Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: Configures network information for the target system and activates network devices in the installation environment. The device specified in the first [command]#network# command is activated automatically. Activation of the device can be also explicitly required by the [option]#--activate# option.
id: Mengonfigurasi informasi jaringan untuk sistem target dan mengaktifkan perangkat jaringan di lingkungan instalasi. Perangkat yang ditentukan dalam perintah [command]#network# pertama diaktifkan secara otomatis. Aktivasi perangkat juga dapat secara eksplisit diminta oleh opsi [opsi]#--aktifkan#.
tr: Hedef sistem için ağ bilgilerini yapılandırır ve kurulum ortamında ağ aygıtlarını etkinleştirir. İlk [command]#network# komutunda belirtilen aygıt otomatik olarak etkinleştirilir. Aygıtın etkinleştirilmesi, [option]#--activate# seçeneği tarafından da açıkça istenebilir.

source: If you use the [option]#--activate# option on a device that has already been activated (for example, an interface you configured with boot options so that the system could retrieve the Kickstart file) the device is reactivated to use the details specified in the Kickstart file.
id: Jika Anda menggunakan opsi [option]#--activate# pada perangkat yang telah diaktifkan (misalnya, antarmuka yang Anda konfigurasikan dengan opsi boot sehingga sistem dapat mengambil file Kickstart) perangkat diaktifkan kembali untuk menggunakan detail ditentukan dalam file Kickstart.
tr: [option]#--activate# seçeneğini zaten etkinleştirilmiş bir aygıtta kullanırsanız (örneğin, sistemin Kickstart dosyasını alabilmesi için önyükleme seçenekleriyle yapılandırdığınız bir arayüz), Kickstart dosyasında belirtilen ayrıntıları kullanmak için aygıt yeniden etkinleştirilir.

source: Use the [option]#--nodefroute# option to prevent the device from using the default route.
id: Gunakan opsi [option]#--nodefroute# untuk mencegah perangkat menggunakan rute default.
tr: Aygıtın öntanımlı yönlendirmeyi kullanmasını önlemek için [option]#--nodefroute# seçeneğini kullanın.

source: Prevents the configured device from automatically activating on boot.
id: Mencegah perangkat yang dikonfigurasi agar tidak aktif secara otomatis saat boot.
tr: Yapılandırılan aygıtın önyükleme sırasında otomatik olarak etkinleştirilmesini engeller.

source: One of `dhcp`, `bootp`, `ibft`, or `static`. The default option is `dhcp`pass:attributes[{blank}]; the `dhcp` and `bootp` options are treated the same.
id: Salah satu dari `dhcp`, `bootp`, `ibft`, atau `static`. Opsi defaultnya adalah `dhcp`pass:attributes[{blank}]; opsi `dhcp` dan `bootp` diperlakukan sama.
tr: `dhcp`, `bootp`, `ibft` veya `static` seçeneklerinden biri. `dhcp`pass:attributes[{blank}] öntanımlı seçenektir; `dhcp` ve `bootp` seçenekleri aynı şekilde ele alınır.

source: The DHCP method uses a DHCP server system to obtain its networking configuration. The BOOTP method is similar, requiring a BOOTP server to supply the networking configuration. To direct a system to use DHCP:
id: Metode DHCP menggunakan sistem server DHCP untuk mendapatkan konfigurasi jaringannya. Metode BOOTP serupa, membutuhkan server BOOTP untuk menyediakan konfigurasi jaringan. Untuk mengarahkan sistem agar menggunakan DHCP:
tr: DHCP yöntemi, ağ yapılandırmasını almak için bir DHCP sunucu sistemi kullanır. BOOTP yöntemi benzerdir ve ağ yapılandırmasını sağlamak için bir BOOTP sunucusu gerektirir. Bir sistemi DHCP kullanmaya yönlendirmek için:

source: To direct a machine to use BOOTP to obtain its networking configuration, use the following line in the Kickstart file:
id: Untuk mengarahkan mesin agar menggunakan BOOTP untuk mendapatkan konfigurasi jaringannya, gunakan baris berikut di file Kickstart:
tr: Bir makineyi ağ yapılandırmasını almak için BOOTP kullanmaya yönlendirmek için Kickstart dosyasında aşağıdaki komutu kullanın:

source: To direct a machine to use the configuration specified in iBFT, use:
id: Untuk mengarahkan mesin agar menggunakan konfigurasi yang ditentukan dalam iBFT, gunakan:
tr: Bir makineyi iBFT'de belirtilen yapılandırmayı kullanmaya yönlendirmek için aşağıdaki komutu kullanın:

source: The `static` method requires that you specify the IP address, netmask, gateway, and nameserver in the Kickstart file. This information is static and is used during and after the installation.
id: Metode `statis` mengharuskan Anda menentukan alamat IP, netmask, gateway, dan server nama di file Kickstart. Informasi ini bersifat statis dan digunakan selama dan setelah penginstalan.
tr: `static` yöntemi; IP adresini, ağ maskesini, ağ geçidini ve ad sunucusunu Kickstart dosyasında belirtmenizi gerektirir. Bu bilgiler statiktir ve kurulum sırasında ve sonrasında kullanılır.

source: All static networking configuration information must be specified on *one* line; you cannot wrap lines using a backslash (`\`) as you can on a command line.
id: Semua informasi konfigurasi jaringan statis harus ditentukan pada *satu* baris; Anda tidak dapat membungkus baris menggunakan garis miring terbalik (`\`) seperti yang Anda bisa pada baris perintah.
tr: Tüm statik ağ yapılandırma bilgileri *bir* satırda belirtilmelidir; komut satırında olduğu gibi ters eğik çizgi (`\`) kullanarak alt satırdan devam edemezsiniz.

source: You can also configure multiple nameservers at the same time. To do so, use the [option]#--nameserver=# options once for each name server you want to configure:
id: Anda juga dapat mengonfigurasi beberapa server nama secara bersamaan. Untuk melakukannya, gunakan opsi [option]#--nameserver=# sekali untuk setiap server nama yang ingin Anda konfigurasi:
tr: Aynı anda birden fazla ad sunucusunu da yapılandırabilirsiniz. Bunu yapmak için, yapılandırmak istediğiniz her ad sunucusu için [option]#--nameserver=# seçeneğini bir kez kullanın:

source: Specifies the device to be configured (and eventually activated in [application]*Anaconda*) with the [command]#network# command.
id: Menentukan perangkat yang akan dikonfigurasi (dan akhirnya diaktifkan di [aplikasi]*Anaconda*) dengan perintah [command]#network#.
tr: [command]#network# komutuyla yapılandırılacak (ve sonunda [application]*Anaconda*'da etkinleştirilecek) aygıtı belirtir.

source: If the [option]#--device=# option is missing on the *first* use of the [command]#network# command, the value of the [option]#ksdevice=# [application]*Anaconda* boot option is used, if available. Note that this is considered deprecated behavior; in most cases, you should always specify a [option]#--device=# for every [command]#network# command.
id: Jika opsi [option]#--device=# hilang pada *pertama* penggunaan perintah [command]#network#, nilai opsi boot [option]#ksdevice=# [application]*Anaconda* adalah digunakan, jika tersedia. Perhatikan bahwa ini dianggap sebagai perilaku yang tidak digunakan lagi; dalam kebanyakan kasus, Anda harus selalu menentukan [option]#--device=# untuk setiap perintah [command]#network#.
tr: [command]#network# komutunun *ilk* kullanımında [option]#--device=# seçeneği yoksa, [option]#ksdevice=# [application]*Anaconda* önyükleme seçeneğinin değeri varsa kullanılır. Bunun kullanımdan kaldırılmış davranış olarak kabul edildiğini unutmayın; çoğu durumda, her [command]#network# komutu için her zaman bir [option]#--device=# seçeneği belirtmeniz gerekir.

source: The behavior of any subsequent [command]#network# command in the same Kickstart file is unspecified if its [option]#--device=# option is missing. Make sure you specify this option for any [command]#network# command beyond the first.
id: Perilaku perintah [command]#network# berikutnya dalam file Kickstart yang sama tidak ditentukan jika opsi [option]#--device=#-nya tidak ada. Pastikan Anda menentukan opsi ini untuk perintah [command]#network# apa pun selain yang pertama.
tr: Aynı Kickstart dosyasında sonraki herhangi bir [command]#network# komutunun davranışı, [option]#--device=# seçeneği eksikse belirsizdir. İlkinden sonraki tüm [command]#network# komutları için bu seçeneği belirttiğinizden emin olun.

source: You can specify a device to be activated in any of the following ways:
id: Anda dapat menentukan perangkat yang akan diaktifkan dengan salah satu cara berikut:
tr: Aşağıdaki yollardan herhangi biriyle etkinleştirilecek bir aygıtı belirtebilirsiniz:

source: the device name of the interface, for example, `em1`
id: nama perangkat antarmuka, misalnya, `em1`
tr: arayüzün aygıt adı, örneğin `em1`

source: the MAC address of the interface, for example, `01:23:45:67:89:ab`
id: alamat MAC antarmuka, misalnya, `01:23:45:67:89:ab`
tr: arayüzün MAC adresi, örneğin `01:23:45:67:89:ab`

source: the keyword `link`, which specifies the first interface with its link in the `up` state
id: kata kunci `link`, yang menentukan antarmuka pertama dengan tautannya dalam status `naik`
tr: Bağlantı durumu `up` olan ilk arayüzü belirten `link` anahtar kelimesi

source: the keyword `bootif`, which uses the MAC address that [application]*pxelinux* set in the `BOOTIF` variable. Set `IPAPPEND 2` in your `pxelinux.cfg` file to have [application]*pxelinux* set the `BOOTIF` variable.
id: kata kunci `bootif`, yang menggunakan alamat MAC yang [aplikasi]*pxelinux* atur dalam variabel `BOOTIF`. Setel `IPAPPEND 2` di file `pxelinux.cfg` Anda agar [application]*pxelinux* menyetel variabel `BOOTIF`.
tr: [application]*pxelinux* tarafından `BOOTIF` değişkeninde ayarlanan MAC adresini kullanan `bootif` anahtar sözcüğü. [application]*pxelinux* tarafından `BOOTIF` değişkeninin ayarlanması için `pxelinux.cfg` dosyanızda `IPAPPEND 2` seçeneğini ayarlayın.

source: Optional. Allows to specify how the connection configuration created for the device should be bound. If the option is not used, the connection binds to interface name (`DEVICE` value in ifcfg file). For virtual devices (bond, team, bridge) it configures binding of slaves. Not applicable to vlan devices.
tr: İsteğe bağlı. Aygıt için oluşturulan bağlantı yapılandırmasının nasıl bağlanacağını belirtmeye izin verir. Seçenek kullanılmazsa, bağlantı arayüz adına (`ifcfg` dosyasındaki `DEVICE` değeri) bağlanır. Sanal aygıtlar (bond, team, bridge) için ikincillerin bağlanmasını yapılandırır. Vlan aygıtları için geçerli değildir.

source: Note that this option is independent of how the `--device` is specified.
tr: Bu seçeneğin, `--device` seçeneğinin nasıl belirtildiğinden bağımsız olduğunu unutmayın.

source: Currently only the value `mac` is supported. `--bindto=mac` will bind the connection to MAC address of the device (`HWADDR` value in the `ifcfg` file).
tr: Şu anda yalnızca `mac` değeri desteklenmektedir. `--bindto=mac`, bağlantıyı aygıtın MAC adresine (`ifcfg` dosyasındaki`HWADDR` değeri) bağlayacaktır.

source: The above will bind the configuration of the device specified by MAC address `01:23:45:67:89:ab` to its MAC address.
tr: Yukarıdaki komut, `01:23:45:67:89:ab` MAC adresiyle belirtilen aygıtın yapılandırmasını MAC adresine bağlayacaktır.

source: The above will bind the configuration of the device specified by MAC address `01:23:45:67:89:ab` to its interface name (e.g. `ens3`).
tr: Yukarıdaki komut, `01:23:45:67:89:ab` MAC adresiyle belirtilen aygıtın yapılandırmasını arayüz adına (örn. `ens3`) bağlayacaktır.

source: The above will bind the configuration of the device specified by interface name `ens3` to its MAC address.
tr: Yukarıdaki komut, `ens3` arayüz adıyla belirtilen aygıtın yapılandırmasını MAC adresine bağlayacaktır.

source: IP address of the device.
id: Alamat IP perangkat.
tr: Aygıtın IP adresi.

source: IPv6 address of the device, in the form of _address_pass:attributes[{blank}][/pass:attributes[{blank}]_prefix_ _length_pass:attributes[{blank}]] - for example, `3ffe:ffff:0:1::1/128` . If _prefix_ is omitted, `64` will be used. You can also use `auto` for automatic configuration, or `dhcp` for DHCPv6-only configuration (no router advertisements).
id: Alamat IPv6 perangkat, dalam bentuk _address_pass:attributes[{blank}][/pass:attributes[{blank}]_prefix_ _length_pass:attributes[{blank}]] - misalnya, `3ffe:ffff:0:1 ::1/128` . Jika _prefix_ dihilangkan, `64` akan digunakan. Anda juga dapat menggunakan `auto` untuk konfigurasi otomatis, atau `dhcp` untuk konfigurasi khusus DHCPv6 (tidak ada iklan router).
tr: _adres_pass:attributes[{blank}][/pass:attributes[{blank}]_ön_ _ek_ _uzunluğu_pass:attributes[{blank}]] biçiminde aygıtın IPv6 adresi - örneğin, `3ffe:ffff:0:1::1/128` . _ön_ _ek_ belirtilmezse, `64` kullanılacaktır. Otomatik yapılandırma için `auto` veya yalnızca DHCPv6 yapılandırması (yönlendirici duyuruları yok) için `dhcp` seçeneklerini de kullanabilirsiniz.

source: Default gateway as a single IPv4 address.
id: Gateway default sebagai alamat IPv4 tunggal.
tr: Tek bir IPv4 adresi olarak öntanımlı ağ geçidi.

source: Default gateway as a single IPv6 address.
id: Gateway default sebagai alamat IPv6 tunggal.
tr: Tek bir IPv6 adresi olarak öntanımlı ağ geçidi.

source: Prevents the interface being set as the default route. Use this option when you activate additional devices with the [option]#--activate=# option, for example, a NIC on a separate subnet for an iSCSI target.
id: Mencegah antarmuka ditetapkan sebagai rute default. Gunakan opsi ini saat Anda mengaktifkan perangkat tambahan dengan opsi [option]#--activate=#, misalnya, NIC pada subnet terpisah untuk target iSCSI.
tr: Arayüzün öntanımlı yönlendirme olarak ayarlanmasını engeller. [option]#--activate=# seçeneğiyle ek aygıtları etkinleştirdiğinizde, örneğin bir iSCSI hedefi için ayrı bir alt ağdaki bir NIC, bu seçeneği kullanın.

source: DNS name server, as an IP address. To specify more than one name server, use this parameter multiple times. For example:
id: Server nama DNS, sebagai alamat IP. Untuk menentukan lebih dari satu server nama, gunakan parameter ini beberapa kali. Sebagai contoh:
tr: IP adresi olarak DNS ad sunucusu. Birden fazla ad sunucusu belirtmek için bu parametreyi birden çok kez kullanın. Örneğin:

source: Do not configure any DNS server.
id: Jangan mengkonfigurasi server DNS apa pun.
tr: Herhangi bir DNS sunucusu yapılandırma.

source: Network mask for the installed system.
id: Masker jaringan untuk sistem yang diinstal.
tr: Kurulu sistem için ağ maskesi.

source: Host name for the installed system. The host name can be either a _fully-qualified domain name_ (FQDN) in the format _hostname_._domainname_, or a short host name with no domain name. Many networks have a _Dynamic Host Configuration Protocol_ (`DHCP`) service that automatically supplies connected systems with a domain name; to allow the `DHCP` service to assign the domain name to this machine, only specify the short host name.
id: Nama host untuk sistem yang diinstal. Nama host dapat berupa _fully-qualified domain name_ (FQDN) dalam format _namahost_._namadomain_, atau nama host pendek tanpa nama domain. Banyak jaringan memiliki layanan _Dynamic Host Configuration Protocol_ (`DHCP`) yang secara otomatis memasok sistem yang terhubung dengan nama domain; untuk mengizinkan layanan `DHCP` menetapkan nama domain ke mesin ini, hanya nyatakan nama host pendek.
tr: Kurulu sistem için ana makine adı. Ana makine adı, _anamakineadı.etkialanıadı_ biçiminde bir _tam nitelikli etki alanı adı (fully-qualified domain name)_ (FQDN) veya etki alanı adı olmayan kısa bir ana makine adı olabilir. Çoğu ağda, bağlı sistemlere otomatik olarak bir etki alanı adı sağlayan _Dinamik Ana Makine Yapılandırma Protokolü (Dynamic Host Configuration Protocol)_ (`DHCP`) hizmeti bulunur; `DHCP` hizmetinin bu makineye etki alanı adı atamasına izin vermek için yalnızca kısa ana makine adını belirtin.

source: Specifies additional low-level settings for the network device which will be passed to the [application]*ethtool* program.
id: Menentukan pengaturan tingkat rendah tambahan untuk perangkat jaringan yang akan diteruskan ke program [application]*ethtool*.
tr: [application]*ethtool* programına aktarılacak, ağ aygıtı için ek düşük seviye ayarlarını belirtir.

source: The network ID for wireless networks.
id: ID jaringan untuk jaringan nirkabel.
tr: Kablosuz ağlar için ağ kimliği.

source: The WEP encryption key for wireless networks.
id: Kunci enkripsi WEP untuk jaringan nirkabel.
tr: Kablosuz ağlar için WEP şifreleme anahtarı.

source: The WPA encryption key for wireless networks.
id: Kunci enkripsi WPA untuk jaringan nirkabel.
tr: Kablosuz ağlar için WPA şifreleme anahtarı.

source: Whether or not to enable the device at boot time.
id: Apakah akan mengaktifkan perangkat saat boot atau tidak.
tr: Önyükleme sırasında aygıtın etkinleştirilip etkinleştirilmeyeceği.

source: The DHCP class.
id: Kelas DHCP.
tr: DHCP sınıfı.

source: The MTU of the device.
id: MTU perangkat.
tr: Aygıtın MTU'su.

source: Disable IPv4 on this device.
id: Nonaktifkan IPv4 di perangkat ini.
tr: Bu aygıtta IPv4'ü devre dışı bırak.

source: Disable IPv6 on this device.
id: Nonaktifkan IPv6 di perangkat ini.
tr: Bu aygıtta IPv6'yı devre dışı bırak.

source: When this option is used, the network device specified in the [option]#--device=# option will be created using slaves defined in the [option]#--bondslaves=# option. For example:
id: Ketika opsi ini digunakan, perangkat jaringan yang ditentukan dalam opsi [option]#--device=# akan dibuat menggunakan slave yang ditentukan dalam opsi [option]#--bondslaves=#. Sebagai contoh:
tr: Bu seçenek kullanıldığında, [option]#--device=# seçeneğinde belirtilen ağ aygıtı, [option]#--bondslaves=# seçeneğinde tanımlanan ikinciller kullanılarak oluşturulacaktır. Örneğin:

source: [command]#network --device=mynetwork --bondslaves=em1,em2#
id: [perintah]#jaringan --device=mynetwork --bondslaves=em1,em2#
tr: [command]#network --device=agim --bondslaves=em1,em2#

source: The above command will create a bond device named `mynetwork` using the `em1` and `em2` interfaces as its slaves.
id: Perintah di atas akan membuat perangkat bond bernama `mynetwork` menggunakan antarmuka `em1` dan `em2` sebagai budaknya.
tr: Yukarıdaki komut, `em1` ve `em2` arayüzlerini ikinciller olarak kullanarak `agim` adlı bir bond aygıtı oluşturacaktır.

source: A list of optional parameters for a bonded interface, which is specified using the [command]#--bondslaves=# and [command]#--device=# options. Options in this list must be separated by commas ("`pass:attributes[{blank}]`,`pass:attributes[{blank}]`") or semicolons ("`pass:attributes[{blank}]`;`pass:attributes[{blank}]`"). If an option itself contains a comma, use a semicolon to separate the options. For example:
tr: [command]#--bondslaves=# ve [command]#--device=# seçenekleri kullanılarak belirtilen, bond yapılan bir arayüz için isteğe bağlı parametrelerin listesi. Bu listedeki seçenekler virgülle ("`pass:attributes[{blank}]`,`pass:attributes[{blank}]`") veya noktalı virgülle ("`pass:attributes[{blank}]`;`pass:attributes[{blank}]`") ayrılmalıdır. Bir seçeneğin kendisi virgül içeriyorsa, seçenekleri ayırmak için noktalı virgül kullanın. Örneğin:

source: Available optional parameters are listed in the [citetitle]_Working with Kernel Modules_ chapter of the [citetitle]_xref:fedora:system-administrators-guide:index.adoc[{PRODUCT} System Administrator's Guide]_.
tr: Kullanılabilir isteğe bağlı parametreler, [citetitle]_xref:fedora:system-administrators-guide:index.adoc[{PRODUCT} Sistem Yöneticisi Kılavuzunun]_ [citetitle]_Çekirdek Modülleriyle Çalışma_ bölümünde listelenmektedir.

source: The [option]#--bondopts=mode=# parameter only supports full mode names such as `balance-rr` or `broadcast`, not their numerical representations such as `0` or `3`.
id: Parameter [option]#--bondopts=mode=# hanya mendukung nama mode lengkap seperti `balance-rr` atau `broadcast`, bukan representasi numeriknya seperti `0` atau `3`.
tr: [option]#--bondopts=mode=# parametresi yalnızca `balance-rr` veya `broadcast` gibi tam mod adlarını desteklemektedir, `0` veya `3` gibi sayısal gösterimlerini değil.

source: Specifies virtual LAN (VLAN) ID number (802.1q tag) for the device created using the device specified in [option]#--device=# as a parent. For example, [command]#network --device=em1 --vlanid=171# will create a virtual LAN device `em1.171`.
id: Menentukan nomor ID LAN (VLAN) virtual (tag 802.1q) untuk perangkat yang dibuat menggunakan perangkat yang ditentukan dalam [option]#--device=# sebagai induk. Misalnya, [command]#network --device=em1 --vlanid=171# akan membuat perangkat LAN virtual `em1.171`.
tr: Ana aygıt olarak [option]#--device=# seçeneğinde belirtilen aygıt kullanılarak oluşturulan aygıt için sanal LAN (VLAN) kimlik numarasını (802.1q etiketi) belirtir. Örneğin, [command]#network --device=em1 --vlanid=171# komutu, `em1.171` sanal LAN aygıtını oluşturacaktır.

source: Specify a custom interface name for a virtual LAN device. This option should be used when the default name generated by the [option]#--vlanid=# option is not desirable. This option must be used along with [option]#--vlanid=#. For example:
id: Tentukan nama antarmuka khusus untuk perangkat LAN virtual. Opsi ini harus digunakan ketika nama default yang dihasilkan oleh opsi [option]#--vlanid=# tidak diinginkan. Opsi ini harus digunakan bersama dengan [option]#--vlanid=#. Sebagai contoh:
tr: Sanal bir LAN aygıtı için özel bir arayüz adı belirt. Bu seçenek, [option]#--vlanid=# seçeneği tarafından oluşturulan öntanımlı ad istenmediğinde kullanılmalıdır. Bu seçenek, [option]#--vlanid=# seçeneğiyle birlikte kullanılmalıdır. Örneğin:

source: The above command will create a virtual LAN interface named `vlan171` on the `em1` device with an ID of `171`.
id: Perintah di atas akan membuat antarmuka LAN virtual bernama `vlan171` pada perangkat `em1` dengan ID `171`.
tr: Yukarıdaki komut, `em1` aygıtında `171` kimliğine sahip `vlan171` adlı bir sanal LAN arayüzü oluşturacaktır.

source: The interface name can be arbitrary (for example, `my-vlan`), but in specific cases, the following conventions must be followed:
id: Nama antarmuka dapat berubah-ubah (misalnya, `my-vlan`), tetapi dalam kasus tertentu, konvensi berikut harus diikuti:
tr: Arayüz adı istediğiniz gibi olabilir (örneğin, `benim-vlanim`), ancak belirli durumlarda aşağıdaki kurallar izlenmelidir:

source: If the name contains a dot (`.`), it must take the form of `pass:attributes[{blank}]_NAME_._ID_pass:attributes[{blank}]`. The _NAME_ is arbitrary, but the _ID_ must be the VLAN ID. For example: `em1.171` or `my-vlan.171`.
id: Jika nama berisi titik (`.`), nama tersebut harus berbentuk `pass:attributes[{blank}]_NAME_._ID_pass:attributes[{blank}]`. _NAME_ bersifat arbitrer, tetapi _ID_ harus berupa ID VLAN. Misalnya: `em1.171` atau `my-vlan.171`.
tr: Ad bir nokta (`.`) içeriyorsa, `pass:attributes[{blank}]_AD_._KİMLİK_pass:attributes[{blank}]` biçiminde olmalıdır. _AD_ istediğiniz gibi olabilir, ancak _KİMLİK_ VLAN kimliği olmalıdır. Örneğin: `em1.171` or `benim-vlanim.171`.

source: Names starting with `vlan` must take the form of `vlanpass:attributes[{blank}]_ID_pass:attributes[{blank}]` - for example, `vlan171`.
id: Nama yang diawali dengan `vlan` harus berbentuk `vlanpass:attributes[{blank}]_ID_pass:attributes[{blank}]` - misalnya, `vlan171`.
tr: `vlan` ile başlayan adlar, `vlanpass:attributes[{blank}]_KİMLİK_pass:attributes[{blank}]` biçiminde olmalıdır - örneğin, `vlan171`.
