Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: For a fully automatic installation, you must either specify one of the available modes ([command]#graphical#, [command]#text#, or [command]#cmdline#) in the Kickstart file, or you must use the [option]#console=# boot option as described in xref:advanced/Boot_Options.adoc#sect-boot-options-display[Console, Environment and Display Options]. Otherwise the system will halt and ask you to choose a mode.
tr: Tam otomatik kurulum için, Kickstart dosyasında kullanılabilir modlardan birini ([command]#graphical#, [command]#text# veya [command]#cmdline#) belirtmeniz veya xref:advanced/Boot_Options.adoc#sect-boot-options-display[Konsol, Ortam ve Ekran Seçenekleri] bölümünde açıklandığı gibi [option]#console=# önyükleme seçeneğini kullanmanız gerekir. Aksi takdirde sistem duracak ve sizden bir mod seçmenizi isteyecektir.

source: graphical (optional) - Perform Installation in Graphical Mode
id: grafis (opsional) - Lakukan Instalasi dalam Mode Grafis
tr: graphical (isteğe bağlı) - Kurulumu Grafiksel Modda Gerçekleştir

source: Perform the installation in graphical mode. This is the default. This command takes no options.
id: Lakukan instalasi dalam mode grafis. Ini adalah default. Perintah ini tidak mengambil opsi.
tr: Kurulumu grafiksel modda gerçekleştir. Bu, öntanımlı olandır. Bu komut hiçbir seçenek almaz.

source: logging (optional) - Configure Error Logging During Installation
id: logging (opsional) - Konfigurasi Error Logging Selama Instalasi
tr: logging (isteğe bağlı) - Kurulum Sırasındaki Hata Günlüğünü Yapılandır

source: Controls the error logging of [application]*Anaconda* during installation. It has no effect on the installed system.
id: Mengontrol kesalahan pencatatan [aplikasi]*Anaconda* selama instalasi. Ini tidak berpengaruh pada sistem yang diinstal.
tr: Kurulum sırasında [application]*Anaconda*'nın hata günlüğü davranışını denetler. Kurulu sistem üzerinde hiçbir etkisi yoktur.

source: Send logging information to the given remote host, which must be running a `syslogd` process configured to accept remote logging.
id: Kirim informasi logging ke host jarak jauh yang diberikan, yang harus menjalankan proses `syslogd` yang dikonfigurasi untuk menerima logging jarak jauh.
tr: Uzak günlük kaydını kabul etmek için yapılandırılmış bir `syslogd` işleminin çalışır olmasını gerektiren, belirtilen uzak ana makineye günlük bilgilerini gönder.

source: If the remote syslogd process uses a port other than the default, it may be specified with this option.
id: Jika proses syslogd jarak jauh menggunakan port selain default, mungkin ditentukan dengan opsi ini.
tr: Uzak syslogd işlemi öntanımlı olandan farklı bir bağlantı noktası kullanıyorsa, bu seçenekle belirtilebilir.

source: Specify the minimum level of messages that appear on virtual console 3 (`tty3`). This only affects messages printed to the console; log files will contain messages of all levels. Possible values are `debug`, `info`, `warning`, `error`, or `critical`.
id: Tentukan level minimum pesan yang muncul di konsol virtual 3 (`tty3`). Ini hanya memengaruhi pesan yang dicetak ke konsol; file log akan berisi pesan dari semua tingkatan. Nilai yang mungkin adalah `debug`, `info`, `warning`, `error`, atau `critical`.
tr: 3. sanal konsolda (`tty3`) görünen asgari mesaj seviyesini belirt. Bu yalnızca konsola yazdırılan mesajları etkiler; günlük dosyaları her seviyeden mesajları içerecektir. Olası değerler şunlardır: `debug`, `info`, `warning`, `error` veya `critical`.

source: rescue (optional) - Rescue Mode
id: penyelamatan (opsional) - Mode Penyelamatan
tr: rescue (isteğe bağlı) - Kurtarma Modu

source: Automatically enters the installation program's rescue mode. This gives you a chance to repair the system in case of any problems.
id: Secara otomatis memasuki mode penyelamatan program instalasi. Ini memberi Anda kesempatan untuk memperbaiki sistem jika ada masalah.
tr: Otomatik olarak kurulum programının kurtarma moduna girer. Bu size herhangi bir sorun olması durumunda sistemi onarma şansı verir.

source: [option]#--nomount# or [option]#--romount#
tr: [option]#--nomount# veya [option]#--romount#

source: Controls how the installed system is mounted in the rescue environment. By default, the installation program will find your system and mount it in read-write mode, telling you where it has performed this mount. You may optionally choose to not mount anything (the [option]#--nomount# option) or mount in read-only mode (the [option]#--romount# option). Only one of these two options may be used.
id: Mengontrol bagaimana sistem yang diinstal dipasang di lingkungan penyelamatan. Secara default, program instalasi akan menemukan sistem Anda dan memasangnya dalam mode baca-tulis, memberi tahu Anda di mana ia telah melakukan pemasangan ini. Anda dapat memilih untuk tidak memasang apa pun (opsi [opsi]#--nomount#) atau memasang dalam mode hanya-baca (opsi [opsi]#--romount#). Hanya satu dari dua opsi ini yang dapat digunakan.
tr: Kurulu sistemin kurtarma ortamında nasıl bağlanacağını denetler. Öntanımlı olarak, kurulum programı sisteminizi bulacak ve onu okuma-yazma modunda bağlayacak ve bu bağlamayı nerede gerçekleştirdiğini size bildirecektir. İsteğe bağlı olarak hiçbir şey bağlamamayı ([option]#--nomount# seçeneği) veya salt okunur modda bağlamayı ([option]#--romount# seçeneği) seçebilirsiniz. Bu iki seçenekten yalnızca biri kullanılabilir.

source: sshpw (optional) - Restrict ssh Access During Installation
id: sshpw (opsional) - Batasi Akses ssh Selama Instalasi
tr: sshpw (isteğe bağlı) - Kurulum Sırasında ssh Erişimini Kısıtla

source: During the installation, you can interact with the installation program and monitor its progress over an `SSH` connection. Use the [command]#sshpw# command to create temporary accounts through which to log on. Each instance of the command creates a separate account that exists only in the installation environment. These accounts are not transferred to the installed system.
id: Selama instalasi, Anda dapat berinteraksi dengan program instalasi dan memantau kemajuannya melalui koneksi `SSH`. Gunakan perintah [command]#sshpw# untuk membuat akun sementara untuk masuk. Setiap contoh perintah membuat akun terpisah yang hanya ada di lingkungan penginstalan. Akun ini tidak ditransfer ke sistem yang diinstal.
tr: Kurulum sırasında, kurulum programı ile etkileşime girebilir ve ilerlemesini bir `SSH' bağlantısı üzerinden izleyebilirsiniz. Oturum açabileceğiniz geçici hesaplar oluşturmak için [command]#sshpw# komutunu kullanın. Komutun her örneği, yalnızca kurulum ortamında bulunan ayrı bir hesap oluşturur. Bu hesaplar kurulu sisteme aktarılmaz.

source: [command]#sshpw --username=pass:attributes[{blank}]_name_ _password_ [--iscrypted|--plaintext] [--lock]#
tr: [command]#sshpw --username=pass:attributes[{blank}]_ad_ _parola_ [--iscrypted|--plaintext] [--lock]#

source: By default, the `ssh` server is not started during the installation. To make `ssh` available during the installation, boot the system with the kernel boot option [option]#inst.sshd#. See xref:advanced/Boot_Options.adoc#sect-boot-options-display[Console, Environment and Display Options] for details.
tr: Öntanımlı olarak, `ssh` sunucusu kurulum sırasında başlatılmaz. Kurulum sırasında `ssh` kullanılabilir hale getirmek için, sistemi [option]#inst.sshd# çekirdek önyükleme seçeneği ile önyükleyin. Ayrıntılar için xref:advanced/Boot_Options.adoc#sect-boot-options-display[Konsol, Ortam ve Ekran Seçenekleri] bölümüne bakın.

source: If you want to disable root `ssh` access to your hardware during installation, use the following:
id: Jika Anda ingin menonaktifkan akses root `ssh` ke perangkat keras Anda selama instalasi, gunakan yang berikut ini:
tr: Kurulum sırasında donanımınıza root `ssh` erişimini devre dışı bırakmak istiyorsanız, aşağıdaki komutu kullanın:

source: If this option is present, the password argument is assumed to be in plain text. This option is mutually exclusive with [option]#--iscrypted#
id: Jika opsi ini ada, argumen kata sandi diasumsikan dalam teks biasa. Opsi ini saling eksklusif dengan [option]#--iscrypted#
tr: Bu seçenek belirtilirse, parola argümanının düz metin olduğu varsayılır. Bu seçenek, [option]#--iscrypted# seçeneğiyle birlikte kullanılamaz.

source: text (optional) - Perform Installation in Text Mode
id: teks (opsional) - Lakukan Instalasi dalam Mode Teks
tr: text (isteğe bağlı) - Kurulumu Metin Modunda Gerçekleştir

source: Perform the Kickstart installation in text mode. Kickstart installations are performed in graphical mode by default.
id: Lakukan instalasi Kickstart dalam mode teks. Instalasi Kickstart dilakukan dalam mode grafis secara default.
tr: Kickstart kurulumunu metin modunda gerçekleştir. Kickstart kurulumları öntanımlı olarak grafiksel modda gerçekleştirilir.

source: unsupported_hardware (optional) - Suppress Unsupported Hardware Alerts
id: unsupported_hardware (opsional) - Menekan Peringatan Perangkat Keras yang Tidak Didukung
tr: unsupported_hardware (isteğe bağlı) - Desteklenmeyen Donanım Uyarılarını Gösterme

source: Suppress the `Unsupported Hardware Detected` alert. If this command is not included and unsupported hardware is detected, the installation will stall at this alert.
id: Tekan peringatan `Unsupported Hardware Detected`. Jika perintah ini tidak disertakan dan perangkat keras yang tidak didukung terdeteksi, penginstalan akan terhenti pada peringatan ini.
tr: `Desteklenmeyen Donanım Algılandı` uyarısını gösterme. Bu komut kullanılmazsa ve desteklenmeyen donanım algılanırsa, kurulum bu uyarıyı verecek ve duracaktır.

source: vnc (optional) - Configure VNC Access
id: vnc (opsional) - Konfigurasikan Akses VNC
tr: vnc (isteğe bağlı) - VNC Erişimini Yapılandır

source: Allows the graphical installation to be viewed remotely via VNC. This method is usually preferred over text mode, as there are some size and language limitations in text installations. With no additional options, this command will start a VNC server on the installation system with no password and will display the details required to connect to it.
id: Memungkinkan instalasi grafis untuk dilihat dari jarak jauh melalui VNC. Metode ini biasanya lebih disukai daripada mode teks, karena ada beberapa batasan ukuran dan bahasa dalam penginstalan teks. Tanpa opsi tambahan, perintah ini akan memulai server VNC pada sistem instalasi tanpa kata sandi dan akan menampilkan detail yang diperlukan untuk menyambungkannya.
tr: Grafiksel kurulumun VNC üzerinden uzaktan görüntülenmesini sağlar. Metin kurulumlarında bazı boyut ve dil sınırlamaları olduğundan, bu yöntem genellikle metin moduna tercih edilir. Hiçbir ek seçenek olmadan bu komut, kurulum sisteminde parolasız bir VNC sunucusu başlatacak ve ona bağlanmak için gereken ayrıntıları görüntüleyecektir.

source: [command]#vnc [--host=pass:attributes[{blank}]_hostname_pass:attributes[{blank}]] [--port=pass:attributes[{blank}]_port_pass:attributes[{blank}]] [--password=pass:attributes[{blank}]_password_pass:attributes[{blank}]]#
tr: [command]#vnc [--host=pass:attributes[{blank}]_anamakineadı_pass:attributes[{blank}]] [--port=pass:attributes[{blank}]_bağlantınoktası_pass:attributes[{blank}]] [--password=pass:attributes[{blank}]_parola_pass:attributes[{blank}]]#

source: For more information about VNC installations, including instructions on how to connect to the installation system, see xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Installing Using VNC].
tr: Kurulum sistemine nasıl bağlanılacağına ilişkin talimatlar da dahil olmak üzere VNC kurulumları hakkında daha fazla bilgi için xref:advanced/VNC_Installations.adoc#chap-vnc-installations[VNC Kullanarak Kurma] bölümüne bakın.

source: Connect to a VNC viewer listening on the given hostname.
id: Hubungkan ke penampil VNC yang mendengarkan pada nama host yang diberikan.
tr: Verilen ana makine üzerinde dinleyen bir VNC görüntüleyiciye bağlan.

source: Provide a port that the remote VNC viewer process is listening on. If not provided, the VNC default (`5900`) will be used.
id: Menyediakan port yang didengarkan oleh proses penampil VNC jarak jauh. Jika tidak disediakan, default VNC (`5900`) akan digunakan.
tr: Uzak VNC görüntüleyici işleminin dinlediği bir bağlantı noktası belirt. Belirtilmezse, öntanımlı VNC değeri (`5900`) kullanılacaktır.

source: Set a password which must be provided to connect to the VNC session. This is optional, but recommended.
id: Tetapkan kata sandi yang harus disediakan untuk terhubung ke sesi VNC. Ini opsional, tetapi disarankan.
tr: VNC oturumuna bağlanmak için sağlanması gereken bir parola ayarla. Bu isteğe bağlıdır, ancak kullanılması tavsiye edilir.

source: After the Installation
id: Setelah Instalasi
tr: Kurulumdan Sonra

source: This section contains commands which control the system's behavior immediately after the installation finishes.
id: Bagian ini berisi perintah yang mengontrol perilaku sistem segera setelah penginstalan selesai.
tr: Bu bölüm, kurulum tamamlandıktan hemen sonra sistemin davranışını denetleyen komutları içerir.

source: %addon com_redhat_kdump (optional) - Configure kdump
id: %addon com_redhat_kdump (opsional) - Konfigurasi kdump
tr: %addon com_redhat_kdump (isteğe bağlı) - kdump'ı Yapılandır

source: This command configures the [application]*kdump* kernel crash dumping mechanism.
id: Perintah ini mengonfigurasi mekanisme dumping crash kernel [application]*kdump*.
tr: Bu komut, [application]*kdump* çekirdek çökme dökümü mekanizmasını yapılandırır.

source: The syntax for this command is unusual because it is an add-on rather than a built-in Kickstart command. For more information about add-ons, see xref:sect-kickstart-commands-addon[%addon (optional) - Include an Anaconda Add-on].
tr: Bu komutun söz dizimi, yerleşik bir Kickstart komutu yerine bir eklenti olduğu için olağan dışıdır. Eklentiler hakkında daha fazla bilgi için xref:sect-kickstart-commands-addon[%addon (isteğe bağlı) - Bir Anaconda Eklentisi Dahil Et] bölümüne bakın.

source: [application]*Kdump* is a kernel crash dumping mechanism that allows you to save the contents of the system's memory for later analysis. It relies on [application]*kexec*, which can be used to start a Linux kernel from the context of another kernel without rebooting the system and preserve the contents of the first kernel memory that would otherwise be lost.
id: [application]*Kdump* adalah mekanisme dumping crash kernel yang memungkinkan Anda menyimpan konten memori sistem untuk analisis nanti. Itu bergantung pada [application]*kexec*, yang dapat digunakan untuk memulai kernel Linux dari konteks kernel lain tanpa me-reboot sistem dan mempertahankan isi dari memori kernel pertama yang seharusnya hilang.
tr: [application]*Kdump*, sistem belleğinin içeriğini daha sonra incelemek üzere kaydetmenize izin veren bir çekirdek çökme dökümü mekanizmasıdır. Sistemi yeniden başlatmadan başka bir çekirdeğin bağlamından bir Linux çekirdeği başlatmak ve aksi takdirde kaybolacak olan ilk çekirdek belleğinin içeriğini korumak için kullanılabilen [application]*kexec* programını kullanmaktadır.

source: In case of a system crash, [application]*kexec* starts a second kernel (a _capture kernel_). This capture kernel resides in a reserved part of the system memory that is inaccessible to the main kernel. [application]*Kdump* then captures the contents of the crashed kernel's memory (a _crash dump_) and saves it to a specified location. This location cannot be configured using Kickstart; it must be specified after the installation by editing the `/etc/kdump.conf` configuration file.
tr: Bir sistem çökmesi durumunda, [application]*kexec* ikinci bir çekirdeği başlatır (bir _yakalama çekirdeği_). Bu yakalama çekirdeği, sistem belleğinin ana çekirdek tarafından erişilemeyen ayrılmış bir bölümünde bulunur. [application]*Kdump* daha sonra çöken çekirdeğin belleğinin içeriğini (bir _çökme dökümü_) yakalar ve belirtilen bir konuma kaydeder. Bu konum, Kickstart kullanılarak yapılandırılamaz; kurulumdan sonra `/etc/kdump.conf` yapılandırma dosyası düzenlenerek belirtilmelidir.

source: Available options are:
id: Pilihan yang tersedia adalah:
tr: Kullanılabilir seçenekler şunlardır:

source: Enable [application]*Kdump* on the installed system.
id: Aktifkan [aplikasi]*Kdump* pada sistem yang diinstal.
tr: Kurulu sistemde [application]*Kdump*'ı etkinleştir.

source: Do not enable [application]*Kdump* on the installed system.
id: Jangan aktifkan [aplikasi]*Kdump* pada sistem yang diinstal.
tr: Kurulu sistemde [application]*Kdump*'ı etkinleştirme.

source: The amount of memory you want to reserve for [application]*Kdump* in megabytes. For example:
id: Jumlah memori yang ingin Anda simpan untuk [aplikasi]*Kdump* dalam megabita. Sebagai contoh:
tr: [application]*Kdump* için megabayt cinsinden ayırmak istediğiniz bellek miktarı. Örneğin:

source: You can also specify `auto` instead of a numeric value. In that case the installer will determine the amount of RAM to reserve for kdump automatically, based on your system architecture and the total amount of memory on the system.
id: Anda juga dapat menentukan `auto` sebagai ganti nilai numerik. Dalam hal ini penginstal akan menentukan jumlah RAM yang akan dicadangkan untuk kdump secara otomatis, berdasarkan arsitektur sistem Anda dan jumlah total memori pada sistem.
tr: Sayısal bir değer yerine `auto` değerini de belirtebilirsiniz. Bu durumda kurucu, sistem mimarinize ve sistemdeki toplam bellek miktarına bağlı olarak kdump için ayrılacak RAM miktarını otomatik olarak belirleyecektir.

source: If you enable [application]*Kdump* and do not specify the [option]#--reserve-mb=# option, the `auto` value will be used.
id: Jika Anda mengaktifkan [application]*Kdump* dan tidak menentukan opsi [option]#--reserve-mb=#, nilai `auto` akan digunakan.
tr: [application]*Kdump*'ı etkinleştirirseniz ve [option]#--reserve-mb=# seçeneğini belirtmezseniz, `auto` değeri kullanılacaktır.

source: Enable firmware-assisted dumping on systems which allow it (notably IBM Power{nbsp}Systems servers).
id: Aktifkan dumping dengan bantuan firmware pada sistem yang mengizinkannya (terutama server IBM Power{nbsp}Systems).
tr: Buna izin veren sistemlerde (özellikle IBM Power{nbsp}Systems sunucuları) ürün yazılımı destekli dökümü etkinleştir.

source: firstboot (optional) - Enable or Disable Initial Setup
id: firstboot (opsional) - Aktifkan atau Nonaktifkan Pengaturan Awal
tr: firstboot (isteğe bağlı) - İlk Kurulumu Etkinleştir veya Devre Dışı Bırak

source: Determine whether the [application]*Initial Setup* application starts the first time the system is booted. If enabled, the [package]*initial-setup* package must be installed. If not specified, this option is disabled by default. For more information about [application]*Initial Setup*, see xref:install/After_Installation.adoc#sect-initial-setup[Initial Setup].
tr: [application]*İlk Kurulum* uygulamasının sistem ilk önyüklendiğinde başlatılıp başlatılmayacağını belirle. Etkinleştirilirse, [package]*initial-setup* paketi kurulmalıdır. Belirtilmezse, bu seçenek öntanımlı olarak devre dışıdır. [application]*İlk Kurulum* hakkında daha fazla bilgi için xref:install/After_Installation.adoc#sect-initial-setup[İlk Kurulum] bölümüne bakın.

source: [option]#--enable# or [option]#--enabled#
tr: [option]#--enable# veya [option]#--enabled#

source: [application]*Initial Setup* will be started the first time the installed system boots.
id: [aplikasi]*Pengaturan Awal* akan dimulai saat pertama kali sistem yang diinstal melakukan booting.
tr: [application]*İlk Kurulum*, kurulu sistem ilk kez önyüklendiğinde başlatılacaktır.

source: [option]#--disable# or [option]#--disabled#
id: [option]#--disable# atau [option]#--disable#
tr: [option]#--disable# veya [option]#--disabled#

source: [application]*Initial Setup* will be disabled.
id: [aplikasi]*Pengaturan Awal* akan dinonaktifkan.
tr: [application]*İlk Kurulum* devre dışı bırakılacak.

source: [application]*Initial Setup* will start after the reboot in reconfiguration mode. This mode enables the language, mouse, keyboard, root password, security level, time zone and networking configuration options in addition to the default ones.
id: [aplikasi]*Pengaturan Awal* akan dimulai setelah reboot dalam mode konfigurasi ulang. Mode ini mengaktifkan bahasa, mouse, keyboard, kata sandi root, tingkat keamanan, zona waktu dan opsi konfigurasi jaringan selain yang default.
tr: [application]*İlk Kurulum*, yeniden başlatmanın ardından yeniden yapılandırma modunda başlayacaktır. Bu mod, öntanımlı olanlara ek olarak dil, fare, klavye, root parolası, güvenlik seviyesi, saat dilimi ve ağ yapılandırma seçeneklerini etkinleştirir.

source: halt (optional) - Halt System After Installation
id: halt (opsional) - Menghentikan Sistem Setelah Instalasi
tr: halt (isteğe bağlı) - Kurulumdan Sonra Sistemi Durdur

source: Halt the system after the installation has successfully completed. This is similar to a manual installation, where after the installation finishes, the installer displays a message and waits for the user to press a key before rebooting. During a Kickstart installation, if no completion method is specified, this option is used as the default.
id: Menghentikan sistem setelah instalasi berhasil diselesaikan. Ini mirip dengan penginstalan manual, di mana setelah penginstalan selesai, penginstal menampilkan pesan dan menunggu pengguna untuk menekan tombol sebelum mem-boot ulang. Selama instalasi Kickstart, jika tidak ada metode penyelesaian yang ditentukan, opsi ini digunakan sebagai default.
tr: Kurulum başarıyla tamamlandıktan sonra sistemi durdur. Bu, kurulum tamamlandıktan sonra kurucunun bir mesaj görüntülediği ve yeniden başlatmadan önce kullanıcının bir tuşa basmasını beklediği elle kuruluma benzer. Bir Kickstart kurulumu sırasında, herhangi bir tamamlama yöntemi belirtilmemişse, bu seçenek öntanımlı olarak kullanılır.

source: For other completion methods, see the [command]#poweroff#, [command]#reboot#, and [command]#shutdown# commands.
id: Untuk metode penyelesaian lainnya, lihat perintah [command]#poweroff#, [command]#reboot#, dan [command]#shutdown#.
tr: Diğer tamamlama yöntemleri için [command]#poweroff#, [command]#reboot# ve [command]#shutdown# komutlarına bakın.

source: poweroff (optional) - Power Off After Installation
id: poweroff (opsional) - Matikan Setelah Instalasi
tr: poweroff (isteğe bağlı) - Kurulumdan Sonra Kapat

source: Shut down and power off the system after the installation has successfully completed.
id: Matikan dan matikan sistem setelah instalasi berhasil diselesaikan.
tr: Kurulum başarıyla tamamlandıktan sonra sistemi kapat.
