Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: For a detailed example of [command]#raid# in action, see xref:sect-kickstart-example-advanced-partitioning[Advanced Partitioning Example].
tr: [command]#raid# komutunun ayrıntılı bir örneği için xref:sect-kickstart-example-advanced-partitioning[Gelişmiş Bölümlendirme Örneği] bölümüne bakın.

source: Location where the RAID file system is mounted. If it is `/`, the RAID level must be 1 unless a boot partition (`/boot`) is present. If a boot partition is present, the `/boot` partition must be level 1 and the root (`/`) partition can be any of the available types. The _partitions*_ (which denotes that multiple partitions can be listed) lists the RAID identifiers to add to the RAID array.
id: Lokasi di mana sistem file RAID dipasang. Jika `/`, level RAID harus 1 kecuali ada partisi boot (`/ boot`). Jika ada partisi boot, partisi `/boot` harus level 1 dan partisi root (`/`) dapat berupa salah satu jenis yang tersedia. _partitions*_ (yang menunjukkan bahwa beberapa partisi dapat dicantumkan) mencantumkan pengidentifikasi RAID untuk ditambahkan ke larik RAID.
tr: RAID dosya sisteminin bağlanacağı konum. `/` ise, bir önyükleme bölümü (`/boot`) olmadığı sürece RAID seviyesi 1 olmalıdır. Bir önyükleme bölümü varsa, `/boot` bölümü 1. seviye olmalıdır ve kök (`/`) bölümü kullanılabilir türlerden herhangi biri olabilir. _bölümler*_ (birden çok bölümün listelenebileceğini belirtir), RAID dizisine eklenecek RAID tanımlayıcılarını listeler.

source: RAID level to use (`0`, `1`, `4`, `5`, `6`, or `10`). See xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types] for information about various RAID types and their requirements.
tr: Kullanılacak RAID seviyesi (`0`, `1`, `4`, `5`, `6` veya `10`). Çeşitli RAID türleri ve gereksinimleri hakkında bilgi için xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Aygıt, Dosya Sistemi ve RAID Türleri] bölümüne bakın.

source: Name of the RAID device to use. As of {PRODUCT}{nbsp}{PRODVER}, RAID devices are no longer referred to by names like `md0`. If you have an old (v0.90 metadata) array that you cannot assign a name to, you can specify the array by a filesystem label or UUID (for example, [option]#--device=rhel7-root --label=rhel7-root#).
id: Nama perangkat RAID yang akan digunakan. Mulai {PRODUCT}{nbsp}{PRODVER}, perangkat RAID tidak lagi disebut dengan nama seperti `md0`. Jika Anda memiliki larik lama (metadata v0.90) yang tidak dapat Anda beri nama, Anda dapat menentukan larik tersebut dengan label sistem file atau UUID (misalnya, [option]#--device=rhel7-root --label= rhel7-root#).
tr: Kullanılacak RAID aygıtının adı. {PRODUCT}{nbsp}{PRODVER} itibarıyla RAID aygıtlarına artık `md0` gibi adlar verilmemektedir. Ad atayamayacağınız eski bir (v0.90 üst veri) diziniz varsa, diziyi bir dosya sistemi etiketi veya UUID ile belirtebilirsiniz (örneğin, [option]#--device=rhel7-root --label=rhel7-root#).

source: Specifies the number of spare drives allocated for the RAID array. Spare drives are used to rebuild the array in case of drive failure.
id: Menentukan jumlah drive cadangan yang dialokasikan untuk larik RAID. Drive cadangan digunakan untuk membangun kembali array jika terjadi kegagalan drive.
tr: RAID dizisi için ayrılan yedek disk sayısını belirtir. Yedek diskler, disk arızası durumunda diziyi yeniden oluşturmak için kullanılır.

source: Specify the label to give to the filesystem to be made. If the given label is already in use by another filesystem, a new label will be created.
id: Tentukan label yang akan diberikan pada filesystem yang akan dibuat. Jika label yang diberikan sudah digunakan oleh sistem file lain, label baru akan dibuat.
tr: Yapılacak dosya sistemine verilecek etiketi belirt. Verilen etiket zaten başka bir dosya sistemi tarafından kullanılıyorsa, yeni bir etiket oluşturulacaktır.

source: Use an existing RAID device and do not format it.
id: Gunakan perangkat RAID yang ada dan jangan memformatnya.
tr: Mevcut bir RAID aygıtını kullan ve onu biçimlendirme.

source: Use an existing RAID device and reformat it.
id: Gunakan perangkat RAID yang ada dan format ulang.
tr: Mevcut bir RAID aygıtını kullan ve onu yeniden biçimlendir.

source: Specifies that this array should be encrypted, using the passphrase provided in the [option]#--passphrase# option. If you do not specify a passphrase, [application]*Anaconda* uses the default, system-wide passphrase set with the [command]#autopart --passphrase# command, or stops the installation and prompts you to provide a passphrase if no default is set.
id: Menentukan bahwa larik ini harus dienkripsi, menggunakan frasa sandi yang disediakan dalam opsi [option]#--passphrase#. Jika Anda tidak menentukan frasa sandi, [application]*Anaconda* menggunakan default, frasa sandi seluruh sistem yang disetel dengan perintah [command]#autopart --passphrase#, atau menghentikan penginstalan dan meminta Anda untuk memberikan frasa sandi jika tidak ada default diatur.
tr: Bu dizinin, [option]#--passphrase=# seçeneğinde sağlanan parola kullanılarak şifrelenmesi gerektiğini belirtir. Bir parola belirtmezseniz, [application]*Anaconda* [command]#autopart --passphrase# komutuyla ayarlanan öntanımlı, sistem genelindeki parolayı kullanacak veya herhangi bir öntanımlı değer ayarlanmadıysa kurulumu durduracak ve sizden bir parola sağlamanızı isteyecektir.

source: The following example shows how to create a RAID level 1 partition for `/`, and a RAID level 5 for `/home`, assuming there are three SCSI disks on the system. It also creates three swap partitions, one on each drive.
id: Contoh berikut menunjukkan cara membuat partisi RAID level 1 untuk `/`, dan RAID level 5 untuk `/home`, dengan asumsi ada tiga disk SCSI pada sistem. Itu juga membuat tiga partisi swap, satu di setiap drive.
tr: Aşağıdaki örnekte, sistemde üç SCSI diski olduğu varsayılarak, `/` için RAID seviye 1 bölümünün ve `/home` için RAID seviye 5 bölümünün nasıl oluşturulacağı gösterilmektedir. Ayrıca her diskte bir tane olmak üzere üç takas bölümü oluşturulmaktadır.

source: Creating a RAID array in Kickstart
id: Membuat larik RAID di Kickstart
tr: Kickstart'ta bir RAID dizisi oluşturma

source: reqpart (optional) - Create Required Partitions
id: reqpart (opsional) - Buat Partisi yang Diperlukan
tr: reqpart (isteğe bağlı) - Gerekli Bölümleri Oluştur

source: Automatically create partitions required by your hardware platform. These include a `/boot/efi` for x86_64 and Aarch64 systems with UEFI firmware, `biosboot` for x86_64 systems with BIOS firmware and GPT (GUID Partition Table), and `PRePBoot` for IBM Power Systems.
id: Secara otomatis membuat partisi yang diperlukan oleh platform perangkat keras Anda. Ini termasuk `/boot/efi` untuk sistem x86_64 dan Aarch64 dengan firmware UEFI, `biosboot` untuk sistem x86_64 dengan firmware BIOS dan GPT (GUID Partition Table), dan `PRePBoot` untuk IBM Power Systems.
tr: Donanım platformunuzun gerektirdiği bölümleri otomatik olarak oluştur. Bunlar, UEFI ürün yazılımına sahip x86_64 ve Aarch64 sistemleri için bir `/boot/efi`, GPT (GUID Bölümlendirme Tablosu) ve BIOS ürün yazılımına sahip x86_64 sistemleri için `biosboot` ve IBM Power Systems için `PRePBoot` bölümlerini içermektedir.

source: This command cannot be used together with [command]#autopart#, because [command]#autopart# does the same and creates other partitions or logical volumes such as `/` and `swap` on top. In contrast with [command]#autopart#, this command only creates platform-specific partitions and leaves the rest of the drive empty, allowing you to create a custom layout.
tr: Bu komut, [command]#autopart# komutuyla birlikte kullanılamaz, çünkü [command]#autopart# komutu aynı şeyi yapar ve üzerine `/` ve `swap` gibi başka bölümler veya mantıksal birimler oluşturur. [command]#autopart# komutunun aksine, bu komut yalnızca platforma özel bölümleri oluşturur ve diskin geri kalanını boş bırakarak özel bir düzen oluşturmanıza olanak tanır.

source: Create a separate `/boot` partition in addition to the platform-specific partition created by the base command.
id: Buat partisi `/boot` terpisah selain partisi khusus platform yang dibuat oleh perintah dasar.
tr: Temel komut tarafından oluşturulan platforma özel bölüme ek olarak ayrı bir `/boot` bölümü oluştur.

source: volgroup (optional) - Create LVM Volume Group
id: volgroup (opsional) - Buat Grup Volume LVM
tr: volgroup (isteğe bağlı) - LVM Birim Grubu Oluştur

source: Creates a Logical Volume Management (LVM) volume group.
id: Membuat grup volume Logical Volume Management (LVM).
tr: Mantıksal Birim Yönetimi (LVM) birim grubu oluşturur.

source: [command]#volgroup _name_ _partition_ [pass:attributes[{blank}]_options_pass:attributes[{blank}]]#
tr: [command]#volgroup _ad_ _bölüm_ [pass:attributes[{blank}]_seçenekler_pass:attributes[{blank}]]#

source: This limitation only applies to newly created logical volume and volume group names. If you are reusing existing ones using the [option]#--noformat# or [option]#--noformat# option, their names will not be changed.
id: Batasan ini hanya berlaku untuk volume logis dan nama grup volume yang baru dibuat. Jika Anda menggunakan kembali yang sudah ada menggunakan opsi [option]#--noformat# atau [option]#--noformat#, namanya tidak akan diubah.
tr: Bu sınırlama yalnızca yeni oluşturulan mantıksal birim ve birim grubu adları için geçerlidir. [option]#--noformat# veya [option]#--useexisting# seçeneğini kullanarak zaten var olanları yeniden kullanıyorsanız, onların adları değiştirilmeyecektir.

source: For a detailed partitioning example including [command]#volgroup#, see xref:sect-kickstart-example-advanced-partitioning[Advanced Partitioning Example].
tr: [command]#volgroup# komutunu içeren ayrıntılı bir bölümlendirme örneği için xref:sect-kickstart-example-advanced-partitioning[Gelişmiş Bölümlendirme Örneği] bölümüne bakın.

source: Use an existing volume group and do not format it.
id: Gunakan grup volume yang ada dan jangan memformatnya.
tr: Mevcut bir birim grubunu kullan ve onu biçimlendirme.

source: Use an existing volume group and reformat it.
id: Gunakan grup volume yang ada dan format ulang.
tr: Mevcut bir birim grubunu kullan ve onu yeniden biçimlendir.

source: Set the size of the physical extents. The default size for Kickstart installations is 4 MiB.
id: Mengatur ukuran luasan fisik. Ukuran default untuk instalasi Kickstart adalah 4 MiB.
tr: Fiziksel genişletmelerin boyutunu ayarla. Kickstart kurulumları için öntanımlı boyut 4 MiB'dir.

source: Specify an amount of space to leave unused in a volume group in megabytes. Applicable only to newly created volume groups.
id: Tentukan jumlah ruang yang tidak digunakan dalam grup volume dalam megabita. Hanya berlaku untuk grup volume yang baru dibuat.
tr: Bir birim grubunda kullanılmadan bırakılacak alan miktarını megabayt olarak belirt. Yalnızca yeni oluşturulan birim grupları için geçerlidir.

source: Specify a percentage of total volume group space to leave unused. Applicable only to newly created volume groups.
id: Tentukan persentase total ruang grup volume yang tidak digunakan. Hanya berlaku untuk grup volume yang baru dibuat.
tr: Kullanılmadan bırakılacak toplam birim grubu alanının yüzdesini belirt. Yalnızca yeni oluşturulan birim grupları için geçerlidir.

source: zerombr (optional) - Reinitialize Partition Tables
id: zerombr (opsional) - Inisialisasi Ulang Tabel Partisi
tr: zerombr (isteğe bağlı) - Bölümlendirme Tablolarını Yeniden Başlat

source: If [command]#zerombr# is specified, any invalid partition tables found on disks are initialized. This destroys all of the contents of disks with invalid partition tables. This command is required when performing an unattended installation on a system with previously initialized disks.
id: Jika [command]#zerombr# ditentukan, semua tabel partisi tidak valid yang ditemukan pada disk akan diinisialisasi. Ini menghancurkan semua isi disk dengan tabel partisi yang tidak valid. Perintah ini diperlukan saat melakukan instalasi tanpa pengawasan pada sistem dengan disk yang telah diinisialisasi sebelumnya.
tr: [command]#zerombr# belirtilirse, disklerde bulunan tüm geçersiz bölüm tabloları yeniden başlatılır. Bu, geçersiz bölüm tablolarına sahip disklerin tüm içeriğini yok eder. Bu komut, önceden başlatılmış disklere sahip bir sistemde etkileşimsiz kurulum gerçekleştirirken gereklidir.

source: On IBM System{nbsp}z, if [command]#zerombr# is specified, any _Direct Access Storage Device_ (DASD) visible to the installation program which is not already low-level formatted is automatically low-level formatted with [application]*dasdfmt*. The command also prevents user choice during interactive installations.
id: Pada IBM System{nbsp}z, jika [command]#zerombr# ditentukan, _Direct Access Storage Device_ (DASD) apa pun yang terlihat oleh program penginstalan yang belum diformat tingkat rendah secara otomatis diformat tingkat rendah dengan [aplikasi]* dasdfmt*. Perintah juga mencegah pilihan pengguna selama instalasi interaktif.
tr: IBM System{nbsp}z sistemlerinde, [command]#zerombr# komutu belirtilirse, kurulum programı tarafından görülebilen ve halihazırda düşük düzeyde biçimlendirilmemiş herhangi bir _Doğrudan Erişimli Depolama Aygıtı_ (Direct Access Storage Device - DASD), [application]*dasdfmt* ile otomatik olarak düşük düzeyde biçimlendirilir. Komut, etkileşimli kurulumlar sırasında kullanıcı seçimini de engeller.

source: If [command]#zerombr# is not specified and there is at least one unformatted DASD visible to the installation program, a non-interactive Kickstart installation will exit unsuccessfully.
id: Jika [command]#zerombr# tidak ditentukan dan setidaknya ada satu DASD yang tidak diformat yang terlihat oleh program penginstalan, penginstalan Kickstart non-interaktif akan gagal.
tr: [command]#zerombr# komutu belirtilmezse ve kurulum programında görülebilen en az bir biçimlendirilmemiş DASD varsa, etkileşimli olmayan bir Kickstart kurulumu başarısız bir şekilde sonlandırılacaktır.

source: If [command]#zerombr# is not specified and there is at least one unformatted DASD visible to the installation program, an interactive installation exits if the user does not agree to format all visible and unformatted DASDs. To circumvent this, only activate those DASDs that you will use during installation. You can always add more DASDs after installation is complete.
id: Jika [command]#zerombr# tidak ditentukan dan setidaknya ada satu DASD yang tidak diformat yang terlihat oleh program instalasi, instalasi interaktif akan keluar jika pengguna tidak setuju untuk memformat semua DASD yang terlihat dan tidak diformat. Untuk menghindari ini, hanya aktifkan DASD yang akan Anda gunakan selama instalasi. Anda selalu dapat menambahkan lebih banyak DASD setelah instalasi selesai.
tr: [command]#zerombr# komutu belirtilmezse ve kurulum programında görülebilen en az bir biçimlendirilmemiş DASD varsa, kullanıcı tüm görülebilen ve biçimlendirilmemiş DASD'leri biçimlendirmeyi kabul etmezse etkileşimli kurulumdan çıkılır. Bunu önlemek için yalnızca kurulum sırasında kullanacağınız DASD'leri etkinleştirin. Kurulum tamamlandıktan sonra her zaman daha fazla DASD ekleyebilirsiniz.

source: zfcp (optional) - Configure Fibre Channel Device
id: zfcp (opsional) - Konfigurasikan Perangkat Saluran Serat
tr: zfcp (isteğe bağlı) - Fiber Kanal Aygıtı Yapılandır

source: Define a Fibre channel device. This option only applies on IBM System{nbsp}z. All of the options described below must be specified.
id: Tentukan perangkat saluran Fibre. Opsi ini hanya berlaku di IBM System{nbsp}z. Semua opsi yang dijelaskan di bawah ini harus ditentukan.
tr: Bir Fiber kanal aygıtı tanımla. Bu seçenek yalnızca IBM System{nbsp}z sistemlerinde geçerlidir. Aşağıda açıklanan seçeneklerin tümü belirtilmelidir.

source: [command]#zfcp --devnum=pass:attributes[{blank}]_devnum_ --wwpn=pass:attributes[{blank}]_wwpn_ --fcplun=pass:attributes[{blank}]_lun_pass:attributes[{blank}]#
tr: [command]#zfcp --devnum=pass:attributes[{blank}]_aygıtno_ --wwpn=pass:attributes[{blank}]_wwpn_ --fcplun=pass:attributes[{blank}]_lun_pass:attributes[{blank}]#

source: The device number (zFCP adaptor device bus ID).
id: Nomor perangkat (ID bus perangkat adaptor zFCP).
tr: Aygıt numarası (zFCP bağdaştırıcı aygıtı veri yolu kimliği).

source: The device's World Wide Port Name (WWPN). Takes the form of a 16-digit number, preceded by `0x`.
id: Nama World Wide Port (WWPN) perangkat. Berbentuk angka 16 digit, didahului dengan `0x`.
tr: Aygıtın Dünya Genelinde Bağlantı Noktası Adı (World Wide Port Name - WWPN). Başında `0x` bulunan 16 basamaklı bir sayı biçimindedir.

source: The device's Logical Unit Number (LUN). Takes the form of a 16-digit number, preceded by `0x`.
id: Nomor Unit Logis (LUN) perangkat. Berbentuk angka 16 digit, didahului dengan `0x`.
tr: Aygıtın Mantıksal Birim Numarası (Logical Unit Number - LUN). Başında `0x` bulunan 16 basamaklı bir sayı biçimindedir.

source: For example:
id: Sebagai contoh:
tr: Örneğin:

source: Network Configuration
id: Konfigurasi Jaringan
tr: Ağ Yapılandırması

source: Commands in this chapter are used for network configuration.
id: Perintah dalam bab ini digunakan untuk konfigurasi jaringan.
tr: Bu bölümdeki komutlar ağ yapılandırması için kullanılmaktadır.

source: firewall (optional) - Configure Firewall
id: firewall (opsional) - Konfigurasi Firewall
tr: firewall (isteğe bağlı) - Güvenlik Duvarını Yapılandır

source: Specify the firewall configuration for the installed system.
id: Tentukan konfigurasi firewall untuk sistem yang diinstal.
tr: Kurulu sistem için güvenlik duvarı yapılandırmasını belirt.

source: [command]#firewall --enabled | --disabled _device_ [--trust= | --ssh | --smtp | --http | --ftp | --port= | --service=]#
id: [command]#firewall --enabled | --disabled _device_ [--trust= | --ssh | --smtp | --http | --ftp | --port= | --layanan=]#
tr: [command]#firewall --enabled | --disabled _aygıt_ [--trust= | --ssh | --smtp | --http | --ftp | --port= | --service=]#

source: [option]#--enabled# or [option]#--enable#
id: [option]#--enabled# atau [option]#--enable#
tr: [option]#--enabled# veya [option]#--enable#

source: Reject incoming connections that are not in response to outbound requests, such as DNS replies or DHCP requests. If access to services running on this machine is needed, you can choose to allow specific services through the firewall.
id: Tolak koneksi masuk yang tidak menanggapi permintaan keluar, seperti balasan DNS atau permintaan DHCP. Jika akses ke layanan yang berjalan pada mesin ini diperlukan, Anda dapat memilih untuk mengizinkan layanan tertentu melalui firewall.
tr: DNS yanıtları veya DHCP istekleri gibi içerinden giden isteklere gelen yanıtlar dışındaki bağlantıları reddet. Bu makinede çalışan hizmetlere erişim gerekiyorsa, güvenlik duvarı aracılığıyla belirli hizmetlere izin vermeyi seçebilirsiniz.

source: [option]#--disabled# or [option]#--disable#
id: [option]#--disabled# atau [option]#--disable#
tr: [option]#--disabled# veya [option]#--disable#

source: Disable the firewall.
id: Nonaktifkan firewallnya.
tr: Güvenlik duvarını devre dışı bırak.

source: Listing a device here, such as `em1`, allows all traffic coming to and from that device to go through the firewall. To list more than one device, use this option again - for example:
id: Mencantumkan perangkat di sini, seperti `em1`, memungkinkan semua lalu lintas yang datang ke dan dari perangkat itu melalui firewall. Untuk membuat daftar lebih dari satu perangkat, gunakan opsi ini lagi - misalnya:
tr: Burada `em1` gibi bir aygıtın listelenmesi, o aygıta gelen ve ondan giden tüm trafiğin güvenlik duvarından geçmesine izin verir. Birden fazla aygıtı listelemek için bu seçeneği tekrar kullanın - örneğin:

source: Do not use a comma-separated format such as [option]#--trust em1, em2#.
id: Jangan gunakan format yang dipisahkan koma seperti [option]#--trust em1, em2#.
tr: [option]#--trust em1, em2# gibi virgülle ayrılmış bir biçim kullanmayın.

source: _incoming_
id: _masuk_
tr: _gelen_

source: Replace with one or more of the following to allow the specified services through the firewall:
id: Ganti dengan satu atau beberapa hal berikut untuk mengizinkan layanan yang ditentukan melalui firewall:
tr: Belirtilen hizmetlere güvenlik duvarı üzerinden izin vermek için aşağıdakilerden bir veya daha fazlasıyla değiştirin:

source: You can specify that ports be allowed through the firewall using the port:protocol format. For example, to allow IMAP access through your firewall, specify `imap:tcp`. Numeric ports can also be specified explicitly; for example, to allow UDP packets on port 1234 through, specify `1234:udp`. To specify multiple ports, separate them by commas.
id: Anda dapat menentukan bahwa port diizinkan melalui firewall menggunakan format port:protocol. Misalnya, untuk mengizinkan akses IMAP melalui firewall Anda, tentukan `imap:tcp`. Port numerik juga dapat ditentukan secara eksplisit; misalnya, untuk mengizinkan paket UDP melalui port 1234, tentukan `1234:udp`. Untuk menentukan beberapa port, pisahkan dengan koma.
tr: bağlantınoktası:protokol biçimini kullanarak güvenlik duvarı üzerinden bağlantı noktalarına izin verilmesini belirtebilirsiniz. Örneğin, güvenlik duvarınız üzerinden IMAP erişimine izin vermek için `imap:tcp` kullanın. Bağlantı noktası numaraları da açıkça belirtilebilir; örneğin, 1234 bağlantı noktası üzerinden UDP paketlerine izin vermek için `1234:udp` kullanın. Birden çok bağlantı noktası belirtmek için onları virgülle ayırın.

source: This option provides a higher-level way to allow services through the firewall. Some services (like `cups`, `avahi`, etc.) require multiple ports to be open or other special configuration in order for the service to work. You can specify each individual port with the [option]#--port# option, or specify [command]#--service=# and open them all at once.
id: Opsi ini menyediakan cara tingkat yang lebih tinggi untuk mengizinkan layanan melalui firewall. Beberapa layanan (seperti `cups`, `avahi`, dll.) memerlukan beberapa port untuk dibuka atau konfigurasi khusus lainnya agar layanan dapat bekerja. Anda dapat menentukan masing-masing port dengan opsi [option]#--port#, atau menentukan [command]#--service=# dan membuka semuanya sekaligus.
tr: Bu seçenek, güvenlik duvarı üzerinden hizmetlere izin vermek için daha üst düzey bir yol sağlar. Bazı hizmetler (`cups`, `avahi` vb.), hizmetin çalışması için birden fazla bağlantı noktasının açık olmasını veya diğer özel yapılandırmaları gerektirir. [option]#--port# seçeneğiyle her bir bağlantı noktasını belirtebilir veya [command]#--service=# seçeneğini belirtebilir ve hepsini bir defada açabilirsiniz.

source: Valid options are anything recognized by the [application]*firewall-offline-cmd* program in the [package]*firewalld* package. If `firewalld` is running, [command]#firewall-cmd --get-services# will provide a list of known service names.
id: Opsi yang valid adalah apa saja yang dikenali oleh program [application]*firewall-offline-cmd* dalam paket [package]*firewalld*. Jika `firewalld` sedang berjalan, [command]#firewall-cmd --get-services# akan memberikan daftar nama layanan yang diketahui.
tr: Geçerli seçenekler, [package]*firewalld* paketindeki [application]*firewall-offline-cmd* programı tarafından tanınan seçeneklerdir. `firewalld` çalışıyorsa, [command]#firewall-cmd --get-services# komutu bilinen hizmet adlarının bir listesini sağlayacaktır.

source: network (optional) - Configure Network Interfaces
id: jaringan (opsional) - Konfigurasi Antarmuka Jaringan
tr: network (isteğe bağlı) - Ağ Arayüzlerini Yapılandır
