Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: pwpolicy (optional) - Change the Default Password Policy
id: pwpolicy (opsional) - Ubah Kebijakan Kata Sandi Default
tr: pwpolicy (isteğe bağlı) - Öntanımlı Parola Politikasını Değiştir

source: This command can be used to set custom requirements (policy) such as length and strength for passwords set during the installation - the `root` password, user passwords and LUKS (disk encryption) password.
id: Perintah ini dapat digunakan untuk mengatur persyaratan khusus (kebijakan) seperti panjang dan kekuatan kata sandi yang ditetapkan selama instalasi - kata sandi `root`, kata sandi pengguna dan kata sandi LUKS (enkripsi disk).
tr: Bu komut, kurulum sırasında ayarlanan parolalar (`root` parolası, kullanıcı parolaları ve LUKS (disk şifreleme) parolası) için uzunluk ve sağlamlık gibi özel gereksinimleri (politika) ayarlamak için kullanılabilir.

source: [command]#pwpolicy _name_ [--minlen=pass:attributes[{blank}]_length_pass:attributes[{blank}]] [--minquality=pass:attributes[{blank}]_quality_pass:attributes[{blank}]] [--strict|nostrict] [--emptyok|noempty] [--changesok|nochanges]#
tr: [command]#pwpolicy _ad_ [--minlen=pass:attributes[{blank}]_uzunluk_pass:attributes[{blank}]] [--minquality=pass:attributes[{blank}]_nitelik_pass:attributes[{blank}]] [--strict|nostrict] [--emptyok|noempty] [--changesok|nochanges]#

source: The `libpwquality` library is used to check minimum password requirements (length and quality). You can use the [command]#pwscore# and [command]#pwmake# commands provided by the [package]*libpwquality* package to check the quality score of your chosen password, or to create a random password with a given score. See the `pwscore(1)` and `pwmake(1)` man pages for details about these commands.
id: Pustaka `libpwquality` digunakan untuk memeriksa persyaratan kata sandi minimum (panjang dan kualitas). Anda dapat menggunakan perintah [command]#pwscore# dan [command]#pwmake# yang disediakan oleh paket [package]*libpwquality* untuk memeriksa skor kualitas kata sandi pilihan Anda, atau untuk membuat kata sandi acak dengan skor tertentu. Lihat halaman manual `pwscore(1)` dan `pwmake(1)` untuk detail tentang perintah ini.
tr: Asgari parola gereksinimlerini (uzunluk ve nitelik) denetlemek için `libpwquality` kütüphanesi kullanılmaktadır. Seçtiğiniz parolanın nitelik puanını denetlemek veya belirli bir puana sahip rastgele bir parola oluşturmak için [package]*libpwquality* paketi tarafından sağlanan [command]#pwscore# ve [command]#pwmake# komutlarını kullanabilirsiniz. Bu komutlarla ilgili ayrıntılar için `pwscore(1)` ve `pwmake(1)` kılavuz sayfalarına bakın.

source: This command must be used inside the [command]#%anaconda# section. See xref:sect-kickstart-commands-anaconda[%anaconda (optional) - Additional Anaconda Configuration] for details.
tr: Bu komut [command]#%anaconda# bölümünde kullanılmalıdır. Ayrıntılar için xref:sect-kickstart-commands-anaconda[%anaconda (isteğe bağlı) - Ek Anaconda Yapılandırması] bölümüne bakın.

source: _name_
id: _nama_
tr: _ad_

source: Name of the password entry. Supported values are `root`, `user` and `luks` for `root` password, user passwords and LUKS password, respectively.
id: Nama entri kata sandi. Nilai yang didukung adalah `root`, `user` dan `luks` untuk kata sandi `root`, kata sandi pengguna, dan kata sandi LUKS.
tr: Parola girdisinin adı. `root` parolası için `root`, kullanıcı parolaları için `user` ve LUKS parolası için `luks` değerleri desteklenmektedir.

source: Sets the minimum allowed password length. The default minimum length is `8`.
id: Menyetel panjang sandi minimum yang diizinkan. Panjang minimum default adalah `8`.
tr: İzin verilen asgari parola uzunluğunu ayarlar. Öntanımlı asgari uzunluk olarak `8` kullanılır.

source: Sets the minimum allowed password quality as defined by the `libpwquality` library. The default value is `50`.
id: Menyetel kualitas kata sandi minimum yang diizinkan seperti yang ditentukan oleh pustaka `libpwquality`. Nilai defaultnya adalah `50`.
tr: `libpwquality` kütüphanesi tarafından tanımlanan izin verilen asgari parola niteliğini ayarlar. Öntanımlı değer olarak `50` kullanılır.

source: Strict password enforcement. Passwords not meeting the quality requirements specified in [option]#--minquality=# will not be allowed. Enabled by default.
id: Penegakan kata sandi yang ketat. Sandi yang tidak memenuhi persyaratan kualitas yang ditentukan dalam [opsi]#--minquality=# tidak akan diizinkan. Diaktifkan secara default.
tr: Katı parola uygulaması. [option]#--minquality=# seçeneğinde belirtilen nitelik gereksinimlerini karşılamayan parolalara izin verilmeyecektir. Öntanımlı olarak etkindir.

source: Passwords *not* meeting the minimum quality requirements specified in [option]#--minquality=# will be allowed after `Done` is clicked twice.
id: Kata sandi *tidak* memenuhi persyaratan kualitas minimum yang ditentukan dalam [opsi]#--minquality=# akan diizinkan setelah `Selesai` diklik dua kali.
tr: [option]#--minquality=# seçeneğinde belirtilen asgari nitelik gereksinimlerini *karşılamayan* parolalara `Bitti` düğmesine iki kez tıklandıktan sonra izin verilecektir.

source: Allow empty passwords. Enabled by default.
id: Izinkan sandi kosong. Diaktifkan secara default.
tr: Boş parolalara izin ver. Öntanımlı olarak etkindir.

source: Do not allow empty passwords.
id: Jangan izinkan kata sandi kosong.
tr: Boş parolalara izin verme.

source: Allow changing the password in the user interface, even if the Kickstart file already specifies a password.
id: Izinkan mengubah kata sandi di antarmuka pengguna, bahkan jika file Kickstart sudah menentukan kata sandi.
tr: Kickstart dosyası zaten bir parola belirtmiş olsa bile, kullanıcı arayüzünde parolanın değiştirilmesine izin ver.

source: Do not allow changing passwords which are already set in the Kickstart file. Enabled by default.
id: Jangan izinkan mengubah kata sandi yang sudah diatur dalam file Kickstart. Diaktifkan secara default.
tr: Kickstart dosyasında önceden ayarlanan olan parolaların değiştirilmesine izin verme. Öntanımlı olarak etkindir.

source: An example use of the [command]#pwpolicy# command is below:
id: Contoh penggunaan perintah [command]#pwpolicy# di bawah ini:
tr: [command]#pwpolicy# komutunun örnek bir kullanımı aşağıdaki gibidir:

source: realm (optional) - Join an Active Directory or IPA Domain
id: ranah (opsional) - Bergabung dengan Direktori Aktif atau Domain IPA
tr: realm (isteğe bağlı) - Active Directory veya IPA Etki Alanına Katıl

source: Join an Active Directory or IPA domain. For more information about this command, see the [command]#join# section of the `realm(8)` man page.
id: Bergabunglah dengan domain Direktori Aktif atau IPA. Untuk informasi lebih lanjut tentang perintah ini, lihat bagian [command]#join# dari halaman manual `realm(8)`.
tr: Bir Active Directory veya IPA etki alanına katıl. Bu komut hakkında daha fazla bilgi için, `realm(8)` kılavuz sayfasındaki [command]#join# bölümüne bakın.

source: [command]#realm join _domain_ [pass:attributes[{blank}]_options_pass:attributes[{blank}]]#
tr: [command]#realm join _etkialanı_ [pass:attributes[{blank}]_seçenekler_pass:attributes[{blank}]]#

source: Provide the _distinguished name_ of an organizational unit in order to create the computer account. The exact format of the distinguished name depends on the client software and membership software. The root DSE portion of the distinguished name can usually be left out.
id: Berikan _nama khusus_ unit organisasi untuk membuat akun komputer. Format yang tepat dari nama yang dibedakan tergantung pada perangkat lunak klien dan perangkat lunak keanggotaan. Bagian root DSE dari nama yang dibedakan biasanya dapat diabaikan.
tr: Bilgisayar hesabını oluşturmak için bir kuruluş biriminin _ayırt edici adını_ belirt. Ayırt edici adın tam biçimi, istemci yazılımına ve üyelik yazılımına bağlıdır. Ayırt edici adın kök DSE kısmı genellikle dışarıda bırakılabilir.

source: Join automatically without a password.
id: Bergabung secara otomatis tanpa kata sandi.
tr: Parola olmadan otomatik olarak katıl.

source: Join using a one-time password. This is not possible with all types of realm.
id: Bergabunglah menggunakan kata sandi satu kali. Ini tidak mungkin dengan semua jenis alam.
tr: Tek seferlik bir parola kullanarak katıl. Bu, tüm erişim alanı (realm) türleriyle mümkün değildir.

source: Only join realms which can run this client software. Valid values include `sssd` and `winbind`. Not all realms support all values. By default, the client software is chosen automatically.
id: Hanya bergabung dengan ranah yang dapat menjalankan perangkat lunak klien ini. Nilai yang valid mencakup `sssd` dan `winbind`. Tidak semua alam mendukung semua nilai. Secara default, perangkat lunak klien dipilih secara otomatis.
tr: Yalnızca bu istemci yazılımını çalıştırabilen erişim alanlarına katıl.`sssd` ve `winbind` geçerli değerlerdir. Tüm erişim alanları tüm değerleri desteklemez. Öntanımlı olarak, istemci yazılımı otomatik olarak seçilir.

source: Only join realms which can run this server software. Possible values include `active-directory` or `freeipa`.
id: Hanya bergabung dengan ranah yang dapat menjalankan perangkat lunak server ini. Nilai yang mungkin termasuk `active-directory` atau `freeipa`.
tr: Yalnızca bu sunucu yazılımını çalıştırabilen erişim alanlarına katıl. `active-directory` veya `freeipa` olası değerlerdir.

source: Use this software when joining the realm. Valid values include `samba` and `adcli`. Not all realms support all values. By default, the membership software is chosen automatically.
id: Gunakan perangkat lunak ini saat bergabung dengan ranah. Nilai yang valid mencakup `samba` dan `adcli`. Tidak semua alam mendukung semua nilai. Secara default, perangkat lunak keanggotaan dipilih secara otomatis.
tr: Erişim alanına katılırken bu yazılımı kullan. `samba` ve `adcli` geçerli değerlerdir. Tüm erişim alanları tüm değerleri desteklemez. Öntanımlı olarak, üyelik yazılımı otomatik olarak seçilir.

source: rootpw (required) - Set Root Password
id: rootpw (wajib) - Setel Kata Sandi Root
tr: rootpw (gerekli) - Root Parolasını Ayarla

source: Sets the system's root password to the _password_ argument.
id: Menyetel kata sandi root sistem ke argumen _password_.
tr: Sistemin root parolasını _parola_ argümanına ayarlar.

source: [command]#rootpw [--iscrypted|--plaintext] [--lock] _password_pass:attributes[{blank}]#
tr: [command]#rootpw [--iscrypted|--plaintext] [--lock] _parola_pass:attributes[{blank}]#

source: If this option is present, the password argument is assumed to already be encrypted. This option is mutually exclusive with [option]#--plaintext#. To create an encrypted password, you can use Python:
id: Jika opsi ini ada, argumen kata sandi dianggap sudah dienkripsi. Opsi ini saling eksklusif dengan [option]#--plaintext#. Untuk membuat kata sandi terenkripsi, Anda dapat menggunakan Python:
tr: Bu seçenek belirtilirse, parola argümanının zaten şifrelenmiş olduğu varsayılır. Bu seçenek, [option]#--plaintext# seçeneğiyle birlikte kullanılamaz. Şifreli bir parola oluşturmak için Python kullanabilirsiniz:

source: $ [command]#python -c 'import crypt; print(crypt.crypt("My Password", "$6$My Salt"))'#
tr: $ [command]#python -c 'import crypt; print(crypt.crypt("Parolam", "$6$Salt Değerim"))'#

source: This will generate a SHA512 crypt of your password using your provided salt.
id: Ini akan menghasilkan crypt SHA512 kata sandi Anda menggunakan garam yang Anda berikan.
tr: Bu, sağladığınız salt değerini kullanarak parolanızın bir SHA512 şifresini oluşturacaktır.

source: If this option is present, the password argument is assumed to be in plain text. This option is mutually exclusive with [option]#--iscrypted#.
id: Jika opsi ini ada, argumen kata sandi diasumsikan dalam teks biasa. Opsi ini saling eksklusif dengan [option]#--iscrypted#.
tr: Bu seçenek belirtilirse, parola argümanının düz metin olduğu varsayılır. Bu seçenek, [option]#--iscrypted# seçeneğiyle birlikte kullanılamaz.

source: If this option is present, the root account is locked by default. This means that the root user will not be able to log in from the console.
id: Jika opsi ini ada, akun root dikunci secara default. Ini berarti bahwa pengguna root tidak akan dapat masuk dari konsol.
tr: Bu seçenek belirtilirse, root hesabı öntanımlı olarak kilitlidir. Bu, root kullanıcısının konsoldan oturum açamayacağı anlamına gelir.

source: selinux (optional) - Configure SELinux
id: selinux (opsional) - Konfigurasi SELinux
tr: selinux (isteğe bağlı) - SELinux'u Yapılandır

source: Sets the state of SELinux on the installed system. The default policy is `enforcing`. For more information regarding SELinux in {PRODUCT}, see the [citetitle]_{PRODUCT} SELinux User's and Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
tr: Kurulu sistemdeki SELinux durumunu ayarlar. `enforcing` öntanımlı politikadır. {PRODUCT}'da SELinux ile ilgili daha fazla bilgi için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} SELinux Kullanıcısı ve Yöneticisi Kılavuzuna_ bakın.

source: Enables SELinux with the default targeted policy being `enforcing`.
id: Mengaktifkan SELinux dengan kebijakan bertarget default yang `menegakkan`.
tr: SELinux'u öntanımlı hedeflenen politika `enforcing` olacak şekilde etkinleştirir.

source: Enables SELinux with the default targeted policy being `permissive`. This policy outputs warnings based on the SELinux policy, but does not actually enforce the policy.
id: Mengaktifkan SELinux dengan kebijakan bertarget default menjadi `permisif`. Kebijakan ini mengeluarkan peringatan berdasarkan kebijakan SELinux, tetapi tidak benar-benar menegakkan kebijakan tersebut.
tr: SELinux'u öntanımlı hedeflenen politika `permissive` olacak şekilde etkinleştirir. Bu politika, SELinux politikasına dayalı uyarılar verir, ancak politikanın uygulanmasını zorlamaz.

source: Disables SELinux completely.
id: Nonaktifkan SELinux sepenuhnya.
tr: SELinux'u tamamen devre dışı bırakır.

source: sshkey (optional) - Add an Authorized SSH Key
id: sshkey (opsional) - Tambahkan Kunci SSH Resmi
tr: sshkey (isteğe bağlı) - Yetkili SSH Anahtarı Ekle

source: Use this command to add a specified `SSH` key to an user's `authorized_keys` file. The specified user must either be `root`, or it must be created in the Kickstart file - either automatically by an installed package, or using xref:sect-kickstart-commands-user[user (optional) - Create User Account].
tr: Bir kullanıcının `authorized_keys` dosyasına belirtilen bir `SSH` anahtarını eklemek için bu komutu kullanın. Belirtilen kullanıcı ya `root` olmalı ya da Kickstart dosyasında (kurulan bir paket tarafından otomatik olarak veya xref:sect-kickstart-commands-user[user (isteğe bağlı) - Kullanıcı Hesabı Oluştur] komutu kullanılarak) oluşturulmalıdır.

source: sshkey --username=user "ssh_key"
tr: sshkey --username=kullanıcı "ssh_anahtarı"

source: The _ssh_key_ must be a full `SSH` key fingerprint, and it must be enclosed in quotes (`""`) because the key may contain spaces.
id: _ssh_key_ harus berupa sidik jari kunci `SSH` lengkap, dan harus diapit dalam tanda kutip (`""`) karena kuncinya mungkin berisi spasi.
tr: _ssh_anahtarı_ tam bir `SSH` anahtarı parmak izi olmalıdır ve anahtar boşluk karakterleri içerebileceğinden tırnak işareti (`""`) içine alınmalıdır.

source: The name of the user account to which you want to install the `SSH` key.
id: Nama akun pengguna yang ingin Anda instal kunci `SSH`.
tr: `SSH` anahtarını kurmak istediğiniz kullanıcı hesabının adı.

source: user (optional) - Create User Account
id: pengguna (opsional) - Buat Akun Pengguna
tr: user (isteğe bağlı) - Kullanıcı Hesabı Oluştur

source: Creates a new user on the system.
id: Membuat pengguna baru pada sistem.
tr: Sistemde yeni bir kullanıcı oluşturur.

source: [command]#user --name=pass:attributes[{blank}]_username_ [pass:attributes[{blank}]_options_pass:attributes[{blank}]]#
tr: [command]#user --name=pass:attributes[{blank}]_kullanıcıadı_ [pass:attributes[{blank}]_seçenekler_pass:attributes[{blank}]]#

source: Provides the name of the user. This option is required.
id: Memberikan nama pengguna. Opsi ini diperlukan.
tr: Kullanıcının adını belirtir. Bu seçenek gereklidir.

source: Provides the GECOS information for the user. This is a string of various system-specific fields separated by a comma. It is frequently used to specify the user's full name, office number, etc. See the `passwd(5)` man page for more details.
id: Memberikan informasi GECOS untuk pengguna. Ini adalah string dari berbagai bidang khusus sistem yang dipisahkan oleh koma. Ini sering digunakan untuk menentukan nama lengkap pengguna, nomor kantor, dll. Lihat halaman manual `passwd(5)` untuk lebih jelasnya.
tr: Kullanıcı için GECOS bilgilerini belirtir. Bu, virgülle ayrılmış sisteme özgü çeşitli alanlardan oluşan bir dizgedir. Kullanıcının tam adını, ofis numarasını vb. belirtmek için sıklıkla kullanılır. Daha fazla ayrıntı için `passwd(5)` kılavuz sayfasına bakın.

source: In addition to the default group, a comma separated list of group names the user should belong to. The groups must exist before the user account is created. See xref:sect-kickstart-commands-group[group (optional) - Create User Group].
tr: Öntanımlı gruba ek olarak, kullanıcının ait olması gereken virgülle ayrılmış grup adları listesi. Gruplar, kullanıcı hesabı oluşturulmadan önce mevcut olmalıdır. xref:sect-kickstart-commands-group[group (isteğe bağlı) - Kullanıcı Grubu Oluştur] bölümüne bakın.

source: The home directory for the user. If not provided, this defaults to `/home/pass:attributes[{blank}]_username_pass:attributes[{blank}]`.
id: Direktori home untuk pengguna. Jika tidak disediakan, defaultnya adalah `/home/pass:attributes[{blank}]_username_pass:attributes[{blank}]`.
tr: Kullanıcının ev dizini. Belirtilmezse, öntanımlı olarak `/home/pass:attributes[{blank}]_kullanıcıadı_pass:attributes[{blank}]` kullanılır.

source: If this option is present, this account is locked by default. This means that the user will not be able to log in from the console.
tr: Bu seçenek belirtilirse, bu hesap öntanımlı olarak kilitlidir. Bu, kullanıcının konsoldan oturum açamayacağı anlamına gelir.

source: The new user's password. If no password is provided, the account will be locked.
id: Kata sandi pengguna baru. Jika tidak ada kata sandi yang diberikan, akun akan dikunci.
tr: Yeni kullanıcının parolası. Parola belirtilmezse hesap kilitlenecektir.

source: The user's login shell. If not provided, the system default will be used.
id: Shell login pengguna. Jika tidak disediakan, default sistem akan digunakan.
tr: Kullanıcının oturum açma kabuğu. Belirtilmezse, sistemin öntanımlı değeri kullanılacaktır.

source: The _UID_ (User ID). If not provided, this defaults to the next available non-system UID.
id: _UID_ (ID Pengguna). Jika tidak disediakan, ini default ke UID non-sistem yang tersedia berikutnya.
tr: _UID_ (Kullanıcı kimliği). Belirtilmezse, öntanımlı olarak bir sonraki kullanılabilir sistem dışı kullanıcı kimliği kullanılır.

source: The _GID_ (Group ID) to be used for the user's default group. If not provided, this defaults to the next available non-system group ID.
id: _GID_ (ID Grup) yang akan digunakan untuk grup default pengguna. Jika tidak disediakan, ini default ke ID grup non-sistem berikutnya yang tersedia.
tr: Kullanıcının öntanımlı grubu için kullanılacak _GID_ (Grup kimliği). Belirtilmezse, öntanımlı olarak bir sonraki kullanılabilir sistem dışı grup kimliği kullanılır.

source: Installation Environment
id: Lingkungan Instalasi
tr: Kurulum Ortamı

source: The following commands control how the system will behave during the installation.
id: Perintah berikut mengontrol bagaimana sistem akan berperilaku selama instalasi.
tr: Aşağıdaki komutlar, sistemin kurulum sırasında nasıl davranacağını denetler.

source: autostep (optional) - Go Through Every Screen
id: autostep (opsional) - Pergi Melalui Setiap Layar
tr: autostep (isteğe bağlı) - Her Ekrandan Geç

source: Normally, Kickstart installations skip unnecessary screens. This option makes the installation program step through every screen, displaying each briefly. This option should not be used when deploying a system because it may disrupt package installation.
id: Biasanya, instalasi Kickstart melewati layar yang tidak perlu. Opsi ini membuat program penginstalan melewati setiap layar, menampilkan masing-masing secara singkat. Opsi ini tidak boleh digunakan saat menerapkan sistem karena dapat mengganggu penginstalan paket.
tr: Normalde, Kickstart kurulumları gereksiz ekranları atlar. Bu seçenek, kurulum programının her ekranda adım adım ilerlemesini ve her birini kısaca görüntülemesini sağlar. Paket kurulumunu bozabileceğinden, bir sistem dağıtımı yapılırken bu seçenek kullanılmamalıdır.

source: Take a screenshot at every step during installation. These screenshots are stored in `/tmp/anaconda-screenshots` during the installation, and after the installation finishes you can find them in `/root/anaconda-screenshots`.
id: Ambil tangkapan layar di setiap langkah selama instalasi. Tangkapan layar ini disimpan di `/tmp/anaconda-screenshots` selama penginstalan, dan setelah penginstalan selesai, Anda dapat menemukannya di `/root/anaconda-screenshots`.
tr: Kurulum sırasında her adımda bir ekran görüntüsü al. Bu ekran görüntüleri kurulum sırasında `/tmp/anaconda-screenshots` dizininde saklanır ve kurulum tamamlandıktan sonra bunları `/root/anaconda-screenshots` dizininde bulabilirsiniz.

source: Each screen is only captured right before the installer switches to the next one. This is important, because if you do not use all required Kickstart options and the installation therefore does not begin automatically, you can go to the screens which were not automatically configured, perform any configuration you want. Then, when you press `Done` to continue, the screen will be captured including the configuration you just provided.
id: Setiap layar hanya diambil tepat sebelum penginstal beralih ke yang berikutnya. Ini penting, karena jika Anda tidak menggunakan semua opsi Kickstart yang diperlukan dan instalasi tidak dimulai secara otomatis, Anda dapat pergi ke layar yang tidak dikonfigurasi secara otomatis, melakukan konfigurasi apa pun yang Anda inginkan. Kemudian, ketika Anda menekan `Selesai` untuk melanjutkan, layar akan diambil termasuk konfigurasi yang baru saja Anda berikan.
tr: Her ekranın görüntüsü, yalnızca kurucu bir sonrakine geçmeden hemen önce kaydedilir. Bu önemlidir, çünkü gerekli tüm Kickstart seçeneklerini kullanmazsanız ve bu nedenle kurulum otomatik olarak başlamazsa, otomatik olarak yapılandırılmamış ekranlara gidebilir, istediğiniz yapılandırmayı yapabilirsiniz. Ardından, devam etmek için `Bitti` düğmesine bastığınızda, en son sağladığınız yapılandırmayı içeren ekran görüntüsü kaydedilecektir.

source: cmdline (optional) - Perform Installation in Command Line Mode
id: baris perintah (opsional) - Lakukan Instalasi dalam Mode Baris Perintah
tr: cmdline (isteğe bağlı) - Kurulumu Komut Satırı Modunda Gerçekleştir

source: Perform the installation in a completely non-interactive command line mode. Any prompts for interaction halts the install. This mode is useful on IBM System{nbsp}z systems with the x3270 terminal.
id: Lakukan penginstalan dalam mode baris perintah yang sepenuhnya non-interaktif. Setiap permintaan untuk interaksi akan menghentikan penginstalan. Mode ini berguna pada sistem IBM System{nbsp}z dengan terminal x3270.
tr: Kurulumu tamamen etkileşimsiz bir komut satırı modunda gerçekleştir. Herhangi bir etkileşim istemi kurulumu durdurur. Bu mod, x3270 terminaline sahip IBM System{nbsp}z sistemlerinde kullanışlıdır.
