Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: This advanced example implements LVM over RAID, as well as the ability to resize various directories for future growth.
id: Contoh lanjutan ini mengimplementasikan LVM melalui RAID, serta kemampuan untuk mengubah ukuran berbagai direktori untuk pertumbuhan di masa mendatang.
tr: Bu gelişmiş örnekte, gelecekteki büyüme için çeşitli dizinleri yeniden boyutlandırma yeteneğinin yanı sıra RAID üzerinde LVM uygulanmaktadır.

source: First, the [command]#clearpart# command is used on drives `hda` and `hdc` to wipe them. The [command]#zerombr# command initializes unused partition tables.
id: Pertama, perintah [command]#clearpart# digunakan pada drive `hda` dan `hdc` untuk menghapusnya. Perintah [command]#zerombr# menginisialisasi tabel partisi yang tidak digunakan.
tr: İlk olarak, onları silmek için `hda` ve `hdc` disklerinde [command]#clearpart# komutu kullanılır. [command]#zerombr# komutu, kullanılmayan bölümlendirme tablolarını başlatır.

source: Then, the two drives are partitioned to prepare them for RAID configuration. Each drive is divided into five partitions, and each drive is partitioned into an identical layout.
id: Kemudian, kedua drive dipartisi untuk mempersiapkan konfigurasi RAID. Setiap drive dibagi menjadi lima partisi, dan setiap drive dipartisi ke dalam tata letak yang identik.
tr: Ardından iki disk, RAID yapılandırmasına hazırlanmaları için bölümlere ayrılır. Her disk beş bölüme ayrılır ve birbirinin aynısı düzende bölümlendirilir.

source: The next part uses these pairs of physical partitions to create a software RAID device with RAID1 level (mirroring). The first four RAID devices are used for `/` (root), `/safe`, `swap` and `/usr`. The fifth, largest pair of partitions is named `pv.01` and will be used in the following part as a physical volume for LVM.
id: Bagian selanjutnya menggunakan pasangan partisi fisik ini untuk membuat perangkat RAID perangkat lunak dengan level RAID1 (mirroring). Empat perangkat RAID pertama digunakan untuk `/` (root), `/safe`, `swap` dan `/usr`. Pasangan partisi terbesar kelima bernama `pv.01` dan akan digunakan di bagian berikut sebagai volume fisik untuk LVM.
tr: Sonraki kısım, RAID1 seviyesine (yansıtma) sahip bir yazılımsal RAID aygıtı oluşturmak için bu fiziksel bölüm çiftlerini kullanır. İlk dört RAID aygıtı `/` (kök), `/safe`, `swap` ve `/usr` için kullanılır. Beşinci, en büyük bölüm çifti `pv.01` olarak adlandırılır ve bir sonraki kısımda LVM için fiziksel bir birim olarak kullanılacaktır.

source: Finally, the last set of commands first creates a volume group named `sysvg` on the `pv.01` physical volume. Then, three logical volumes (`/var`, `/var/freespace` and `/usr/local`) are created and added to the `sysvg` volume group. The `/var` and `/var/freespace` volumes have a set size of 8 GB, and the `/usr/local` volume uses the [option]#--grow# option to fill all remaining available space.
id: Terakhir, kumpulan perintah terakhir pertama-tama membuat grup volume bernama `sysvg` pada volume fisik `pv.01`. Kemudian, tiga volume logis (`/var`, `/var/freespace` dan `/usr/local`) dibuat dan ditambahkan ke grup volume `sysvg`. Volume `/var` dan `/var/freespace` memiliki ukuran yang ditetapkan sebesar 8 GB, dan volume `/usr/local` menggunakan opsi [option]#--grow# untuk mengisi semua sisa ruang yang tersedia.
tr: Son olarak, son komut kümesi ilk olarak `pv.01` fiziksel biriminde `sysvg` adlı bir birim grubu oluşturur. Ardından, üç mantıksal birim (`/var`, `/var/freespace` ve `/usr/local`) oluşturulur ve `sysvg` birim grubuna eklenir. `/var` ve `/var/freespace` birimlerinin 8 GB'lik bir ayarlanmış boyutu vardır ve `/usr/local` birimi, kalan tüm kullanılabilir alanı doldurmak için [option]#--grow# seçeneğini kullanır.

source: The above example uses identifiers `hda` and `hdc` to identify disk drives. You should use unique identifiers, such as a disk labels or an UUIDs, to identify disk drives. See the note in introduction to this appendix.
id: Contoh di atas menggunakan pengenal `hda` dan `hdc` untuk mengidentifikasi drive disk. Anda harus menggunakan pengidentifikasi unik, seperti label disk atau UUID, untuk mengidentifikasi drive disk. Lihat catatan dalam pengantar lampiran ini.
tr: Yukarıdaki örnek, disk sürücülerini tanımlamak için `hda` ve `hdc` tanımlayıcılarını kullanır. Disk sürücülerini tanımlamak için disk etiketleri veya UUID'ler gibi benzersiz tanımlayıcılar kullanmalısınız. Bu ekin giriş bölümündeki nota bakın.

source: Example Pre-installation Script
id: Contoh Skrip Pra-instalasi
tr: Örnek Kurulum Öncesi Betiği

source: The following is an example [command]#%pre# section:
id: Berikut ini adalah contoh bagian [command]#%pre#:
tr: [command]#%pre# bölümünün bir örneği aşağıdadır:

source: Sample %pre Script
id: Contoh % pra Skrip
tr: Örnek %pre Betiği

source: #Write out partition scheme based on whether there are 1 or 2 hard drives if [ $numhd == "2" ] ; then #2 drives echo "#partitioning scheme generated in %pre for 2 drives" > /tmp/part-include echo "clearpart --all" >> /tmp/part-include echo "part /boot --fstype xfs --size 75 --ondisk hda" >> /tmp/part-include echo "part / --fstype xfs --size 1 --grow --ondisk hda" >> /tmp/part-include echo "part swap --recommended --ondisk $drive1" >> /tmp/part-include echo "part /home --fstype xfs --size 1 --grow --ondisk hdb" >> /tmp/part-include else #1 drive echo "#partitioning scheme generated in %pre for 1 drive" > /tmp/part-include echo "clearpart --all" >> /tmp/part-include echo "part /boot --fstype xfs --size 75" >> /tmp/part-include echo "part swap --recommended" >> /tmp/part-include echo "part / --fstype xfs --size 2048" >> /tmp/part-include echo "part /home --fstype xfs --size 2048 --grow" >> /tmp/part-include fi %end
id: #Tulis skema partisi berdasarkan apakah ada 1 atau 2 hard drive jika [ $numhd == "2" ] ; kemudian #2 drive echo "#skema partisi dihasilkan di %pre untuk 2 drive" > /tmp/part-include echo "clearpart --all" >> /tmp/part-include echo "part /boot --fstype xfs --size 75 --ondisk hda" >> /tmp/part-include echo "part / --fstype xfs --size 1 --grow --ondisk hda" >> /tmp/part-include echo "part swap --recommended --ondisk $drive1" >> /tmp/part-include echo "part /home --fstype xfs --size 1 --grow --ondisk hdb" >> /tmp/part-include lain #1 mengemudi echo "#skema partisi dihasilkan di %pre untuk 1 drive" > /tmp/part-include echo "clearpart --all" >> /tmp/part-include echo "part /boot --fstype xfs --size 75" >> /tmp/part-include echo "part swap --recommended" >> /tmp/part-include echo "bagian / --fstype xfs --size 2048" >> /tmp/part-include echo "bagian /home --fstype xfs --size 2048 --grow" >> /tmp/part-include fi %akhir
tr: #1 veya 2 sabit disk olup olmadığına göre bölümlendirme düzenini yaz if [ $numhd == "2" ] ; then #2 disk echo "#%pre bölümünde 2 disk için oluşturulan bölümlendirme düzeni" > /tmp/part-include echo "clearpart --all" >> /tmp/part-include echo "part /boot --fstype xfs --size 75 --ondisk hda" >> /tmp/part-include echo "part / --fstype xfs --size 1 --grow --ondisk hda" >> /tmp/part-include echo "part swap --recommended --ondisk $drive1" >> /tmp/part-include echo "part /home --fstype xfs --size 1 --grow --ondisk hdb" >> /tmp/part-include else #1 disk echo "#%pre bölümünde 1 disk için oluşturulan bölümlendirme düzeni" > /tmp/part-include echo "clearpart --all" >> /tmp/part-include echo "part /boot --fstype xfs --size 75" >> /tmp/part-include echo "part swap --recommended" >> /tmp/part-include echo "part / --fstype xfs --size 2048" >> /tmp/part-include echo "part /home --fstype xfs --size 2048 --grow" >> /tmp/part-include fi %end

source: This script determines the number of hard drives in the system and writes a text file with a different partitioning scheme depending on whether it has one or two drives. Instead of having a set of partitioning commands in the Kickstart file, include the following line:
id: Script ini menentukan jumlah hard drive dalam sistem dan menulis file teks dengan skema partisi yang berbeda tergantung pada apakah ia memiliki satu atau dua drive. Alih-alih memiliki satu set perintah partisi di file Kickstart, sertakan baris berikut:
tr: Bu betik, sistemdeki sabit disk sayısını belirler ve bir veya iki diske sahip olmasına bağlı olarak farklı bir bölümlendirme düzenine sahip bir metin dosyası yazar. Kickstart dosyasında bir dizi bölümlendirme komutunu bulundurmak yerine aşağıdaki satırı ekleyin:

source: The partitioning commands selected in the script will be used.
id: Perintah partisi yang dipilih dalam skrip akan digunakan.
tr: Betikte seçilen bölümlendirme komutları kullanılacaktır.

source: Example Post-installation Script
id: Contoh Skrip Pasca-instalasi
tr: Örnek Kurulum Sonrası Betiği

source: The following is an example [command]#%post# section:
id: Berikut ini adalah contoh bagian [command]#%post#:
tr: [command]#%post# bölümünün bir örneği aşağıdadır:

source: Sample %post Script
id: Contoh Skrip %post
tr: Örnek %post Betiği

source: # Start of the %post section with logging into /root/ks-post.log %post --log=/root/ks-post.log
id: # Mulai dari bagian %post dengan masuk ke /root/ks-post.log %post --log=/root/ks-post.log
tr: # /root/ks-post.log dosyasına günlük kaydı yapan %post bölümünün başlangıcı %post --log=/root/ks-post.log

source: # Mount an NFS share mkdir /mnt/temp mount -o nolock 10.10.0.2:/usr/new-machines /mnt/temp openvt -s -w -- /mnt/temp/runme umount /mnt/temp
id: # Pasang berbagi NFS mkdir /mnt/temp mount -o nolock 10.10.0.2:/usr/new-machines /mnt/temp openvt -s -w -- /mnt/temp/runme umount /mnt/temp
tr: # Bir NFS paylaşımını bağla mkdir /mnt/temp mount -o nolock 10.10.0.2:/usr/new-machines /mnt/temp openvt -s -w -- /mnt/temp/runme umount /mnt/temp

source: # End of the %post section %end
id: # Akhir dari bagian %posting %akhir
tr: # %post bölümünün sonu %end

source: The above example mounts an NFS share and executes a script named `runme` located at `/usr/new-machines/` on the share. Note that NFS file locking is *not* supported while in Kickstart mode, therefore the [option]#-o nolock# option is required.
id: Contoh di atas me-mount share NFS dan mengeksekusi skrip bernama `runme` yang terletak di `/usr/new-machines/` pada share. Perhatikan bahwa penguncian file NFS *tidak* didukung saat dalam mode Kickstart, oleh karena itu opsi [opsi]#-o nolock# diperlukan.
tr: Yukarıdaki örnekte bir NFS paylaşımı bağlanır ve paylaşımdaki `/usr/new-machines/` konumunda bulunan `runme` adlı bir betik çalıştırılır. Kickstart modundayken NFS dosya kilitlemesinin *desteklenmediğini* unutmayın, bu nedenle [option]#-o nolock# seçeneği gereklidir.

source: [option]#--name=#
id: [option]#ifname=#

source: [option]#--baseurl=#
id: [option]#--url=#

source: [option]#--cost=#
id: [option]#--opts=#

source: [command]#bootloader --location=mbr --append="hdd=ide-scsi ide=nodma"#
id: [perintah]#bootloader --location=mbr --append="hdd=ide-scsi ide=nodma"#

source: [command]#bootloader --driveorder=sda,hda#
id: [perintah]#bootloader --driveorder=sda,hda#

source: [command]#clearpart --drives=disk/by-id/scsi-58095BEC5510947BE8C0360F604351918#
id: [perintah]#clearpart --drives=disk/by-id/scsi-58095BEC5510947BE8C0360F604351918#

source: [command]#clearpart --list=sda2,sda3,sdb1#
id: [perintah]#clearpart --list=sda2,sda3,sdb1#

source: [command]#ignoredisk --drives=sda,sdc#
id: [perintah]#ignoredisk --drives=sda,sdc#

source: [option]#--reverse-password=#
id: [opsi]#--reverse-password=#

source: [option]#--poolname=#
id: [opsi]#--poolname=#

source: [command]#partition /home --onpart=hda1#
id: [perintah]#partisi /home --onpart=hda1#

source: [command]#partition pv.1 --onpart=hda2#
id: [perintah]#partisi pv.1 --onpart=hda2#

source: [command]#part / --fstype=xfs --grow --asprimary --size=8192 --ondisk=disk/by-id/scsi-58095BEC5510947BE8C0360F604351918#
id: [perintah]#part / --fstype=xfs --grow --asprimary --size=8192 --ondisk=disk/by-id/scsi-58095BEC5510947BE8C0360F604351918#

source: [option]#--reserved-space=#
id: [opsi]#--reserved-space=#

source: [option]#--wwpn#
id: [opsi]#--wwpn#

source: [option]#--trust=#
id: [opsi]#--kepercayaan=#

source: [command]#firewall --enable --trust=em1 --trust=em2#
id: [perintah]#firewall --aktifkan --trust=em1 --trust=em2#

source: [option]#--service=#
id: [opsi]#--layanan=#

source: [command]#network --bootproto=bootp#
id: [perintah]#jaringan --bootproto=bootp#

source: [command]#network --bootproto=static --ip=10.0.2.15 --netmask=255.255.255.0 --gateway=10.0.2.254 --nameserver=192.168.2.1 --nameserver=192.168.3.1#
id: [perintah]#network --bootproto=static --ip=10.0.2.15 --netmask=255.255.255.0 --gateway=10.0.2.254 --nameserver=192.168.2.1 --nameserver=192.168.3.1#

source: [command]#network --bootproto=dhcp --device=em1#
id: [perintah]#jaringan --bootproto=dhcp --device=em1#

source: [option]#--nameserver=#
id: [opsi]#--nameserver=#

source: [option]#--netmask=#
id: [opsi]#--netmask=#

source: [option]#--hostname=#
id: [opsi]#--namahost=#

source: [option]#--wepkey=#
id: [opsi]#--wepkey=#

source: [option]#--wpakey=#
id: [opsi]#--wpakey=#

source: [option]#--noipv6#
id: [option]#--nolvm#

source: [command]#network --device team0 --activate --bootproto static --ip=10.34.102.222 --netmask=255.255.255.0 --gateway=10.34.102.254 --nameserver=10.34.39.2 --teamslaves="p3p1'{\"prio\": -10, \"sticky\": true}',p3p2'{\"prio\": 100}'" --teamconfig="{\"runner\": {\"name\": \"activebackup\"}}"#
id: Konfigurasi perangkat tim dengan tanda kutip ganda yang merupakan string JSON dengan tanda kutip tunggal dengan tanda kutip ganda diloloskan oleh karakter `\`. Nama ditentukan oleh opsi [option]#--device=# dan slave-nya serta mengkonfigurasinya oleh opsi [option]#--teamslaves=#. Sebagai contoh:

source: [command]#network --device=bridge0 --bridgeslaves=em1#
id: [perintah]#jaringan --device=bridge0 --bridgeslaves=em1#

source: [option]#--xlayouts=#
id: [opsi]#--xlayouts=#

source: [option]#--autoscreenshot#
id: [opsi]#--autoscreenshot#

source: [option]#--enable#
id: [opsi]#--aktifkan#

source: [option]#--reconfig#
id: [opsi]#--konfigurasi ulang#

source: [command]#%pre --log=/mnt/sysimage/root/ks-pre.log#
id: [perintah]#%pre --log=/mnt/sysimage/root/ks-pre.log#

source: [command]#%post --nochroot --log=/mnt/sysimage/root/ks-post.log#
id: [perintah]#%post --nochroot --log=/mnt/sysimage/root/ks-post.log#
