Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: You can change the default behavior of the [command]#%packages# section by using several options. Some options work for the entire package selection, others are used with only specific groups.
id: Anda dapat mengubah perilaku default bagian [command]#%packages# dengan menggunakan beberapa opsi. Beberapa opsi berfungsi untuk seluruh pemilihan paket, yang lain digunakan hanya dengan grup tertentu.
tr: Birkaç seçeneği kullanarak [command]#%packages# bölümünün öntanımlı davranışını değiştirebilirsiniz. Bazı seçenekler tüm paket seçimi için çalışır, diğerleri yalnızca belirli gruplarla kullanılır.

source: Common Package Selection Options
id: Opsi Pemilihan Paket Umum
tr: Ortak Paket Seçimi Seçenekleri

source: The following options are available for the [command]#%packages#. To use an option, append it to the start of the package selection section. For example:
id: Opsi berikut tersedia untuk [command]#%packages#. Untuk menggunakan opsi, tambahkan ke awal bagian pemilihan paket. Sebagai contoh:
tr: [command]#%packages# için aşağıdaki seçenekler kullanılabilir. Bir seçeneği kullanmak için, onu paket seçimi bölümünün başına ekleyin. Örneğin:

source: Do not install the `@Core` group.
id: Jangan instal grup `@Core`.
tr: `@Core` grubunu kurma.

source: Ignore any packages, groups and environments missing in the installation source, instead of halting the installation to ask if the installation should be aborted or continued.
id: Abaikan semua paket, grup, dan lingkungan yang hilang di sumber penginstalan, alih-alih menghentikan penginstalan untuk menanyakan apakah penginstalan harus dibatalkan atau dilanjutkan.
tr: Kurulumun sonlandırılıp sonlandırılmayacağını veya devam ettirilip ettirilmeyeceğini sormak için kurulumu durdurmak yerine kurulum kaynağında eksik olan paketleri, grupları ve ortamları yoksay.

source: Do not install any documentation contained within packages. In most cases, this will exclude any files normally installed in the `/usr/share/doc*` directory, but the specific files to be excluded depend on individual packages.
id: Jangan menginstal dokumentasi apa pun yang ada di dalam paket. Dalam kebanyakan kasus, ini akan mengecualikan file apa pun yang biasanya diinstal di direktori `/usr/share/doc*`, tetapi file tertentu yang akan dikecualikan bergantung pada paket individual.
tr: Paketlerde bulunan hiçbir belgelendirmeyi kurma. Çoğu durumda, bu, normalde `/usr/share/doc*` dizinine kurulan dosyaları hariç tutacaktır, ancak hariç tutulacak belirli dosyalar paketlerin kendisine bağlıdır.

source: Configure the installed system for multilib packages (that is, to allow installing 32-bit packages on a 64-bit system) and install packages specified in this section as such.
id: Konfigurasikan sistem yang diinstal untuk paket multilib (yaitu, untuk mengizinkan penginstalan paket 32-bit pada sistem 64-bit) dan instal paket yang ditentukan di bagian ini.
tr: Kurulu sistemi çoklu kütüphane (multilib) paketleri için yapılandır (yani, 64-bit x86 sistemine 32-bit paketlerin kurulmasına izin vermek için) ve bu bölümde belirtilen paketleri bu şekilde kur.

source: Normally, on a 64-bit system, only packages for this architecture (marked as `x86_64`) and packages for all architectures (marked as `noarch`) would be installed. When you use this option, packages for 32-bit systems (marked as `i686`) will be automatically installed as well, if available.
id: Biasanya, pada sistem 64-bit, hanya paket untuk arsitektur ini (ditandai sebagai `x86_64`) dan paket untuk semua arsitektur (ditandai sebagai `noarch`) yang akan diinstal. Saat Anda menggunakan opsi ini, paket untuk sistem 32-bit (ditandai sebagai `i686`) juga akan diinstal secara otomatis, jika tersedia.
tr: Normalde 64-bit bir sistemde, yalnızca bu mimari için olan paketler (`x86_64` olarak işaretlenir) ve tüm mimariler için olan paketler (`noarch` olarak işaretlenir) kurulur. Bu seçeneği kullandığınızda, varsa 32-bit sistemler için olan paketler de (`i686` olarak işaretlenir) otomatik olarak kurulacaktır.

source: This only applies to packages explicitly specified in the [command]#%packages# section. Packages which are only being installed as dependencies without being specified in the Kickstart file will only be installed in architecture versions in which they are needed, even if they are available for more architectures.
id: Ini hanya berlaku untuk paket yang secara eksplisit ditentukan di bagian [command]#%packages#. Paket yang hanya diinstal sebagai dependensi tanpa ditentukan dalam file Kickstart hanya akan diinstal dalam versi arsitektur yang diperlukan, bahkan jika tersedia untuk lebih banyak arsitektur.
tr: Bu yalnızca [command]#%packages# bölümünde açıkça belirtilen paketler için geçerlidir. Kickstart dosyasında belirtilmeden yalnızca bağımlılık olarak kurulan paketler, daha fazla mimari için kullanılabilir olsalar bile, yalnızca ihtiyaç duyulan mimari sürümlerinde kurulacaktır.

source: Options for Specific Package Groups
id: Opsi untuk Grup Paket Tertentu
tr: Belirli Paket Grupları için Seçenekler

source: The options in this list only apply to a single package group. Instead of using them at the [command]#%packages# command in the Kickstart file, append them to the group name. For example:
id: Opsi dalam daftar ini hanya berlaku untuk satu grup paket. Alih-alih menggunakannya pada perintah [command]#%packages# di file Kickstart, tambahkan mereka ke nama grup. Sebagai contoh:
tr: Bu listedeki seçenekler yalnızca tek bir paket grubu için geçerlidir. Bunları Kickstart dosyasındaki [command]#%packages# komutunda kullanmak yerine grup adına ekleyin. Örneğin:

source: Only install the group's mandatory packages, not the default selections.
id: Hanya instal paket wajib grup, bukan pilihan default.
tr: Öntanımlı seçimleri değil, yalnızca grubun zorunlu paketlerini kur.

source: Install packages marked as optional in the group definition in the `comps.xml` file, in addition to installing the default selections.
id: Instal paket yang ditandai sebagai opsional dalam definisi grup di file `comps.xml`, selain menginstal pilihan default.
tr: Öntanımlı seçimleri kurmaya ek olarak, `comps.xml` dosyasındaki grup tanımında isteğe bağlı olarak işaretlenen paketleri de kur.

source: Note that some package groups, such as `Scientific Support`, do not have any mandatory or default packages specified - only optional packages. In this case the [option]#--optional# option must always be used, otherwise no packages from this group will be installed.
id: Perhatikan bahwa beberapa grup paket, seperti `Scientific Support`, tidak memiliki paket wajib atau default yang ditentukan - hanya paket opsional. Dalam hal ini opsi [option]#--opsional# harus selalu digunakan, jika tidak, tidak ada paket dari grup ini yang akan diinstal.
tr: `Scientific Support` gibi bazı paket gruplarının, belirtilen zorunlu veya öntanımlı paketlere sahip olmadığını, yalnızca isteğe bağlı paketleri olduğunu unutmayın. Bu durumda [option]#--optional# seçeneği her zaman kullanılmalıdır, aksi takdirde bu gruptan hiçbir paket kurulmayacaktır.

source: %pre (optional) - Pre-installation Script
id: %pre (opsional) - Skrip Pra-instalasi
tr: %pre (isteğe bağlı) - Kurulum Öncesi Betiği

source: You can add commands to run on the system immediately after the Kickstart file has been parsed, but before the installation begins. This section must be placed towards the end of the Kickstart file, after the actual Kickstart commands, and must start with [command]#%pre# and end with [command]#%end#. If your Kickstart file also includes a [command]#%post# section, the order in which the [command]#%pre# and [command]#%post# sections are included does not matter.
id: Anda dapat menambahkan perintah untuk dijalankan di sistem segera setelah file Kickstart diurai, tetapi sebelum instalasi dimulai. Bagian ini harus ditempatkan menjelang akhir file Kickstart, setelah perintah Kickstart yang sebenarnya, dan harus dimulai dengan [command]#%pre# dan diakhiri dengan [command]#%end#. Jika file Kickstart Anda juga menyertakan bagian [command]#%post#, urutan di mana bagian [command]#%pre# dan [command]#%post# disertakan tidak masalah.
tr: Kickstart dosyası ayrıştırıldıktan hemen sonra, ancak kurulum başlamadan önce sistemde çalıştırılacak komutlar ekleyebilirsiniz. Bu bölüm Kickstart dosyasının sonuna doğru, gerçek Kickstart komutlarından sonra bulunmalı, [command]#%pre# ile başlamalı ve [command]#%end# ile bitmelidir. Kickstart dosyanız ayrıca bir [command]#%post# bölümü içeriyorsa, [command]#%pre# ve [command]#%post# bölümlerinin eklenme sırası önemli değildir.

source: You can access the network in the [command]#%pre# section. However, the _name service_ has not been configured at this point, so only IP addresses work, not URLs.
id: Anda dapat mengakses jaringan di bagian [command]#%pre#. Namun, _name service_ belum dikonfigurasi pada saat ini, jadi hanya alamat IP yang berfungsi, bukan URL.
tr: [command]#%pre# bölümünde ağa erişebilirsiniz. Ancak _ad hizmeti_ bu noktada yapılandırılmamıştır, bu nedenle yalnızca IP adresleri çalışır, URL'ler çalışmaz.

source: The pre-installation script section of Kickstart *cannot* manage multiple install trees or source media. This information must be included for each created Kickstart file, as the pre-installation script occurs during the second stage of the installation process.
id: Bagian skrip pra-instalasi Kickstart *tidak dapat* mengelola beberapa pohon instalasi atau media sumber. Informasi ini harus disertakan untuk setiap file Kickstart yang dibuat, karena skrip pra-instalasi terjadi selama tahap kedua proses instalasi.
tr: Kickstart kurulum öncesi betiği bölümü birden fazla kurulum ağacını veya kaynak ortamını *yönetemez*. Kurulum öncesi betiği, kurulum işleminin ikinci aşamasında gerçekleştiğinden, oluşturulan her Kickstart dosyası için bu bilgilerin dahil edilmesi gerekir.

source: Unlike the post-installation script, the pre-installation script is not run in the `chroot` environment.
id: Tidak seperti skrip pasca-instalasi, skrip pra-instalasi tidak dijalankan di lingkungan `chroot`.
tr: Kurulum sonrası betiğinin aksine, kurulum öncesi betiği `chroot` ortamında çalıştırılmaz.

source: The following options can be used to change the behavior of pre-installation scripts. To use an option, append it to the [command]#%pre# line at the beginning of the script. For example:
id: Opsi berikut dapat digunakan untuk mengubah perilaku skrip pra-instalasi. Untuk menggunakan opsi, tambahkan ke baris [command]#%pre# di awal skrip. Sebagai contoh:
tr: Kurulum öncesi betiklerinin davranışını değiştirmek için aşağıdaki seçenekler kullanılabilir. Bir seçeneği kullanmak için, onu betiğin başındaki [command]#%pre# satırına ekleyin. Örneğin:

source: [command]#%pre --interpreter=/usr/bin/python# --- Python script omitted -- [command]#%end#
tr: [command]#%pre --interpreter=/usr/bin/python# --- Buraya Python betiği yazılır -- [command]#%end#

source: Allows you to specify a different scripting language, such as Python. Any scripting language available on the system can be used; in most cases, these will be `/usr/bin/sh`, `/usr/bin/bash`, and `/usr/bin/python`.
id: Memungkinkan Anda menentukan bahasa skrip yang berbeda, seperti Python. Bahasa skrip apa pun yang tersedia di sistem dapat digunakan; dalam kebanyakan kasus, ini akan menjadi `/usr/bin/sh`, `/usr/bin/bash`, dan `/usr/bin/python`.
tr: Python gibi farklı bir betik dili belirlemenize olanak tanır. Sistemde bulunan herhangi bir betik dili kullanılabilir; çoğu durumda bunlar `/usr/bin/sh`, `/usr/bin/bash` ve `/usr/bin/python` olacaktır.

source: Display an error and halt the installation if the script fails. The error message will direct you to where the cause of the failure is logged.
id: Tampilkan kesalahan dan hentikan instalasi jika skrip gagal. Pesan kesalahan akan mengarahkan Anda ke tempat penyebab kegagalan dicatat.
tr: Betik başarısız olursa bir hata görüntüle ve kurulumu durdur. Hata mesajı sizi hatanın nedeninin günlüğe kaydedildiği yere yönlendirecektir.

source: Logs the script's output into the specified log file. For example:
id: Log output skrip ke dalam file log yang ditentukan. Sebagai contoh:
tr: Betiğin çıktısını belirtilen günlük dosyasına kaydeder. Örneğin:

source: For an example of a pre-installation script, see xref:sect-kickstart-example-pre-script[Example Pre-installation Script].
tr: Kurulum öncesi betiğinin bir örneği için xref:sect-kickstart-example-pre-script[Örnek Kurulum Öncesi Betiği] bölümüne bakın.

source: %post (optional) - Post-installation Script
id: %post (opsional) - Skrip Pasca-instalasi
tr: %post (isteğe bağlı) - Kurulum Sonrası Betiği

source: You have the option of adding commands to run on the system once the installation is complete, but before the system is rebooted for the first time. This section must be placed towards the end of the Kickstart file, after the actual Kickstart commands, and must start with [command]#%post# and end with [command]#%end#. If your Kickstart file also includes a [command]#%pre# section, the order of the [command]#%pre# and [command]#%post# sections does not matter.
id: Anda memiliki opsi untuk menambahkan perintah untuk dijalankan pada sistem setelah penginstalan selesai, tetapi sebelum sistem di-boot ulang untuk pertama kalinya. Bagian ini harus ditempatkan di akhir file Kickstart, setelah perintah Kickstart yang sebenarnya, dan harus dimulai dengan [command]#%post# dan diakhiri dengan [command]#%end#. Jika file Kickstart Anda juga menyertakan bagian [command]#%pre#, urutan bagian [command]#%pre# dan [command]#%post# tidak menjadi masalah.
tr: Kurulum tamamlandıktan sonra, ancak sistem ilk kez yeniden başlatılmadan önce sistemde çalıştırılacak komutları ekleme seçeneğiniz vardır. Bu bölüm, gerçek Kickstart komutlarından sonra, Kickstart dosyasının sonuna doğru bulunmalı, [command]#%post# ile başlamalı ve [command]#%end# ile bitmelidir. Kickstart dosyanız ayrıca bir [command]#%pre# bölümü içeriyorsa, [command]#%pre# ve [command]#%post# bölümlerinin sırası önemli değildir.

source: This section is useful for functions such as installing additional software or configuring an additional name server. The post-install script is run in a chroot environment, therefore, performing tasks such as copying scripts or RPM packages from the installation media do not work by default. You can change this behavior using the [option]#--nochroot# option as described below.
id: Bagian ini berguna untuk fungsi seperti menginstal perangkat lunak tambahan atau mengkonfigurasi server nama tambahan. Skrip pasca-instal dijalankan di lingkungan chroot, oleh karena itu, melakukan tugas seperti menyalin skrip atau paket RPM dari media instalasi tidak bekerja secara default. Anda dapat mengubah perilaku ini menggunakan opsi [option]#--nochroot# seperti yang dijelaskan di bawah ini.
tr: Bu bölüm, ek yazılımlar kurma veya ek ad sunucusu yapılandırma gibi işlevler için kullanışlıdır. Kurulum sonrası betiği bir chroot ortamında çalıştırılır, bu nedenle betikleri veya RPM paketlerini kurulum ortamından kopyalamak gibi görevlerin gerçekleştirilmesi öntanımlı olarak çalışmaz. Bu davranışı, aşağıda açıklandığı gibi [option]#--nochroot# seçeneğini kullanarak değiştirebilirsiniz.

source: If you configured the network with static IP information, including a name server, you can access the network and resolve IP addresses in the [command]#%post# section. If you configured the network for `DHCP`, the `/etc/resolv.conf` file has not been completed when the installation executes the [command]#%post# section. You can access the network, but you cannot resolve IP addresses. Thus, if you are using `DHCP`, you must specify IP addresses in the [command]#%post# section.
id: Jika Anda mengonfigurasi jaringan dengan informasi IP statis, termasuk server nama, Anda dapat mengakses jaringan dan menyelesaikan alamat IP di bagian [command]#%post#. Jika Anda mengkonfigurasi jaringan untuk `DHCP`, file `/etc/resolv.conf` belum selesai ketika instalasi menjalankan bagian [command]#%post#. Anda dapat mengakses jaringan, tetapi Anda tidak dapat menyelesaikan alamat IP. Jadi, jika Anda menggunakan `DHCP`, Anda harus menentukan alamat IP di bagian [command]#%post#.
tr: Ağı bir ad sunucusu da dahil olmak üzere statik IP bilgileriyle yapılandırdıysanız, [command]#%post# bölümünde ağa erişebilir ve IP adreslerini çözümleyebilirsiniz. Ağı `DHCP` için yapılandırdıysanız, kurulum [command]#%post# bölümünü çalıştırdığında `/etc/resolv.conf` dosyası tamamlanmamıştır. Ağa erişebilirsiniz, ancak IP adreslerini çözümleyemezsiniz. Bu nedenle, `DHCP` kullanıyorsanız, [command]#%post# bölümünde IP adreslerini belirtmelisiniz.

source: The following options can be used to change the behavior of post-installation scripts. To use an option, append it to the [command]#%post# line at the beginning of the script. For example:
id: Opsi berikut dapat digunakan untuk mengubah perilaku skrip pasca-instalasi. Untuk menggunakan opsi, tambahkan ke baris [command]#%post# di awal skrip. Sebagai contoh:
tr: Kurulum sonrası betiklerinin davranışını değiştirmek için aşağıdaki seçenekler kullanılabilir. Bir seçeneği kullanmak için, onu betiğin başındaki [command]#%post# satırına ekleyin. Örneğin:

source: [command]#%post --interpreter=/usr/bin/python# --- Python script omitted -- [command]#%end#
id: [perintah]#%post --interpreter=/usr/bin/python# --- Skrip Python dihilangkan -- [perintah]#%akhir#
tr: [command]#%post --interpreter=/usr/bin/python# --- Buraya Python betiği yazılır -- [command]#%end#

source: Allows you to specify a different scripting language, such as Python. For example:
id: Memungkinkan Anda menentukan bahasa skrip yang berbeda, seperti Python. Sebagai contoh:
tr: Python gibi farklı bir betik dili belirtmenize olanak tanır. Örneğin:

source: Any scripting language available on the system can be used; in most cases, these will be `/usr/bin/sh`, `/usr/bin/bash`, and `/usr/bin/python`.
id: Bahasa skrip apa pun yang tersedia di sistem dapat digunakan; dalam kebanyakan kasus, ini akan menjadi `/usr/bin/sh`, `/usr/bin/bash`, dan `/usr/bin/python`.
tr: Sistemde bulunan herhangi bir betik dili kullanılabilir; çoğu durumda bunlar `/usr/bin/sh`, `/usr/bin/bash` ve `/usr/bin/python` olacaktır.

source: Allows you to specify commands that you would like to run outside of the chroot environment.
id: Memungkinkan Anda menentukan perintah yang ingin Anda jalankan di luar lingkungan chroot.
tr: chroot ortamının dışında çalıştırmak istediğiniz komutları belirtmenize olanak tanır.

source: The following example copies the file `/etc/resolv.conf` to the file system that was just installed.
id: Contoh berikut menyalin file `/etc/resolv.conf` ke sistem file yang baru saja diinstal.
tr: Aşağıdaki örnek, `/etc/resolv.conf` dosyasını yeni kurulan dosya sistemine kopyalar.

source: Logs the script's output into the specified log file. Note that the path of the log file must take into account whether or not you use the [option]#--nochroot# option. For example, without [option]#--nochroot#:
id: Log output skrip ke dalam file log yang ditentukan. Perhatikan bahwa jalur file log harus memperhitungkan apakah Anda menggunakan opsi [option]#--nochroot# atau tidak. Misalnya, tanpa [opsi]#--nochroot#:
tr: Betiğin çıktısını belirtilen günlük dosyasına kaydeder. Günlük dosyasının yolunun, [option]#--nochroot# seçeneğini kullanıp kullanmadığınızı dikkate alması gerektiğini unutmayın. Örneğin, [option]#--nochroot# seçeneği olmadan:

source: with [option]#--nochroot#:
id: dengan [opsi]#--nochroot#:
tr: [option]#--nochroot# seçeneğiyle:

source: For an example of a post-installation script, see xref:sect-kickstart-example-post-script[Example Post-installation Script].
tr: Kurulum sonrası betiğinin bir örneği için xref:sect-kickstart-example-post-script[Örnek Kurulum Sonrası Betiği] bölümüne bakın.

source: Example Kickstart Configurations
id: Contoh Konfigurasi Kickstart
tr: Örnek Kickstart Yapılandırmaları

source: Advanced Partitioning Example
id: Contoh Partisi Lanjutan
tr: Gelişmiş Bölümlendirme Örneği

source: The following is an integrated example showing the [command]#clearpart#, [command]#zerombr#, [command]#part#, [command]#raid#, [command]#volgroup#, and [command]#logvol# Kickstart options in action:
id: Berikut ini adalah contoh terintegrasi yang menunjukkan [command]#clearpart#, [command]#zerombr#, [command]#part#, [command]#raid#, [command]#volgroup#, dan [command]#logvol# Opsi kickstart beraksi:
tr: [command]#clearpart#, [command]#zerombr#, [command]#part#, [command]#raid#, [command]#volgroup# ve [command]#logvol# Kickstart komutlarının uygulamalı bir örneği aşağıdadır:

source: clearpart --drives=hda,hdc zerombr # Raid 1 IDE config part raid.11 --size 1000 --asprimary --ondrive=hda part raid.12 --size 1000 --asprimary --ondrive=hda part raid.13 --size 2000 --asprimary --ondrive=hda part raid.14 --size 8000 --ondrive=hda part raid.15 --size 16384 --grow --ondrive=hda part raid.21 --size 1000 --asprimary --ondrive=hdc part raid.22 --size 1000 --asprimary --ondrive=hdc part raid.23 --size 2000 --asprimary --ondrive=hdc part raid.24 --size 8000 --ondrive=hdc part raid.25 --size 16384 --grow --ondrive=hdc
tr: clearpart --drives=hda,hdc zerombr # Raid 1 IDE yapılandırması part raid.11 --size 1000 --asprimary --ondrive=hda part raid.12 --size 1000 --asprimary --ondrive=hda part raid.13 --size 2000 --asprimary --ondrive=hda part raid.14 --size 8000 --ondrive=hda part raid.15 --size 16384 --grow --ondrive=hda part raid.21 --size 1000 --asprimary --ondrive=hdc part raid.22 --size 1000 --asprimary --ondrive=hdc part raid.23 --size 2000 --asprimary --ondrive=hdc part raid.24 --size 8000 --ondrive=hdc part raid.25 --size 16384 --grow --ondrive=hdc

source: # You can add --spares=x raid / --fstype xfs --device root --level=RAID1 raid.11 raid.21 raid /safe --fstype xfs --device safe --level=RAID1 raid.12 raid.22 raid swap --fstype swap --device swap --level=RAID1 raid.13 raid.23 raid /usr --fstype xfs --device usr --level=RAID1 raid.14 raid.24 raid pv.01 --fstype xfs --device pv.01 --level=RAID1 raid.15 raid.25
tr: # --spares=x seçeneğini ekleyebilirsiniz raid / --fstype xfs --device root --level=RAID1 raid.11 raid.21 raid /safe --fstype xfs --device safe --level=RAID1 raid.12 raid.22 raid swap --fstype swap --device swap --level=RAID1 raid.13 raid.23 raid /usr --fstype xfs --device usr --level=RAID1 raid.14 raid.24 raid pv.01 --fstype xfs --device pv.01 --level=RAID1 raid.15 raid.25

source: # LVM configuration so that we can resize /var and /usr/local later volgroup sysvg pv.01 logvol /var --vgname=sysvg --size=8000 --name=var logvol /var/freespace --vgname=sysvg --size=8000 --name=freespacetouse logvol /usr/local --vgname=sysvg --size=1 --grow --name=usrlocal
id: # Konfigurasi LVM sehingga kita dapat mengubah ukuran /var dan /usr/local nanti volgroup sysvg pv.01 logvol /var --vgname=sysvg --size=8000 --name=var logvol /var/freespace --vgname=sysvg --size=8000 --name=freespacetouse logvol /usr/local --vgname=sysvg --size=1 --grow --name=usrlocal
tr: # /var ve /usr/local bölümlerini daha sonra yeniden boyutlandırabilmemiz için LVM yapılandırması volgroup sysvg pv.01 logvol /var --vgname=sysvg --size=8000 --name=var logvol /var/freespace --vgname=sysvg --size=8000 --name=freespacetouse logvol /usr/local --vgname=sysvg --size=1 --grow --name=usrlocal
