Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: Commands in this section are used to determine your system's storage options and partitioning.
id: Perintah di bagian ini digunakan untuk menentukan opsi penyimpanan dan partisi sistem Anda.
tr: Bu bölümdeki komutlar, sisteminizin depolama seçeneklerini ve bölümlendirmesini belirlemek için kullanılır.

source: autopart (optional) - Automatic Partitioning
id: autopart (opsional) - Partisi Otomatis
tr: autopart (isteğe bağlı) - Otomatik Bölümlendirme

source: Automatically creates partitions: a root (`/`) partition (1 GB or larger), a `swap` partition, and an appropriate `/boot` partition for the architecture. On large enough drives (50{nbsp}GB and larger), this also creates a `/home` partition.
id: Secara otomatis membuat partisi: partisi root (`/`) (1 GB atau lebih besar), partisi `swap`, dan partisi `/boot` yang sesuai untuk arsitektur. Pada drive yang cukup besar (50{nbsp}GB dan lebih besar), ini juga membuat partisi `/home`.
tr: Bölümleri otomatik olarak oluşturur: bir kök (`/`) bölümü (1 GB veya daha büyük), bir `takas` bölümü ve mimari için uygun bir `/boot` bölümü. Yeterince büyük disklerde (50{nbsp}GB ve daha büyük), aynı zamanda bir `/home` bölümü oluşturur.

source: The [command]#autopart# option cannot be used together with the [command]#part/partition#, [command]#raid#, [command]#logvol#, or [command]#volgroup# options in the same Kickstart file.
id: Opsi [command]#autopart# tidak dapat digunakan bersama dengan opsi [command]#part/partition#, [command]#raid#, [command]#logvol#, atau [command]#volgroup# dalam file Kickstart yang sama .
tr: [command]#autopart# seçeneği, aynı Kickstart dosyasında [command]#part/partition#, [command]#raid#, [command]#logvol# veya [command]#volgroup# seçenekleriyle birlikte kullanılamaz .

source: Selects one of the predefined automatic partitioning schemes you want to use. Accepts the following values:
id: Memilih salah satu skema partisi otomatis yang telah ditentukan yang ingin Anda gunakan. Menerima nilai-nilai berikut:
tr: Kullanmak istediğiniz önceden tanımlanmış otomatik bölümlendirme düzenlerinden birini seçer. Aşağıdaki değerleri kabul eder:

source: `lvm`: The LVM partitioning scheme.
id: `lvm`: Skema partisi LVM.
tr: `lvm`: LVM bölümlendirme düzeni.

source: `btrfs`: The Btrfs partitioning scheme.
id: `btrfs`: Skema partisi Btrfs.
tr: `btrfs`: Btrfs bölümlendirme düzeni.

source: `plain`: Regular partitions with no LVM or Btrfs.
id: `plain`: Partisi biasa tanpa LVM atau Btrf.
tr: `plain`: LVM veya Btrfs içermeyen normal bölümler.

source: `thinp`: The LVM Thin Provisioning partitioning scheme.
id: `plain`: Partisi biasa tanpa LVM atau Btrf.
tr: `thinp`: LVM İnce Dağıtım (Thin Provisioning) bölümlendirme düzeni.

source: The created partitioning scheme will follow the recommended scheme described at xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
tr: Oluşturulan bölümlendirme düzeni, xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümünde açıklanan tavsiye edilen düzeni izleyecektir.

source: Specify a supported file system (such as `ext4` or `xfs`) to replace the default when doing automatic partitioning.
id: Tentukan sistem file yang didukung (seperti `ext4` atau `xfs`) untuk menggantikan default saat melakukan partisi otomatis.
tr: Otomatik bölümlendirme yaparken öntanımlı değeri değiştirmek için desteklenen bir dosya sistemi (`ext4` veya `xfs` gibi) belirt.

source: Do not use LVM or Btrfs for automatic partitioning. This option is equal to [option]#--type=plain#.
id: Jangan gunakan LVM atau Btrfs untuk partisi otomatis. Opsi ini sama dengan [opsi]#--type=plain#.
tr: Otomatik bölümlendirme için LVM veya Btrfs kullanma. Bu seçenek, [option]#--type=plain# seçeneğine eşittir.

source: Encrypts all partitions. This is equivalent to checking the `Encrypt partitions` check box on the initial partitioning screen during a manual graphical installation.
id: Mengenkripsi semua partisi. Ini sama dengan mencentang kotak centang `Encrypt partitions` pada layar partisi awal selama instalasi grafis manual.
tr: Tüm bölümleri şifreler. Bu, grafiksel elle kurulum sırasında ilk bölümlendirme ekranındaki `Bölümleri şifrele` onay kutusunun işaretlenmesine eş değerdir.

source: Provides a default system-wide passphrase for all encrypted devices.
id: Menyediakan frasa sandi seluruh sistem default untuk semua perangkat terenkripsi.
tr: Şifrelenen tüm aygıtlar için sistem genelinde öntanımlı bir parola sağlar.

source: [option]#--escrowcert=pass:attributes[{blank}]_URL_of_X.509_certificate_pass:attributes[{blank}]#
tr: [option]#--escrowcert=pass:attributes[{blank}]_X.509_sertifikasının_URLsi_pass:attributes[{blank}]#

source: Stores data encryption keys of all encrypted volumes as files in `/root`, encrypted using the X.509 certificate from the URL specified with _URL_of_X.509_certificate_. The keys are stored as a separate file for each encrypted volume. This option is only meaningful if [option]#--encrypted# is specified.
id: Menyimpan kunci enkripsi data dari semua volume terenkripsi sebagai file di `/root`, dienkripsi menggunakan sertifikat X.509 dari URL yang ditentukan dengan _URL_of_X.509_certificate_. Kunci disimpan sebagai file terpisah untuk setiap volume terenkripsi. Opsi ini hanya bermakna jika [option]#--encrypted# ditentukan.
tr: Tüm şifrelenmiş birimlerin veri şifreleme anahtarlarını, _X.509_sertifikasının_URLsi_ ile belirtilen URL'deki X.509 sertifikası kullanılarak şifrelenmiş dosyalar olarak `/root` dizininde depolar. Anahtarlar, şifrelenen her birim için ayrı bir dosya olarak depolanır. Bu seçenek yalnızca [option]#--encrypted# seçeneği belirtilmişse anlamlıdır.

source: Adds a randomly-generated passphrase to each encrypted volume. Store these passphrases in separate files in `/root`, encrypted using the X.509 certificate specified with [option]#--escrowcert#. This option is only meaningful if [option]#--escrowcert# is specified.
id: Menambahkan frasa sandi yang dibuat secara acak ke setiap volume terenkripsi. Simpan frasa sandi ini dalam file terpisah di `/root`, dienkripsi menggunakan sertifikat X.509 yang ditentukan dengan [option]#--escrowcert#. Opsi ini hanya bermakna jika [opsi]#--escrowcert# ditentukan.
tr: Şifrelenen her birime rastgele oluşturulmuş bir parola ekler. Bu parolaları, [option]#--escrowcert# seçeneğiyle belirtilen X.509 sertifikası kullanılarak şifrelenen ayrı dosyalarda `/root` dizinde depolar. Bu seçenek yalnızca [option]#--escrowcert# seçeneği belirtilmişse anlamlıdır.

source: Specifies which type of encryption will be used if the [application]*Anaconda* default `aes-xts-plain64` is not satisfactory. You must use this option together with the [option]#--encrypted# option; by itself it has no effect. Available types of encryption are listed in the [citetitle]_Fedora Security Guide_, available at link:++https://docs.fedoraproject.org/++[]. Using either `aes-xts-plain64` or `aes-cbc-essiv:sha256` is strongly recommended.
tr: [application]*Anaconda* için öntanımlı olan `aes-xts-plain64` tatmin edici değilse hangi şifreleme türünün kullanılacağını belirtir. Bu seçeneği [option]#--encrypted# seçeneğiyle birlikte kullanmalısınız; tek başına hiçbir etkisi yoktur. Kullanılabilir şifreleme türleri, link:++https://docs.fedoraproject.org/++[] adresindeki [citetitle]_Fedora Güvenlik Kılavuzunda_ listelenmektedir. `aes-xts-plain64` veya `aes-cbc-essiv:sha256` kullanılması şiddetle tavsiye edilir.

source: Specifies which version of LUKS should be used to encrypt the system. Only relevant if [option]#--encrypted# is also specified.
tr: Sistemi şifrelemek için hangi LUKS sürümünün kullanılması gerektiğini belirtir. Yalnızca [option]#--encrypted# seçeneği de belirtilmişse geçerlidir.

source: Sets Password-Based Key Derivation Function (PBKDF) algorithm for the LUKS keyslot. Only relevant if [option]#--encrypted# is also specified. See the `cryptsetup(8)` man page for more information.
tr: LUKS anahtar yuvası için Parola Tabanlı Anahtar Türetme İşlevi (Password-Based Key Derivation Function - PBKDF) algoritmasını ayarlar. Yalnızca [option]#--encrypted# seçeneği de belirtilmişse geçerlidir. Daha fazla bilgi için `cryptsetup(8)` kılavuz sayfasına bakın.

source: Sets the memory cost for PBKDF. Only relevant if [option]#--encrypted# is also specified. See the `cryptsetup(8)` man page for more information.
id: Menetapkan biaya memori untuk PBKDF. Hanya relevan jika [option]#--encrypted# juga ditentukan. Lihat halaman manual `cryptsetup(8)` untuk informasi lebih lanjut.
tr: PBKDF için bellek maliyetini ayarlar. Yalnızca [option]#--encrypted# seçeneği de belirtilmişse geçerlidir. Daha fazla bilgi için `cryptsetup(8)` kılavuz sayfasına bakın.

source: Sets the number of milliseconds to spend with PBKDF passphrase processing. Only relevant if [option]#--encrypted# is also specified. See information about the [option]#--iter-time# option in the `cryptsetup(8)` man page for more information.
id: Menyetel jumlah milidetik untuk dihabiskan dengan pemrosesan frasa sandi PBKDF. Hanya relevan jika [option]#--encrypted# juga ditentukan. Lihat informasi tentang opsi [option]#--iter-time# di halaman manual `cryptsetup(8)` untuk informasi lebih lanjut.
tr: PBKDF parola işlemesiyle harcanacak milisaniye miktarını ayarlar. Yalnızca [option]#--encrypted# seçeneği de belirtilmişse geçerlidir. Daha fazla bilgi için `cryptsetup(8)` kılavuz sayfasındaki [option]#--iter-time# seçeneğiyle ilgili bilgilere bakın.

source: Only one of [option]#--pbkdf-time=# or [option]#--pbkdf-iterations=# can be specified at the same time.
id: Hanya satu dari [option]#--pbkdf-time=# atau [option]#--pbkdf-iteration=# yang dapat ditentukan pada waktu yang sama.
tr: Aynı anda [option]#--pbkdf-time=# veya [option]#--pbkdf-iterations=# seçeneklerinden yalnızca biri belirtilebilir.

source: Sets the number of iterations for passphrase processing directly, and avoids PBKDF benchmark. Only relevant if [option]#--encrypted# is also specified. See information about the [option]#--pbkdf-force-iterations# option in the `cryptsetup(8)` man page for more information.
id: Menetapkan jumlah iterasi untuk pemrosesan frasa sandi secara langsung, dan menghindari benchmark PBKDF. Hanya relevan jika [option]#--encrypted# juga ditentukan. Lihat informasi tentang opsi [option]#--pbkdf-force-iterations# di halaman manual `cryptsetup(8)` untuk informasi selengkapnya.
tr: Parola işleme için yineleme sayısını doğrudan ayarlar ve PBKDF karşılaştırmasını önler. Yalnızca [option]#--encrypted# seçeneği de belirtilmişse geçerlidir. Daha fazla bilgi için `cryptsetup(8)` kılavuz sayfasındaki [option]#--pbkdf-force-iterations# seçeneğiyle ilgili bilgilere bakın.

source: bootloader (required) - Configure Boot Loader
id: bootloader (wajib) - Konfigurasikan Boot Loader
tr: bootloader (gerekli) - Önyükleyiciyi Yapılandır

source: Specifies how the boot loader should be installed.
id: Menentukan bagaimana boot loader harus diinstal.
tr: Önyükleyicinin nasıl kurulacağını belirtir.

source: You should always use a password to protect your boot loader. An unprotected boot loader can allow a potential attacker to modify the system's boot options and gain unauthorized access to the system.
id: Anda harus selalu menggunakan kata sandi untuk melindungi boot loader Anda. Boot loader yang tidak terlindungi dapat memungkinkan penyerang potensial untuk memodifikasi opsi boot sistem dan mendapatkan akses tidak sah ke sistem.
tr: Önyükleyicinizi korumak için her zaman bir parola kullanmalısınız. Korumasız bir önyükleyici, potansiyel bir saldırganın sistemin önyükleme seçeneklerini değiştirmesine ve sisteme yetkisiz erişim elde etmesine izin verebilir.

source: Some systems require a special partition for installing the boot loader. The type and size of this partition depends on whether the disk you are installing the boot loader to uses the _Master Boot Record_ (MBR) or a _GUID Partition Table_ (GPT) schema. For more information, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning-bootloader[Boot Loader Installation].
id: Beberapa sistem memerlukan partisi khusus untuk menginstal boot loader. Jenis dan ukuran partisi ini bergantung pada apakah disk tempat Anda menginstal boot loader menggunakan skema _Master Boot Record_ (MBR) atau _GUID Partition Table_ (GPT). Untuk informasi lebih lanjut, lihat xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning-bootloader[Instalasi Boot Loader].
tr: Bazı sistemler, önyükleyiciyi kurmak için özel bir bölüm gerektirir. Bu bölümün türü ve boyutu, önyükleyiciyi kurduğunuz diskin _Ana Önyükleme Kaydı_ (MBR) mı yoksa _GUID Bölümlendirme Tablosu_ (GPT) düzeni mi kullandığına bağlıdır. Daha fazla bilgi için xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning-bootloader[Önyükleyici Kurulumu] bölümüne bakın.

source: Specifies additional kernel parameters. To specify multiple parameters, separate them with spaces. For example:
id: Menentukan parameter kernel tambahan. Untuk menentukan beberapa parameter, pisahkan dengan spasi. Sebagai contoh:
tr: Ek çekirdek parametrelerini belirtir. Birden çok parametre belirtmek için onları boşluklarla ayırın. Örneğin:

source: The [option]#rhgb# and [option]#quiet# parameters are always used, even if you do not specify them here or do not use the [option]#--append=# command at all.
id: Parameter [option]#rhgb# dan [option]#quiet# selalu digunakan, meskipun Anda tidak menentukannya di sini atau tidak menggunakan perintah [option]#--append=# sama sekali.
tr: [option]#rhgb# ve [option]#quiet# parametreleri, bunları burada belirtmeseniz veya [option]#--append=# komutunu hiç kullanmasanız bile her zaman kullanılır.

source: Specifies which drive the boot loader should be written to, and therefore which drive the computer will boot from. If you use a multipath device as the boot drive, specify only one member of the device.
id: Menentukan ke drive mana boot loader harus ditulis, dan oleh karena itu dari drive mana komputer akan melakukan booting. Jika Anda menggunakan perangkat multipath sebagai drive boot, tentukan hanya satu anggota perangkat.
tr: Önyükleyicinin hangi sürücüye yazılması gerektiğini ve dolayısıyla bilgisayarın hangi sürücüden önyükleneceğini belirtir. Önyükleme sürücüsü olarak çok yollu bir aygıt kullanıyorsanız, aygıtın yalnızca bir üyesini belirtin.

source: The [option]#--boot-drive=# option is currently being ignored in {PRODUCT} installations on IBM System{nbsp}z systems using the [application]*zipl* boot loader. When [application]*zipl* is installed, it determines the boot drive on its own.
id: Opsi [option]#--boot-drive=# saat ini diabaikan dalam instalasi {PRODUCT} pada sistem IBM System{nbsp}z menggunakan [application]*zipl* boot loader. Ketika [application]*zipl* diinstal, ia menentukan drive boot sendiri.
tr: [option]#--boot-drive=# seçeneği, [application]*zipl* önyükleyicisini kullanan IBM System{nbsp}z sistemlerindeki {PRODUCT} kurulumlarında şu anda yok sayılmaktadır. [application]*zipl* kuruluysa, önyükleme sürücüsünü kendisi belirler.

source: *Not* specifying this option will result in the following behavior:
id: *Tidak* menentukan opsi ini akan menghasilkan perilaku berikut:
tr: Bu seçeneğin *belirtilmemesi* aşağıdaki davranışa yol açacaktır:

source: If the [option]#--driveorder=# option was used, [application]*Anaconda* will install the boot loader on the first valid device specified in the drive order.
id: Jika opsi [option]#--driveorder=# digunakan, [application]*Anaconda* akan menginstal boot loader pada perangkat valid pertama yang ditentukan dalam urutan drive.
tr: [option]#--driveorder=# seçeneği kullanılmışsa, [application]*Anaconda* önyükleyiciyi sürücü sıralamasında belirtilen ilk geçerli aygıta kuracaktır.

source: The first present and valid disk containing a `/boot` partition will be used.
id: Disk pertama yang ada dan valid yang berisi partisi `/ boot` akan digunakan.
tr: Bir `/boot` bölümü içeren ilk mevcut ve geçerli disk kullanılacaktır.

source: If none of the above applies, then the first valid storage device from the list of all detected devices will be used to install the boot loader.
id: Jika tidak satu pun di atas berlaku, maka perangkat penyimpanan valid pertama dari daftar semua perangkat yang terdeteksi akan digunakan untuk menginstal boot loader.
tr: Yukarıdakilerin hiçbiri geçerli değilse, algılanan tüm aygıtlar listesinden ilk geçerli depolama aygıtı önyükleyiciyi kurmak için kullanılacaktır.

source: Prevents the installation program from making changes to the existing list of bootable images on UEFI or ISeries/PSeries systems.
id: Mencegah program penginstalan membuat perubahan pada daftar image yang dapat di-boot yang ada pada sistem UEFI atau ISeries/PSeries.
tr: Kurulum programının, UEFI veya ISeries/PSeries sistemlerinde mevcut önyüklenebilir kalıplar listesinde değişiklik yapmasını engeller.

source: Specifies which drive is first in the BIOS boot order. For example:
id: Menentukan drive mana yang pertama dalam urutan boot BIOS. Sebagai contoh:
tr: BIOS önyükleme sırasında hangi sürücünün ilk sırada olduğunu belirtir. Örneğin:

source: Specifies where the boot record is written. Valid values are the following:
id: Menentukan di mana catatan boot ditulis. Nilai yang valid adalah sebagai berikut:
tr: Önyükleme kaydının nereye yazılacağını belirtir. Geçerli değerler şunlardır:

source: `mbr` - The default option. Depends on whether the drive uses the Master Boot Record (MBR) or GUID Partition Table (GPT) scheme:
id: `mbr` - Opsi default. Tergantung pada apakah drive menggunakan skema Master Boot Record (MBR) atau GUID Partition Table (GPT):
tr: `mbr` - Öntanımlı seçenek. Sürücünün Ana Önyükleme Kaydı (MBR) veya GUID Bölümlendirme Tablosu (GPT) düzenini kullanıp kullanmadığına bağlıdır:

source: On a GPT-formatted disk, this option will install stage 1.5 of the boot loader into the BIOS boot partition.
id: Pada disk berformat GPT, opsi ini akan menginstal tahap 1.5 dari boot loader ke dalam partisi boot BIOS.
tr: GPT biçimli bir diskte bu seçenek, önyükleyicinin 1.5 aşamasını BIOS önyükleme bölümüne kuracaktır.

source: On an MBR-formatted disk, stage 1.5 will be installed into the empty space between the MBR and the first partition.
id: Pada disk berformat MBR, tahap 1.5 akan dipasang ke ruang kosong antara MBR dan partisi pertama.
tr: MBR biçimli bir diskte 1.5 aşaması, MBR ile ilk bölüm arasındaki boş alana kurulacaktır.

source: `partition` - Install the boot loader on the first sector of the partition containing the kernel.
id: `partition` - Instal boot loader pada sektor pertama dari partisi yang berisi kernel.
tr: `partition` - Önyükleyiciyi, çekirdeği içeren bölümün ilk sektörüne kur.

source: `none` - Do not install the boot loader.
id: `none` - Jangan menginstal boot loader.
tr: `none` - Önyükleyiciyi kurma.

source: In most cases, this option does not need to be specified.
id: Dalam kebanyakan kasus, opsi ini tidak perlu ditentukan.
tr: Çoğu durumda, bu seçeneğin belirtilmesi gerekmez.

source: If using [application]*GRUB2* as the boot loader, sets the boot loader password to the one specified with this option. This should be used to restrict access to the [application]*GRUB2* shell, where arbitrary kernel options can be passed.
id: Jika menggunakan [application]*GRUB2* sebagai boot loader, setel kata sandi boot loader ke yang ditentukan dengan opsi ini. Ini harus digunakan untuk membatasi akses ke [aplikasi]*GRUB2* shell, di mana opsi kernel arbitrer dapat diteruskan.
tr: Önyükleyici olarak [application]*GRUB2* kullanılıyorsa, önyükleyici parolasını bu seçenekle belirtilen parolaya ayarlar. Bu, isteğe bağlı çekirdek seçeneklerinin iletilebileceği [application]*GRUB2* kabuğuna erişimi kısıtlamak için kullanılmalıdır.

source: If a password is specified, [application]*GRUB2* will also ask for a user name. The user name is always `root`.
id: Jika kata sandi ditentukan, [aplikasi]*GRUB2* juga akan meminta nama pengguna. Nama pengguna selalu `root`.
tr: Bir parola belirtilirse, [application]*GRUB2* ayrıca bir kullanıcı adı isteyecektir. Kullanıcı adı her zaman `root` olacaktır.

source: Normally, when you specify a boot loader password using the [option]#--password=# option, it will be stored in the Kickstart file in plain text. If you want to encrypt the password, use this option and an encrypted password.
id: Biasanya, ketika Anda menentukan kata sandi boot loader menggunakan opsi [option]#--password=#, itu akan disimpan dalam file Kickstart dalam teks biasa. Jika Anda ingin mengenkripsi kata sandi, gunakan opsi ini dan kata sandi terenkripsi.
tr: Normalde, [option]#--password=# seçeneğini kullanarak bir önyükleyici parolası belirttiğinizde bu, Kickstart dosyasında düz metin olarak saklanacaktır. Parolayı şifrelemek istiyorsanız, bu seçeneği ve şifreli bir parola kullanın.

source: To generate an encrypted password, use the [command]#grub2-mkpasswd-pbkdf2# command, enter the password you want to use, and copy the command's output (the hash starting with `grub.pbkdf2`) into the Kickstart file. An example [command]#bootloader# Kickstart entry with an encrypted password will look similar to the following:
id: Untuk membuat kata sandi terenkripsi, gunakan perintah [command]#grub2-mkpasswd-pbkdf2#, masukkan kata sandi yang ingin Anda gunakan, dan salin output perintah (hash dimulai dengan `grub.pbkdf2`) ke dalam file Kickstart. Contoh entri [command]#bootloader# Kickstart dengan kata sandi terenkripsi akan terlihat seperti berikut:
tr: Şifreli bir parola oluşturmak için [command]#grub2-mkpasswd-pbkdf2# komutunu kullanın, kullanmak istediğiniz parolayı girin ve komutun çıktısını (`grub.pbkdf2` ile başlayan değer) Kickstart dosyasına kopyalayın. Şifrelenmiş parolaya sahip örnek bir [command]#bootloader# Kickstart girdisi aşağıdakine benzeyecektir:

source: Specifies the amount of time the boot loader will wait before booting the default option (in seconds).
id: Menentukan berapa lama boot loader akan menunggu sebelum mem-boot opsi default (dalam detik).
tr: Önyükleyicinin öntanımlı seçeneği önyüklemeden önce bekleyeceği süreyi (saniye cinsinden) belirtir.

source: Sets the default boot image in the boot loader configuration.
id: Menetapkan gambar boot default dalam konfigurasi boot loader.
tr: Önyükleyici yapılandırmasında öntanımlı önyükleme kalıbını ayarlar.

source: Use the [application]*extlinux* boot loader instead of [application]*GRUB2*. This option only works on systems supported by [application]*extlinux*.
id: Gunakan [aplikasi]*extlinux* boot loader sebagai ganti [aplikasi]*GRUB2*. Opsi ini hanya berfungsi pada sistem yang didukung oleh [aplikasi]*extlinux*.
tr: [application]*GRUB2* yerine [application]*extlinux* önyükleyicisini kullan. Bu seçenek yalnızca [application]*extlinux* tarafından desteklenen sistemlerde çalışır.

source: Do not attempt to install a boot loader. This option overrides all other boot loader configuration; all other boot loader options will be ignored and no boot loader packages will be installed.
id: Jangan mencoba menginstal boot loader. Opsi ini mengesampingkan semua konfigurasi boot loader lainnya; semua opsi boot loader lainnya akan diabaikan dan tidak ada paket boot loader yang akan diinstal.
tr: Bir önyükleyici kurmaya çalışma. Bu seçenek, diğer tüm önyükleyici yapılandırmasını geçersiz kılar; diğer tüm önyükleyici seçenekleri yok sayılacak ve hiçbir önyükleyici paketi kurulmayacak.
