Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: Install the boot loader configuration and support files, but do not modify the MBR.
id: Instal konfigurasi boot loader dan file dukungan, tetapi jangan ubah MBR.
tr: Önyükleyici yapılandırmasını ve destek dosyalarını kur, ancak MBR'yi değiştirme.

source: btrfs (optional) - Create Btrfs Volume or Subvolume
id: btrfs (opsional) - Buat Volume atau Subvolume Btrfs
tr: btrfs (isteğe bağlı) - Btrfs Birimi ve Alt Birimi Oluştur

source: Create a Btrfs volume or subvolume. For a volume, the syntax is:
id: Buat volume atau subvolume Btrfs. Untuk volume, sintaksnya adalah:
tr: Bir Btrfs birimi veya alt birimi oluştur. Bir birim için söz dizimi şu şekildedir:

source: [command]#btrfs _mntpoint_ --data=pass:attributes[{blank}]_level_ --metadata=pass:attributes[{blank}]_level_ [--label=] _partitions_pass:attributes[{blank}]#
tr: [command]#btrfs _bağlamanoktası_ --data=pass:attributes[{blank}]_seviye_ --metadata=pass:attributes[{blank}]_seviye_ [--label=] _bölümler_pass:attributes[{blank}]#

source: One or more partitions can be specified in _partitions_. When specifying more than one partitions, the entries must be separated by a single space. See xref:exam-kickstart-create-btrfs[Creating Btrfs Volumes and Subvolumes] for a demonstration.
id: Satu atau lebih partisi dapat ditentukan dalam _partitions_. Saat menentukan lebih dari satu partisi, entri harus dipisahkan oleh satu spasi. Lihat xref:exam-kickstart-create-btrfs[Membuat Volume dan Subvolume Btrfs] untuk demonstrasi.
tr: _bölümler_ parametresinde bir veya daha fazla bölüm belirtilebilir. Birden fazla bölüm belirtirken, girdiler tek bir boşlukla ayrılmalıdır. Örnek için xref:exam-kickstart-create-btrfs[Btrfs Birimleri ve Alt Birimleri Oluşturma] bölümüne bakın.

source: For a subvolume, the syntax is:
id: Untuk subvolume, sintaksnya adalah:
tr: Bir alt birim için söz dizimi şu şekildedir:

source: [command]#btrfs _mntpoint_ --subvol --name=pass:attributes[{blank}]_name_ _parent_pass:attributes[{blank}]#
tr: [command]#btrfs _bağlamanoktası_ --subvol --name=pass:attributes[{blank}]_ad_ _üstbirim_pass:attributes[{blank}]#

source: _parent_ should be the identifier of the subvolume's parent volume, _name_ with a name for the subvolume, and _mntpoint_ is the location where the file system is mounted.
id: _parent_ harus menjadi pengidentifikasi volume induk subvolume, _name_ dengan nama untuk subvolume, dan _mntpoint_ adalah lokasi di mana sistem file dipasang.
tr: _üstbirim_ alt birimin üstünün tanımlayıcısı, _ad_ alt birimin adı, ve _bağlamanoktası_ dosya sisteminin bağlanacağı konum olmalıdır.

source: RAID level to use for file system *data* (such as `0`, `1`, or `10`). This parameter is optional, has no meaning for subvolumes, and requires more than one physical disk.
id: Tingkat RAID yang akan digunakan untuk sistem file *data* (seperti `0`, `1`, atau `10`). Parameter ini opsional, tidak memiliki arti untuk subvolume, dan memerlukan lebih dari satu disk fisik.
tr: Dosya sistemi *verileri* için kullanılacak RAID seviyesi (`0`, `1`, veya `10` gibi). Bu parametre isteğe bağlıdır, alt birimler için bir anlamı yoktur ve birden fazla fiziksel disk gerektirir.

source: RAID level to use for file system/volume *metadata* (such as `0`, `1`, or `10`). This parameter is optional, has no meaning for subvolumes, and requires more than one physical disk.
id: Tingkat RAID yang akan digunakan untuk sistem file/volume *metadata* (seperti `0`, `1`, atau `10`). Parameter ini opsional, tidak memiliki arti untuk subvolume, dan memerlukan lebih dari satu disk fisik.
tr: Dosya sistemi/birim *üst verileri* için kullanılacak RAID seviyesi (`0`, `1`, veya `10` gibi). Bu parametre isteğe bağlıdır, alt birimler için bir anlamı yoktur ve birden fazla fiziksel disk gerektirir.

source: Specify a label for the Btrfs file system. If the given label is already in use by another file system, a new label will be created. This option has no meaning for subvolumes.
id: Tentukan label untuk sistem file Btrfs. Jika label yang diberikan sudah digunakan oleh sistem file lain, label baru akan dibuat. Opsi ini tidak memiliki arti untuk subvolume.
tr: Btrfs dosya sistemi için bir etiket belirt. Verilen etiket zaten başka bir dosya sistemi tarafından kullanılıyorsa, yeni bir etiket oluşturulacaktır. Bu seçeneğin alt birimler için bir anlamı yoktur.

source: Create a Btrfs subvolume instead of a volume.
id: Buat subvolume Btrfs dari pada volume.
tr: Birim yerine bir Btrfs alt birimi oluştur.

source: Set a name for a Btrfs subvolume.
id: Tetapkan nama untuk subvolume Btrfs.
tr: Bir Btrfs alt biriminin adını ayarla.

source: [option]#--noformat# or [option]#--useexisting#
id: [option]#--noformat# atau [option]#--useexisting#
tr: [option]#--noformat# veya [option]#--useexisting#

source: Use an existing Btrfs volume (or subvolume) and do not reformat the file system.
id: Gunakan volume Btrfs (atau subvolume) yang ada dan jangan memformat ulang sistem file.
tr: Var olan bir Btrfs birimini (veya alt birimini) kullan ve dosya sistemini yeniden biçimlendirme.

source: Specifies additional parameters to be passed to the program that makes a filesystem on this volume or subvolume. No processing is done on the list of arguments, so they must be supplied in a format that can be passed directly to the mkfs program. This means multiple options should be comma-separated or surrounded by double quotes, depending on the filesystem.
id: Menentukan parameter tambahan yang akan diteruskan ke program yang membuat sistem file pada volume atau subvolume ini. Tidak ada pemrosesan yang dilakukan pada daftar argumen, sehingga argumen harus diberikan dalam format yang dapat diteruskan langsung ke program mkfs. Ini berarti beberapa opsi harus dipisahkan dengan koma atau dikelilingi oleh tanda kutip ganda, tergantung pada sistem file.
tr: Bu birim veya alt birim üzerinde bir dosya sistemi oluşturan programa iletilecek ek parametreleri belirtir. Argüman listesinde herhangi bir işlem yapılmaz, bu nedenle doğrudan mkfs programına iletilebilecek bir biçimde sağlanmaları gerekir. Bu, dosya sistemine bağlı olarak birden çok seçeneğin virgülle ayrılması veya çift tırnak içine alınması gerektiği anlamına gelir.

source: The following example shows how to create a Btrfs volume from member partitions on three disks with subvolumes for `/` and `/home`. The main volume is not mounted or used directly in this example.
id: Contoh berikut menunjukkan cara membuat volume Btrfs dari partisi anggota pada tiga disk dengan subvolume untuk `/` dan `/ home`. Volume utama tidak dipasang atau digunakan secara langsung dalam contoh ini.
tr: Aşağıdaki örnek, üç diskteki üye bölümlerden `/` ve `/home` için alt birimlere sahip bir Btrfs biriminin nasıl oluşturulacağını göstermektedir. Ana birim bu örnekte doğrudan bağlanmamış veya kullanılmamıştır.

source: Creating Btrfs Volumes and Subvolumes
id: Membuat Volume dan Subvolume Btrfs
tr: Btrfs Birimleri ve Alt Birimleri Oluşturma

source: clearpart (optional) - Remove All Existing Partitions
id: clearpart (opsional) - Hapus Semua Partisi yang Ada
tr: clearpart (isteğe bağlı) - Var Olan Tüm Bölümleri Kaldır

source: Removes partitions from the system, prior to creation of new partitions. By default, no partitions are removed.
id: Menghapus partisi dari sistem, sebelum membuat partisi baru. Secara default, tidak ada partisi yang dihapus.
tr: Yeni bölümlerin oluşturulmasından önce sistemden mevcut bölümleri kaldırır. Öntanımlı olarak, hiçbir bölüm kaldırılmaz.

source: If the [command]#clearpart# command is used, then the [command]#part --onpart# command cannot be used on a logical partition.
id: Jika perintah [command]#clearpart# digunakan, maka perintah [command]#part --onpart# tidak dapat digunakan pada partisi logis.
tr: [command]#clearpart# komutu kullanılırsa, mantıksal bir bölümde [command]#part --onpart# komutu kullanılamaz.

source: For a detailed example of partitioning including the [command]#clearpart# command, see xref:sect-kickstart-example-advanced-partitioning[Advanced Partitioning Example].
id: Untuk contoh detail partisi termasuk perintah [command]#clearpart#, lihat xref:sect-kickstart-example-advanced-partitioning[Contoh Partisi Lanjutan].
tr: [command]#clearpart# komutunu içeren ayrıntılı bir bölümlendirme örneği için xref:sect-kickstart-example-advanced-partitioning[Gelişmiş Bölümlendirme Örneği] bölümüne bakın.

source: Erases all partitions from the system.
id: Menghapus semua partisi dari sistem.
tr: Sistemdeki tüm bölümleri siler.

source: This option will erase all disks which can be reached by the installer, including any attached network storage. Use this option with caution.
id: Opsi ini akan menghapus semua disk yang dapat dijangkau oleh penginstal, termasuk penyimpanan jaringan yang terpasang. Gunakan opsi ini dengan hati-hati.
tr: Bu seçenek, bağlı ağ depolama alanları da dahil olmak üzere kurucu tarafından erişilebilen tüm diskleri silecektir. Bu seçeneği dikkatli kullanın.

source: Specifies which drives to clear partitions from. For example, the following clears all the partitions on the first two drives on the primary IDE controller:
id: Menentukan drive mana yang akan digunakan untuk menghapus partisi. Misalnya, berikut ini akan menghapus semua partisi pada dua drive pertama pada pengontrol IDE utama:
tr: Hangi disklerdeki bölümlerin temizleneceğini belirtir. Aşağıdaki örnekte, birincil IDE denetleyicisindeki ilk iki diskteki tüm bölümler temizlenir:

source: To clear a multipath device, use the format `disk/by-id/scsi-_WWID_pass:attributes[{blank}]`, where _WWID_ is the _world-wide identifier_ for the device. For example, to clear a disk with WWID `58095BEC5510947BE8C0360F604351918`, use:
id: Untuk menghapus perangkat multipath, gunakan format `disk/by-id/scsi-_WWID_pass:attributes[{blank}]`, di mana _WWID_ adalah _world-wide identifier_ untuk perangkat. Misalnya, untuk menghapus disk dengan WWID `58095BEC5510947BE8C0360F604351918`, gunakan:
tr: Çok yollu bir aygıtı temizlemek için `disk/by-id/scsi-_WWID_pass:attributes[{blank}]` biçimini kullanın; burada _WWID_, aygıtın _dünya genelinde tanımlayıcısıdır_. Örneğin, `58095BEC5510947BE8C0360F604351918` WWID'sine sahip olan bir diski temizlemek için şunu kullanın:

source: This format is preferable for all multipath devices, but if errors arise, multipath devices that do not use _logical volume management_ (LVM) can also be cleared using the format `disk/by-id/dm-uuid-mpath-_WWID_pass:attributes[{blank}]`, where _WWID_ is the _world-wide identifier_ for the device. For example, to clear a disk with WWID `2416CD96995134CA5D787F00A5AA11017`, use:
id: Format ini lebih disukai untuk semua perangkat multipath, tetapi jika terjadi kesalahan, perangkat multipath yang tidak menggunakan _logical volume management_ (LVM) juga dapat dihapus menggunakan format `disk/by-id/dm-uuid-mpath-_WWID_pass:attributes[ {blank}]`, dengan _WWID_ adalah _pengidentifikasi seluruh dunia_ untuk perangkat. Misalnya, untuk menghapus disk dengan WWID `2416CD96995134CA5D787F00A5AA11017`, gunakan:
tr: Bu biçim tüm çok yollu aygıtlar için tercih edilmektedir, ancak hatalar ortaya çıkarsa, _mantıksal birim yönetimi_ (LVM) kullanmayan çok yollu aygıtlar da `disk/by-id/dm-uuid-mpath-_WWID_pass:attributes[{blank}]` biçimi kullanılarak temizlenebilir, burada _WWID_, aygıtın _dünya genelinde tanımlayıcısıdır_. Örneğin, `2416CD96995134CA5D787F00A5AA11017` WWID'sine sahip olan bir diski temizlemek için şunu kullanın:

source: Never specify multipath devices by device names like `mpatha`. Device names such as this are not specific to a particular disk. The disk named `/dev/mpatha` during installation might not be the one that you expect it to be. Therefore, the [command]#clearpart# command could target the wrong disk.
id: Jangan pernah menentukan perangkat multipath dengan nama perangkat seperti `mpatha`. Nama perangkat seperti ini tidak spesifik untuk disk tertentu. Disk bernama `/dev/mpatha` selama instalasi mungkin bukan yang Anda harapkan. Oleh karena itu, perintah [command]#clearpart# dapat menargetkan disk yang salah.
tr: Çok yollu aygıtları asla `mpatha` gibi aygıt adlarıyla belirtmeyin. Bunun gibi aygıt adları belirli bir diske özgü değildir. Kurulum sırasında `/dev/mpatha` adlı disk beklediğiniz disk olmayabilir. Bu nedenle, [command]#clearpart# komutu yanlış diski hedefleyebilir.

source: Starting with Fedora 25, you can combine multiple ways of specifying storage targets in one command, using the pipe ("`pass:attributes[{blank}]`|`pass:attributes[{blank}]`") as a delimiter. For example:
tr: Fedora 25'ten başlayarak, sınırlayıcı olarak "`pass:attributes[{blank}]`|`pass:attributes[{blank}]`" karakterini kullanarak depolama hedeflerini belirtmenin birden çok yolunu tek bir komutta birleştirebilirsiniz. Örneğin:

source: The above will match either of `sd*`, `hd*`, *or* `vda` *and* `/dev/vdc`. Variants are processed from left to right, and at least one of them must match for the command to succeed.
id: Di atas akan cocok dengan salah satu dari `sd*`, `hd*`, *atau* `vda` *dan* `/dev/vdc`. Varian diproses dari kiri ke kanan, dan setidaknya salah satu dari mereka harus cocok agar perintah berhasil.
tr: Yukarıdaki komut `sd*`, `hd*`, *ya da* `vda` disklerinden biriyle *ve* `/dev/vdc` ile eşleşecektir. Seçenekler soldan sağa işlenir ve komutun başarılı olması için en az birinin eşleşmesi gerekmektedir.

source: Specifies which partitions to clear. This option overrides the [option]#--all# and [option]#--linux# options if used. Can be used across different drives. For example:
id: Menentukan partisi mana yang akan dihapus. Opsi ini mengesampingkan opsi [option]#--all# dan [option]#--linux# jika digunakan. Dapat digunakan di berbagai drive. Sebagai contoh:
tr: Hangi bölümlerin temizleneceğini belirtir. Bu seçenek, kullanılıyorsa [option]#--all# ve [option]#--linux# seçeneklerini geçersiz kılar. Farklı diskler arasında kullanılabilir. Örneğin:

source: Create a set disk label when relabeling a disk.
id: Buat label disk yang ditetapkan saat memberi label ulang pada disk.
tr: Bir diski yeniden etiketlerken ayarlanmış bir disk etiketi oluştur.

source: Erases all Linux partitions.
id: Menghapus semua partisi Linux.
tr: Tüm Linux bölümlerini siler.

source: Do not remove any partitions. This is the default behavior - using this option is the same as not using the [command]#clearpart# command at all.
id: Jangan hapus partisi apa pun. Ini adalah perilaku default - menggunakan opsi ini sama dengan tidak menggunakan perintah [command]#clearpart# sama sekali.
tr: Hiçbir bölümü kaldırma. Bu öntanımlı davranıştır - bu seçeneği kullanmak, [command]#clearpart# komutunu hiç kullanmamakla aynıdır.

source: Using the [command]#clearpart --all# command in a Kickstart file to remove all existing partitions during the installation will cause [application]*Anaconda* to pause and prompt you for a confirmation. If you need to perform the installation automatically with no interaction, add the [command]#zerombr# command to your Kickstart file.
id: Menggunakan perintah [command]#clearpart --all# dalam file Kickstart untuk menghapus semua partisi yang ada selama instalasi akan menyebabkan [aplikasi]*Anaconda* berhenti sejenak dan meminta Anda untuk konfirmasi. Jika Anda perlu melakukan instalasi secara otomatis tanpa interaksi, tambahkan perintah [command]#zerombr# ke file Kickstart Anda.
tr: Kurulum sırasında, var olan tüm bölümleri kaldırmak için bir Kickstart dosyasında [command]#clearpart --all# komutunun kullanılması [application]*Anaconda*'nın duraklamasına ve sizden bir onay istemesine neden olacaktır. Kurulumu hiçbir etkileşim olmadan otomatik olarak gerçekleştirmeniz gerekiyorsa, Kickstart dosyanıza [command]#zerombr# komutunu ekleyin.

source: fcoe (optional) - Configure Fibre Channel Over Ethernet Devices
id: fcoe (opsional) - Konfigurasikan Fibre Channel Over Ethernet Devices
tr: fcoe (optional) - Fibre Channel Over Ethernet Aygıtlarını Yapılandır

source: Specify which FCoE devices should be activated automatically in addition to those discovered by _Enhanced Disk Drive Services_ (EDD).
id: Tentukan perangkat FCoE mana yang harus diaktifkan secara otomatis selain yang ditemukan oleh _Enhanced Disk Drive Services_ (EDD).
tr: _Gelişmiş Disk Sürücü Hizmetleri_ (Enhanced Disk Drive - EDD) tarafından keşfedilenlere ek olarak hangi FCoE aygıtlarının otomatik olarak etkinleştirileceğini belirt.

source: [command]#fcoe --nic=pass:attributes[{blank}]_name_ [--dcp= | --autovlan]#
tr: [command]#fcoe --nic=pass:attributes[{blank}]_ad_ [--dcp= | --autovlan]#

source: [option]#--nic=# (required)
tr: [option]#--nic=# (gerekli)

source: Name of the device to be activated.
id: Nama perangkat yang akan diaktifkan.
tr: Etkinleştirilecek aygıtın adı.

source: Establish _Data Center Bridging_ (DCB) settings.
id: Tetapkan pengaturan _Data Center Bridging_ (DCB).
tr: _Veri Merkezi Köprüleme_ (Data Center Bridging - DCB) ayarlarını yap.

source: Discover VLANs automatically.
id: Temukan VLAN secara otomatis.
tr: VLAN'ları otomatik olarak keşfet.

source: ignoredisk (optional) - Ignore Specified Disks
id: abaikandisk (opsional) - Abaikan Disk yang Ditentukan
tr: ignoredisk (isteğe bağlı) - Belirtilen Diskleri Yok Say

source: Causes the installation program to ignore the specified disks. This is useful if you use autopartition and want to be sure that some disks are ignored. For example, without [command]#ignoredisk#, attempting to deploy on a SAN cluster the Kickstart would fail, as the installation program detects passive paths to the SAN that return no partition table.
id: Menyebabkan program penginstalan mengabaikan disk yang ditentukan. Ini berguna jika Anda menggunakan partisi otomatis dan ingin memastikan bahwa beberapa disk diabaikan. Misalnya, tanpa [command]#ignoredisk#, mencoba menerapkan pada klaster SAN, Kickstart akan gagal, karena program penginstalan mendeteksi jalur pasif ke SAN yang tidak mengembalikan tabel partisi.
tr: Kurulum programının belirtilen diskleri yok saymasına neden olur. Bu, otomatik bölümlendirme kullanıyorsanız ve bazı disklerin yok sayıldığından emin olmak istiyorsanız kullanışlıdır. Örneğin, [command]#ignoredisk# olmadan, hiçbir bölümlendirme tablosu döndürmeyen SAN için pasif yollar kurulum programı tarafından algılandığından, bir SAN kümesi üzerinde kurulum yapılmaya çalışılırsa Kickstart başarısız olacaktır.

source: Specify one or more drives to ignore. Multiple drives can be specified as a comma-separated list. For example:
id: Tentukan satu atau lebih drive untuk diabaikan. Beberapa drive dapat ditentukan sebagai daftar yang dipisahkan koma. Sebagai contoh:
tr: Yok sayılacak bir veya daha fazla disk belirt. Birden çok disk, virgülle ayrılmış bir liste olarak belirtilebilir. Örneğin:

source: To ignore a multipath device that does not use _logical volume management_ (LVM), use the format `disk/by-id/dm-uuid-mpath-_WWID_pass:attributes[{blank}]`, where _WWID_ is the _world-wide identifier_ for the device. For example, to ignore a disk with WWID `2416CD96995134CA5D787F00A5AA11017`, use:
id: Untuk mengabaikan perangkat multipath yang tidak menggunakan _logical volume management_ (LVM), gunakan format `disk/by-id/dm-uuid-mpath-_WWID_pass:attributes[{blank}]`, dengan _WWID_ adalah _world-wide identifier_ untuk perangkat. Misalnya, untuk mengabaikan disk dengan WWID `2416CD96995134CA5D787F00A5AA11017`, gunakan:
tr: _Mantıksal birim yönetimi_ (LVM) kullanmayan çok yollu bir aygıtı yok saymak için, `disk/by-id/dm-uuid-mpath-_WWID_pass:attributes[{blank}]` biçimini kullanın; burada _WWID_, aygıt için _dünya genelinde tanımlayıcıdır_. Örneğin, `2416CD96995134CA5D787F00A5AA11017` WWID'sine sahip olan bir diski yok saymak için şunu kullanın:

source: Multipath devices that use LVM are not assembled until after [application]*Anaconda* has parsed the Kickstart file. Therefore, you cannot specify these devices in the format `dm-uuid-mpath`. Instead, to ignore a multipath device that uses LVM, use the format `disk/by-id/scsi-_WWID_pass:attributes[{blank}]`, where _WWID_ is the _world-wide identifier_ for the device. For example, to ignore a disk with WWID `58095BEC5510947BE8C0360F604351918`, use:
id: Perangkat multipath yang menggunakan LVM tidak dirakit sampai setelah [aplikasi]*Anaconda* menguraikan file Kickstart. Oleh karena itu, Anda tidak dapat menentukan perangkat ini dalam format `dm-uuid-mpath`. Sebagai gantinya, untuk mengabaikan perangkat multipath yang menggunakan LVM, gunakan format `disk/by-id/scsi-_WWID_pass:attributes[{blank}]`, dengan _WWID_ adalah _pengidentifikasi seluruh dunia_ untuk perangkat. Misalnya, untuk mengabaikan disk dengan WWID `58095BEC5510947BE8C0360F604351918`, gunakan:
tr: LVM kullanan çok yollu aygıtlar, [application]*Anaconda* Kickstart dosyasını ayrıştırana kadar bağlanmaz. Bu nedenle, bu aygıtları `dm-uuid-mpath` biçiminde belirtemezsiniz. Bunun yerine, LVM kullanan çok yollu bir aygıtı yok saymak için, `disk/by-id/scsi-_WWID_pass:attributes[{blank}]` biçimini kullanın; burada _WWID_, aygıt için _dünya genelinde tanımlayıcıdır. Örneğin, `58095BEC5510947BE8C0360F604351918` WWID'sine sahip olan bir diski yok saymak için şunu kullanın:

source: Specifies a list of disks for the installation program to use. All other disks are ignored. For example, to use disk `sda` during installation and ignore all other disks:
id: Menentukan daftar disk untuk program instalasi yang akan digunakan. Semua disk lain diabaikan. Misalnya, untuk menggunakan disk `sda` selama instalasi dan mengabaikan semua disk lain:
tr: Kurulum programının kullanacağı disklerin listesini belirtir. Diğer tüm diskler yok sayılır. Örneğin, kurulum sırasında `sda` diskini kullanmak ve diğer tüm diskleri yok saymak için:

source: To include a multipath device that does not use LVM:
id: Untuk menyertakan perangkat multipath yang tidak menggunakan LVM:
tr: LVM kullanmayan bir çok yollu aygıtı dahil etmek için:

source: To include a multipath device that uses LVM:
id: Untuk menyertakan perangkat multipath yang menggunakan LVM:
tr: LVM kullanan bir çok yollu aygıtı dahil etmek için:

source: Allows you to manually navigate the advanced storage screen.
id: Memungkinkan Anda menavigasi layar penyimpanan lanjutan secara manual.
tr: Gelişmiş depolama ekranında elle gezinmenizi sağlar.

source: iscsi (optional) - Configure iSCSI Devices
id: iscsi (opsional) - Konfigurasi Perangkat iSCSI
tr: iscsi (isteğe bağlı) - iSCSI Aygıtlarını Yapılandır

source: Specifies additional iSCSI storage to be attached during installation. If you use the [command]#iscsi# command, you must also assign a name to the iSCSI node, using the [command]#iscsiname# command (see xref:sect-kickstart-commands-iscsiname[iscsiname (optional) - Assign Name to iSCSI Device]. The [command]#iscsiname# command must appear before the [command]#iscsi# command in the Kickstart file.
id: Menentukan penyimpanan iSCSI tambahan yang akan dipasang selama instalasi. Jika Anda menggunakan perintah [command]#iscsi#, Anda juga harus menetapkan nama ke node iSCSI, menggunakan perintah [command]#iscsiname# (lihat xref:sect-kickstart-commands-iscsiname[iscsiname (opsional) - Assign Name to iSCSI Device] Perintah [command]#iscsiname# harus muncul sebelum perintah [command]#iscsi# di file Kickstart.
tr: Kurulum sırasında eklenecek ek iSCSI depolama aygıtlarını belirtir. [command]#iscsi# komutunu kullanırsanız, ayrıca [command]#iscsiname# komutunu kullanarak iSCSI düğümüne bir ad atamanız gerekmektedir (xref:sect-kickstart-commands-iscsiname[iscsiname (isteğe bağlı) - iSCSI Aygıtına Ad Ata] bölümüne bakın). [command]#iscsiname# komutu, Kickstart dosyasında [command]#iscsi# komutundan önce görünmelidir.
