Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: Specify the configuration profile name to use with thin logical volumes. If used, the name will also be included in the metadata for the given logical volume. By default, the available profiles are `default` and `thin-performance` and are defined in the `/etc/lvm/profile` directory. See the `lvm(8)` man page for additional information.
id: Tentukan nama profil konfigurasi yang akan digunakan dengan volume logis tipis. Jika digunakan, nama tersebut juga akan disertakan dalam metadata untuk volume logis yang diberikan. Secara default, profil yang tersedia adalah `default` dan `thin-performance` dan ditentukan dalam direktori `/etc/lvm/profile`. Lihat halaman manual `lvm(8)` untuk informasi tambahan.
tr: İnce mantıksal birimlerle kullanılacak yapılandırma profili adını belirt. Kullanılırsa ad, verilen mantıksal birim için üst verilere de dahil edilecektir. Öntanımlı olarak, `default` ve `thin-performance` kullanılabilir profillerdir ve `/etc/lvm/profile` dizininde tanımlanmaktadır. Ek bilgi için `lvm(8)` kılavuz sayfasına bakın.

source: A comma-separated list of (fast) physical volumes which should be used for LVM cache.
id: Daftar volume fisik (cepat) yang dipisahkan koma yang harus digunakan untuk cache LVM.
tr: LVM önbelleği için kullanılması gereken (hızlı) fiziksel birimlerin virgülle ayrılmış listesi.

source: Requested size of cache attached to the logical volume, in MiB. (Requires the [option]#--cachepvs=# option.)
id: Ukuran cache yang diminta yang dilampirkan ke volume logis, dalam MiB. (Memerlukan opsi [opsi]#--cachepvs=#.)
tr: Mantıksal birime eklenen önbelleğin MiB cinsinden istenen boyutu. ([option]#--cachepvs=# seçeneğini gerektirir.)

source: Mode to be used for LVM cache (either `writeback` or `writethrough`).
id: Mode yang akan digunakan untuk cache LVM (baik `writeback` atau `writethrough`).
tr: LVM önbelleği için kullanılacak mod (`writeback` veya `writethrough`).

source: The [option]#--cachepvs=#, [option]#--cachesize=#, and [option]#--cachemode=# options listed above are used to configure LVM caching. For more information, see the `lvmcache(7)` man page.
id: Opsi [option]#--cachepvs=#, [option]#--cachesize=#, dan [option]#--cachemode=# yang tercantum di atas digunakan untuk mengonfigurasi cache LVM. Untuk informasi lebih lanjut, lihat halaman manual `lvmcache(7)`.
tr: Yukarıda listelenen [option]#--cachepvs=#, [option]#--cachesize=# ve [option]#--cachemode=# seçenekleri LVM önbelleğe alınmasını yapılandırmak için kullanılmaktadır. Daha fazla bilgi için `lvmcache(7)` kılavuz sayfasına bakın.

source: Create one or more partitions first using xref:sect-kickstart-commands-part[part (required) - Create Physical Partition], create the logical volume group (xref:sect-kickstart-commands-volgroup[volgroup (optional) - Create LVM Volume Group]), and then create logical volumes. For example:
id: Buat satu atau lebih partisi terlebih dahulu menggunakan xref:sect-kickstart-commands-part[part (wajib) - Buat Partisi Fisik], buat grup volume logis (xref:sect-kickstart-commands-volgroup[volgroup (opsional) - Buat LVM Grup Volume]), lalu buat volume logis. Sebagai contoh:
tr: Önce xref:sect-kickstart-commands-part[part (gerekli) - Fiziksel Bölüm Oluştur] kullanarak bir veya daha fazla bölüm oluştur, mantıksal birim grubu oluştur (xref:sect-kickstart-commands-volgroup[volgroup (isteğe bağlı) - LVM Birim Grubu Oluştur]) ve ardından mantıksal birimler oluştur. Örneğin:

source: part (required) - Create Physical Partition
tr: part (gerekli) - Fiziksel Bölüm Oluştur

source: Creates a partition on the system.
id: Membuat partisi pada sistem.
tr: Sistemde bir bölüm oluşturur.

source: For a detailed example of [command]#part# in action, see xref:sect-kickstart-example-advanced-partitioning[Advanced Partitioning Example].
id: Untuk contoh rinci tentang [perintah]#bagian# dalam tindakan, lihat xref:sect-kickstart-example-advanced-partitioning[Contoh Partisi Lanjutan].
tr: [command]#part# komutunun ayrıntılı bir örneği için xref:sect-kickstart-example-advanced-partitioning[Gelişmiş Bölümlendirme Örneği] bölümüne bakın.

source: [command]#part|partition _mntpoint_ --name=pass:attributes[{blank}]_name_ --device=pass:attributes[{blank}]_device_ --rule=pass:attributes[{blank}]_rule_ [pass:attributes[{blank}]_options_pass:attributes[{blank}]]#
id: [command]#part|partition _mntpoint_ --name=pass:attributes[{blank}]_name_ --device=pass:attributes[{blank}]_device_ --rule=pass:attributes[{blank}]_rule_ [pass: atribut[{blank}]_options_pass:attributes[{blank}]]#
tr: [command]#part|partition _bağlamanoktası_ --name=pass:attributes[{blank}]_ad_ --device=pass:attributes[{blank}]_aygıt_ --rule=pass:attributes[{blank}]_kural_ [pass:attributes[{blank}]_seçenekler_pass:attributes[{blank}]]#

source: All partitions created are formatted as part of the installation process unless [option]#--noformat# and [option]#--onpart=# are used.
id: Semua partisi yang dibuat diformat sebagai bagian dari proses instalasi kecuali [option]#--noformat# dan [option]#--onpart=# digunakan.
tr: Oluşturulan tüm bölümler, [option]#--noformat# ve [option]#--onpart=# seçenekleri kullanılmadığı sürece kurulum işleminin bir parçası olarak biçimlendirilir.

source: If partitioning fails for any reason, diagnostic messages appear on virtual console 3.
id: Jika partisi gagal karena alasan apa pun, pesan diagnostik muncul di konsol virtual 3.
tr: Bölümlendirme herhangi bir nedenle başarısız olursa, tanılama mesajları 3. sanal konsolda görünecektir.

source: Where the partition is mounted. The value must be of one of the following:
id: Di mana partisi dipasang. Nilai harus salah satu dari berikut ini:
tr: Bölümün bağlanacağı konum. Değer aşağıdakilerden biri olmalıdır:

source: The size assigned will be effective but not precisely calibrated for your system.
id: Ukuran yang ditetapkan akan efektif tetapi tidak dikalibrasi dengan tepat untuk sistem Anda.
tr: Atanan boyut etkili olacaktır ancak sisteminiz için en uygun şekilde ayarlanmış olmayacaktır.

source: The partition is used for software RAID (see [command]#raid#).
id: Partisi ini digunakan untuk RAID perangkat lunak (lihat [perintah]#raid#).
tr: Bölüm, yazılımsal RAID için kullanılır ([command]#raid# komutuna bakın).

source: The partition is used for LVM (see xref:sect-kickstart-commands-part[part (required) - Create Physical Partition]).
tr: Bölüm, LVM için kullanılır (xref:sect-kickstart-commands-part[part (gerekli) - Fiziksel Bölüm Oluştur] bölümüne bakın).

source: The partition will be used for a BIOS Boot partition. A 1 MB BIOS boot partition is necessary on BIOS-based systems using a _GUID Partition Table_ (GPT); the boot loader will be installed into it. It is not necessary on UEFI systems. Also see xref:sect-kickstart-commands-part[part (required) - Create Physical Partition].
tr: Bölüm, bir BIOS Önyükleme bölümü için kullanılacaktır. _GUID Bölümlendirme Tablosu_ (GPT) kullanan BIOS tabanlı sistemlerde 1 MB BIOS önyükleme bölümü gereklidir; önyükleyici bu bölüme kurulacaktır. UEFI sistemlerinde gerekli değildir. Ayrıca xref:sect-kickstart-commands-part[part (gerekli) - Fiziksel Bölüm Oluştur] bölümüne bakın.

source: An EFI System Partition. An EFI partition at least 50 MB in size is necessary on UEFI-based systems; the recommended size is 200 MB. It is not necessary on BIOS systems. Also see xref:sect-kickstart-commands-part[part (required) - Create Physical Partition].
tr: Bir EFI Sistem Bölümü. UEFI tabanlı sistemlerde en az 50 MB boyutunda bir EFI bölümü gereklidir; tavsiye edilen boyut 200 MB'dir. BIOS sistemlerinde gerekli değildir. Ayrıca xref:sect-kickstart-commands-part[part (gerekli) - Fiziksel Bölüm Oluştur] bölümüne bakın.

source: The minimum partition size in megabytes. Specify an integer value here such as `500` (do not include the unit).
id: Ukuran partisi minimum dalam megabyte. Tentukan nilai integer di sini seperti `500` (tidak termasuk unit).
tr: Megabayt cinsinden asgari bölüm boyutu. Burada `500` gibi bir tam sayı değeri belirtin (birimini dahil etmeyin).

source: If the [option]#--size# value is too small, the installation will fail. Set the [option]#--size# value as the minimum amount of space you require. For size recommendations, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
tr: [option]#--size# değeri çok küçükse kurulum başarısız olacaktır. [option]#--size# değerini, ihtiyacınız olan asgari alan miktarı olarak ayarlayın. Boyut tavsiyeleri için xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın.

source: The maximum partition size in megabytes when the partition is set to grow. Specify an integer value here such as `500` (do not include the unit).
id: Ukuran partisi maksimum dalam megabyte ketika partisi diatur untuk tumbuh. Tentukan nilai integer di sini seperti `500` (tidak termasuk unit).
tr: Bölüm büyütülmeye ayarlandığında megabayt cinsinden azami bölüm boyutu. Burada `500` gibi bir tam sayı değeri belirtin (birimini dahil etmeyin).

source: Resize an existing partition. When using this option, specify the new size (in megabytes) using the [option]#--size=# option and the target partition using the [option]#--onpart=# option.
id: Ubah ukuran partisi yang ada. Saat menggunakan opsi ini, tentukan ukuran baru (dalam megabita) menggunakan opsi [option]#--size=# dan partisi target menggunakan opsi [option]#--onpart=#.
tr: Mevcut bir bölümü yeniden boyutlandır. Bu seçeneği kullanırken, [option]#--size=# seçeneğini kullanarak (megabayt cinsinden) yeni boyutu ve [option]#--onpart=# seçeneğini kullanarak hedef bölümü belirtin.

source: Tells the partition to grow to fill available space (if any), or up to the maximum size setting.
id: Memberitahu partisi untuk tumbuh untuk mengisi ruang yang tersedia (jika ada), atau hingga pengaturan ukuran maksimum.
tr: Bölüme, (varsa) kullanılabilir alanı veya azami boyut ayarına kadar dolduracak şekilde büyümesini söyler.

source: If you use [option]#--grow=# without setting [option]#--maxsize=# on a swap partition, [application]*Anaconda* will limit the maximum size of the swap partition. For systems that have less than 2{nbsp}GB of physical memory, the imposed limit is twice the amount of physical memory. For systems with more than 2{nbsp}GB, the imposed limit is the size of physical memory plus 2{nbsp}GB.
id: Jika Anda menggunakan [option]#--grow=# tanpa menyetel [option]#--maxsize=# pada partisi swap, [application]*Anaconda* akan membatasi ukuran maksimum partisi swap. Untuk sistem yang memiliki memori fisik kurang dari 2{nbsp}GB, batas yang diberlakukan adalah dua kali jumlah memori fisik. Untuk sistem dengan lebih dari 2{nbsp}GB, batas yang diberlakukan adalah ukuran memori fisik ditambah 2{nbsp}GB.
tr: Bir takas bölümünde [option]#--maxsize=# ayarlamadan [option]#--grow=# seçeneğini kullanırsanız, [application]*Anaconda* takas bölümünün azami boyutunu sınırlayacaktır. 2{nbsp}GB'tan daha az fiziksel belleğe sahip sistemler için uygulanan sınır, fiziksel bellek miktarının iki katıdır. 2{nbsp}GB'den fazla olan sistemler için uygulanan sınır, fiziksel bellek boyutu artı 2{nbsp}GB'tır.

source: Specifies that the partition should not be formatted, for use with the [option]#--onpart# command.
id: Menentukan bahwa partisi tidak boleh diformat, untuk digunakan dengan perintah [option]#--onpart#.
tr: [option]#--onpart# komutuyla kullanım için bölümün biçimlendirilmemesi gerektiğini belirtir.

source: [option]#--onpart=# or [option]#--usepart=#
tr: [option]#--onpart=# veya [option]#--usepart=#

source: Specifies the device on which to place the partition. For example:
id: Menentukan perangkat untuk menempatkan partisi. Sebagai contoh:
tr: Bölümün üzerinde olacağı aygıtı belirtir. Örneğin:

source: The above puts `/home` on `/dev/hda1`.
id: Di atas menempatkan `/home` di `/dev/hda1`.
tr: Yukarıdaki komut, `/home` bölümünü `/dev/hda1` aygıtı üzerine koyar.

source: These options can also add a partition to a logical volume. For example:
id: Opsi ini juga dapat menambahkan partisi ke volume logis. Sebagai contoh:
tr: Bu seçenekler mantıksal bir birime de bölüm ekleyebilir. Örneğin:

source: The device must already exist on the system; the [option]#--onpart# option will not create it.
id: Perangkat harus sudah ada di sistem; opsi [option]#--onpart# tidak akan membuatnya.
tr: Aygıt sistemde zaten mevcut olmalıdır; [option]#--onpart# seçeneği onu oluşturmayacaktır.

source: [option]#--ondisk=# or [option]#--ondrive=#
tr: [option]#--ondisk=# veya [option]#--ondrive=#

source: Forces the partition to be created on a particular disk. For example, [option]#--ondisk=sdb# puts the partition on the second SCSI disk on the system.
id: Memaksa partisi dibuat pada disk tertentu. Misalnya, [option]#--ondisk=sdb# menempatkan partisi pada disk SCSI kedua pada sistem.
tr: Bölümün belirli bir disk üzerinde oluşturulmasını zorlar. Örneğin, [option]#--ondisk=sdb#, bölümü sistemdeki ikinci SCSI diskinin üzerine koyar.

source: To specify a multipath device that does not use _logical volume management_ (LVM), use the format `disk/by-id/dm-uuid-mpath-_WWID_pass:attributes[{blank}]`, where _WWID_ is the _world-wide identifier_ for the device. For example, to specify a disk with WWID `2416CD96995134CA5D787F00A5AA11017`, use:
id: Untuk menentukan perangkat multipath yang tidak menggunakan _logical volume management_ (LVM), gunakan format `disk/by-id/dm-uuid-mpath-_WWID_pass:attributes[{blank}]`, dengan _WWID_ adalah _world-wide identifier_ untuk perangkat. Misalnya, untuk menentukan disk dengan WWID `2416CD96995134CA5D787F00A5AA11017`, gunakan:
tr: _Mantıksal birim yönetimi_ (LVM) kullanmayan çok yollu bir aygıtı belirtmek için, `disk/by-id/dm-uuid-mpath-_WWID_pass:attributes[{blank}]` biçimini kullanın; burada _WWID_, aygıt için _dünya genelinde tanımlayıcıdır_. Örneğin, `2416CD96995134CA5D787F00A5AA11017` WWID'sine sahip olan bir diski belirtmek için şunu kullanın:

source: Multipath devices that use LVM are not assembled until after [application]*Anaconda* has parsed the Kickstart file. Therefore, you cannot specify these devices in the format `dm-uuid-mpath`. Instead, to specify a multipath device that uses LVM, use the format `disk/by-id/scsi-_WWID_pass:attributes[{blank}]`, where _WWID_ is the _world-wide identifier_ for the device. For example, to specify a disk with WWID `58095BEC5510947BE8C0360F604351918`, use:
id: Perangkat multipath yang menggunakan LVM tidak dirakit sampai setelah [aplikasi]*Anaconda* menguraikan file Kickstart. Oleh karena itu, Anda tidak dapat menentukan perangkat ini dalam format `dm-uuid-mpath`. Sebagai gantinya, untuk menentukan perangkat multipath yang menggunakan LVM, gunakan format `disk/by-id/scsi-_WWID_pass:attributes[{blank}]`, di mana _WWID_ adalah _world-wide identifier_ untuk perangkat. Misalnya, untuk menentukan disk dengan WWID `58095BEC5510947BE8C0360F604351918`, gunakan:
tr: LVM kullanan çok yollu aygıtlar, [application]*Anaconda* Kickstart dosyasını ayrıştırana kadar bağlanmaz. Bu nedenle, bu aygıtları `dm-uuid-mpath` biçiminde belirtemezsiniz. Bunun yerine, LVM kullanan çok yollu bir aygıtı belirtmek için, `disk/by-id/scsi-_WWID_pass:attributes[{blank}]` biçimini kullanın; burada _WWID_, aygıt için _dünya genelinde tanımlayıcıdır. Örneğin, `58095BEC5510947BE8C0360F604351918` WWID'sine sahip olan bir diski belirtmek için şunu kullanın:

source: Forces the partition to be allocated as a *primary* partition. If the partition cannot be allocated as primary (usually due to too many primary partitions being already allocated), the partitioning process will fail. This option only makes sense when the disk uses a Master Boot Record (MBR); for GUID Partition Table (GPT)-labeled disks this option has no meaning. For information about primary (and extended) partitions, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
tr: Bölümü bir *birincil* bölüm olarak ayrılmaya zorlar. Bölüm birincil olarak ayrılamazsa (genellikle çok fazla birincil bölümün zaten ayrılmış olması nedeniyle), bölümleme işlemi başarısız olacaktır. Bu seçenek yalnızca disk bir Ana Önyükleme Kaydı (MBR) kullandığında anlamlıdır; GUID Bölümlendirme Tablosu (GPT) etiketli diskler için bu seçeneğin bir anlamı yoktur. Birincil (ve genişletilmiş) bölümler hakkında bilgi için xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın.

source: Specifies a _usage type_ to be passed to the program that makes a filesystem on this partition. A usage type defines a variety of tuning parameters to be used when making a filesystem. For this option to work, the filesystem must support the concept of usage types and there must be a configuration file that lists valid types. For `ext2`, `ext3`, `ext4`, this configuration file is `/etc/mke2fs.conf`.
id: Menentukan _usage type_ yang akan diteruskan ke program yang membuat sistem file pada partisi ini. Jenis penggunaan mendefinisikan berbagai parameter penyetelan yang akan digunakan saat membuat sistem file. Agar opsi ini berfungsi, sistem file harus mendukung konsep tipe penggunaan dan harus ada file konfigurasi yang mencantumkan tipe yang valid. Untuk `ext2`, `ext3`, `ext4`, file konfigurasi ini adalah `/etc/mke2fs.conf`.
tr: Bu bölümde bir dosya sistemi oluşturan programa geçirilecek bir _kullanım türü_ belirtir. Kullanım türü, bir dosya sistemi oluştururken kullanılacak çeşitli ayar parametrelerini tanımlar. Bu seçeneğin çalışması için dosya sisteminin kullanım türleri kavramını desteklemesi ve geçerli türleri listeleyen bir yapılandırma dosyası olması gerekir. `ext2`, `ext3`, `ext4` için bu `/etc/mke2fs.conf` yapılandırma dosyasıdır.

source: Sets the file system type for the partition. Valid values are `xfs`, `ext2`, `ext3`, `ext4`, `swap`, `vfat`, `efi` and `biosboot`. For information about supported file systems, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types].
tr: Bölüm için dosya sistemi türünü ayarlar. Geçerli değerler şunlardır: `xfs`, `ext2`, `ext3`, `ext4`, `swap`, `vfat`, `efi` ve `biosboot`. Desteklenen dosya sistemleri hakkında bilgi için xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Aygıt, Dosya Sistemi ve RAID Türleri] bölümüne bakın.

source: Specifies additional parameters to be passed to the program that makes a filesystem on this partition. No processing is done on the list of arguments, so they must be supplied in a format that can be passed directly to the mkfs program. This means multiple options should be comma-separated or surrounded by double quotes, depending on the filesystem.
id: Menentukan parameter tambahan yang akan diteruskan ke program yang membuat sistem file pada partisi ini. Tidak ada pemrosesan yang dilakukan pada daftar argumen, sehingga argumen harus diberikan dalam format yang dapat diteruskan langsung ke program mkfs. Ini berarti beberapa opsi harus dipisahkan dengan koma atau dikelilingi oleh tanda kutip ganda, tergantung pada sistem file.
tr: Bu bölüm üzerinde bir dosya sistemi oluşturan programa iletilecek ek parametreleri belirtir. Argüman listesinde herhangi bir işlem yapılmaz, bu nedenle doğrudan mkfs programına iletilebilecek bir biçimde sağlanmaları gerekir. Bu, dosya sistemine bağlı olarak birden çok seçeneğin virgülle ayrılması veya çift tırnak içine alınması gerektiği anlamına gelir.

source: Assign a label to an individual partition.
id: Tetapkan label ke partisi individual.
tr: Tek bir bölüme bir etiket ata.

source: Determine the size of the partition automatically. For details about the recommended scheme, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
tr: Bölümün boyutunu otomatik olarak belirle. Tavsiye edilen düzen hakkında ayrıntılar için xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın.

source: Forces the partition to be created on a particular disk as discovered by the BIOS.
id: Memaksa partisi dibuat pada disk tertentu seperti yang ditemukan oleh BIOS.
tr: Bölümü, BIOS tarafından keşfedildiği gibi belirli bir diskte oluşturulmaya zorlar.

source: Specifies that this partition should be encrypted, using the passphrase provided in the [option]#--passphrase# option. If you do not specify a passphrase, [application]*Anaconda* uses the default, system-wide passphrase set with the [command]#autopart --passphrase# command, or stops the installation and prompts you to provide a passphrase if no default is set.
id: Menentukan bahwa partisi ini harus dienkripsi, menggunakan frasa sandi yang disediakan dalam opsi [option]#--passphrase#. Jika Anda tidak menentukan frasa sandi, [application]*Anaconda* menggunakan default, frasa sandi seluruh sistem yang disetel dengan perintah [command]#autopart --passphrase#, atau menghentikan penginstalan dan meminta Anda untuk memberikan frasa sandi jika tidak ada default diatur.
tr: Bu bölümün, [option]#--passphrase=# seçeneğinde sağlanan parola kullanılarak şifrelenmesi gerektiğini belirtir. Bir parola belirtmezseniz, [application]*Anaconda* [command]#autopart --passphrase# komutuyla ayarlanan öntanımlı, sistem genelindeki parolayı kullanacak veya herhangi bir öntanımlı değer ayarlanmadıysa kurulumu durduracak ve sizden bir parola sağlamanızı isteyecektir.

source: Specifies the passphrase to use when encrypting this partition. You must use this option together with the [option]#--encrypted# option; by itself it has no effect.
id: Menentukan frasa sandi yang akan digunakan saat mengenkripsi partisi ini. Anda harus menggunakan opsi ini bersama dengan opsi [option]#--encrypted#; dengan sendirinya tidak berpengaruh.
tr: Bu bölümü şifrelerken kullanılacak parolayı belirtir. Bu seçeneği [option]#--encrypted# seçeneğiyle birlikte kullanmalısınız; tek başına bir etkisi yoktur.

source: Add a randomly-generated passphrase to each encrypted partition. Store these passphrases in separate files in `/root`, encrypted using the X.509 certificate specified with [option]#--escrowcert#. This option is only meaningful if [option]#--escrowcert# is specified.
id: Tambahkan frasa sandi yang dibuat secara acak ke setiap partisi terenkripsi. Simpan frasa sandi ini dalam file terpisah di `/root`, dienkripsi menggunakan sertifikat X.509 yang ditentukan dengan [option]#--escrowcert#. Opsi ini hanya bermakna jika [opsi]#--escrowcert# ditentukan.
tr: Şifrelenen her bölüme rastgele oluşturulmuş bir parola ekle. Bu parolaları, [option]#--escrowcert# seçeneğiyle belirtilen X.509 sertifikası kullanılarak şifrelenen ayrı dosyalarda `/root` dizinde depola. Bu seçenek yalnızca [option]#--escrowcert# seçeneği belirtilmişse anlamlıdır.

source: raid (optional) - Create Software RAID
id: raid (opsional) - Buat RAID Perangkat Lunak
tr: raid (isteğe bağlı) - Yazılımsal RAID Oluştur

source: Assembles a software RAID device. This command is of the form:
id: Merakit perangkat perangkat lunak RAID. Perintah ini berbentuk:
tr: Bir yazılımsal RAID aygıtı oluşturur. Bu komutun kullanımı aşağıdaki şekildedir:

source: raid mntpoint --level=level --device=mddevice partitions*
id: serangan mntpoint --level=level --device=mddevice partisi*
tr: raid bağlamanoktası --level=seviye --device=mdaygıtı bölümler*
