Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: Kickstart Syntax Reference
id: Referensi Sintaks Kickstart
tr: Kickstart Söz Dizimi Referansı

source: This appendix describes commands and options available in Kickstart installations. For general information about Kickstart, see xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart].
id: Lampiran ini menjelaskan perintah dan opsi yang tersedia dalam instalasi KickStart. Untuk informasi umum tentang KickStart, lihat xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Mengotomatiskan instalasi dengan KickStart].
tr: Bu ek, Kickstart kurulumlarında kullanılabilen komutları ve seçenekleri açıklamaktadır. Kickstart hakkında genel bilgi için xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Kickstart ile Kurulumu Otomatikleştirme] bölümüne bakın.

source: Device names are not guaranteed to be consistent across reboots, which can complicate usage in Kickstart scripts. When a Kickstart option calls for a device node name (such as `sda`), you can instead use any item from `/dev/disk`. For example, instead of:
id: Nama perangkat tidak dijamin konsisten di seluruh reboot, yang dapat memperumit penggunaan dalam skrip Kickstart. Saat opsi Kickstart memanggil nama node perangkat (seperti `sda`), Anda dapat menggunakan item apa pun dari `/dev/disk`. Misalnya, alih-alih:
tr: Aygıt adlarının yeniden başlatmalar arasında tutarlı olması garanti edilmez, bu da Kickstart betiklerinde kullanımlarını karmaşıklaştırabilir. Bir Kickstart seçeneği bir aygıt düğümü adını (örneğin `sda`) gerektirdiğinde, bunun yerine `/dev/disk` altındaki herhangi bir ögeyi kullanabilirsiniz. Örneğin, şunun yerine:

source: You could use an entry similar to one of the following:
id: Anda dapat menggunakan entri yang mirip dengan salah satu dari berikut ini:
tr: Aşağıdakilerden birine benzer bir girdi kullanabilirsiniz:

source: This provides a consistent way to refer to disks that is more meaningful than just `sda`. This is especially useful in large storage environments.
id: Ini memberikan cara yang konsisten untuk merujuk ke disk yang lebih bermakna daripada hanya `sda`. Ini sangat berguna di lingkungan penyimpanan yang besar.
tr: Bu, diskleri belirtmek için tutarlı bir yol sağlar ve yalnızca `sda` kullanmaktan daha anlamlıdır. Bu, özellikle büyük depolama ortamlarında kullanışlıdır.

source: While the general principles of Kickstart installations tend to stay the same, the commands and options can change between major releases. You can use the [command]#ksverdiff# command to display the differences between two versions of the Kickstart syntax. This is useful when updating an existing Kickstart file to be used with a new release. To display a list of changes in syntax between Fedora{nbsp}{PREVVER} and {PRODVER}, use the following command:
id: Sementara prinsip umum instalasi Kickstart cenderung tetap sama, perintah dan opsi dapat berubah di antara rilis utama. Anda dapat menggunakan perintah [command]#ksverdiff# untuk menampilkan perbedaan antara dua versi sintaks Kickstart. Ini berguna saat memperbarui file Kickstart yang ada untuk digunakan dengan rilis baru. Untuk menampilkan daftar perubahan sintaks antara Fedora{nbsp}{PREVVER} dan {PRODVER}, gunakan perintah berikut:
tr: Kickstart kurulumlarının genel ilkeleri çoğunlukla aynı kalırken, komutlar ve seçenekler ana sürümler arasında değişebilir. Kickstart söz diziminin iki sürümü arasındaki farkları görüntülemek için [command]#ksverdiff# komutunu kullanabilirsiniz. Bu, yeni bir sürümle kullanılmak üzere mevcut bir Kickstart dosyasını güncellerken faydalıdır. Fedora{nbsp}{PREVVER} ve {PRODVER} arasındaki söz dizimi değişikliklerinin bir listesini görüntülemek için aşağıdaki komutu kullanın:

source: The [option]#-f# option specifies the release to start the comparison with, and the [option]#-t# option to specify the release to end with. For additional information, see the `ksverdiff(1)` man page. Also note that you cannot use this to display changes in a release that is newer than your system - the version of [package]*pykickstart* on Fedora{nbsp}{PREVVER} cannot display changes in Fedora{nbsp}{PRODVER}.
tr: [option]#-f# seçeneği karşılaştırmanın başlatılacağı sürümü, [option]#-t# seçeneği sonlandırılacağı sürümü belirtir. Ek bilgi için `ksverdiff(1)` kılavuz sayfasına bakın. Ayrıca bunu sisteminizden daha yeni bir sürümdeki değişiklikleri görüntülemek için kullanamayacağınızı unutmayın - Fedora{nbsp}{PREVVER} üzerindeki [package]*pykickstart* sürümü Fedora{nbsp}{PRODVER} için olan değişiklikleri görüntüleyemez.

source: Additionally, you can review the [citetitle]_Fedora{nbsp}{PRODVER} Release Notes_, available at link:++https://docs.fedoraproject.org/++[], for a list of changes.
tr: Ek olarak, değişikliklerin bir listesi için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_Fedora{nbsp}{PRODVER} Sürüm Notlarını_ inceleyebilirsiniz.

source: In the following sections, if an option is followed by an equals mark (`=`), a value must be specified after it. In the example commands, options in square brackets (`[ ]`) are optional arguments for the command.
id: Di bagian berikut, jika opsi diikuti dengan tanda sama dengan (`=`), nilai harus ditentukan setelahnya. Dalam contoh perintah, opsi dalam tanda kurung siku (`[ ]`) adalah argumen opsional untuk perintah tersebut.
tr: Aşağıdaki bölümlerde, bir seçeneğin ardından eşittir işareti (`=`) geliyorsa, ondan sonra bir değer belirtilmelidir. Örnek komutlarda, köşeli parantez (`[ ]`) içindeki seçenekler komut için isteğe bağlı argümanlardır.

source: Installation Methods and Sources
id: Metode dan Sumber Instalasi
tr: Kurulum Yöntemleri ve Kaynakları

source: The following commands control the way Fedora will be installed.
id: Perintah berikut mengontrol bagaimana Fedora akan diinstal.
tr: Aşağıdaki komutlar Fedora'nın nasıl kurulacağını denetler.

source: device (optional) - Install Extra Device Drivers
id: perangkat (opsional) - Instal Driver Perangkat Ekstra
tr: device (isteğe bağlı) - Ek Aygıt Sürücüleri Kur

source: On most PCI systems, the installation program will automatically detect Ethernet and SCSI cards. However, on older systems and some PCI systems, Kickstart requires a hint to find the proper devices. The [command]#device# command, which tells the installation program to install extra modules, uses the following format:
id: Pada kebanyakan sistem PCI, program instalasi akan secara otomatis mendeteksi kartu Ethernet dan SCSI. Namun, pada sistem yang lebih lama dan beberapa sistem PCI, Kickstart memerlukan petunjuk untuk menemukan perangkat yang tepat. Perintah [command]#device#, yang memberitahu program instalasi untuk menginstal modul tambahan, menggunakan format berikut:
tr: Çoğu PCI sisteminde, kurulum programı Ethernet ve SCSI kartlarını otomatik olarak algılayacaktır. Ancak, daha eski sistemlerde ve bazı PCI sistemlerinde Kickstart, uygun aygıtları bulmak için bir ipucu gerektirir. Kurulum programına ek modüller kurmasını söyleyen [command]#device# komutu aşağıdaki biçimi kullanmaktadır:

source: [command]#device _moduleName_ [--opts=]#
tr: [command]#device _modülAdı_ [--opts=]#

source: Replace _moduleName_ with the name of the kernel module which should be installed.
id: Ganti _moduleName_ dengan nama modul kernel yang harus diinstal.
tr: _modülAdı_ parametresini kurulması gereken çekirdek modülünün adıyla değiştirin.

source: Options to pass to the installed kernel module. For example:
id: Opsi untuk diteruskan ke modul kernel yang diinstal. Sebagai contoh:
tr: Kurulan çekirdek modülüne iletilecek seçenekler. Örneğin:

source: driverdisk (optional) - Use a Driver Disk
id: driverdisk (opsional) - Gunakan Disk Driver
tr: driverdisk (isteğe bağlı) - Bir Sürücü Diski Kullan

source: Driver disks can be used during Kickstart installations to provide additional drivers not included by default. You must copy the driver disks's contents to the root directory of a partition on the system's hard drive. Then, you must use the [command]#driverdisk# command to specify that the installation program should look for a driver disk and its location.
id: Disk driver dapat digunakan selama instalasi Kickstart untuk menyediakan driver tambahan yang tidak disertakan secara default. Anda harus menyalin konten disk driver ke direktori root partisi pada hard drive sistem. Kemudian, Anda harus menggunakan perintah [command]#driverdisk# untuk menentukan bahwa program penginstalan harus mencari disk driver dan lokasinya.
tr: Sürücü diskleri, öntanımlı olarak dahil edilmeyen ek sürücüleri sağlamak için Kickstart kurulumları sırasında kullanılabilir. Sürücü disklerinin içeriğini, sistemin sabit diskindeki bir bölümün kök dizinine kopyalamanız gerekir. Ardından, kurulum programının bir sürücü diski araması gerektiğini ve konumunu belirtmek için [command]#driverdisk# komutunu kullanmanız gerekir.

source: [command]#driverdisk _partition_ | --source= | --biospart=#
tr: [command]#driverdisk _bölüm_ | --source= | --biospart=#

source: _partition_
tr: _bölüm_

source: Search for the driver disk image on a local partition. Replace _partition_ with the name of the partition containing the driver disk. Note that the partition must be specified as a full path. For example:
id: Cari gambar disk driver di partisi lokal. Ganti _partition_ dengan nama partisi yang berisi disk driver. Perhatikan bahwa partisi harus ditentukan sebagai path lengkap. Sebagai contoh:
tr: Sürücü disk görüntüsünü yerel bir bölümde arayın. _bölüm_ parametresini sürücü diskini içeren bölümün adıyla değiştirin. Bölümün tam yol olarak belirtilmesi gerektiğini unutmayın. Örneğin:

source: Search for the driver disk in a network location instead of a local partition. For example:
id: Cari disk driver di lokasi jaringan, bukan di partisi lokal. Sebagai contoh:
tr: Sürücü diskini yerel bölüm yerine bir ağ konumunda arayın. Örneğin:

source: [command]#driverdisk --source=ftp://pass:attributes[{blank}]_path/to/dd.img_pass:attributes[{blank}]#
tr: [command]#driverdisk --source=ftp://pass:attributes[{blank}]_sürücü/diskinin/yolu.img_pass:attributes[{blank}]#

source: [command]#driverdisk --source=http://pass:attributes[{blank}]_path/to/dd.img_pass:attributes[{blank}]#
tr: [command]#driverdisk --source=http://pass:attributes[{blank}]_sürücü/diskinin/yolu.img_pass:attributes[{blank}]#

source: [command]#driverdisk --source=nfs:pass:attributes[{blank}]_hostname_:/pass:attributes[{blank}]_path/to/dd.img_pass:attributes[{blank}]#
tr: [command]#driverdisk --source=nfs:pass:attributes[{blank}]_anamakineadı_:/pass:attributes[{blank}]_sürücü/diskinin/yolu.img_pass:attributes[{blank}]#

source: BIOS partition containing the driver disk (for example, `82p2`).
id: Partisi BIOS yang berisi disk driver (misalnya, `82p2`).
tr: Sürücü diskini içeren BIOS bölümü (örneğin, `82p2`).

source: mediacheck (optional) - Verify Installation Media Integrity
id: mediacheck (opsional) - Verifikasi Integritas Media Instalasi
tr: mediacheck (isteğe bağlı) - Kurulum Ortamının Bütünlüğünü Doğrula

source: This command will force the installation program to perform a media check before starting the installation, similarly to the [option]#rd.live.check# boot option (see xref:advanced/Boot_Options.adoc#sect-boot-options-mediacheck[Verifying Boot Media]. This command requires that installations be attended, so it is disabled by default.
tr: Bu komut, kurulum programını [option]#rd.live.check# önyükleme seçeneğine benzer şekilde kuruluma başlamadan önce bir ortam denetimi gerçekleştirmeye zorlayacaktır (xref:advanced/Boot_Options.adoc#sect-boot-options-mediacheck[Önyükleme Ortamını Doğrulama] bölümüne bakın). Bu komut kurulumların etkileşimli olmasını gerektirir, bu nedenle öntanımlı olarak devre dışıdır.

source: ostreesetup (optional) - Install from an OSTree
id: ostreesetup (opsional) - Instal dari OSTree
tr: ostreesetup (isteğe bağlı) - Bir OSTree'den Kur

source: Used for OSTree installations. See link:++https://wiki.gnome.org/action/show/Projects/OSTree++[] for more information about OSTree. Available options are:
id: Digunakan untuk instalasi OSTree. Lihat tautan:++https://wiki.gnome.org/action/show/Projects/OSTree++[] untuk informasi lebih lanjut tentang OSTree. Pilihan yang tersedia adalah:
tr: OSTree kurulumları için kullanılır. OSTree hakkında daha fazla bilgi için link:++https://wiki.gnome.org/action/show/Projects/OSTree++[] sayfasına bakın. Kullanılabilir seçenekler şunlardır:

source: Management root for OS installation (required).
id: Root manajemen untuk instalasi OS (wajib).
tr: İşletim sistemi kurulumu için yönetim kökü (gerekli).

source: Management root for OS installation (optional).
id: Root manajemen untuk instalasi OS (opsional).
tr: İşletim sistemi kurulumu için yönetim kökü (isteğe bağlı).

source: Repository URL (required).
id: URL repositori (diharuskan).
tr: Depo URL'si (gerekli).

source: Name of branch inside the repository (required).
id: Nama cabang di dalam repositori (wajib).
tr: Deponun içindeki dalın adı (gerekli).

source: Disable GPG key verification (optional).
id: Nonaktifkan verifikasi kunci GPG (opsional).
tr: GPG anahtar doğrulamasını devre dışı bırak (isteğe bağlı).

source: repo (optional) - Configure Additional Repositories
id: repo (opsional) - Konfigurasikan Repositori Tambahan
tr: repo (isteğe bağlı) - Ek Depoları Yapılandır

source: Configures additional [application]*DNF* repositories that may be used as sources for package installation. This command can be used multiple times in a single Kickstart file.
id: Mengonfigurasi repositori [application]*DNF* tambahan yang dapat digunakan sebagai sumber untuk instalasi paket. Perintah ini dapat digunakan beberapa kali dalam satu file Kickstart.
tr: Paket kurulumu için kaynak olarak kullanılabilecek ek [application]*DNF* depolarını yapılandırır. Bu komut, tek bir Kickstart dosyasında birden çok kez kullanılabilir.

source: See the [citetitle]_xref:fedora:system-administrators-guide:index.adoc[{PRODUCT} System Administrator's Guide]_ for information about the [application]*DNF* package manager.
tr: [application]*DNF* paket yöneticisi hakkında bilgi için [citetitle]_xref:fedora:system-administrators-guide:index.adoc[{PRODUCT} Sistem Yöneticisi Kılavuzuna]_ bakın.

source: Repositories used for installation must be stable. The installation may fail if a repository is modified before the installation concludes.
id: Lihat [citetitle]_Fedora System Administrator's Guide_, tersedia di link:++https://docs.fedoraproject.org/++[], untuk informasi tentang [application]*DNF* package manager.
tr: Kurulum için kullanılan depolar kararlı olmalıdır. Kurulum tamamlanmadan önce bir depo değiştirilirse kurulum başarısız olabilir.

source: The repository ID. This option is required. If a repository has a name which conflicts with another previously added repository, it will be ignored. Because the installation program uses a list of pre-configured repositories, this means that you cannot add repositories with the same names as the preconfigured ones.
id: ID penyimpanan. Opsi ini diperlukan. Jika repositori memiliki nama yang bertentangan dengan repositori lain yang ditambahkan sebelumnya, itu akan diabaikan. Karena program penginstalan menggunakan daftar repositori yang telah dikonfigurasi sebelumnya, ini berarti Anda tidak dapat menambahkan repositori dengan nama yang sama dengan yang telah dikonfigurasi sebelumnya.
tr: Depo kimliği. Bu seçenek gereklidir. Bir deponun, önceden eklenen başka bir depoyla çakışan bir adı varsa, o depo yok sayılacaktır. Bu, kurulum programı önceden yapılandırılan depoların bir listesini kullandığından, onlarla aynı adlara sahip depolar ekleyemeyeceğiniz anlamına gelmektedir.

source: The repository URL. The variables that may be used in [application]*DNF* repo configuration files are *not* supported. You may use one of either this option or [option]#--mirrorlist#, not both.
id: URL repositori. Variabel yang dapat digunakan dalam file konfigurasi repo [aplikasi]*DNF* *tidak* didukung. Anda dapat menggunakan salah satu dari opsi ini atau [option]#--mirrorlist#, tidak keduanya.
tr: Depo URL'si. [application]*DNF* depo yapılandırma dosyalarında kullanılabilen değişkenler *desteklenmez*. Ya bu seçeneği ya da [option]#--mirrorlist# seçeneğini kullanabilirsiniz, ikisini birden kullanamazsınız.

source: The URL pointing at a list of mirrors for the repository. The variables that may normally be used in dnf repository configuration files are not supported here. You may use one of either this option or --baseurl, not both.
id: URL yang menunjuk ke daftar mirror untuk repositori. Variabel yang biasanya digunakan dalam file konfigurasi repositori dnf tidak didukung di sini. Anda dapat menggunakan salah satu dari opsi ini atau --baseurl, bukan keduanya.
tr: Depo için bir yansı listesini gösteren URL. Normalde dnf depo yapılandırma dosyalarında kullanılabilen değişkenler burada desteklenmez. Ya bu seçeneği ya da --baseurl seçeneğini kullanabilirsiniz, ikisini birden kullanamazsınız.

source: Make the repository configured in the Kickstart file available on the system after the installation as well. Creates a configuration file for the repository in `/etc/yum.repos.d/` on the installed system.
id: Jadikan repositori yang dikonfigurasi dalam file Kickstart tersedia di sistem setelah instalasi juga. Membuat file konfigurasi untuk repositori di `/etc/yum.repos.d/` pada sistem yang diinstal.
tr: Kickstart dosyasında yapılandırılan depoyu kurulumdan sonraki sistemde de kullanılabilir hale getir. Kurulu sistemde `/etc/yum.repos.d/` konumunda depo için bir yapılandırma dosyası oluşturur.

source: An integer value to assign a cost to this repository. If multiple repositories provide the same packages, this number will be used to prioritize which repository will be used before another. Repositories with a lower cost take priority over repositories with higher cost.
id: Nilai integer untuk menetapkan biaya ke repositori ini. Jika beberapa repositori menyediakan paket yang sama, nomor ini akan digunakan untuk memprioritaskan repositori mana yang akan digunakan sebelum yang lain. Repositori dengan biaya lebih rendah diprioritaskan daripada repositori dengan biaya lebih tinggi.
tr: Bu depoya bir maliyet atamak için bir tamsayı değeri. Birden fazla depo aynı paketleri sağlıyorsa, bu sayı hangi deponun diğerinden önce kullanılacağına öncelik vermek için kullanılacaktır. Daha düşük maliyetli depolar, daha yüksek maliyetli depolara göre önceliklidir.

source: A comma-separated list of package names that must *not* be pulled from this repository. This is useful if multiple repositories provide the same package and you want to make sure it comes from a particular repository. Both full package names (such as `publican`) and globs (such as `gnome-*`) are accepted.
id: Daftar nama paket yang dipisahkan koma yang *tidak* harus ditarik dari repositori ini. Ini berguna jika beberapa repositori menyediakan paket yang sama dan Anda ingin memastikan itu berasal dari repositori tertentu. Baik nama paket lengkap (seperti `publican`) dan gumpalan (seperti `gnome-*`) diterima.
tr: Bu depodan *çekilmemesi* gereken paket adlarının virgülle ayrılmış bir listesi. Bu, birden fazla depo aynı paketi sağlıyorsa ve bunun belirli bir depodan geldiğinden emin olmak istiyorsanız kullanışlıdır. Hem tam paket adları (`publican` gibi) hem de kalıplar (`gnome-*` gibi) kabul edilmektedir.

source: A comma-separated list of package names and globs that must be pulled from this repository. This is useful if multiple repositories provide the same package and you want to make sure it comes from this repository.
id: Daftar nama paket dan gumpalan yang dipisahkan koma yang harus ditarik dari repositori ini. Ini berguna jika beberapa repositori menyediakan paket yang sama dan Anda ingin memastikan itu berasal dari repositori ini.
tr: Bu depodan alınması gereken paket adlarının ve kalıpların virgülle ayrılmış bir listesi. Bu, birden fazla depo aynı paketi sağlıyorsa ve o paketin bu depodan geldiğinden emin olmak istiyorsanız kullanışlıdır.

source: Specify an `HTTP`, `HTTPS` or `FTP` proxy server to use when accessing this repository. This setting does not affect any other repositories or installation sources.
id: Tentukan server proxy `HTTP`, `HTTPS` atau `FTP` untuk digunakan saat mengakses repositori ini. Pengaturan ini tidak mempengaruhi repositori atau sumber instalasi lainnya.
tr: Bu depoya erişirken kullanmak için bir `HTTP`, `HTTPS` veya `FTP` vekil sunucusu belirt. Bu ayar, diğer depoları veya kurulum kaynaklarını etkilemez.

source: This option is used when composing installation trees and has no effect on the installation process itself. It tells the compose tools to not look at the package group information when mirroring trees so as to avoid mirroring large amounts of unnecessary data.
id: Opsi ini digunakan saat membuat pohon instalasi dan tidak berpengaruh pada proses instalasi itu sendiri. Ini memberi tahu alat penulisan untuk tidak melihat informasi grup paket saat mencerminkan pohon untuk menghindari pencerminan data yang tidak perlu dalam jumlah besar.
tr: Bu seçenek, kurulum ağaçları oluşturulurken kullanılır ve kurulum sürecinin kendisi üzerinde hiçbir etkisi yoktur. Oluşturma araçlarına, büyük miktarda gereksiz veriyi yansıtmamak için ağaçları yansıtırken paket grubu bilgilerine bakmamalarını söyler.

source: Disable SSL verification when connecting to an `HTTPS` server.
id: Nonaktifkan verifikasi SSL saat menghubungkan ke server `HTTPS`.
tr: Bir `HTTPS` sunucusuna bağlanırken SSL doğrulamasını devre dışı bırak.

source: url (optional) - Install from an installation tree on a remote server via FTP or HTTP.
tr: url (isteğe bağlı) - FTP veya HTTP aracılığıyla uzak bir sunucudaki bir kurulum ağacından kur.

source: Install from an installation tree on a remote server via FTP or HTTP.
tr: FTP veya HTTP aracılığıyla uzak bir sunucudaki bir kurulum ağacından kur.

source: Specify an HTTP/HTTPS/FTP proxy to use while performing the install. The various parts of the argument act like you would expect. The syntax is:
tr: Kurulumu gerçekleştirirken kullanılacak bir HTTP/HTTPS/FTP vekil sunucusu belirt. Argümanın çeşitli kısımları beklediğiniz gibi davranmaktadır. Söz dizimi şu şekildedir:

source: [protocol://][username[:password]@]host[:port]
tr: [protokol://][kullanıcıadı[:parola]@]anamakine[:bağlantınoktası]

source: For a tree on a HTTPS server do not check the server’s certificate with what well-known CA validate and do not check the server’s host name matches the certificate’s domain name.
tr: HTTPS sunucusundaki bir ağaç için, sunucunun sertifikasını iyi bilinen bir CA'nın doğruladığını denetleme ve sunucunun ana makine adının sertifikanın etki alanı adıyla eşleştiğini denetleme.

source: The URL to install from. Variable substitution is done for `$releasever` and `$basearch` in the URL.
tr: Kurulumun yapılacağı URL. URL'de `$releasever` ve `$basearch` için değişken değiştirmesi yapılır.

source: The mirror URL to install from. Variable substitution is done for `$releasever` and `$basearch` in the URL.
tr: Kurulumun yapılacağı yansı URL'si. URL'de `$releasever` ve `$basearch` için değişken değiştirmesi yapılır.

source: The metalink URL to install from. Variable substitution is done for `$releasever` and `$basearch` in the URL.
tr: Kurulumun yapılacağı üst bağlantı URL'si. URL'de `$releasever` ve `$basearch` için değişken değiştirmesi yapılır.

source: Storage and Partitioning
id: Penyimpanan dan Partisi
tr: Depolama ve Bölümlendirme
