Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: You should configure iSCSI storage in the system BIOS or firmware (iBFT for Intel systems) rather than use the [command]#iscsi# command if possible. If you do so, [application]*Anaconda* automatically detects and uses disks configured in BIOS or firmware and no special configuration is necessary in the Kickstart file.
id: Anda harus mengonfigurasi penyimpanan iSCSI di BIOS atau firmware sistem (iBFT untuk sistem Intel) daripada menggunakan perintah [command]#iscsi# jika memungkinkan. Jika Anda melakukannya, [aplikasi]*Anaconda* secara otomatis mendeteksi dan menggunakan disk yang dikonfigurasi di BIOS atau firmware dan tidak diperlukan konfigurasi khusus dalam file Kickstart.
tr: [command]#iscsi# komutunu kullanmak yerine, mümkünse sistemin BIOS'unda veya ürün yazılımında (Intel sistemleri için iBFT) iSCSI depolamasını yapılandırmalısınız. Bunu yaparsanız, [application]*Anaconda* BIOS veya ürün yazılımında yapılandırılan diskleri otomatik olarak algılar ve kullanır, Kickstart dosyasında özel bir yapılandırma gerekmez.

source: If you must use the [command]#iscsi# command, make sure that networking is activated at the beginning of the installation, and that the [command]#iscsi# command appears in the Kickstart file *before* you refer to iSCSI disks with commands such as [command]#clearpart# or [command]#ignoredisk#.
id: Jika Anda harus menggunakan perintah [command]#iscsi#, pastikan jaringan diaktifkan pada awal instalasi, dan perintah [command]#iscsi# muncul di file Kickstart *sebelum* Anda merujuk ke disk iSCSI dengan perintah seperti [command]#clearpart# atau [command]#ignoredisk#.
tr: [command]#iscsi# komutunu kullanmanız gerekiyorsa, kurulumun başında ağ bağlantısının etkinleştirildiğinden ve [command]#clearpart# veya [command]#ignoredisk# gibi komutlarla iSCSI disklerine başvurulmadan *önce* [command]#iscsi# komutunun Kickstart dosyasında göründüğünden emin olun.

source: The IP address of the target to connect to.
id: Alamat IP target yang akan disambungkan.
tr: Bağlanılacak hedefin IP adresi.

source: The port number (typically `3260`).
id: Nomor port (biasanya `3260`).
tr: Bağlantı noktası numarası (genellikle `3260`).

source: Target _IQN_ (iSCSI Qualified Name).
tr: Hedef _IQN_ (iSCSI Qualified Name - iSCSI Nitelikli Adı).

source: Bind the connection to a specific network interface instead of using the default one determined by the network layer. Once used, it must be specified in all instances of the [command]#iscsi# command in the entire Kickstart file.
id: Ikat koneksi ke antarmuka jaringan tertentu alih-alih menggunakan yang default yang ditentukan oleh lapisan jaringan. Setelah digunakan, itu harus ditentukan di semua contoh perintah [command]#iscsi# di seluruh file Kickstart.
tr: Ağ katmanı tarafından belirlenen öntanımlı olanı kullanmak yerine, bağlantıyı belirli bir ağ arayüzüne bağla. Bir kere kullanıldıktan sonra, Kickstart dosyasının tamamındaki [command]#iscsi# komutunun tüm örneklerinde belirtilmelidir.

source: User name required to authenticate with the target.
id: Nama pengguna diperlukan untuk mengautentikasi dengan target.
tr: Hedefle kimlik doğrulaması yapmak için gerekli kullanıcı adı.

source: Password that corresponds with the user name specified for the target.
id: Kata sandi yang sesuai dengan nama pengguna yang ditentukan untuk target.
tr: Hedef için belirtilen kullanıcı adına karşılık gelen parola.

source: User name required to authenticate with the initiator from a target using reverse CHAP authentication.
id: Nama pengguna diperlukan untuk mengautentikasi dengan inisiator dari target menggunakan autentikasi CHAP terbalik.
tr: Ters CHAP kimlik doğrulamasını kullanarak bir hedefteki başlatıcıyla kimlik doğrulaması yapmak için gerekli kullanıcı adı.

source: Password that corresponds with the user name specified for the initiator.
id: Kata sandi yang sesuai dengan nama pengguna yang ditentukan untuk inisiator.
tr: Başlatıcı için belirtilen kullanıcı adına karşılık gelen parola.

source: iscsiname (optional) - Assign Name to iSCSI Device
id: iscsiname (opsional) - Tetapkan Nama ke Perangkat iSCSI
tr: iscsiname (isteğe bağlı) - iSCSI Aygıtına Ad Ata

source: Assigns a name to an iSCSI node specified by the [command]#iscsi# command (xref:sect-kickstart-commands-iscsi[iscsi (optional) - Configure iSCSI Devices]). This command is mandatory if you use the [command]#iscsi# command, and it must be specified *before* you use [command]#iscsi#.
id: Menetapkan nama ke node iSCSI yang ditentukan oleh perintah [command]#iscsi# (xref:sect-kickstart-commands-iscsi[iscsi (opsional) - Konfigurasi Perangkat iSCSI]). Perintah ini wajib jika Anda menggunakan perintah [command]#iscsi#, dan harus ditentukan *sebelum* Anda menggunakan [command]#iscsi#.
tr: [command]#iscsi# komutuyla (xref:sect-kickstart-commands-iscsi[iscsi (isteğe bağlı) - iSCSI Aygıtlarını Yapılandır]) belirtilen bir iSCSI düğümüne bir ad atar. [command]#iscsi# komutunu kullanıyorsanız bu komut zorunludur ve [command]#iscsi# komutunu kullanmadan *önce* belirtilmelidir.

source: logvol (optional) - Create LVM Logical Volume
id: logvol (opsional) - Buat Volume Logis LVM
tr: logvol (isteğe bağlı) - LVM Mantıksal Birimi Oluştur

source: Create a logical volume for Logical Volume Management (LVM) with the syntax:
id: Buat volume logis untuk Logical Volume Management (LVM) dengan sintaks:
tr: Aşağıdaki söz dizimi ile Mantıksal Birim Yönetimi (LVM) için mantıksal bir birim oluştur:

source: [command]#logvol _mntpoint_ --vgname= --name= [pass:attributes[{blank}]_options_pass:attributes[{blank}]]#
tr: [command]#logvol _bağlamanoktası_ --vgname= --name= [pass:attributes[{blank}]_seçenekler_pass:attributes[{blank}]]#

source: Do not use the dash (`-`) character in logical volume and volume group names when installing {PRODUCT} using Kickstart. If this character is used, the installation will finish normally, but the `/dev/mapper/` directory will list these volumes and volume groups with every dash doubled. For example, a volume group named `volgrp-01` containing a logical volume named `logvol-01` will be listed as `/dev/mapper/volgrp--01-logvol--01`.
id: Jangan gunakan karakter tanda hubung (`-`) dalam volume logis dan nama grup volume saat memasang {PRODUCT} menggunakan Kickstart. Jika karakter ini digunakan, penginstalan akan selesai secara normal, tetapi direktori `/dev/mapper/` akan mencantumkan volume dan grup volume ini dengan setiap tanda hubung digandakan. Misalnya, grup volume bernama `volgrp-01` yang berisi volume logis bernama `logvol-01` akan terdaftar sebagai `/dev/mapper/volgrp--01-logvol--01`.
tr: Kickstart kullanarak {PRODUCT} kurarken mantıksal birim ve birim grubu adlarında tire (`-`) karakterini kullanmayın. Bu karakter kullanılırsa, kurulum normal şekilde tamamlanır, ancak `/dev/mapper/` dizini bu birimleri ve birim gruplarını her tire iki defa görünecek şekilde listeler. Örneğin, `logvol-01` adlı mantıksal bir birim içeren ve `volgrp-01` olarak adlandırılan bir birim grubu, `/dev/mapper/volgrp--01-logvol--01` olarak listelenecektir.

source: This limitation only applies to newly created logical volume and volume group names. If you are reusing existing ones using the [option]#--noformat# or [option]#--useexisting# option, their names will not be changed.
id: Batasan ini hanya berlaku untuk volume logis dan nama grup volume yang baru dibuat. Jika Anda menggunakan kembali yang sudah ada menggunakan opsi [option]#--noformat# atau [option]#--useexisting#, nama mereka tidak akan diubah.
tr: Bu sınırlama yalnızca yeni oluşturulan mantıksal birim ve birim grubu adları için geçerlidir. [option]#--noformat# veya [option]#--useexisting# seçeneğini kullanarak zaten var olanları yeniden kullanıyorsanız, onların adları değiştirilmeyecektir.

source: For a detailed example of [command]#logvol# in action, see xref:sect-kickstart-example-advanced-partitioning[Advanced Partitioning Example].
id: Untuk contoh rinci tentang [perintah]#logvol# dalam tindakan, lihat xref:sect-kickstart-example-advanced-partitioning[Contoh Partisi Lanjutan].
tr: [command]#logvol# komutunun ayrıntılı bir örneği için xref:sect-kickstart-example-advanced-partitioning[Gelişmiş Bölümlendirme Örneği] bölümüne bakın.

source: _mntpoint_
tr: _bağlamanoktası_

source: Replace with the volume's mount point. This name can take the following forms:
id: Ganti dengan titik pemasangan volume. Nama ini dapat mengambil bentuk berikut:
tr: Birimin bağlama noktasıyla değiştirin. Bu ad aşağıdaki biçimleri alabilir:

source: `/pass:attributes[{blank}]_path_pass:attributes[{blank}]`:
tr: `/pass:attributes[{blank}]_yol_pass:attributes[{blank}]`:

source: A path to the mount point - for example, `/` or `/home`
id: Jalur ke titik pemasangan - misalnya, `/` atau `/home`
tr: Bağlama noktasının yolu - örneğin, `/` veya `/home`

source: The partition is used as swap space.
id: Partisi ini digunakan sebagai ruang swap.
tr: Bölüm, takas alanı olarak kullanılır.

source: To determine the size of the swap partition automatically, use the [option]#--recommended# option:
id: Untuk menentukan ukuran partisi swap secara otomatis, gunakan opsi [option]#--recommended#:
tr: Takas bölümünün boyutunu otomatik olarak belirlemek için [option]#--recommended# seçeneğini kullanın:

source: To determine the size of the swap partition automatically but also allow extra space for your system to hibernate, use the [option]#--hibernation# option:
id: Untuk menentukan ukuran partisi swap secara otomatis tetapi juga memberikan ruang ekstra bagi sistem Anda untuk hibernasi, gunakan opsi [option]#--hibernation#:
tr: Takas bölümünün boyutunu otomatik olarak belirlemek ve aynı zamanda sisteminizin hazırda bekletme moduna geçmesi için fazladan alana izin vermek için [option]#--hibernation# seçeneğini kullanın:

source: The size assigned will be equivalent to the swap space assigned by [option]#--recommended# plus the amount of RAM on your system.
id: Ukuran yang ditetapkan akan setara dengan ruang swap yang ditetapkan oleh [option]#--recommended# ditambah jumlah RAM pada sistem Anda.
tr: Atanan boyut, [option]#--recommended# seçeneği tarafından atanan takas alanının ve sisteminizdeki RAM miktarının toplamına eşit olacaktır.

source: For the swap sizes assigned by these commands, see the section describing swap in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
id: Untuk ukuran swap yang ditetapkan oleh perintah ini, lihat bagian yang menjelaskan swap di xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
tr: Bu komutlar tarafından atanan takas boyutları için, xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümünde takası açıklayan kısma bakın.

source: Used only when creating a thin pool volume.
id: Digunakan hanya saat membuat volume kolam tipis.
tr: Yalnızca bir ince havuz birimi oluşturulurken kullanılır.

source: Use an existing logical volume and do not format it.
id: Gunakan volume logis yang ada dan jangan memformatnya.
tr: Mevcut bir mantıksal birimi kullan ve onu biçimlendirme.

source: Use an existing logical volume and format it.
id: Gunakan volume logis yang ada dan formatlah.
tr: Mevcut bir mantıksal birimi kullan ve onu biçimlendir.

source: Sets the file system type for the logical volume. Valid values are `xfs`, `ext2`, `ext3`, `ext4`, `swap`, and `vfat`. See xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types] for information about available file systems.
id: Menetapkan jenis sistem file untuk volume logis. Nilai yang valid adalah `xfs`, `ext2`, `ext3`, `ext4`, `swap`, dan `vfat`. Lihat xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Perangkat, Sistem File dan Jenis RAID] untuk informasi tentang sistem file yang tersedia.
tr: Mantıksal birim için dosya sistemi türünü ayarlar. Geçerli değerler şunlardır: `xfs`, `ext2`, `ext3`, `ext4`, `swap`, ve `vfat`. Kullanılabilir dosya sistemleri hakkında bilgi için xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Aygıt, Dosya Sistemi ve RAID Türleri] bölümüne bakın.

source: Specifies a free form string of options to be used when mounting the filesystem. This string will be copied into the `/etc/fstab` file of the installed system and should be enclosed in quotes. For example:
id: Menentukan string opsi bentuk bebas yang akan digunakan saat memasang sistem file. String ini akan disalin ke file `/etc/fstab` dari sistem yang diinstal dan harus diapit dalam tanda kutip. Sebagai contoh:
tr: Dosya sistemini bağlarken kullanılacak serbest bir biçimde seçenekler dizgesini belirtir. Bu dizge kurulu sistemin `/etc/fstab` dosyasına kopyalanacaktır ve tırnak içine alınmalıdır. Örneğin:

source: Specifies additional parameters to be passed to the program that makes a filesystem on this logical volume. No processing is done on the list of arguments, so they must be supplied in a format that can be passed directly to the mkfs program. This means multiple options should be comma-separated or surrounded by double quotes, depending on the filesystem.
id: Menentukan parameter tambahan yang akan diteruskan ke program yang membuat sistem file pada volume logis ini. Tidak ada pemrosesan yang dilakukan pada daftar argumen, sehingga argumen harus diberikan dalam format yang dapat diteruskan langsung ke program mkfs. Ini berarti beberapa opsi harus dipisahkan dengan koma atau dikelilingi oleh tanda kutip ganda, tergantung pada sistem file.
tr: Bu mantıksal birim üzerinde bir dosya sistemi oluşturan programa iletilecek ek parametreleri belirtir. Argüman listesinde herhangi bir işlem yapılmaz, bu nedenle doğrudan mkfs programına iletilebilecek bir biçimde sağlanmaları gerekir. Bu, dosya sistemine bağlı olarak birden çok seçeneğin virgülle ayrılması veya çift tırnak içine alınması gerektiği anlamına gelir.

source: Sets a label for the logical volume.
id: Menetapkan label untuk volume logis.
tr: Mantıksal birim için bir etiket ayarlar.

source: Grow the volume to fill available space (if any), or up to the limit set by the [option]#--maxsize=# option.
id: Perbesar volume untuk mengisi ruang yang tersedia (jika ada), atau hingga batas yang ditentukan oleh opsi [option]#--maxsize=#.
tr: Birimi, (varsa) kullanılabilir alanı dolduracak şekilde veya [option]#--maxsize=# seçeneği tarafından belirlenen sınıra kadar büyüt.

source: The size of the logical volume in megabytes. This option cannot be used together with the [option]#--percent=# option.
tr: Mantıksal birimin megabayt cinsinden boyutu. Bu seçenek, [option]#--percent=# seçeneğiyle birlikte kullanılamaz.

source: Specify the amount by which to grow the logical volume, as a percentage of the free space in the volume group after any statically-sized logical volumes are taken into account. This option cannot be used together with the [option]#--size=# and [option]#--grow# options.
tr: Mantıksal birimin büyütüleceği miktarı, statik olarak boyutlandırılan mantıksal birimler dikkate alındıktan sonra birim grubunda kalan boş alanın yüzdesi olarak belirt. Bu seçenek, [option]#--size=# ve [option]#--grow# seçenekleriyle birlikte kullanılamaz.

source: When creating a new logical volume, you must either specify its size statically using the [option]#--size=# option, or as a percentage of remaining free space using the [option]#--percent=# option. You cannot use both of these options on the same logical volume.
tr: Yeni bir mantıksal birim oluştururken, boyutunu [option]#--size=# seçeneğini kullanarak statik olarak veya [option]#--percent=# seçeneğini kullanarak kalan boş alanın yüzdesi olarak belirtmelisiniz. Aynı mantıksal birimde bu seçeneklerin ikisini birlikte kullanamazsınız.

source: The maximum size in megabytes when the logical volume is set to grow. Specify an integer value here such as `500` (do not include the unit).
id: Ukuran maksimum dalam megabyte ketika volume logis diatur untuk tumbuh. Tentukan nilai integer di sini seperti `500` (tidak termasuk unit).
tr: Mantıksal birim büyütülmeye ayarlandığında megabayt cinsinden azami boyut. Burada `500` gibi bir tam sayı değeri belirtin (birimini dahil etmeyin).

source: Use this option when creating a `swap` logical volume to determine the size of this volume automatically, based on your system's hardware. For details about the recommended scheme, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
id: Gunakan opsi ini saat membuat volume logis `swap` untuk menentukan ukuran volume ini secara otomatis, berdasarkan perangkat keras sistem Anda. Untuk detail tentang skema yang disarankan, lihat xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Skema Partisi yang Disarankan].
tr: Sisteminizin donanımına bağlı olarak boyutunu otomatik olarak belirlemek için bir `swap` mantıksal birimi oluştururken bu seçeneği kullanın. Tavsiye edilen düzen hakkında ayrıntılar için xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın.

source: This option can only be used for partitions which result in a file system such as the `/boot` partition and `swap` space. It cannot be used to create partitionsm, LVM physical or logical volumes or RAID members.
tr: Bu seçenek yalnızca `/boot` bölümü ve `swap` alanı gibi bir dosya sistemiyle sonuçlanan bölümler için kullanılabilir. Bölümler, LVM fiziksel veya mantıksal birimleri ya da RAID üyeleri oluşturmak için kullanılamaz.

source: Resize an existing logical volume. If you use this option, you must also specify [option]#--useexisting# and [option]#--size#.
id: Ubah ukuran volume logis yang ada. Jika Anda menggunakan opsi ini, Anda juga harus menentukan [option]#--useexisting# dan [option]#--size#.
tr: Mevcut bir mantıksal birimi yeniden boyutlandır. Bu seçeneği kullanırsanız, [option]#--useexisting# ve [option]#--size# seçeneklerini de belirtmelisiniz.

source: Specifies that this logical volume should be encrypted, using the passphrase provided in the [option]#--passphrase=# option. If you do not specify a passphrase, the installation program will use the default, system-wide passphrase set with the [command]#autopart --passphrase# command, or stop the installation and prompt you to provide a passphrase if no default is set.
id: Menentukan bahwa volume logis ini harus dienkripsi, menggunakan frasa sandi yang disediakan dalam opsi [option]#--passphrase=#. Jika Anda tidak menentukan frasa sandi, program penginstalan akan menggunakan default, frasa sandi seluruh sistem yang disetel dengan perintah [command]#autopart --passphrase#, atau menghentikan penginstalan dan meminta Anda untuk memberikan frasa sandi jika tidak ada default yang disetel .
tr: Bu mantıksal birimin, [option]#--passphrase=# seçeneğinde sağlanan parola kullanılarak şifrelenmesi gerektiğini belirtir. Bir parola belirtmezseniz, kurulum programı [command]#autopart --passphrase# komutuyla ayarlanan öntanımlı, sistem genelindeki parolayı kullanacak veya herhangi bir öntanımlı değer ayarlanmadıysa kurulumu durduracak ve sizden bir parola sağlamanızı isteyecektir.

source: Specifies the passphrase to use when encrypting this logical volume. You must use this option together with the [option]#--encrypted# option. This option has no effect by itself.
id: Menentukan frasa sandi yang akan digunakan saat mengenkripsi volume logis ini. Anda harus menggunakan opsi ini bersama dengan opsi [option]#--encrypted#. Opsi ini tidak berpengaruh dengan sendirinya.
tr: Bu mantıksal birimi şifrelerken kullanılacak parolayı belirtir. Bu seçeneği [option]#--encrypted# seçeneğiyle birlikte kullanmalısınız. Bu seçeneğin tek başına bir etkisi yoktur.

source: Store data encryption keys of all encrypted volumes as files in `/root`, encrypted using the X.509 certificate from the URL specified with _URL_of_X.509_certificate_. The keys are stored as a separate file for each encrypted volume. This option is only meaningful if [option]#--encrypted# is specified.
id: Simpan kunci enkripsi data dari semua volume terenkripsi sebagai file di `/root`, dienkripsi menggunakan sertifikat X.509 dari URL yang ditentukan dengan _URL_of_X.509_certificate_. Kunci disimpan sebagai file terpisah untuk setiap volume terenkripsi. Opsi ini hanya bermakna jika [option]#--encrypted# ditentukan.
tr: Tüm şifrelenmiş birimlerin veri şifreleme anahtarlarını, _X.509_sertifikasının_URLsi_ ile belirtilen URL'deki X.509 sertifikası kullanılarak şifrelenmiş dosyalar olarak `/root` dizininde depola. Anahtarlar, şifrelenen her birim için ayrı bir dosya olarak depolanır. Bu seçenek yalnızca [option]#--encrypted# seçeneği belirtilmişse anlamlıdır.

source: Add a randomly-generated passphrase to each encrypted volume. Store these passphrases in separate files in `/root`, encrypted using the X.509 certificate specified with [option]#--escrowcert#. This option is only meaningful if [option]#--escrowcert# is specified.
id: Tambahkan frasa sandi yang dibuat secara acak ke setiap volume terenkripsi. Simpan frasa sandi ini dalam file terpisah di `/root`, dienkripsi menggunakan sertifikat X.509 yang ditentukan dengan [option]#--escrowcert#. Opsi ini hanya bermakna jika [opsi]#--escrowcert# ditentukan.
tr: Şifrelenen her birime rastgele oluşturulmuş bir parola ekle. Bu parolaları, [option]#--escrowcert# seçeneğiyle belirtilen X.509 sertifikası kullanılarak şifrelenen ayrı dosyalarda `/root` dizinde depola. Bu seçenek yalnızca [option]#--escrowcert# seçeneği belirtilmişse anlamlıdır.

source: Creates a thin pool logical volume. (Use a mount point of `none`)
id: Membuat volume logis kumpulan tipis. (Gunakan titik pemasangan `none`)
tr: Bir ince havuz mantıksal birimi oluşturur. (`none` bağlama noktasını kullanın)

source: Metadata area size (in MiB) for a new thin pool device.
id: Ukuran area metadata (dalam MiB) untuk perangkat thin pool baru.
tr: Yeni bir ince havuz aygıtı için üst veri alanı boyutu (MiB cinsinden).

source: Chunk size (in KiB) for a new thin pool device.
id: Ukuran potongan (dalam KiB) untuk perangkat kolam tipis baru.
tr: Yeni bir ince havuz aygıtı için öbek boyutu (KiB cinsinden).

source: Create a thin logical volume. (Requires use of [option]#--poolname#)
id: Buat volume logis yang tipis. (Memerlukan penggunaan [option]#--poolname#)
tr: Bir ince mantıksal birim oluştur. ([option]#--poolname# seçeneğinin kullanılmasını gerektirir)

source: Specify the name of the thin pool in which to create a thin logical volume. Requires the [option]#--thin# option.
id: Tentukan nama kumpulan tipis untuk membuat volume logis tipis. Memerlukan opsi [opsi]#--tipis#.
tr: İçerisinde bir ince mantıksal birim oluşturulacak ince havuzun adını belirt. [option]#--thin# seçeneğini gerektirir.
