Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: Team device specified by the [option]#--device=# option will be created using slaves specified in this option. Slaves are separated by commas. A slave can be followed by its configuration, which is a single-quoted JSON string with double quotes escaped by the `\` character. For example:
id: Perangkat tim yang ditentukan oleh opsi [option]#--device=# akan dibuat menggunakan budak yang ditentukan dalam opsi ini. Budak dipisahkan dengan koma. Seorang budak dapat diikuti oleh konfigurasinya, yang merupakan string JSON dengan tanda kutip tunggal dengan tanda kutip ganda yang diloloskan oleh karakter `\`. Sebagai contoh:
tr: [option]#--device=# seçeneği ile belirtilen team aygıtı, bu seçenekte belirtilen ikinciller kullanılarak oluşturulacaktır. İkinciller virgülle ayrılır. Bir ikincili, çift tırnak karakterlerinin `\` karakteriyle kaçırıldığı tek tırnak içinde bir JSON dizgesi olan yapılandırması takip edebilir. Örneğin:

source: See also the [option]#--teamconfig=# option.
id: Lihat juga opsi [option]#--teamconfig=#.
tr: Ayrıca [option]#--teamconfig=# seçeneğine bakın.

source: Double-quoted team device configuration which is a single-quoted JSON string with double quotes escaped by the `\` character. The device name is specified by [option]#--device=# option and its slaves and their configuration by [option]#--teamslaves=# option. For example:
id: Konfigurasi perangkat tim dengan tanda kutip ganda yang merupakan string JSON dengan tanda kutip tunggal dengan tanda kutip ganda diloloskan oleh karakter `\`. Nama perangkat ditentukan oleh opsi [option]#--device=# dan slave-nya serta konfigurasinya oleh opsi [option]#--teamslaves=#. Sebagai contoh:
tr: Çift tırnak karakterlerinin `\` karakteriyle kaçırıldığı tek tırnak içinde bir JSON dizgesi olan çift tırnak içinde team aygıtı yapılandırması . Aygıt adı, [option]#--device=# seçeneğiyle, ikincilleri ve bunların yapılandırmaları [option]#--teamslaves=# seçeneğiyle belirtilir. Örneğin:

source: When this option is used, the network bridge with device name specified using the [option]#--device=# option will be created and devices defined in the [option]#--bridgeslaves=# option will be added to the bridge. For example:
id: Ketika opsi ini digunakan, jembatan jaringan dengan nama perangkat yang ditentukan menggunakan opsi [option]#--device=# akan dibuat dan perangkat yang ditentukan dalam opsi [opsi]#--bridgeslaves=# akan ditambahkan ke jembatan. Sebagai contoh:
tr: Bu seçenek kullanıldığında, [option]#--device=# seçeneği kullanılarak belirtilen aygıt adıyla ağ köprüsü oluşturulacak ve [option]#--bridgeslaves=# seçeneğinde tanımlanan aygıtlar köprüye eklenecektir. Örneğin:

source: An optional comma-separated list of parameters for the bridged interface. Available values are `stp`, `priority`, `forward-delay`, `hello-time`, `max-age`, and `ageing-time`. For information about these parameters, see the [citetitle]_bridge setting_ table in the `nm-settings(5)` man page or at link:++https://developer.gnome.org/NetworkManager/0.9/ref-settings.html++[]. Also see the [citetitle]_{PRODUCT} Networking Guide_, available at link:++https://docs.fedoraproject.org/++[], for general information about network bridging.
tr: Köprü yapılan arayüz için isteğe bağlı virgülle ayrılmış bir parametre listesi. Kullanılabilir değerler şunlardır: `stp`, `priority`, `forward-delay`, `hello-time`, `max-age` ve `ageing-time`. Bu parametreler hakkında bilgi için `nm-settings(5)` kılavuz sayfasındaki veya link:++https://developer.gnome.org/NetworkManager/0.9/ref-settings.html++[] adresindeki [citetitle]_bridge setting_ tablosuna bakın. Ağ köprüleme hakkında genel bilgi için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Ağ Kılavuzuna_ da bakın.

source: Console and Environment
id: Konsol dan Lingkungan
tr: Konsol ve Ortam

source: The following commands control the environment of the system after the installation finishes - language, keyboard layouts, or the graphical interface.
id: Perintah berikut mengontrol lingkungan sistem setelah penginstalan selesai - bahasa, tata letak keyboard, atau antarmuka grafis.
tr: Aşağıdaki komutlar, kurulum tamamlandıktan sonraki sistemin ortamını denetler - dil, klavye düzenleri veya grafiksel arayüz.

source: keyboard (optional) - Configure Keyboard Layouts
id: keyboard (opsional) - Konfigurasi Tata Letak Keyboard
tr: keyboard (isteğe bağlı) - Klavye Düzenlerini Yapılandır

source: Sets one or more available keyboard layouts for the system.
id: Menetapkan satu atau beberapa tata letak keyboard yang tersedia untuk sistem.
tr: Sistem için bir veya daha fazla kullanılabilir klavye düzeni ayarlar.

source: Specify a `VConsole` keymap which should be used. Valid names correspond to the list of files in the `/usr/lib/kbd/keymaps/*` directory, without the `.map.gz` extension.
id: Tentukan keymap `VConsole` yang harus digunakan. Nama yang valid sesuai dengan daftar file di direktori `/usr/lib/kbd/keymaps/*`, tanpa ekstensi `.map.gz`.
tr: Kullanılması gereken bir `VConsole` tuş eşlemi belirt. Geçerli adlar, `/usr/lib/kbd/keymaps/*` dizinindeki dosyaların adlarının `.map.gz` uzantısı olmayan halidir.

source: Specify a list of [application]*X* layouts that should be used as a comma-separated list without spaces. Accepts values in the same format as `setxkbmap(1)`, either in the `pass:attributes[{blank}]_layout_pass:attributes[{blank}]` format (such as `cz`), or in the `pass:attributes[{blank}]_layout_ (_variant_)` format (such as `cz (qwerty)`).
id: Tentukan daftar tata letak [aplikasi]*X* yang harus digunakan sebagai daftar yang dipisahkan koma tanpa spasi. Menerima nilai dalam format yang sama dengan `setxkbmap(1)`, baik dalam format `pass:attributes[{blank}]_layout_pass:attributes[{blank}]` (seperti `cz`), atau dalam `pass: atribut[{blank}]_layout_ (_variant_)` format (seperti `cz (qwerty)`).
tr: Aralarında boşluk olmadan virgülle ayrılmış bir liste olarak kullanılması gereken [application]*X* düzenlerinin bir listesini belirt. Ya `pass:attributes[{blank}]_düzen_pass:attributes[{blank}]` (`tr` gibi), ya da `pass:attributes[{blank}]_düzen_ (_çeşit_)` (`tr (f)` gibi) şeklinde `setxkbmap(1)` ile aynı biçimde değerleri kabul eder.

source: All available layouts can be viewed on the `xkeyboard-config(7)` man page under `Layouts`.
id: Semua layout yang tersedia dapat dilihat di halaman manual `xkeyboard-config(7)` di bawah `Layouts`.
tr: Kullanılabilir tüm düzenler, `xkeyboard-config(7)` kılavuz sayfasının `Layouts` bölümünde görülebilir.

source: Specify a list of layout-switching options (shortcuts for switching between multiple keyboard layouts). Multiple options must be separated by commas without spaces. Accepts values in the same format as `setxkbmap(1)`.
id: Tentukan daftar opsi pengalihan tata letak (pintasan untuk beralih di antara beberapa tata letak keyboard). Beberapa opsi harus dipisahkan dengan koma tanpa spasi. Menerima nilai dalam format yang sama dengan `setxkbmap(1)`.
tr: Düzen değiştirme seçeneklerinin bir listesini belirt (birden çok klavye düzeni arasında geçiş yapmak için kısayollar). Birden çok seçenek, aralarında boşluk olmadan virgülle ayrılmalıdır. `setxkbmap(1)` ile aynı biçimdeki değerleri kabul eder.

source: Available switching options can be viewed on the `xkeyboard-config(7)` man page under `Options`.
id: Opsi peralihan yang tersedia dapat dilihat di halaman manual `xkeyboard-config(7)` di bawah `Opsi`.
tr: Kullanılabilir değiştirme seçenekleri, `xkeyboard-config(7)` kılavuz sayfasının `Options` bölümünde görülebilir.

source: The following example sets up two keyboard layouts (`English (US)` and `Czech (qwerty)`) using the [option]#--xlayouts=# option, and allows to switch between them using kbd:[Alt + Shift]:
id: Contoh berikut menyiapkan dua tata letak keyboard (`Bahasa Inggris (AS)` dan `Ceko (qwerty)`) menggunakan opsi [option]#--xlayouts=#, dan memungkinkan untuk beralih di antara keduanya menggunakan kbd:[Alt + Shift] :
tr: Aşağıdaki örnek, [option]#--xlayouts=# seçeneğini kullanarak iki klavye düzeni (`İngilizce (ABD)` ve `Türkçe (f)`) ayarlar ve kbd:[Alt + Shift]: kullanarak bunlar arasında geçiş yapılmasına olanak tanır.

source: keyboard --xlayouts=us,'cz (qwerty)' --switch=grp:alt_shift_toggle
tr: keyboard --xlayouts=us,'tr (f)' --switch=grp:alt_shift_toggle

source: lang (optional) - Configure Language During Installation
id: lang (opsional) - Konfigurasikan Bahasa Selama Instalasi
tr: lang (isteğe bağlı) - Kurulum Sırasındaki Dili Yapılandır

source: Sets the language to use during installation and the default language to use on the installed system.
id: Mengatur bahasa yang akan digunakan selama instalasi dan bahasa default untuk digunakan pada sistem yang diinstal.
tr: Kurulum sırasında kullanılacak dili ve kurulu sistemde kullanılacak öntanımlı dili ayarlar.

source: [command]#lang _language_ [--addsupport=]#
tr: [command]#lang _dil_ [--addsupport=]#

source: The file `/usr/share/system-config-language/locale-list` provides a list of the valid _language_ codes in the first column of each line and is part of the [package]*system-config-language* package.
id: File `/usr/share/system-config-language/locale-list` menyediakan daftar kode _language_ yang valid di kolom pertama setiap baris dan merupakan bagian dari paket [package]*system-config-language*.
tr: `/usr/share/system-config-language/locale-list` dosyası, her satırın ilk sütununda geçerli _dil_ kodlarının bir listesini sağlar ve [package]*system-config-language* paketinin bir parçasıdır.

source: Certain languages (for example, Chinese, Japanese, Korean, and Indic languages) are not supported during text-mode installation. If you specify one of these languages with the [command]#lang# command and use text mode, the installation process will continue in English, but the installed system will use your selection as its default language.
id: Bahasa tertentu (misalnya, bahasa Cina, Jepang, Korea, dan India) tidak didukung selama penginstalan mode teks. Jika Anda menentukan salah satu bahasa ini dengan perintah [command]#lang# dan menggunakan mode teks, proses instalasi akan dilanjutkan dalam bahasa Inggris, tetapi sistem yang diinstal akan menggunakan pilihan Anda sebagai bahasa default.
tr: Metin modunda kurulum sırasında belirli diller (örneğin Çince, Japonca, Korece ve Hint dilleri) desteklenmez. Bu dillerden birini [command]#lang# komutuyla belirtir ve metin modunu kullanırsanız, kurulum işlemi İngilizce olarak devam edecek, ancak kurulu sistem seçiminizi öntanımlı dil olarak kullanacaktır.

source: Add support for additional languages. Takes the form of comma-separated list without spaces. For example:
id: Tambahkan dukungan untuk bahasa tambahan. Berbentuk daftar yang dipisahkan koma tanpa spasi. Sebagai contoh:
tr: Ek diller için destek ekle. Aralarında boşluk olmadan virgülle ayrılmış liste şeklini alır. Örneğin:

source: lang en_US --addsupport=cs_CZ,de_DE,en_UK
tr: lang tr_TR --addsupport=cs_CZ,de_DE,en_US

source: services (optional) - Configure Services
id: services (opsional) - Konfigurasikan Layanan
tr: services (isteğe bağlı) - Hizmetleri Yapılandır

source: Modifies the default set of services that will run under the default [application]*systemd* target. The list of disabled services is processed before the list of enabled services - therefore, if a service appears on both lists, it will be enabled.
id: Memodifikasi kumpulan layanan default yang akan berjalan di bawah target [application]*systemd* default. Daftar layanan yang dinonaktifkan diproses sebelum daftar layanan yang diaktifkan - oleh karena itu, jika layanan muncul di kedua daftar, itu akan diaktifkan.
tr: Öntanımlı [application]*systemd* hedefi altında çalışacak öntanımlı hizmet kümesini değiştirir. Devre dışı bırakılan hizmetler listesi, etkinleştirilen hizmetler listesinden önce işlenir - bu nedenle, bir hizmet her iki listede de görünüyorsa, o hizmet etkinleştirilecektir.

source: [command]#services [--disabled=pass:attributes[{blank}]_list_pass:attributes[{blank}]] [--enabled=pass:attributes[{blank}]_list_pass:attributes[{blank}]]#
tr: [command]#services [--disabled=pass:attributes[{blank}]_liste_pass:attributes[{blank}]] [--enabled=pass:attributes[{blank}]_liste_pass:attributes[{blank}]]#

source: Do not include spaces in the list of services. If you do, Kickstart will enable or disable only the services up to the first space. For example:
id: Jangan sertakan spasi dalam daftar layanan. Jika Anda melakukannya, Kickstart akan mengaktifkan atau menonaktifkan hanya layanan hingga ruang pertama. Sebagai contoh:
tr: Hizmetler listesine boşluk eklemeyin. Bunu yaparsanız, Kickstart yalnızca ilk boşluk karakterine kadar olan hizmetleri etkinleştirecek veya devre dışı bırakacaktır. Örneğin:

source: The above will disable only the `auditd` service. To disable all four services, the entry should include no spaces:
id: Di atas hanya akan menonaktifkan layanan `auditd`. Untuk menonaktifkan keempat layanan, entri tidak boleh menyertakan spasi:
tr: Yukarıdaki komut yalnızca `auditd` hizmetini devre dışı bırakacaktır. Dördünü de devre dışı bırakmak için hizmetlerin arasında boşluk olmamalıdır:

source: Disable the services given in the comma separated list.
id: Nonaktifkan layanan yang diberikan dalam daftar yang dipisahkan koma.
tr: Virgülle ayrılmış listede verilen hizmetleri devre dışı bırak.

source: Enable the services given in the comma separated list.
id: Aktifkan layanan yang diberikan dalam daftar yang dipisahkan koma.
tr: Virgülle ayrılmış listede verilen hizmetleri etkinleştir.

source: skipx (optional) - Do Not Configure X Window System
id: skipx (opsional) - Jangan Konfigurasi Sistem X Window
tr: skipx (isteğe bağlı) - X Pencere Sistemini Yapılandırma

source: If present, [application]*X* will not be configured on the installed system.
id: Jika ada, [aplikasi]*X* tidak akan dikonfigurasi pada sistem yang diinstal.
tr: Belirtilirse, kurulu sistemde [application]*X* yapılandırılmayacaktır.

source: If you install a display manager among your package selection options, this package will create an [application]*X* configuration, and the installed system will default to `graphical.target`. The effect of the [command]#skipx# option will be overridden.
id: Jika Anda menginstal manajer tampilan di antara opsi pemilihan paket, paket ini akan membuat konfigurasi [application]*X*, dan sistem yang diinstal akan default ke `graphical.target`. Efek dari opsi [command]#skipx# akan ditimpa.
tr: Paket seçim seçenekleriniz arasında bir görüntü yöneticisi kurarsanız, bu paket bir [application]*X* yapılandırması oluşturacak ve kurulu sistem öntanımlı olarak `graphical.target` hedefini kullanacaktır. [command]#skipx# seçeneğinin etkisi geçersiz kılınacaktır.

source: timezone (optional) - Configure Time Zone
id: zona waktu (opsional) - Konfigurasi Zona Waktu
tr: timezone (isteğe bağlı) - Saat Dilimini Yapılandır

source: Sets the system time zone to _timezone_. To view a list of available time zones, use the [command]#timedatectl list-timezones# command.
id: Mengatur zona waktu sistem ke _timezone_. Untuk melihat daftar zona waktu yang tersedia, gunakan perintah [command]#timedatectl list-timezones#.
tr: Sistemin saat dilimini _saatdilimi_ olarak ayarlar. Kullanılabilir saat dilimlerinin listesini görüntülemek için [command]#timedatectl list-timezones# komutunu kullanın.

source: Every option, including actually specifying a time zone, is optional starting with Fedora 25. This allows you to, for example, disable NTP from starting using [option]#--nontp# without having to choose any time zone. However, if this command is present in the Kickstart file, at least one option must be used.
id: Setiap opsi, termasuk benar-benar menentukan zona waktu, adalah opsional dimulai dengan Fedora 25. Ini memungkinkan Anda, misalnya, menonaktifkan NTP dari mulai menggunakan [opsi]#--nontp# tanpa harus memilih zona waktu apa pun. Namun, jika perintah ini ada di file Kickstart, setidaknya satu opsi harus digunakan.
tr: Gerçekten bir saat dilimi belirtmek de dahil olmak üzere her seçenek, Fedora 25'ten başlayarak isteğe bağlıdır. Bu örneğin, herhangi bir saat dilimi seçmek zorunda kalmadan [option]#--nontp# seçeneğini kullanarak NTP'nin başlatılmasını devre dışı bırakmanıza olanak tanır. Ancak bu komut Kickstart dosyasında bulunursa, en az bir seçenek kullanılmalıdır.

source: [command]#timezone [pass:attributes[{blank}]_timezone_pass:attributes[{blank}]] [pass:attributes[{blank}]_options_pass:attributes[{blank}]]#
tr: [command]#timezone [pass:attributes[{blank}]_saatdilimi_pass:attributes[{blank}]] [pass:attributes[{blank}]_seçenekler_pass:attributes[{blank}]]#

source: If present, the system assumes the hardware clock is set to UTC (Greenwich Mean) time.
id: Jika ada, sistem menganggap jam perangkat keras diatur ke waktu UTC (Greenwich Mean).
tr: Belirtilirse, sistem donanım saatinin UTC (Greenwich Mean) saatine ayarlandığını varsayar.

source: Disable the NTP service automatic starting.
id: Nonaktifkan mulai otomatis layanan NTP.
tr: NTP hizmetinin otomatik başlatılmasını devre dışı bırak.

source: Specify a list of NTP servers to be used as a comma-separated list without spaces.
id: Tentukan daftar server NTP yang akan digunakan sebagai daftar yang dipisahkan koma tanpa spasi.
tr: Aralarında boşluk olmadan virgülle ayrılmış bir liste olarak kullanılacak NTP sunucularının listesini belirt.

source: xconfig (optional) - Configure X Window System
id: xconfig (opsional) - Konfigurasikan Sistem X Window
tr: xconfig (isteğe bağlı) - X Pencere Sistemini Yapılandır

source: Configures the [application]*X Window System*. If you install the [application]*X Window System* with a Kickstart file that does not include the [command]#xconfig# command, you must provide the [application]*X* configuration manually during installation.
id: Mengonfigurasi [aplikasi]*X Window System*. Jika Anda menginstal [aplikasi]*X Window System* dengan file Kickstart yang tidak menyertakan perintah [command]#xconfig#, Anda harus menyediakan konfigurasi [application]*X* secara manual selama instalasi.
tr: [application]*X Pencere Sistemini* yapılandırır. [command]#xconfig# komutunu içermeyen bir Kickstart dosyasıyla [application]*X Pencere Sistemini* kurarsanız, [application]*X* yapılandırmasını kurulum sırasında elle sağlamanız gerekmektedir.

source: Do not use this command in a Kickstart file that does not install the [application]*X Window System*.
id: Jangan gunakan perintah ini di file Kickstart yang tidak menginstal [aplikasi]*X Window System*.
tr: Bu komutu, [application]*X Pencere Sistemini* kurmayan bir Kickstart dosyasında kullanmayın.

source: Specify either `GNOME` or `KDE` to set the default desktop (assumes that [application]*GNOME Desktop Environment* and/or [application]*KDE Desktop Environment* has been installed in the [command]#%packages# section).
id: Tentukan `GNOME` atau `KDE` untuk mengatur desktop default (dengan asumsi bahwa [aplikasi]*GNOME Desktop Environment* dan/atau [application]*KDE Desktop Environment* telah diinstal di bagian [command]#%packages#) .
tr: Öntanımlı masaüstünü ayarlamak için `GNOME` veya `KDE` belirt ([command]#%packages# bölümünde [application]*GNOME Masaüstü Ortamı* ve/veya [application]*KDE Masaüstü Ortamı*'nın kurulduğu varsayılır).

source: Use a graphical login on the installed system.
id: Gunakan login grafis pada sistem yang diinstal.
tr: Kurulu sistemde grafiksel bir oturum açma kullan.

source: Users, Groups and Authentication
id: Pengguna, Grup, dan Otentikasi
tr: Kullanıcılar, Gruplar ve Kimlik Doğrulama

source: The commands below are used to control user accounts, groups, and related areas.
id: Perintah di bawah ini digunakan untuk mengontrol akun pengguna, grup, dan area terkait.
tr: Aşağıdaki komutlar kullanıcı hesaplarını, grupları ve ilgili alanları denetlemek için kullanılmaktadır.

source: auth or authconfig (optional) - Configure Authentication (deprecated)
tr: auth veya authconfig (isteğe bağlı) - Kimlik Doğrulamayı Yapılandır (kullanımdan kaldırıldı)

source: This command has been deprecated by [command]#authselect#. Using it will invoke the authconfig compatibility tool; however, it is highly recommended to use [command]#authselect# instead.
tr: Bu komut, [command]#authselect# komutu tarafından kullanımdan kaldırıldı. Bunu kullanmak, authconfig uyumluluk aracını çalıştıracaktır; ancak bunun yerine [command]#authselect# komutunun kullanılması şiddetle tavsiye edilir.

source: Sets up the authentication options for the system using the [command]#authconfig# command, which can also be run on a command line after the installation finishes. See the `authconfig(8)` manual page and the [command]#authconfig --help# command for more details. Passwords are shadowed by default.
id: Mengatur opsi otentikasi untuk sistem menggunakan perintah [command]#authconfig#, yang juga dapat dijalankan pada baris perintah setelah penginstalan selesai. Lihat halaman manual `authconfig(8)` dan perintah [command]#authconfig --help# untuk lebih jelasnya. Kata sandi dibayangi secara default.
tr: Kurulum tamamlandıktan sonra komut satırı aracılığıyla da çalıştırılabilen [command]#authconfig# komutunu kullanarak sistem için kimlik doğrulama seçeneklerini ayarlar. Daha fazla ayrıntı için `authconfig(8)` kılavuz sayfasına ve [command]#authconfig --help# komutuna bakın. Parolalar öntanımlı olarak gölgelenmektedir.

source: authselect (optional) - Configure Authentication
tr: authselect (isteğe bağlı) - Kimlik Doğrulamayı Yapılandır

source: This command sets up the authentication options for the system. This is just a wrapper around the [command]#authselect# program, so all options recognized by that program are valid for this command. See the `authselect(8)` for a complete list. Passwords are shadowed by default.
tr: Bu komut, sistem için kimlik doğrulama seçeneklerini ayarlar. Bu, yalnızca [command]#authselect# programının etrafında bir sarmalayıcıdır, dolayısıyla o program tarafından tanınan tüm seçenekler bu komut için geçerlidir. Tam bir liste için `authselect(8)` kılavuz sayfasına bakın. Parolalar öntanımlı olarak gölgelenmektedir.

source: group (optional) - Create User Group
id: grup (opsional) - Buat Grup Pengguna
tr: group (isteğe bağlı) - Kullanıcı Grubu Oluştur

source: Creates a new user group on the system. If a group with the given name or GID already exists, this command will fail. In addition, the [command]#user# command can be used to create a new group for the newly created user.
id: Membuat grup pengguna baru di sistem. Jika grup dengan nama atau GID yang diberikan sudah ada, perintah ini akan gagal. Selain itu, perintah [command]#user# dapat digunakan untuk membuat grup baru bagi pengguna yang baru dibuat.
tr: Sistemde yeni bir kullanıcı grubu oluşturur. Belirtilen ada veya kimliğe (GID) sahip bir grup zaten varsa bu komut başarısız olacaktır. Ayrıca, yeni oluşturulan kullanıcı için yeni bir grup oluşturmak için [command]#user# komutu kullanılabilir.

source: [command]#group --name=pass:attributes[{blank}]_name_ [--gid=pass:attributes[{blank}]_gid_pass:attributes[{blank}]]#
tr: [command]#group --name=pass:attributes[{blank}]_ad_ [--gid=pass:attributes[{blank}]_kimlik_pass:attributes[{blank}]]#

source: Provides the name of the group.
id: Memberikan nama grup.
tr: Grubun adını belirtir.

source: The group ID (GID). If not provided, defaults to the next available non-system GID.
id: ID grup (GID). Jika tidak disediakan, defaultnya adalah GID non-sistem yang tersedia berikutnya.
tr: Grup kimliği (GID). Belirtilmezse, öntanımlı olarak bir sonraki kullanılabilir sistem dışı kimlik kullanılır.
