Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/appendixes/Kickstart_Syntax_Reference.po
Languages: id, tr

source: The [command]#poweroff# command is highly dependent on the system hardware in use. Specifically, certain hardware components such as the BIOS, APM (advanced power management), and ACPI (advanced configuration and power interface) must be able to interact with the system kernel. Consult your hardware documentation for more information on you system's APM/ACPI abilities.
id: Perintah [command]#poweroff# sangat bergantung pada perangkat keras sistem yang digunakan. Secara khusus, komponen perangkat keras tertentu seperti BIOS, APM (manajemen daya lanjutan), dan ACPI (konfigurasi lanjutan dan antarmuka daya) harus dapat berinteraksi dengan kernel sistem. Konsultasikan dokumentasi perangkat keras Anda untuk informasi lebih lanjut tentang kemampuan APM/ACPI sistem Anda.
tr: [command]#poweroff# komutu, büyük ölçüde kullanılan sistem donanımına bağlıdır. Özellikle BIOS, APM (advanced power management - gelişmiş güç yönetimi) ve ACPI (advanced configuration and power interface - gelişmiş yapılandırma ve güç arayüzü) gibi belirli donanım bileşenlerinin sistem çekirdeğiyle etkileşime girebilmesi gerekir. Sisteminizin APM/ACPI yetenekleri hakkında daha fazla bilgi için donanımınızın belgelendirmesine bakın.

source: For other completion methods, see the [command]#halt#, [command]#reboot#, and [command]#shutdown# Kickstart commands.
id: Untuk metode penyelesaian lainnya, lihat perintah [command]#halt#, [command]#reboot#, dan [command]#shutdown# Kickstart.
tr: Diğer tamamlama yöntemleri için [command]#halt#, [command]#reboot# ve [command]#shutdown# Kickstart komutlarına bakın.

source: reboot (optional) - Reboot After Installation
id: reboot (opsional) - Reboot Setelah Instalasi
tr: reboot (isteğe bağlı) - Kurulumdan Sonra Yeniden Başlat

source: Reboot after the installation is successfully completed. If you are installing {PRODUCT} on IBM System{nbsp}z in command line mode (using xref:sect-kickstart-commands-cmdline[cmdline (optional) - Perform Installation in Command Line Mode]), this command is necessary for a fully automated installation.
tr: Kurulum başarıyla tamamlandıktan sonra yeniden başlat. {PRODUCT}'yı IBM System{nbsp}z üzerinde komut satırı modunda kuruyorsanız (xref:sect-kickstart-commands-cmdline[cmdline (isteğe bağlı) - Kurulumu Komut Satırı Modunda Gerçekleştir] kullanarak), bu komut bir tam otomatik kurulum için gereklidir.

source: For other completion methods, see the [command]#halt#, [command]#poweroff#, and [command]#shutdown# Kickstart options.
id: Untuk metode penyelesaian lainnya, lihat opsi [command]#halt#, [command]#poweroff#, dan [command]#shutdown# Kickstart.
tr: Diğer tamamlama yöntemleri için [command]#halt#, [command]#poweroff# ve [command]#shutdown# Kickstart seçeneklerine bakın.

source: Use of the [command]#reboot# command *may* result in an endless installation loop, depending on the installation media and method.
id: Penggunaan perintah [command]#reboot# *dapat* mengakibatkan pengulangan penginstalan tanpa akhir, tergantung pada media dan metode penginstalan.
tr: [command]#reboot# komutunun kullanılması, kurulum ortamına ve yöntemine bağlı olarak sonsuz bir kurulum döngüsüyle *sonuçlanabilir*.

source: Attempt to eject the installation media (if installing from a DVD) before rebooting.
id: Cobalah untuk mengeluarkan media instalasi (jika menginstal dari DVD) sebelum mem-boot ulang.
tr: Yeniden başlatmadan önce kurulum ortamını (DVD'den kurulum yapıyorsanız) çıkarmayı dene.

source: Use this option to reboot into the new system using the `kexec` kernel switching mechanism instead of a full reboot, bypassing the BIOS/Firmware and boot loader.
id: Gunakan opsi ini untuk mem-boot ulang ke sistem baru menggunakan mekanisme peralihan kernel `kexec` alih-alih reboot penuh, melewati BIOS/Firmware dan boot loader.
tr: Tam bir yeniden başlatma yerine `kexec` çekirdek değiştirme mekanizmasını kullanıp BIOS/ürün yazılımı ve önyükleyiciyi atlayarak yeni sistemi yeniden başlatmak için bu seçeneği kullanın.

source: shutdown (optional) - Shut Down After Installation
id: shutdown (opsional) - Matikan Setelah Instalasi
tr: shutdown (isteğe bağlı) - Kurulumdan Sonra Kapat

source: Shut down the system after the installation has successfully completed.
id: Matikan sistem setelah instalasi berhasil diselesaikan.
tr: Kurulum başarıyla tamamlandıktan sonra sistemi kapat.

source: For other completion methods, see the [command]#halt#, [command]#poweroff#, and [command]#reboot# Kickstart options.
id: Untuk metode penyelesaian lainnya, lihat opsi [command]#halt#, [command]#poweroff#, dan [command]#reboot# Kickstart.
tr: Diğer tamamlama yöntemleri için [command]#halt#, [command]#poweroff# ve [command]#reboot# Kickstart seçeneklerine bakın.

source: %addon (optional) - Include an Anaconda Add-on
id: %addon (opsional) - Sertakan Pengaya Anaconda
tr: %addon (isteğe bağlı) - Bir Anaconda Eklentisi Dahil Et

source: You can expand the basic [application]*Anaconda* and Kickstart functionality by using custom add-ons specified using the [command]#%addon# section.
id: Anda dapat memperluas fungsionalitas dasar [aplikasi]*Anaconda* dan Kickstart dengan menggunakan add-on khusus yang ditentukan menggunakan bagian [command]#%addon#.
tr: [command]#%addon# bölümünde belirtilen özel eklentileri kullanarak temel [application]*Anaconda* ve Kickstart işlevselliğini genişletebilirsiniz.

source: To use an add-on in your Kickstart file, add the [command]#%addon _addon_name_ _options_pass:attributes[{blank}]# command. The section must be closed with an [command]#%end# statement. For example, to use the [application]*Kdump* add-on, which is included by default on some installations, use the following block:
id: Untuk menggunakan add-on di file Kickstart Anda, tambahkan perintah [command]#%addon _addon_name_ _options_pass:attributes[{blank}]#. Bagian harus ditutup dengan pernyataan [command]#%end#. Misalnya, untuk menggunakan add-on [application]*Kdump*, yang disertakan secara default pada beberapa instalasi, gunakan blok berikut:
tr: Kickstart dosyanızda bir eklenti kullanmak için [command]#%addon _eklenti_adı_ _seçenekler_pass:attributes[{blank}]# komutunu ekleyin. Bölüm, bir [command]#%end# ifadesi ile kapatılmalıdır. Örneğin, bazı kurulumlarda öntanımlı olarak bulunan [application]*Kdump* eklentisini kullanmak için aşağıdaki bloğu kullanın:

source: The [command]#%addon# section does not have any options of its own; all options depend on the add-on being used.
id: Bagian [command]#%addon# tidak memiliki opsi sendiri; semua opsi tergantung pada add-on yang digunakan.
tr: [command]#%addon# bölümünün kendi seçeneği yoktur; tüm seçenekler, kullanılan eklentiye bağlıdır.

source: For more information about [application]*Anaconda* add-ons, see the link:++https://vpodzime.fedorapeople.org/anaconda-addon-development-guide/++[Fedora Anaconda Addon Development Guide].
id: Untuk informasi lebih lanjut tentang [aplikasi]*Anaconda* add-on, lihat tautan:++https://vpodzime.fedorapeople.org/anaconda-addon-development-guide/++[Fedora Anaconda Addon Development Guide].
tr: [application]*Anaconda* eklentileri hakkında daha fazla bilgi için link:++https://vpodzime.fedorapeople.org/anaconda-addon-development-guide/++[Fedora Anaconda Eklenti Geliştirme Kılavuzuna] bakın.

source: %anaconda (optional) - Additional Anaconda Configuration
id: %anaconda (opsional) - Konfigurasi Anaconda Tambahan
tr: %anaconda (optional) - Ek Anaconda Yapılandırması

source: This section, introduced in {PRODUCT} 22, is used to specify additional configuration options for the installer. Commands inside this section only control the behavior during installation, not on the installed system. The only command currently available inside this section is xref:sect-kickstart-commands-pwpolicy[pwpolicy (optional) - Change the Default Password Policy]. The [command]#%anaconda# section must end with `%end`.
tr: {PRODUCT} 22'de tanıtılan bu bölüm, kurucu için ek yapılandırma seçeneklerini belirtmek için kullanılır. Bu bölümdeki komutlar yalnızca kurulum sırasındaki davranışı denetler, kurulu sistemdeki değil. Bu bölümde şu anda kullanılabilen tek komut xref:sect-kickstart-commands-pwpolicy[pwpolicy (isteğe bağlı) - Öntanımlı Parola Politikasını Değiştir] komutudur. [command]#%anaconda# bölümü `%end` ile bitmelidir.

source: In interactive installations (using the graphical or text interface), the `/usr/share/anaconda/interactive-defaults.ks` file contains the default [command]#%anaconda# section. To change the defaults, you must create a `product.img` file with a Kickstart file replacing the default one, and pass this file to [application]*Anaconda* using a boot option.
id: Dalam instalasi interaktif (menggunakan antarmuka grafis atau teks), file `/usr/share/anaconda/interactive-defaults.ks` berisi bagian [command]#%anaconda# default. Untuk mengubah default, Anda harus membuat file `product.img` dengan file Kickstart menggantikan file default, dan meneruskan file ini ke [application]*Anaconda* menggunakan opsi boot.
tr: Etkileşimli kurulumlarda (grafiksel veya metin arayüzü kullanılarak), `/usr/share/anaconda/interactive-defaults.ks` dosyası öntanımlı [command]#%anaconda# bölümünü içerir. Öntanımlı değerleri değiştirmek için, öntanımlı olanın yerini alan bir Kickstart dosyasıyla bir `product.img` dosyası oluşturmalı ve bu dosyayı bir önyükleme seçeneği kullanarak [application]*Anaconda*'ya iletmelisiniz.

source: When using a Kickstart file, you can override the default [command]#%anaconda# section by using the section again in your custom Kickstart.
id: Saat menggunakan file Kickstart, Anda dapat mengganti bagian [command]#%anaconda# default dengan menggunakan bagian itu lagi di Kickstart kustom Anda.
tr: Bir Kickstart dosyası kullanırken, özel Kickstart dosyanızda bölümü tekrar kullanarak öntanımlı [command]#%anaconda# bölümünü geçersiz kılabilirsiniz.

source: %include (optional) - Include Contents of Another File
id: %include (opsional) - Sertakan Isi File Lain
tr: %include (isteğe bağlı) - Başka Bir Dosyanın İçeriğini Dahil Et

source: Use the [command]#%include _/path/to/file_pass:attributes[{blank}]# command to include the contents of another file in the Kickstart file as though the contents were at the location of the [command]#%include# command in the Kickstart file.
id: Gunakan perintah [command]#%include _/path/to/file_pass:attributes[{blank}]# untuk memasukkan konten file lain ke file Kickstart seolah-olah konten berada di lokasi [command]#% sertakan# perintah di file Kickstart.
tr: Başka bir dosyanın içeriğini, içerikler [command]#%include# komutunun bulunduğu konumdaymış gibi Kickstart dosyasına dahil etmek için [command]#%include _/dosyanın/yolu_pass:attributes[{blank}]# komutunu kullanın.

source: %ksappend (optional) - Append Contents of Another File
id: %ksappend (opsional) - Tambahkan Isi File Lain
tr: %ksappend (isteğe bağlı) - Başka Bir Dosyanın İçeriğini Ekle

source: The [command]#%ksappend _url_pass:attributes[{blank}]# directive is very similar to xref:sect-kickstart-commands-include[%include (optional) - Include Contents of Another File] in that it is used to include the contents of additional files as though they were at the location of the [command]#%ksappend# command. The difference is in when the two directives are processed.
tr: [command]#%ksappend _URL_pass:attributes[{blank}]# komutu, sanki [command]#%ksappend# komutunun bulunduğu konumdaymış gibi ek dosyaların içeriğini dahil etmek için kullanıldığı için xref:sect-kickstart-commands-include[%include (isteğe bağlı) - Başka Bir Dosyanın İçeriğini Dahil Et] komutuna çok benzer. Aralarındaki fark, iki komutun ne zaman işlendiğidir.

source: [command]#%ksappend# is processed in an initial pass, before any other part of the Kickstart file. Then, this expanded Kickstart file is passed to the rest of [application]*Anaconda* where all [command]#%pre# scripts are handled, and then finally the rest of the Kickstart file is processed in order, which includes [command]#%include# directives.
id: [command]#%ksappend# diproses dalam pass awal, sebelum bagian lain dari file Kickstart. Kemudian, file Kickstart yang diperluas ini diteruskan ke [aplikasi]*Anaconda* lainnya di mana semua skrip [command]#%pre# ditangani, dan akhirnya sisa file Kickstart diproses secara berurutan, termasuk [command] #%include# arahan.
tr: [command]#%ksappend#, Kickstart dosyasının diğer bölümlerinden önceki bir ilk geçişte işlenir. Ardından bu genişletilen Kickstart dosyası, tüm [command]#%pre# betiklerinin işlendiği [application]*Anaconda*'nın geri kalanına iletilir ve son olarak, [command]#%include# komutları içeren Kickstart dosyasının geri kalanı sırayla işlenir.

source: Therefore, [command]#%ksappend# provides a way to include a file containing [command]#%pre# scripts, while [command]#%include# does not.
id: Oleh karena itu, [command]#%ksappend# menyediakan cara untuk menyertakan file yang berisi skrip [command]#%pre#, sedangkan [command]#%include# tidak.
tr: Bu nedenle [command]#%ksappend# komutu, [command]#%pre# betiklerini içeren bir dosyayı dahil etmenin bir yolunu sağlarken [command]#%include# bunu sağlamaz.

source: %packages (required) - Package Selection
id: %paket (wajib) - Pemilihan Paket
tr: %packages (gerekli) - Paket Seçimi

source: Use the [command]#%packages# command to begin a Kickstart section which describes the software packages to be installed. This section must end with an [command]#%end# statement.
id: Gunakan perintah [command]#%packages# untuk memulai bagian Kickstart yang menjelaskan paket perangkat lunak yang akan diinstal. Bagian ini harus diakhiri dengan pernyataan [command]#%end#.
tr: Kurulacak yazılım paketlerini açıklayan bir Kickstart bölümüne başlamak için [command]#%packages# komutunu kullanın. Bu bölüm bir [command]#%end# ifadesi ile bitmelidir.

source: You can specify packages by _environment_, _group_, or by their package names. Several environments and groups that contain related packages are defined. See the `repodata/comps.xml` file in your installation source for environment and group definitions.
id: Anda dapat menentukan paket menurut _environment_, _group_, atau dengan nama paketnya. Beberapa lingkungan dan grup yang berisi paket terkait ditentukan. Lihat file `repodata/comps.xml` di sumber instalasi Anda untuk definisi lingkungan dan grup.
tr: Paketleri _ortam_, _grup_ veya paket adlarına göre belirtebilirsiniz. İlgili paketleri içeren çeşitli ortamlar ve gruplar tanımlanmıştır. Ortam ve grup tanımları için kurulum kaynağınızdaki `repodata/comps.xml` dosyasına bakın.

source: The `comps.xml` file contains a structure describing available environments (marked by the `<environment>` tag) and groups (the `<group>` tag). Each entry has an ID, user visibility value, name, description, and package list. If the group is selected for installation, the packages marked `mandatory` in the package list are always installed, the packages marked `default` are installed if they are not specifically excluded, and the packages marked `optional` must be specifically included even when the group is selected.
id: File `comps.xml` berisi struktur yang menjelaskan lingkungan yang tersedia (ditandai dengan tag `<environment>`) dan grup (tag `<group>`). Setiap entri memiliki ID, nilai visibilitas pengguna, nama, deskripsi, dan daftar paket. Jika grup dipilih untuk penginstalan, paket bertanda `mandatory` dalam daftar paket selalu diinstal, paket bertanda `default` diinstal jika tidak secara khusus dikecualikan, dan paket bertanda `opsional` harus disertakan secara khusus bahkan ketika kelompok dipilih.
tr: `comps.xml` dosyası, kullanılabilir ortamları (`<environment>` etiketiyle işaretlenir) ve grupları (`<group>` etiketiyle işaretlenir) açıklayan bir yapı içerir. Her girdinin bir kimliği, kullanıcı görünürlük değeri, adı, açıklaması ve paket listesi vardır. Kurulum için grup seçilirse, paket listesinde `mandatory` olarak işaretlenen paketler her zaman kurulur, `default` olarak işaretlenen paketler özellikle hariç tutulmamışlarsa kurulur ve `default` olarak işaretlenen paketler grup seçilmiş olsa bile özellikle dahil edilmelidir.

source: You can specify a package group or environment using either its ID (the `<id>` tag) or name (the `<name>` tag).
id: Anda dapat menentukan grup paket atau lingkungan menggunakan ID-nya (tag `<id>`) atau nama (tag `<name>`).
tr: Kimliğini (`<id>` etiketi) veya adını (`<name>` etiketi) kullanarak bir paket grubu veya ortamı belirtebilirsiniz.

source: To install a 32-bit package on a 64-bit system, you will need to append the package name with the 32-bit architecture for which the package was built - for example, [package]*glibc.i686*. The [option]#--multilib# option also must be specified in the Kickstart file; see the available options below.
id: Untuk menginstal paket 32-bit pada sistem 64-bit, Anda perlu menambahkan nama paket dengan arsitektur 32-bit yang digunakan untuk membuat paket - misalnya, [paket]*glibc.i686*. Opsi [option]#--multilib# juga harus ditentukan dalam file Kickstart; lihat opsi yang tersedia di bawah ini.
tr: 64 bitlik bir sisteme 32 bitlik bir paket kurmak için, paketin oluşturulduğu 32 bit mimariye sahip paket adını eklemeniz gerekir - örneğin, [package]*glibc.i686*. Ayrıca [option]#--multilib# seçeneği Kickstart dosyasında belirtilmelidir; aşağıdaki kullanılabilir seçeneklere bakın.

source: [application]*Initial Setup* does not run after a system is installed from a Kickstart file unless a desktop environment and the [application]*X Window System* were included in the installation and graphical login was enabled. This means that by default, no users except for `root` will be created. You can either create a user with the [option]#user# option in the Kickstart file before installing additional systems from it (see xref:sect-kickstart-commands-user[user (optional) - Create User Account] for details) or log into the installed system with a virtual console as `root` and add users with the [command]#useradd# command.
tr: [application]*İlk Kurulum*, bir masaüstü ortamı ve [application]*X Pencere Sistemi* kuruluma dahil edilmedikçe ve grafiksel oturum açma etkinleştirilmedikçe, bir sistem Kickstart dosyasından kurulduktan sonra çalıştırılmaz. Bu, öntanımlı olarak `root` dışında hiçbir kullanıcının oluşturulmayacağı anlamına gelir. Ek sistemler kurmadan önce Kickstart dosyasında [option]#user# seçeneğiyle bir kullanıcı oluşturabilirsiniz (ayrıntılar için xref:sect-kickstart-commands-user[user (isteğe bağlı) - Kullanıcı Hesabı Oluştur] bölümüne bakın) veya kurulu sistemde sanal bir konsolla `root` olarak oturum açıp [command]#useradd# komutuyla kullanıcılar ekleyebilirsiniz.

source: Specifying Environments, Groups and Packages
id: Menentukan Lingkungan, Grup, dan Paket
tr: Ortamları, Grupları ve Paketleri Belirtme

source: Specifying an Environment
id: Menentukan Lingkungan
tr: Bir Ortam Belirtme

source: In addition to groups, you specify an entire environment to be installed:
id: Selain grup, Anda menentukan seluruh lingkungan yang akan diinstal:
tr: Gruplara ek olarak, tamamıyla kurulacak bir ortamı belirtebilirsiniz:

source: This command will install all packages which are part of the `Infrastracture Server` environment. All available environments are described in the `comps.xml` file.
id: Perintah ini akan menginstal semua paket yang merupakan bagian dari lingkungan `Infrastructure Server`. Semua lingkungan yang tersedia dijelaskan dalam file `comps.xml`.
tr: Bu komut, `Infrastracture Server` ortamının parçası olan tüm paketleri kuracaktır. Kullanılabilir tüm ortamlar `comps.xml` dosyasında açıklanmaktadır.

source: Specifying Groups
id: Menentukan Grup
tr: Grupları Belirtme

source: Specify groups, one entry to a line, starting with an `@` symbol, and then the full group name or group id as given in the `comps.xml` file. For example:
id: Tentukan grup, satu entri ke satu baris, dimulai dengan simbol `@`, lalu nama grup lengkap atau id grup seperti yang diberikan dalam file `comps.xml`. Sebagai contoh:
tr: Her satır `@` simgesiyle başlayacak ve ardından `comps.xml` dosyasında belirtilen tam grup adını veya grup kimliğini içerecek biçimde grupları belirt. Örneğin:

source: The `Core` and `Base` groups are always selected - it is not necessary to specify them in the [command]#%packages# section.
id: Grup `Core` dan `Base` selalu dipilih - tidak perlu menentukannya di bagian [command]#%packages#.
tr: `Core` ve `Base` gruplar her zaman seçilir - bunları [command]#%packages# bölümünde belirtmeniz gerekmez.

source: The `comps.xml` file also defines groups called `Conflicts (_variant_)` for each variant of {PRODUCT}. This group contains all packages which are known to cause file conflicts, and is intended to be excluded.
id: File `comps.xml` juga mendefinisikan grup yang disebut `Konflik (_varian_)` untuk setiap varian {PRODUCT}. Grup ini berisi semua paket yang diketahui menyebabkan konflik file, dan dimaksudkan untuk dikecualikan.
tr: `comps.xml` dosyası, {PRODUCT}'nın her bir çeşidi için `Conflicts (_çeşit_)` adlı grupları da tanımlar. Bu grup, dosya çakışmalarına neden olduğu bilinen ve hariç tutulması amaçlanan tüm paketleri içermektedir.

source: Specifying Individual Packages
id: Menentukan Paket Individu
tr: Tek Tek Paketleri Belirtme

source: Specify individual packages by name, one entry to a line. You can use the asterisk character (`*`) as a _wildcard_ in package names. For example:
id: Tentukan paket individu dengan nama, satu entri ke baris. Anda dapat menggunakan karakter asterisk (`*`) sebagai _wildcard_ dalam nama paket. Sebagai contoh:
tr: Her satırda bir girdi olacak şekilde tek tek paketleri adlarıyla belirt. Paket adlarında yıldız karakterini (`*`) _joker_ _karakter_ olarak kullanabilirsiniz. Örneğin:

source: The `docbook*` entry includes the packages [package]*docbook-dtds*, [package]*docbook-simple*, [package]*docbook-slides* and others that match the pattern represented with the wildcard.
id: Entri `docbook*` mencakup paket [paket]*docbook-dtds*, [paket]*docbook-simple*, [paket]*docbook-slides* dan lainnya yang cocok dengan pola yang diwakili dengan karakter pengganti.
tr: `docbook*` girdisi; [package]*docbook-dtds*, [package]*docbook-simple*, [package]*docbook-slides* paketlerini ve joker karakterle temsil edilen modelle eşleşen diğerlerini içerir.

source: Excluding Environments, Groups, or Packages
id: Tidak termasuk Lingkungan, Grup, atau Paket
tr: Ortamları, Grupları veya Paketleri Hariç Tutma

source: Use a leading dash (`-`) to specify packages or groups to exclude from the installation. For example:
id: Gunakan tanda hubung (`-`) di depan untuk menentukan paket atau grup yang akan dikecualikan dari penginstalan. Sebagai contoh:
tr: Kurulumdan hariç tutulacak paketleri veya grupları belirtmek için satır başında tire karakteri (`-`) kullanın. Örneğin:

source: Installing all available packages using only `*` in a Kickstart file is not supported, even if you exclude the `@Conflicts (_variant_)` group.
id: Menginstal semua paket yang tersedia hanya menggunakan `*` dalam file Kickstart tidak didukung, bahkan jika Anda mengecualikan grup `@Konflik (_variant_)`.
tr: `@Conflicts (_çeşit_)` grubunu hariç tutsanız bile, bir Kickstart dosyasında yalnızca `*` kullanılarak kullanılabilir tüm paketlerin kurulması desteklenmemektedir.
