Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/install/After_Installation.po
Languages: pt_br

source: After the Installation
pt_br: Após a Instalação

source: This chapter describes the initial setup tools which open after you finish the installation, reboot the system, and log in for the first time.
pt_br: Este capítulo descreve as ferramentas de configuração inicial que abrem após você finalizar a instalação, reiniciar o sistema, e fazer login pela primeira vez.

source: Two separate configuration tools are part of {PRODUCT}. If you installed the [application]*GNOME* desktop environment (the default {PRODUCT} environment, installed for example as part of the {PRODUCT} Workstation Edition), the [application]*GNOME Initial Setup* utility will open; for all other graphical environments, the [application]*Initial Setup* tool serves the same purpose.
pt_br: Duas ferramentas de configuração separadas são parte do {PRODUCT}. Se você instalou o ambiente de trabalho [application]*GNOME* (o ambiente de trabalho padrão do {PRODUCT}, instalado por exemplo como parte da Edição {PRODUCT} Workstation), o utilitário [application]*Definições Iniciais do GNOME* abrirá; para todos os outros ambientes gráficos, a ferramenta [application]*Definições Iniciais* serve ao mesmo propósito.

source: Both of these tools will allow you to configure user-specific settings which have not been configured during the installation. Some of the settings are available both in the graphical installer (or as Kickstart commands) as well as in the initial-setup utilities; in that case, they will only be displayed after the first reboot if you skipped them during the installation. This means that, for example, if you configured a user account before the installation finished, you will not be prompted to do so again after the installation completes.
pt_br: Ambas as ferramentas permitirão que você defina configurações específicas de usuário que não foram definidas durante a instalação. Algumas dessas configurações estão disponíveis tanto no instalador gráfico (ou como comandos do Kickstart) quanto no utilitário de definições iniciais; nesse caso, elas serão exibidas apenas depois da primeira reinicialização se você as pulou durante a instalação. Isso significa que, por exemplo, se você configurou uma conta de usuário antes da instalação terminar, não será solicitado que você faça isso novamente depois que a instalação concluir.

source: GNOME Initial Setup
pt_br: Definições Iniciais do GNOME

source: The [application]*GNOME Initial Setup* utility will be displayed after you log in for the first time with any user account, as long as your first login is in the [application]*GNOME* desktop environment.
pt_br: O utilitário [application]*Definições Inicias do GNOME* será exibido depois que você fizer login pela primeira vez com qualquer conta de usuário, desde que seu primeiro login seja no ambiente de trabalho [application]*GNOME*.

source: GNOME Initial Setup with language selection displayed.
pt_br: Definições Iniciais do GNOME com a seleção do idioma exibida.

source: This utility allows you to configure several user-specific settings, such as system language or the default keyboard layout. Use the `Next` and `Previous` buttons at the top of the window to navigate between screens. Some screens (`Configure online accounts` in particular) are optional and can be skipped using the `Skip` button in the top right corner.
pt_br: Este utilitário permite que você defina diversas configurações específicas de usuário, como o idioma do sistema ou o layout padrão do teclado. Use os botões `Próximo` e `Anterior` no topo da janela para navegar entre as telas. Algumas telas (`Configure contas online` em particular) são opcionais e podem ser puladas usando o botão `Ignorar` no canto superior direito.

source: After you finish configuring all screens, click `Start using Fedora` to exit the utility. After that, the `Getting Started` page from GNOME help will be displayed, and you can either browse the help content, or close it and start using your desktop.
pt_br: Depois que você terminar de configurar todas as telas, clique em `Começar a usar o Fedora` para sair do utilitário. Após isso, a página `Primeiros passos` da Ajuda do GNOME será exibida, e você pode navegar pelo conteúdo de ajuda, ou fechá-la e começar a usar seu desktop.

source: Common Post-installation Tasks
pt_br: Tarefas Comuns de Pós-instalação

source: After you finish the installation and go through one of the initial setup utilities described above, your system is ready for use. However, other administrative tasks not covered by the installer or the initial setup utilities may still be necessary, depending on how you plan to use your system. The list below describes some of the more common tasks usually performed immediately after a new installation.
pt_br: Depois que você finalizar a instalação e passar por algum dos utilitários de definições iniciais descrito acima, seus sistema está pronto para uso. Entretanto, outras tarefas administrativas não cobertas pelo instalador ou pelos utilitários de configurações iniciais ainda podem ser necessárias, dependendo de como você planeja usar seu sistema. A lista abaixo descreve algumas das tarefas mais comuns geralmente performadas imediatamente após uma nova instalação.

source: Recover a lost `root` password
pt_br: Recupere uma senha `root` perdida

source: The `root` password, which is configured during the installation, is required for accessing the system as the `root` user. Without this password you will not be able to configure your system or install additional software. If you lost or forgot your `root` password, you can reset it by following the steps described in xref:install/Troubleshooting.adoc#sect-trouble-after-reset-root-password[Resetting the Root Password].
pt_br: A senha `root`, que é definida durante a instalação, é necessária para acessar o sistema como o usuário `root`. Sem essa senha você não será capaz de configurar seu sistema ou instalar softwares adicionais. Se você perdeu ou esqueceu sua senha `root`, você pode redefini-la seguindo os passos descritos em xref:install/Troubleshooting.adoc#sect-trouble-after-reset-root-password[Redefinindo a Senha Root].

source: Configure the network
pt_br: Configure a rede

source: In most cases, network access is configured during the installation process, either in the [application]*Anaconda* installation program (see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Network & Hostname]) or in a Kickstart file (see xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-network[network (optional) - Configure Network Interfaces]). For information on configuring the network after the installation, see the [citetitle]_{PRODUCT} Networking Guide_, available at link:++https://docs.fedoraproject.org/++[].
pt_br: Na maioria dos casos, o acesso a rede é configurado durante o processo de instalação, tanto no programa de instalação [application]*Anaconda* (veja xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Rede e Nome de Host]) ou em um arquivo Kickstart (veja xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-network[rede (opcional) - Configure Interfaces de Rede]). Para informações sobre configurar a rede após a instalação, veja o [citetitle]_Guia de Rede do {PRODUCT}_ disponível em link:++https://docs.fedoraproject.org/++[].

source: Perform an initial system update
pt_br: Faça uma atualização inicial do sistema

source: If you installed {PRODUCT} from a full installation ISO image (such as the Workstation live image or full Server DVD), it is recommended to perform an initial system update, because your installation media likely contained older versions of software packages. During the initial update, all installed packages are updated to their latest available versions. Updates to packages provide security fixes, bug fixes and enhancements.
pt_br: Se você instalou o {PRODUCT} de uma imagem ISO de instalação completa (como a imagem live do Workstation ou o DVD completo do Server), é recomendado realizar uma atualização inicial do sistema, porque sua mídia de instalação provavelmente contém versões antigas de pacotes de software. Durante a atualização inicial, todos os pacotes instalados são atualizados para suas últimas versões disponíveis. As atualizações para os pacotes fornecem correções de segurança, correções de bugs e melhorias.

source: The [application]*DNF* package manager is used for updating installed packages. For more information about updating your system with [application]*DNF*, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++http://docs.fedoraproject.org/++[].
pt_br: O gerenciador de pacotes [application]*DNF* é usado para atualização dos pacotes instalados. Para mais informação sobre atualização do seu sistema com o [application]*DNF*, veja o [citetitle]_Guia de Administradores de Sistema do {PRODUCT}_, disponível em link:++https://docs.fedoraproject.org/++[].

source: Install driver updates
pt_br: Instale atualizações de driver

source: Usually, drivers for system devices are already supported in the kernel provided by Red{nbsp}Hat Enterprise{nbsp}Linux. However, occasionally, support for devices that have been released recently could be missing. In these cases, a driver update enabling your device may be available.
pt_br: Geralmente, drivers para os dispositivos do sistema já são suportados no kernel provido pela Red{nbsp}Hat Enterprise{nbsp}Linux. Entretanto, ocasionalmente, o suporte para dispositivos que foram lançados recentemente pode estar faltando. Nesses casos, uma atualização de driver habilitando o seu dispositivo pode estar disponível.

source: Devices necessary to complete the installation can have driver updates provided before the installation begins. If a device is missing a driver, but it is not essential during the installation, it is recommended to wait until after the installation completes, and install additional drivers afterwards. For instructions on installing and enabling additional drivers on the installed system using [application]*RPM* and [application]*DNF*, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++http://docs.fedoraproject.org/++[].
pt_br: Dispositivos necessários para completar a instalação podem ter atualizações de driver providas antes da instalação começar. Se um dispositivo está sem um driver, mas não é essencial durante a instalação, é recomendado esperar até depois da instalação completar, e instalar os drivers adicionais depois disso. Para instruções sobre instalar e habilitar drivers adicionais no sistema instalado usando [application]*RPM* e [application]*DNF*, veja o [citetitle]_Guia de Administradores de Sistema do {PRODUCT}_, disponível em link:++https://docs.fedoraproject.org/++[].

source: Configure additional repositories
pt_br: Configure repositórios adicionais

source: New software is installed from _package repositories_. Package repositories are organized sets of software and metadata that can be accessed by the [application]*DNF* package manager. By default, several update repositories provided by {PRODUCT} are configured automatically and you can install updates and additional software from those. However, if you want to set up additional repositories, for example ones containing your own software, some extra steps are needed.
pt_br: Novos softwares são instalados por _repositórios de pacote_. Repositórios de pacote são conjuntos organizados de software e metadados que podem ser acessados pelo gerenciador de pacotes [application]*DNF*. Por padrão, muitos repositórios de atualização providos pelo {PRODUCT} são configurados automaticamente e você pode instalar atualizações e software adicional a partir deles. Porém, se você quiser configurar repositórios adicionais, por exemplo aqueles contendo seu próprio software, alguns passos extras são necessários.

source: For information about configuring additional software repositories, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++http://docs.fedoraproject.org/++[].
pt_br: Para informação sobre configurar repositórios de software adicionais, veja o [citetitle]_Guia de Administradores de Sistema do {PRODUCT}_, disponível em link:++https://docs.fedoraproject.org/++[].

source: Install additional packages
pt_br: Instale pacotes adicionais

source: You can control which packages will be installed by selecting an environment in the `Software Selection` dialog in the graphical installation (see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Software Selection]). This dialog does not provide a way to choose individual packages, only predefined sets. However, you can use the [application]*DNF* package manager to install additional packages after the installation. See the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[], for more information.
pt_br: Você pode controlar quais pacotes serão instalados selecionando um ambiente no diálogo `Seleção de Software` na instalação gráfica (veja xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Seleção de Software]). Esse diálogo não fornece uma maneira de escolher pacotes individuais, apenas conjuntos predefinidos. Porém, você pode usar o gerenciador de pacotes [application]*DNF* para instalar pacotes adicionais após a instalação. Veja o [citetitle]_Guia de Administradores de Sistema do {PRODUCT}_, disponível em link:++https://docs.fedoraproject.org/++[], para mais informação.

source: Switch to a graphical login
pt_br: Troque para um login gráfico

source: Depending on the options you chose during the installation process, it is possible that your system does not have a graphical interface, instead offering only a text-based prompt. If this is the case and you wish to enable a graphical desktop after the installation, you must install the [application]*X Window System* and your preferred desktop environment (either [application]*GNOME* or [application]*KDE*).
pt_br: Dependendo das opções que você escolheu durante o processo de instalação, é possível que o seu sistema não tenha uma interface gráfica, oferecendo apenas um prompt baseado em texto. Se esse for o caso e você deseja habilitar um desktop gráfico depois da instalação, você deve instalar o [application]*X Window System* e o seu ambiente de trabalho preferido (seja o [application]*GNOME* ou o [application]*KDE*).

source: As with all other software, these packages can be installed using the [application]*DNF* package manager. For information about using [application]*DNF* to install new packages, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[]. For information on how to enable graphical login by default, see xref:install/Troubleshooting.adoc#sect-trouble-after-graphical-login[Booting into a Graphical Environment].
pt_br: Igual a todos os outros softwares, esses pacotes podem ser instalados usando o gerenciador de pacotes [application]*DNF*. Para informação sobre usar o [application]*DNF* para instalar novos pacotes, veja o [citetitle]_Guia de Administradores de Sistema do {PRODUCT}_, disponível em link:++https://docs.fedoraproject.org/++[]. Para informação sobre como habilitar o login gráfico por padrão, veja xref:install/Troubleshooting.adoc#sect-trouble-after-graphical-login[Inicializando em um Ambiente Gráfico].
