Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/install/Installing_Using_Anaconda.po
Languages: tr

source: Installing Using Anaconda
tr: Anaconda Kullanarak Kurma

source: This chapter provides step-by-step instructions for installing {PRODUCT} using the [application]*Anaconda* installer. The bulk of this chapter describes installation using the graphical user interface. A text mode is also available for systems with no graphical display, but this mode is limited in certain aspects (for example, custom partitioning is not possible in text mode).
tr: Bu bölümde, [application]*Anaconda* kurucusunu kullanarak {PRODUCT} kurmak için adım adım talimatlar verilmektedir. Bu bölümün büyük bölümü, grafiksel kullanıcı arayüzünü kullanarak kurulumu açıklamaktadır. Grafiksel ekranı olmayan sistemler için bir metin modu da bulunmaktadır, ancak bu mod belirli yönlerden sınırlıdır (örneğin, metin modunda özel bölümlendirme mümkün değildir).

source: If your system does not have the ability to use the graphical mode, you can:
tr: Sisteminizde grafiksel modu kullanamıyorsanız aşağıdakilerden birini yapabilirsiniz:

source: Use Kickstart to automate the installation as described in xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart]
tr: xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Kickstart ile Kurulumu Otomatikleştirme] bölümünde açıklandığı gibi kurulumu otomatikleştirmek için Kickstart kullanın

source: Perform the graphical installation remotely by connecting to the installation system from another computer with a graphical display using the _VNC_ (Virtual Network Computing) protocol - see xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Installing Using VNC]
tr: Grafiksel ekranı olan başka bir bilgisayardan _VNC_ (Virtual Network Computing) protokolünü kullanarak kurulum sistemine bağlanarak grafiksel kurulumu uzaktan gerçekleştirin - xref:advanced/VNC_Installations.adoc#chap-vnc-installations[VNC Kullanarak Kurma] bölümüne bakın

source: Introduction to Anaconda
tr: Anaconda'ya Giriş

source: The {PRODUCT} installer, [application]*Anaconda*, is different from most other operating system installation programs due to its parallel nature. Most installers follow a fixed path: you must choose your language first, then you configure network, then installation type, then partitioning, etc. There is usually only one way to proceed at any given time.
tr: {PRODUCT} kurucusu, [application]*Anaconda*, paralel yapısı nedeniyle diğer işletim sistemi kurulum programlarının çoğundan farklıdır. Çoğu kurucu sabit bir yol izler: önce dilinizi seçmelisiniz, sonra ağı yapılandırırsınız, sonra kurulum türünü, sonra bölümlendirmeyi vs. Herhangi bir zamanda ilerlemenin genellikle tek bir yolu vardır.

source: In [application]*Anaconda* you are only required to select your language and locale first, and then you are presented with a central screen, where you can configure most aspects of the installation in any order you like. This does not apply to all parts of the installation process, however - for example, when installing from a network location, you must configure the network before you can select which packages to install.
tr: [application]*Anaconda*'da önce sadece dilinizi ve yerel ayarınızı seçmeniz gereklidir ve ardından kurulumun çoğu yönünü istediğiniz sırayla yapılandırabileceğiniz merkezi bir ekran sunulmaktadır. Ancak bu, kurulum işleminin tüm bölümleri için geçerli değildir - örneğin, bir ağ konumundan kurulum yaparken, kurulacak paketleri seçebilmeniz için önce ağı yapılandırmanız gerekmektedir.

source: Some screens will be automatically configured depending on your hardware and the type of media you used to start the installation. You can still change the detected settings in any screen. Screens which have not been automatically configured, and therefore require your attention before you begin the installation, are marked by an exclamation mark. You can not start the actual installation process before you finish configuring these settings.
tr: Bazı ekranlar donanımınıza ve kurulumu başlatmak için kullandığınız ortam türüne bağlı olarak otomatik olarak yapılandırılacaktır. Herhangi bir ekrandaki algılanan ayarları yine de değiştirebilirsiniz. Otomatik olarak yapılandırılmamış ve bu nedenle kuruluma başlamadan önce ilgilenmenizi gerektiren ekranlar bir ünlem işareti ile işaretlenmiştir. Bu ayarları yapılandırmayı tamamlamadan asıl kurulum işlemini başlatamazsınız.

source: Additional differences appear in certain screens; notably the custom partitioning process is very different from other Linux distributions. These differences are described in each screen's subsection.
tr: Bazı ekranlarda ek farklılıklar görülür; özellikle özel bölümlendirme işlemi diğer Linux dağıtımlarından çok farklıdır. Bu farklılıklar her ekranın alt bölümünde açıklanmaktadır.

source: Consoles and Logging During the Installation
tr: Kurulum Sırasında Konsollar ve Günlük Kaydı

source: The following sections describe how to access logs and an interactive shell during the installation. This is useful when troubleshooting problems, but should not be necessary in most cases.
tr: Aşağıdaki bölümlerde, kurulum sırasında günlüklere ve etkileşimli bir kabuğa nasıl erişileceği açıklanmaktadır. Bu, sorunları giderirken yararlıdır, ancak çoğu durumda gerekli olmamalıdır.

source: Accessing Consoles
tr: Konsollara Erişme

source: The {PRODUCT} installer uses the [application]*tmux* terminal multiplexer to display and control several windows you can use in addition to the main interface. Each of these windows serves a different purpose - they display several different logs, which can be used to troubleshoot any issues during the installation, and one of the windows provides an interactive shell prompt with `root` privileges, unless this prompt was specifically disabled using a boot option or a Kickstart command.
tr: {PRODUCT} kurucusu, ana arayüze ek olarak kullanabileceğiniz birkaç pencereyi görüntülemek ve denetlemek için [application]*tmux* terminal çoklayıcısını kullanmaktadır. Bu pencerelerin her biri farklı bir amaca hizmet eder - kurulum sırasında herhangi bir sorunu gidermek için kullanılabilecek birkaç farklı günlük kaydını görüntüler ve pencerelerden biri, bir önyükleme seçeneği veya Kickstart komutu kullanılarak özel olarak devre dışı bırakılmadığı sürece `root` ayrıcalıklarına sahip etkileşimli bir kabuk istemi sağlar.

source: In general, there is no reason to leave the default graphical installation environment unless you need to diagnose an installation problem.
tr: Genel olarak, bir kurulum sorununu teşhis etmeniz gerekmediği sürece öntanımlı grafiksel kurulum ortamından ayrılmak için hiçbir neden yoktur.

source: The terminal multiplexer is running in virtual console 1. To switch from the actual installation environment to [application]*tmux*, press kbd:[Ctrl + Alt + F1]. To go back to the main installation interface which runs in virtual console 6, press kbd:[Ctrl + Alt + F6].
tr: Terminal çoklayıcı birinci sanal konsolda çalışmaktadır. Gerçek kurulum ortamından [application]*tmux*'a geçmek için kbd:[Ctrl + Alt + F1] tuşlarına basın. Altıncı sanal konsolda çalışan ana kurulum arayüzüne geri dönmek için kbd:[Ctrl + Alt + F6] tuşlarına basın.

source: If you choose text mode installation, you will start in virtual console 1 ([application]*tmux*), and switching to console 6 will open a shell prompt instead of a graphical interface.
tr: Metin modunda kurulumu seçerseniz birinci sanal konsolda ([application]*tmux*) başlayacaksınız, ve altıncı konsola geçtiğinizde grafiksel arayüz yerine bir kabuk istemi açılacaktır.

source: The console running [application]*tmux* has 5 available windows; their contents are described in the table below, along with keyboard shortcuts used to access them. Note that the keyboard shortcuts are two-part: first press kbd:[Ctrl + b], then release both keys, and press the number key for the window you want to use.
tr: [application]*tmux*'u çalıştıran konsolda 5 pencere vardır; içerikleri, onlara erişmek için kullanılan klavye kısayollarıyla birlikte aşağıdaki tabloda açıklanmıştır. Klavye kısayollarının iki bölümden oluştuğunu unutmayın: önce kbd:[Ctrl + b] tuşlarına basın, ardından her iki tuşu da bırakın ve kullanmak istediğiniz pencerenin sayı tuşuna basın.

source: You can also use kbd:[Ctrl + b] kbd:[n] and kbd:[Ctrl + b] kbd:[p] to switch to the next or previous [application]*tmux* window, respectively.
tr: Sonraki [application]*tmux* penceresine geçmek için kbd:[Ctrl + b] kbd:[n], önceki [application]*tmux* penceresine geçmek için kbd:[Ctrl + b] kbd:[p] tuşlarını da kullanabilirsiniz.

source: Available tmux Windows
tr: Kullanılabilir tmux pencereleri

source: |Shortcut|Contents |kbd:[Ctrl + b] kbd:[1]|Main installation program window. Contains text-based prompts (during text mode installation or if you use VNC direct mode), and also some debugging information. |kbd:[Ctrl + b] kbd:[2]|Interactive shell prompt with `root` privileges. |kbd:[Ctrl + b] kbd:[3]|Installation log; displays messages stored in `/tmp/anaconda.log`. |kbd:[Ctrl + b] kbd:[4]|Storage log; displays messages related storage devices from kernel and system services, stored in `/tmp/storage.log`. |kbd:[Ctrl + b] kbd:[5]|Program log; displays messages from other system utilities, stored in `/tmp/program.log`.
tr: |Kısayol|İçerik |kbd:[Ctrl + b] kbd:[1]|Ana kurulum programı penceresi. Metin tabanlı istemler (metin modunda kurulum sırasında veya VNC doğrudan modunu kullanıyorsanız) ve ayrıca bazı hata ayıklama bilgilerini içerir. |kbd:[Ctrl + b] kbd:[2]|`root` ayrıcalıklarına sahip etkileşimli kabuk istemi. |kbd:[Ctrl + b] kbd:[3]|Kurulum günlük kaydı; `/tmp/anaconda.log` dosyasında saklanan mesajları görüntüler. |kbd:[Ctrl + b] kbd:[4]|Depolama günlük kaydı; `/tmp/storage.log` dosyasında saklanan, çekirdek ve sistem hizmetlerinden gelen depolama aygıtlarıyla ilgili mesajları görüntüler. |kbd:[Ctrl + b] kbd:[5]|Program günlük kaydı; `/tmp/program.log ` dosyasında saklanan, diğer sistem programlarından gelen mesajları görüntüler.

source: In addition to displaying diagnostic information in [application]*tmux* windows, [application]*Anaconda* also generates several log files, which can be transferred from the installation system. These log files are described in xref:install/Troubleshooting.adoc#sect-troubleshooting-log-files[Log Files Generated During the Installation], and directions for transferring them from the installation system are available in xref:install/Troubleshooting.adoc#sect-troubleshooting-transferring-logs[Transferring Log Files from the Installation System].
tr: [application]*Anaconda*, tanılama bilgilerini [application]*tmux* pencerelerinde görüntülemenin yanı sıra, kurulum sisteminden başka bir yere aktarılabilen birkaç günlük kaydı dosyası oluşturur. Bu günlük kaydı dosyaları, xref:install/Troubleshooting.adoc#sect-troubleshooting-log-files[Kurulum Sırasında Oluşturulan Günlük Kaydı Dosyaları] bölümünde açıklanmaktadır ve bunları kurulum sisteminden aktarma talimatları, xref:install/Troubleshooting.adoc#sect-troubleshooting-transferring-logs[Günlük Kaydı Dosyalarını Kurulum Sisteminden Aktarma] bölümünde bulunabilir.

source: Saving Screenshots
tr: Ekran Görüntülerini Kaydetme

source: You can press kbd:[Shift + Print Screen] at any time during the graphical installation to capture the current screen. These screenshots are saved to `/tmp/anaconda-screenshots`.
tr: Geçerli ekranı yakalamak için grafiksel kurulum sırasında istediğiniz zaman kbd:[Shift + Print Screen] tuşlarına basabilirsiniz. Bu ekran görüntüleri `/tmp/anaconda-screenshots` dizinine kaydedilir.

source: Additionally, you can use the [command]#autostep --autoscreenshot# command in a Kickstart file to capture and save each step of the installation automatically. See xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-autostep[autostep (optional) - Go Through Every Screen] for details.
tr: Ayrıca, kurulum işleminin her adımını otomatik olarak yakalamak ve kaydetmek için Kickstart dosyasında [command]#autostep --autoscreenshot# komutunu kullanabilirsiniz. Ayrıntılar için xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-autostep[autostep (isteğe bağlı) - Her Ekrandan Geçin] bölümüne bakın.

source: Installing in Text Mode
tr: Metin Modunda Kurma

source: Text mode installation offers an interactive, non-graphical interface for installing {PRODUCT}. This may be useful on systems with no graphical capabilities; however, you should always consider the available alternatives before starting a text-based installation. Text mode is limited in the amount of choices you can make during the installation.
tr: Metin modu kurulumu, {PRODUCT} kurmak için etkileşimli, grafiksel olmayan bir arayüz sunmaktadır. Bu, grafiksel özellikleri olmayan sistemlerde yararlı olabilir; ancak, metin tabanlı bir kuruluma başlamadan önce daima kullanılabilir alternatifleri göz önünde bulundurmalısınız. Metin modu, kurulum sırasında yapabileceğiniz seçimler konusunda sınırlıdır.

source: There are two alternatives to text mode which can both be used even if the installation system does not have a graphical display. You can either connect to the installation system using VNC and perform an interactive graphical installation remotely (see xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Installing Using VNC]), or you can create a Kickstart file to perform the installation automatically (see xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart]).
tr: Kurulum sisteminde grafiksel bir ekran olmasa bile kullanılabilen, metin moduna alternatif iki tane seçenek vardır. Kurulum sistemine VNC kullanarak bağlanabilir ve uzaktan etkileşimli bir grafiksel kurulum gerçekleştirebilirsiniz (xref:advanced/VNC_Installations.adoc#chap-vnc-installations[VNC Kullanarak Kurma]) veya kurulumu otomatik olarak gerçekleştirmek için bir Kickstart dosyası oluşturabilirsiniz (xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Kickstart ile Kurulumu Otomatikleştirme]).

source: Text Mode Installation
tr: Metin Modunda Kurulum

source: The main menu in during a text-based installation.
tr: Metin tabanlı kurulum sırasında ana menü.

source: Installation in text mode follows a pattern similar to the graphical installation: There is no single fixed progression; you can configure many settings in any order you want using the main status screen. Screens which have already been configured, either automatically or by you, are marked as `[x]`, and screens which require your attention before the installation can begin are marked with `[!]`. Available commands are displayed below the list of available options.
tr: Metin modunda kurulum, grafiksel kuruluma benzer bir model izlemektedir: Tek bir sabit ilerleme süreci yoktur; ana durum ekranını kullanarak birçok ayarı istediğiniz sırada yapılandırabilirsiniz. Otomatik olarak veya sizin tarafınızdan yapılandırılmış olan ekranlar `[x]` ile işaretlenir, ve kurulum başlamadan önce ilgilenmenizi gerektiren ekranlar `[!]` ile işaretlenir. Kullanılabilir komutlar, kullanılabilir seçenekler listesinin altında görüntülenmektedir.

source: Limits of interactive text mode installation include:
tr: Etkileşimli metin modunda kurulumun kısıtlamaları:

source: The installer will always use the English language and the US English keyboard layout. You can configure your language and keyboard settings, but these settings will only apply to the installed system, not to the installation.
tr: Kurucu her zaman İngilizce dilini ve ABD İngilizce klavye düzenini kullanacaktır. Dil ve klavye ayarlarınızı yapılandırabilirsiniz, ancak bu ayarlar sadece kurulacak sisteme uygulanacaktır, kurulum süresince geçerli olmayacaktır.

source: You can not configure any advanced storage methods (LVM, software RAID, FCoE, zFCP and iSCSI).
tr: Gelişmiş depolama yöntemlerini (LVM, yazılımsal RAID, FCoE, zFCP ve iSCSI) yapılandıramazsınız.

source: It is not possible to configure custom partitioning; you must use one of the automatic partitioning settings. You also cannot configure where the boot loader will be installed.
tr: Özel bölümlendirme yapılandırmak mümkün değildir; otomatik bölümlendirme ayarlarından birini kullanmanız gerekmektedir. Önyükleyicinin nereye kurulacağını da yapılandıramazsınız.

source: To start a text mode installation, boot the installation with the [option]#inst.text# boot option used either at the boot command line in the boot menu, or in your PXE server configuration. See xref:install/Booting_the_Installation.adoc#chap-booting-the-installation[Booting the Installation] for information about booting and using boot options.
tr: Metin modunda kurulumu başlatmak için, önyükleme menüsündeki önyükleme komut satırında veya PXE sunucusu yapılandırmanızda kullanılan [option]#inst.text# önyükleme seçeneğiyle kurulumu başlatın. Önyükleme ve önyükleme seçeneklerini kullanma hakkında bilgi için xref:install/Booting_the_Installation.adoc#chap-booting-the-installation[Kurulumu Önyükleme] bölümüne bakın.

source: Installing in the Graphical User Interface
tr: Grafiksel Kullanıcı Arayüzünde Kurma

source: The graphical installation interface is the preferred method of manually installing {PRODUCT}. It allows you full control over all available settings, including custom partitioning and advanced storage configuration, and it is also localized to many languages other than English, allowing you to perform the entire installation in a different language. The graphical mode is used by default when you boot the system from local media (a CD, DVD or a USB flash drive).
tr: Grafiksel kurulum arayüzü, elle {PRODUCT} kurmak için tercih edilen yöntemdir. Özel bölümlendirme ve gelişmiş depolama yapılandırması da dahil olmak üzere kullanılabilir tüm ayarlar üzerinde tam denetim sahibi olmanızı sağlar ve ayrıca İngilizce dışındaki birçok dilde yerelleştirildiği için kurulumun tamamını farklı bir dilde gerçekleştirmenize izin verir. Grafiksel mod, sistemi yerel ortamdan (CD, DVD veya USB flash sürücü) önyüklediğinizde öntanımlı olarak kullanılır.

source: The sections below discuss each screen available in the installation process. Note that due to the installer's parallel nature, most of the screens do not have to be completed in the order in which they are described here.
tr: Aşağıdaki bölümlerde, kurulum işleminde kullanılabilecek tüm ekranlar açıklanmaktadır. Kurucunun paralel yapısı nedeniyle, ekranların çoğunun burada açıklandığı sırada tamamlanması gerekmediğini unutmayın.

source: Each screen in the graphical interface contains a `Help` button. This button opens the [application]*Yelp* help browser displaying the section of the _{PRODUCT} Installation Guide_ relevant to the current screen.
tr: Grafiksel arayüzdeki her ekran bir `Yardım` düğmesi içermektedir. Bu düğme, [application]*Yelp* yardım tarayıcısını açarak _{PRODUCT} Kurulum Kılavuzunun_ geçerli ekranla ilgili bölümünü görüntüler.

source: You can also control the graphical installer with your keyboard. Use kbd:[Tab] and kbd:[Shift + Tab] to cycle through active control elements (buttons, check boxes, etc.) on the current screen, kbd:[Up] and kbd:[Down] arrow keys to scroll through lists, and kbd:[Left] and kbd:[Right] to scroll through horizontal toolbars or table entries. kbd:[Space] or kbd:[Enter] can be used to select or remove a highlighted item from selection and to expand and collapse drop-down menus.
tr: Grafiksel kurucuyu klavyenizle de denetleyebilirsiniz. Geçerli ekrandaki etkin denetim ögeleri (düğmeler, onay kutuları vb.) arasında geçiş yapmak için kbd:[Tab] ve kbd:[Shift + Tab] tuşlarını, listeler arasında gezinmek için kbd:[Yukarı] ve kbd:[Aşağı], yatay araç çubukları veya tablo elemanları arasında gezinmek için kbd:[Sol] ve kbd:[Sağ] ok tuşlarını kullanın. kbd:[Space] veya kbd:[Enter], vurgulanan bir ögeyi seçmek veya seçimden kaldırmak ve açılır menüleri genişletmek ve daraltmak için kullanılabilir.

source: Additionally, elements in each screen can be toggled using their respective shortcuts. These shortcuts are highlighted (underlined) when you hold down the kbd:[Alt] key; to toggle that element, press kbd:[Alt + _X_pass:attributes[{blank}]], where _X_ is the highlighted letter.
tr: Ayrıca, her bir ekrandaki ögeler ilgili kısayolları kullanılarak değiştirilebilir. Bu kısayollar, kbd:[Alt] tuşuna basılı tuttuğunuzda vurgulanır (altı çizilir); o ögeyi değiştirmek için kbd:[Alt + _X_pass:attributes[{blank}]] tuşlarına basın, burada _X_ vurgulanan harftir.

source: Your current keyboard layout is displayed in the top right hand corner. Only one layout is configured by default; if you configure more than layout in the `Keyboard Layout` screen (xref:Installing_Using_Anaconda.adoc#sect-installation-gui-keyboard-layout[Keyboard Layout]), you can switch between them by clicking the layout indicator.
tr: Geçerli klavye düzeniniz sağ üst köşede görüntülenir. Öntanımlı olarak yalnızca bir düzen yapılandırılmıştır; `Klavye Düzeni` ekranında (xref:Installing_Using_Anaconda.adoc#sect-installation-gui-keyboard-layout[Klavye Düzeni]) birden fazlasını yapılandırırsanız, düzen göstergesine tıklayarak aralarında geçiş yapabilirsiniz.
