Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/install/Troubleshooting.po
Languages: tr

source: Troubleshooting
tr: Sorun Giderme

source: This chapter offers some pointers on how to get help when something goes wrong. It also discusses some common installation problems and their solutions.
tr: Bu bölüm, bir şeyler ters gittiğinde nasıl yardım alınacağına dair bazı ipuçları sunmaktadır. Ayrıca bazı genel kurulum sorunları ve bunların çözümleri tartışılır.

source: Getting Help
tr: Yardım Alma

source: There are many places on the internet which can help you when you encounter a problem not described in this chapter: discussion boards, blogs, IRC, and more. Some of the more popular places where you can find help include:
tr: İnternette bu bölümde açıklanmayan bir sorunla karşılaştığınızda size yardımcı olabilecek pek çok yer vardır: tartışma forumları, bloglar, IRC ve daha fazlası. Yardım bulabileceğiniz bilinen yerlerden bazıları şunlardır:

source: link:++https://ask.fedoraproject.org/en/questions/++[Ask Fedora] - Fedora's knowledge base, available in multiple languages
tr: link:++https://ask.fedoraproject.org/en/questions/++[Fedora'ya Sorun] - Fedora'nın bilgi kaynağı, birden çok dilde kullanılabilir

source: The #fedora IRC channel on link:++http://freenode.net/++[FreeNode] - one of the main IRC channels used by Fedora users, English only
tr: link:++https://libera.chat/++[Libera.Chat] üzerindeki #fedora IRC kanalı - Fedora kullanıcıları tarafından kullanılan ana IRC kanallarından biri, yalnızca İngilizce

source: link:++https://fedoraproject.org/wiki/++[Fedora Project Wiki] - the official wiki for Fedora Project
tr: link:++https://fedoraproject.org/wiki/++[Fedora Projesi Wiki Sayfası] - Fedora Projesinin resmi wiki sayfası

source: link:++http://unix.stackexchange.com/++[Stack Exchange] - an English language Q&A board, not specific to Fedora
tr: link:++https://unix.stackexchange.com/++[Stack Exchange] - Fedora'ya özel olmayan İngilizce bir soru & cevap sitesi

source: The above list is by no means complete - you can find help in many other places as well. Additional information about available resources such as IRC channels and mailing lists is available at link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[].
tr: Seçenekler yukarıdaki listeden ibaret değildir - başka birçok yerde de yardım bulabilirsiniz. IRC kanalları ve e-posta listeleri gibi kullanılabilecek kaynaklar hakkında ek bilgi link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[] sayfasında bulunabilir.

source: Before you open a new discussion or ask anyone for help on IRC, you should always do some research on your own. If you are encountering an issue, there is usually a good chance that someone else ran into the same problem before you and published a solution somewhere. Opening a discussion about something already explained elsewhere, or asking a common question which has been answered many times before, is not likely to result in a friendly, constructive response.
tr: Yeni bir tartışma açmadan veya IRC üzerinde birinden yardım istemeden önce, her zaman kendi başınıza biraz araştırma yapmalısınız. Bir sorunla karşılaşırsanız, genellikle başka birinin sizden önce aynı problemle karşılaşması ve bir yerde bir çözüm yayınlaması ihtimali yüksektir. Başka bir yerde zaten açıklanan bir şey hakkında bir tartışma başlatmak veya daha önce birçok kez yanıtlanmış yaygın bir soruyu sormak, muhtemelen dostça, yapıcı bir yanıtla sonuçlanmayacaktır.

source: When you ask for help troubleshooting problems related to the installation, you may be asked to provide log files generated by the installer. The sections below explain which files are generated, what their contents are, and how to transfer them from the installation system.
tr: Kurulumla ilgili sorunları gidermek için yardım istediğinizde, kurucu tarafından oluşturulan günlük kaydı dosyalarını sağlamanız istenebilir. Aşağıdaki bölümler hangi dosyaların oluşturulduğunu, içeriklerinin ne olduğunu ve bunların kurulum sisteminden nasıl aktarılacağını açıklamaktadır.

source: Log Files Generated During the Installation
tr: Kurulum Sırasında Oluşturulan Günlük Kaydı Dosyaları

source: For debugging purposes, [application]*Anaconda* logs installation actions into files in the `/tmp` directory. These files are listed in the following table.
tr: Hata ayıklama amacıyla, [application]*Anaconda* kurulum işlemlerini `/tmp` dizinindeki dosyalara kaydeder. Bu dosyalar aşağıdaki tabloda listelenmiştir.

source: Log Files and Their Contents
tr: Günlük Kaydı Dosyaları ve İçerikleri

source: |Log file|Contents |`/tmp/anaconda.log`|general [application]*Anaconda* messages |`/tmp/program.log`|all external programs run during the installation |`/tmp/storage.log`|extensive storage module information |`/tmp/packaging.log`|[application]*dnf* and [application]*rpm* package installation messages |`/tmp/syslog`|hardware-related system messages
tr: |Günlük kaydı dosyası|İçerikleri |`/tmp/anaconda.log`|genel [application]*Anaconda* mesajları |`/tmp/program.log`|kurulum sırasında çalıştırılan tüm harici programlar |`/tmp/storage.log`|kapsamlı depolama modülü bilgileri |`/tmp/packaging.log`|[application]*dnf* ve [application]*rpm* paket kurulum mesajları |`/tmp/syslog`|donanımla ilgili sistem mesajları

source: If the installation fails, the messages from these files are consolidated into `/tmp/anaconda-tb-_identifier_pass:attributes[{blank}]`, where _identifier_ is a random string.
tr: Kurulum başarısız olursa, bu dosyalardaki mesajlar, `/tmp/anaconda-tb-_tanımlayıcı_pass:attributes[{blank}]` dosyasında birleştirilir; buradaki _tanımlayıcı_ rastgele bir dizgedir.

source: Transferring Log Files from the Installation System
tr: Günlük Kaydı Dosyalarını Kurulum Sisteminden Aktarma

source: All of the files described in xref:install/Troubleshooting.adoc#sect-troubleshooting-log-files[Log Files Generated During the Installation] reside in the installation program's RAM disk, which means they are not saved permamently and will be lost once the system is powered down. To store them permanently, copy those files to another system on the network using [command]#scp# on the system running the installation program, or copy them to a mounted storage device (such as an USB flash drive). Details on how to transfer the log files are below. Note that if you use an USB flash drive or other removable media, you should make sure to back up any data on it before starting the procedure.
tr: xref:install/Troubleshooting.adoc#sect-troubleshooting-log-files[Kurulum Sırasında Oluşturulan Günlük Kaydı Dosyaları] bölümünde açıklanan tüm dosyalar, kurulum programının RAM diskinde bulunur, bu da kalıcı olarak kaydedilmedikleri ve sistem kapatıldığında kaybolacakları anlamına gelir. Onları kalıcı olarak saklamak için, bu dosyaları kurulum programını çalıştıran sistemde [command]#scp# komutunu kullanarak ağdaki başka bir sisteme kopyalayın veya bunları takılı bir depolama aygıtına (USB flash bellek gibi) kopyalayın. Günlük kaydı dosyalarının nasıl aktarılacağına ilişkin ayrıntılar aşağıdadır. Bir USB flash bellek veya başka bir çıkarılabilir ortam kullanıyorsanız, işleme başlamadan önce içindeki tüm verileri yedeklediğinizden emin olmanız gerektiğini unutmayın.

source: Transferring Log Files Onto a USB Drive
tr: Günlük Kaydı Dosyalarını USB Belleğe Aktarma

source: On the system you are installing, press kbd:[Ctrl + Alt + F2] to access a shell prompt. You will be logged into a root account and you will have access to the installation program's temporary file system.
tr: Kurduğunuz sistemde, bir kabuk istemine erişmek için kbd:[Ctrl + Alt + F2] tuşlarına basın. Bir root hesabında oturum açacaksınız ve kurulum programının geçici dosya sistemine erişiminiz olacak.

source: Connect a USB flash drive to the system and execute the [command]#dmesg# command. A log detailing all recent events will be displayed. At the bottom of this log, you will see a set of messages caused by the USB flash drive you just connected. It will look like a set of lines similar to the following:
tr: Sisteme bir USB flash bellek bağlayın ve [command]#dmesg# komutunu çalıştırın. Tüm son olayların ayrıntılarını içeren bir günlük kaydı görüntülenecektir. Bu günlük kaydının altında, yeni bağladığınız USB flash belleğin neden olduğu bir dizi mesaj göreceksiniz. Aşağıdakine benzer bir dizi satır gibi görünecektir:

source: Note the name of the connected device - in the above example, it is `sdb`.
tr: Bağlanan aygıtın adını not edin - yukarıdaki örnekte bu `sdb` olacak.

source: Go to the `/mnt` directory and once there, create new directory which will serve as the mount target for the USB drive. The name of the directory does not matter; this example uses the name `usb`.
tr: `/mnt` dizinine gidin ve orada, USB bellek için bağlama hedefi olarak kullanılacak yeni bir dizin oluşturun. Dizinin adı önemli değil; bu örnekte `usb` kullanılacak.

source: Mount the USB flash drive onto the newly created directory. Note that in most cases, you do not want to mount the whole drive, but a partition on it. Therefore, do not use the name `sdb` - use the name of the partition you want to write the log files to. In this example, the name `sdb1` is used.
tr: USB flash belleği yeni oluşturulan dizine bağlayın. Çoğu durumda USB belleğin tamamını değil, üzerindeki bir bölümü bağlamak isteyeceğinizi unutmayın. Bu nedenle, `sdb` adını kullanmayın - günlük kaydı dosyalarını yazmak istediğiniz bölümün adını kullanın. Bu örnekte `sdb1` kullanılmaktadır.

source: You can now verify that you mounted the correct device and partition by accessing it and listing its contents - the list should match what you expect to be on the drive.
tr: Artık doğru aygıtı ve bölümü bağladığınızı, ona erişerek ve içeriğini listeleyerek doğrulayabilirsiniz - liste, USB bellekte olmasını beklediklerinizle eşleşmelidir.

source: Copy the log files to the mounted device.
tr: Günlük kaydı dosyalarını bağlanan aygıta kopyalayın.

source: Unmount the USB flash drive. If you get an error message saying that the target is busy, change your working directory to outside the mount (for example, `/`).
tr: USB flash belleğin bağlantısını kaldırın. Hedefin meşgul olduğunu belirten bir hata mesajı alırsanız, çalışma dizininizi bağlama noktasının dışında bir yere değiştirin (örneğin, `/`).

source: The log files from the installation are now saved on the USB flash drive.
tr: Kurulumdaki günlük kaydı dosyaları artık USB flash belleğe kaydedildi.

source: Transferring Log Files Over the Network
tr: Günlük Kaydı Dosyalarını Ağ Üzerinden Aktarma

source: Switch to the `/tmp` directory where the log files are located:
tr: Günlük kaydı dosyalarının bulunduğu `/tmp` dizinine geçin:

source: Copy the log files onto another system on the network using the [command]#scp# command:
tr: Günlük kaydı dosyalarını [command]#scp# komutunu kullanarak ağdaki başka bir sisteme kopyalayın:

source: # scp *log user@address:path
tr: # scp *log kullanıcı@adres:yol

source: Replace _user_ with a valid user name on the target system, _address_ with the target system's address or host name, and _path_ with the path to the directory you wish to save the log files into. For example, if you want to log in as `john` to a system with an IP address of `192.168.0.122` and place the log files into the `/home/john/logs/` directory on that system, the command will have the following form:
tr: _kullanıcı_ kısmını hedef sistemde geçerli bir kullanıcı adıyla, _adres_ kısmını hedef sistemin adresi veya ana makine adıyla ve _yol_ kısmını günlük kaydı dosyalarını kaydetmek istediğiniz dizinin yoluyla değiştirin. Örneğin, `192.168.0.122` IP adresine sahip bir sistemde `john` olarak oturum açmak ve günlük kaydı dosyalarını o sistemdeki `/home/john/logs/` dizinine kaydetmek istiyorsanız, komut aşağıdaki biçimde olacaktır:

source: When connecting to the target system for the first time, you may encounter a message similar to the following:
tr: Hedef sisteme ilk kez bağlanırken aşağıdakine benzer bir mesajla karşılaşabilirsiniz:

source: Type `yes` and press kbd:[Enter] to continue. Then, provide a valid password when prompted. The files will start transferring to the specified directory on the target system.
tr: `yes` yazın ve devam etmek için kbd:[Enter] tuşuna basın. Ardından, istendiğinde geçerli bir parola girin. Dosyalar, hedef sistemde belirtilen dizine aktarılmaya başlayacaktır.

source: The log files from the installation are now permanently saved on the target system and available for review.
tr: Kurulumdaki günlük kaydı dosyaları artık kalıcı olarak hedef sisteme kaydedildi ve incelenmek için hazır.

source: Trouble Beginning the Installation
tr: Kuruluma Başlama Sorunları

source: Problems with Booting into the Graphical Installation
tr: Grafiksel Kuruluma Önyükleme ile İlgili Sorunlar

source: Systems with some video cards have trouble booting into the graphical installation program. If the installation program does not run using its default settings, it attempts to run in a lower resolution mode. If that still fails, the installation program attempts to run in text mode.
tr: Bazı ekran kartlarına sahip sistemler, grafiksel kurulum programına önyükleme yaparken sorun yaşarlar. Kurulum programı öntanımlı ayarlarını kullanarak çalışmazsa, daha düşük bir çözünürlük modunda çalışmayı dener. Bu da başarısız olursa, kurulum programı metin modunda çalışmayı dener.

source: There are several possible solutions to display issues, most of which involve specifying custom boot options. For more information, see xref:advanced/Boot_Options.adoc#sect-boot-options-installer[Configuring the Installation System at the Boot Menu].
tr: Ekran sorunları için, çoğu özel önyükleme seçeneklerini belirtmeyi içeren birkaç olası çözüm vardır. Daha fazla bilgi için xref:advanced/Boot_Options.adoc#sect-boot-options-installer[Önyükleme Menüsünde Kurulum Sistemini Yapılandırma] bölümüne bakın.

source: Use the basic graphics mode
tr: Temel grafiksel modu kullanın

source: You can attempt to perform the installation using the basic graphics driver. To do this, edit the installation program's boot options and append [option]#inst.xdriver=vesa# at the end of the command line.
tr: Temel grafik sürücüsünü kullanarak kurulumu gerçekleştirmeyi deneyebilirsiniz. Bunu yapmak için, kurulum programının önyükleme seçeneklerini düzenleyin ve komut satırının sonuna [option]#inst.xdriver=vesa# ekleyin.

source: Specify the display resolution manually
tr: Ekran çözünürlüğünü elle belirtin

source: If the installation program fails to detect your screen resolution, you can override the automatic detection and specify it manually. To do this, append the [option]#inst.resolution=pass:attributes[{blank}]_x_pass:attributes[{blank}]# option at the boot menu, where _x_ is your display's resolution (for example, `1024x768`).
tr: Kurulum programı ekran çözünürlüğünüzü algılayamazsa, otomatik algılamayı geçersiz kılabilir ve çözünürlüğü elle belirleyebilirsiniz. Bunu yapmak için, önyükleme menüsünde [option]#inst.resolution=pass:attributes[{blank}]_x_pass:attributes[{blank}]# seçeneğini ekleyin, burada _x_ ekranınızın çözünürlüğüdür (örneğin, `1024x768`).

source: Use an alternate video driver
tr: Başka bir grafik sürücüsü kullanın

source: You can also attempt to specify a custom video driver, overriding the installation program's automatic detection. To specify a driver, use the [option]#inst.xdriver=pass:attributes[{blank}]_x_pass:attributes[{blank}]# option, where _x_ is the device driver you want to use (for example, `nouveau`).
tr: Kurulum programının otomatik algılamasını geçersiz kılarak özel bir grafik sürücüsü belirtmeyi de deneyebilirsiniz. Bir sürücü belirtmek için [option]#inst.xdriver=pass:attributes[{blank}]_x_pass:attributes[{blank}]# seçeneğini kullanın, burada _x_ kullanmak istediğiniz aygıt sürücüsüdür (örneğin, `nouveau`).

source: If specifying a custom video driver solves your problem, you should report it as a bug at link:++https://bugzilla.redhat.com++[] under the `anaconda` component. [application]*Anaconda* should be able to detect your hardware automatically and use the appropriate driver without your intervention.
tr: Özel bir grafik sürücüsü belirtmeniz sorununuzu çözerse, bunu link:++https://bugzilla.redhat.com++[] adresinde `anaconda` bileşeninin altında bir hata olarak bildirmelisiniz. [application]*Anaconda*, donanımınızı otomatik olarak algılayabilmeli ve sizin müdahaleniz olmadan uygun sürücüyü kullanabilmelidir.

source: Perform the installation using VNC
tr: Kurulumu VNC kullanarak gerçekleştirin

source: If the above options fail, you can use a separate system to access the graphical installation over the network, using the _Virtual Network Computing_ (VNC) protocol. For details on installing using VNC, see xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Installing Using VNC].
tr: Yukarıdaki seçenekler başarısız olursa, _Virtual Network Computing_ (VNC) protokolünü kullanarak ağ üzerinden grafiksel kuruluma erişmek için ayrı bir sistem kullanabilirsiniz. VNC kullanarak kurmayla ilgili ayrıntılar için xref:advanced/VNC_Installations.adoc#chap-vnc-installations[VNC Kullanarak Kurma] bölümüne bakın.

source: Serial Console Not Detected
tr: Seri Konsol Algılanmadı

source: In some cases, attempting to install in text mode using a serial console will result in no output on the console. This happens on systems which have a graphics card, but no monitor connected. If [application]*Anaconda* detects a graphics card, it will attempt to use it for a display, even if no display is connected.
tr: Bazı durumlarda, bir seri konsol kullanarak metin modunda kurulum yapmaya çalışmak, konsolda çıktı alınmamasına neden olacaktır. Bu, grafik kartı olan ancak ekran bağlı olmayan sistemlerde olur. [application]*Anaconda* bir grafik kartı algılarsa, herhangi bir ekran bağlı olmasa bile onu bir ekran için kullanmayı deneyecektir.

source: If you want to perform a text-based installation on a serial console, use the [option]#inst.text# and [option]#console=# boot options. See xref:advanced/Boot_Options.adoc#chap-anaconda-boot-options[Boot Options] for more details.
tr: Bir seri konsolda metin tabanlı bir kurulum gerçekleştirmek istiyorsanız, [option]#inst.text# ve [option]#console=# önyükleme seçeneklerini kullanın. Daha fazla ayrıntı için xref:advanced/Boot_Options.adoc#chap-anaconda-boot-options[Önyükleme Seçenekleri] bölümüne bakın.

source: Trouble During the Installation
tr: Kurulum Anındaki Sorunlar

source: No Disks Detected
tr: Disk Algılanmadı

source: In the `Installation Destination` screen, the following error message may appear at the bottom: `No disks detected. Please shut down the computer, connect at least one disk, and restart to complete installation`.
tr: `Kurulum Hedefi` ekranında, altta aşağıdaki hata mesajı görünebilir: `Disk algılanmadı. Lütfen bilgisayarı kapatın, en az bir disk bağlayın ve kurulumu tamamlamak için yeniden başlatın`.

source: The message indicates that [application]*Anaconda* did not find any writable storage devices to install to. In that case, first make sure that your system does have at least one storage device attached.
tr: Bu mesaj, [application]*Anaconda*'nın kurulum yapılacak herhangi bir yazılabilir depolama aygıtı bulamadığını gösterir. Bu durumda, öncelikle sisteminize en az bir depolama aygıtının takılı olduğundan emin olun.

source: If your system uses a hardware RAID controller, verify that the controller is properly configured and working. See your controller's documentation for instructions.
tr: Sisteminiz bir donanımsal RAID denetleyicisi kullanıyorsa, denetleyicinin uygun şekilde yapılandırıldığını ve çalıştığını doğrulayın. Talimatlar için denetleyicinizin belgelendirmesine bakın.

source: If you are installing into one or more iSCSI devices and there is no local storage present on the system, make sure that all required LUNs (_Logical Unit Numbers_) are being presented to the appropriate HBA (_Host Bus Adapter_).
tr: Bir veya daha fazla iSCSI aygıtına kurulum yapıyorsanız ve sistemde yerel depolama yoksa, gerekli tüm LUN'ların (_Logical Unit Numbers_) uygun HBA'ya (_Host Bus Adapter_) sunulduğundan emin olun.

source: If you made sure you have a connected and properly configured storage device and the message still appears after you reboot the system and start the installation again, it means that the installation program failed to detect the storage. In most cases this message appears when you attempt to install on an SCSI device which has not been recognized by the installation program.
tr: Bağlı ve uygun şekilde yapılandırılmış bir depolama aygıtına sahip olduğunuzdan emin olduysanız ve sistemi yeniden önyükleyip kurulumu yeniden başlattıktan sonra mesaj hala görünüyorsa, bu kurulum programının depolamayı algılayamadığı anlamına gelir. Çoğu durumda bu mesaj, kurulum programı tarafından tanınmayan bir SCSI aygıtına kurulum yapmaya çalıştığınızda görünür.

source: Problems After Installation
tr: Kurulumdan Sonraki Sorunlar

source: Resetting the Root Password
tr: Root Parolasını Sıfırlama

source: If you lost the root password to the system and you have access to the boot loader, you can reset the password by editing the GRUB2 configuration.
tr: Sistemin root parolasını kaybettiyseniz ve önyükleyiciye erişiminiz varsa, GRUB2 yapılandırmasını düzenleyerek parolayı sıfırlayabilirsiniz.

source: Boot your system and wait until the GRUB2 menu appears.
tr: Sisteminizi önyükleyin ve GRUB2 menüsü görünene kadar bekleyin.

source: In the boot loader menu, highlight any entry and press kbd:[e] to edit it.
tr: Önyükleyici menüsünde, herhangi bir girdiyi vurgulayın ve düzenlemek için kbd:[e] tuşuna basın.

source: Find the line beginning with `linux`. At the end of this line, append the following:
tr: `linux` ile başlayan satırı bulun. Bu satırın sonuna şunu ekleyin:

source: Press kbd:[F10] or kbd:[Ctrl + X] to boot the system using the options you just edited.
tr: Düzenlediğiniz seçenekleri kullanarak sistemi önyüklemek için kbd:[F10] veya kbd:[Ctrl + X] tuşlarına basın.

source: Once the system boots, you will be presented with a shell prompt without having to enter any user name or password:
tr: Sistem önyüklendiğinde, herhangi bir kullanıcı adı veya parola girmenize gerek kalmadan size bir kabuk istemi sunulacak:

source: Load the installed SELinux policy:
tr: Kurulu SELinux politikasını yükleyin:

source: Execute the following command to remount your root partition:
tr: Kök bölümünüzü yeniden bağlamak için aşağıdaki komutu çalıştırın:

source: Reset the root password:
tr: Root parolasını sıfırlayın:

source: When prompted to, enter your new root password and confirm by pressing the kbd:[Enter] key. Enter the password for the second time to make sure you typed it correctly and confirm with kbd:[Enter] again. If both passwords match, a message informing you of a successful root password change will appear.
tr: İstendiğinde, yeni root parolanızı girin ve kbd:[Enter] tuşuna basarak onaylayın. Doğru yazdığınızdan emin olmak için parolayı ikinci kez girin ve kbd:[Enter] tuşu ile tekrar onaylayın. Her iki parola da eşleşirse, başarılı bir root parolası değişikliğini size bildiren bir mesaj görünecektir.

source: Remount the root partition again, this time as read-only:
tr: Kök bölümünü, bu sefer salt okunur olarak yeniden bağlayın:

source: Reboot the system. From now on, you will be able to log in as the root user using the new password set up during this procedure.
tr: Sistemi yeniden başlatın. Bundan böyle, bu adımlar sırasında belirlenen yeni parolayı kullanarak root kullanıcısı olarak oturum açabileceksiniz.

source: Are You Unable to Boot With Your RAID Card?
tr: RAID Kartınızla Önyükleme Yapamıyor Musunuz?
