Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/install/Troubleshooting.po
Languages: tr

source: If you have performed an installation and cannot boot your system properly, you may need to reinstall and partition your system's storage differently.
tr: Bir kurulum yaptıysanız ve sisteminizi düzgün şekilde önyükleyemiyorsanız, yeniden kurulum yapmanız ve sisteminizin depolama alanını farklı şekilde bölümlendirmeniz gerekebilir.

source: Some BIOS types do not support booting from RAID cards. After you finish the installation and reboot the system for the first time, a text-based screen showing the boot loader prompt (for example, `grub>`) and a flashing cursor may be all that appears. If this is the case, you must repartition your system and move your `/boot` partition and the boot loader outside the RAID array. The `/boot` partition and the boot loader must be on the same drive.
tr: Bazı BIOS türleri RAID kartlarından önyüklemeyi desteklemez. Kurulumu bitirdikten ve sistemi ilk kez yeniden başlattıktan sonra, önyükleyici istemini gösteren metin tabanlı bir ekran (örneğin, `grub>`) ve yanıp sönen bir imleç görünen tek şey olabilir. Durum buysa, sisteminizi yeniden bölümlendirmeniz ve `/boot` bölümünüzü ve önyükleyiciyi RAID dizisinin dışına taşımanız gerekir. `/boot` bölümü ve önyükleyici aynı diskte olmalıdır.

source: Once these changes have been made, you should be able to finish your installation and boot the system properly. For more information about partitioning, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination].
tr: Bu değişiklikler yapıldıktan sonra, kurulumunuzu tamamlayabilmeli ve sistemi düzgün bir şekilde önyükleyebilmelisiniz. Bölümlendirme hakkında daha fazla bilgi için xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Kurulum Hedefi] bölümüne bakın.

source: Trouble With the Graphical Boot Sequence
tr: Grafiksel Önyükleme Sırasıyla İlgili Sorunlar

source: After you finish the installation and reboot your system for the first time, it is possible that the system stops responding during the graphical boot sequence, requiring a reset. In this case, the boot loader is displayed successfully, but selecting any entry and attempting to boot the system results in a halt. This usually means a problem with the graphical boot sequence; to solve this issue, you must disable graphical boot. To do this, temporarily alter the setting at boot time before changing it permanently.
tr: Kurulumu bitirdikten ve sisteminizi ilk kez yeniden başlattıktan sonra, sistem grafiksel önyükleme sırasında yanıt vermeyebilir ve sıfırlama gerektirebilir. Bu durumda, önyükleyici başarıyla görüntülenir, ancak herhangi bir girdiyi seçip başlatmaya çalışmak, sistemin durmasıyla sonuçlanır. Bu genellikle grafiksel önyükleme sırası ile ilgili bir sorun olduğu anlamına gelir; bu sorunu çözmek için grafiksel önyüklemeyi devre dışı bırakmalısınız. Bunu yapmak için, kalıcı olarak değiştirmeden önce önyükleme sırasında ayarı geçici olarak değiştirin.

source: Disabling Graphical Boot Temporarily
tr: Grafiksel Önyüklemeyi Geçici Olarak Devre Dışı Bırakma

source: Start your computer and wait until the boot loader menu appears. If you set your boot loader timeout period to 0, hold down the kbd:[Esc] key to access it.
tr: Bilgisayarınızı başlatın ve önyükleyici menüsü görünene kadar bekleyin. Önyükleyici zaman aşımı sürenizi 0 olarak ayarladıysanız, menüye erişmek için kbd:[Esc] tuşunu basılı tutun.

source: When the boot loader menu appears, use your cursor keys to highlight the entry you want to boot and press the kbd:[e] key to edit this entry's options.
tr: Önyükleyici menüsü göründüğünde, önyükleme yapmak istediğiniz girdiyi vurgulamak için imleç tuşlarınızı kullanın ve o girdinin seçeneklerini düzenlemek için kbd:[e] tuşuna basın.

source: In the list of options, find the kernel line - that is, the line beginning with the keyword `linux` (or, in some cases, `linux16` or `linuxefi`). On this line, locate the `rhgb` option and delete it. The option may not be immediately visible; use the cursor keys to scroll up and down.
tr: Seçenekler listesinde çekirdek satırını, yani `linux` (veya bazı durumlarda `linux16` veya `linuxefi`) anahtar kelimesiyle başlayan satırı bulun. Bu satırda `rhgb` seçeneğini bulun ve silin. Seçenek hemen görünmeyebilir; yukarı ve aşağı kaydırmak için imleç tuşlarını kullanın.

source: Press kbd:[F10] or kbd:[Ctrl + X] to boot your system with the edited options.
tr: Düzenlenen seçeneklerle sisteminizi önyüklemek için kbd:[F10] veya kbd:[Ctrl + X] tuşlarına basın.

source: If the system started successfully, you can log in normally. Then you will need to disable the graphical boot permanently - otherwise you will have to perform the previous procedure every time the system boots. To permanently change boot options, do the following.
tr: Sistem başarıyla başlatıldıysa, normal şekilde oturum açabilirsiniz. Ardından, grafiksel önyüklemeyi kalıcı olarak devre dışı bırakmanız gerekecek - aksi takdirde sistem her önyüklendiğinde önceki işlemleri uygulamanız gerekecek. Önyükleme seçeneklerini kalıcı olarak değiştirmek için aşağıdakileri yapın.

source: Disabling Graphical Boot Permanently
tr: Grafiksel Önyüklemeyi Kalıcı Olarak Devre Dışı Bırakma

source: Log in to the `root` account using the [command]#su -# command:
tr: [command]#su -# komutunu kullanarak `root` hesabında oturum açın:

source: Open the `/etc/default/grub` configuration file using a plain text editor such as [application]*vim*.
tr: [application]*vim* gibi bir düz metin düzenleyicisi kullanarak `/etc/default/grub` yapılandırma dosyasını açın.

source: Within the `grub` file, locate the line beginning with `GRUB_CMDLINE_LINUX`. The line should look similar to the following:
tr: `grub` dosyası içinde, `GRUB_CMDLINE_LINUX` ile başlayan satırı bulun. Satır aşağıdakine benzer şekilde görünmelidir:

source: On this line, delete the `rhgb` option.
tr: Bu satırda `rhgb` seçeneğini silin.

source: Save the edited configuration file.
tr: Düzenlenen yapılandırma dosyasını kaydedin.

source: Refresh the boot loader configuration by executing the following command:
tr: Aşağıdaki komutu çalıştırarak önyükleyici yapılandırmasını yenileyin:

source: After you finish this procedure, you can reboot your computer. {PRODUCT} will not use the graphical boot sequence any more. If you wish to enable graphical boot, follow the same procedure, add the `rhgb` option to the `GRUB_CMDLINE_LINUX` line in the `/etc/default/grub` file and refresh the boot loader configuration again using the [command]#grub2-mkconfig# command.
tr: Bu işlemi tamamladıktan sonra bilgisayarınızı yeniden başlatabilirsiniz. {PRODUCT} artık grafiksel önyükleme sırasını kullanmayacak. Grafiksel önyüklemeyi etkinleştirmek istiyorsanız aynı adımları izleyin, `/etc/default/grub` dosyasındaki `GRUB_CMDLINE_LINUX` satırına `rhgb` seçeneğini ekleyin ve [command]#grub2-mkconfig# komutunu kullanarak önyükleyici yapılandırmasını tekrar yenileyin.

source: See the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++http://docs.fedoraproject.org/++[], for more information about working with the [application]*GRUB2* boot loader.
tr: [application]*GRUB2* önyükleyicisi ile çalışma hakkında daha fazla bilgi için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Sistem Yöneticisi Kılavuzuna_ bakın.

source: Booting into a Graphical Environment
tr: Grafiksel Bir Ortama Önyükleme Yapma

source: If you have installed the [application]*X Window System* and a desktop environment such as [application]*GNOME*, but are not seeing a graphical desktop environment once you log into your system, you can start it manually using the [command]#startx# command. Note, however, that this is just a one-time fix and does not change the log in process for future log ins.
tr: [application]*X Pencere Sistemi* ve [application]*GNOME* gibi bir masaüstü ortamı kurduysanız, ancak sisteminizde oturum açtığınızda bir grafiksel masaüstü ortamı görmüyorsanız, [command]#startx# kullanarak elle başlatabilirsiniz. Ancak bunun yalnızca bir seferlik bir düzeltme olduğunu ve gelecekteki oturum açma işlemleri için oturum açma sürecini değiştirmediğini unutmayın.

source: To set up your system so that you can log in at a graphical login screen, you must change the default [application]*systemd* target to `graphical.target`. When you are finished, reboot the computer. You will presented with a graphical login prompt after the system restarts.
tr: Sisteminizi bir grafiksel oturum açma ekranında oturum açabilecek şekilde ayarlamak için öntanımlı [application]*systemd* hedefini `graphical.target` olarak değiştirmelisiniz. Bitirdiğinizde, bilgisayarı yeniden başlatın. Sistem yeniden başlatıldıktan sonra grafiksel bir oturum açma istemi ile karşılaşacaksınız.

source: Setting Graphical Login as Default
tr: Grafiksel Oturum Açmayı Öntanımlı Olarak Ayarlama

source: Open a shell prompt. If you are in your user account, become root by typing the [command]#su -# command.
tr: Bir kabuk istemi açın. Kullanıcı hesabınızdaysanız [command]#su -# komutunu yazarak root kullanıcısına geçiş yapın.

source: Change the default target to `graphical.target`. To do this, execute the following command:
tr: Öntanımlı hedefi `graphical.target` olarak değiştirin. Bunu yapmak için aşağıdaki komutu çalıştırın:

source: Graphical login is now enabled by default - you will be presented with a graphical login prompt after the next reboot. If you want to reverse this change and keep using the text-based login prompt, execute the following command as `root`:
tr: Grafiksel oturum açma artık öntanımlı olarak etkindir - bir sonraki yeniden başlatmanın ardından bir grafiksel oturum açma istemi ile karşılaşacaksınız. Bu değişikliği geri almak ve metin tabanlı oturum açma istemini kullanmaya devam etmek istiyorsanız, `root` olarak aşağıdaki komutu çalıştırın:

source: For more information about targets in [application]*systemd*, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++http://docs.fedoraproject.org/++[].
tr: [application]*systemd* hedefleri hakkında daha fazla bilgi için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Sistem Yöneticisi Kılavuzuna_ bakın.

source: No Graphical User Interface Present
tr: Grafiksel Kullanıcı Arayüzü Yok

source: If you are having trouble getting [application]*X* (the [application]*X Window System*) to start, it is possible that it has not been installed. Some of the pre-set base environments you can select during the installation, such as `Minimal install` or `Web Server`, do not include a graphical interface - it has to be installed manually.
tr: [application]*X* ([application]*X Pencere Sistemi*) başlatmakta sorun yaşıyorsanız, onu kurmamış olabilirsiniz. Kurulum sırasında seçebileceğiniz `Asgari kurulum` veya `Web Sunucusu` gibi bazı önceden ayarlanmış temel ortamlar, bir grafiksel arayüz içermez - elle kurulmalıdır.

source: If you want [application]*X*, you can install the necessary packages after the installation using the [application]*DNF* package manager. For example, to install [application]*GNOME*, use [command]#dnf install gnome-shell# as `root`.
tr: [application]*X* istiyorsanız, kurulumdan sonra [application]*DNF* paket yöneticisini kullanarak gerekli paketleri kurabilirsiniz. Örneğin, [application]*GNOME* kurmak için `root` olarak [command]#dnf install gnome-shell# komutunu kullanın.

source: X Server Crashing After User Logs In
tr: Kullanıcı Oturum Açtıktan Sonra X Sunucusu Çöküyor

source: If you are having trouble with the [application]*X* server crashing when a user logs in, one or more of your file systems may be full (or nearly full). To verify that this is the problem you are experiencing, execute the following command:
tr: Bir kullanıcı oturum açtığında [application]*X* sunucusunun çökmesiyle ilgili sorun yaşıyorsanız, bir veya daha fazla dosya sisteminiz dolu (veya neredeyse dolu) olabilir. Yaşadığınız sorunun bu olduğunu doğrulamak için aşağıdaki komutu çalıştırın:

source: The output will help you diagnose which partition is full - in most cases, the problem will be on the `/home` partition. A sample output of the [command]#df# command may look similar to the following:
tr: Çıktı, hangi bölümün dolu olduğunu teşhis etmenize yardımcı olacaktır - çoğu durumda sorun `/home` bölümünde olacaktır. [command]#df# komutunun örnek bir çıktısı aşağıdakine benzer şekilde görünebilir:

source: In the above example, you can see that the `/home` partition is full, which causes the crash. You can make some room on the partition by removing unneeded files. After you free up some disk space, start [application]*X* using the [command]#startx# command.
tr: Yukarıdaki örnekte, `/home` bölümünün dolu olduğunu ve bunun da çökmeye neden olduğunu görebilirsiniz. Gereksiz dosyaları kaldırarak bölümde biraz yer açabilirsiniz. Biraz disk alanı boşalttıktan sonra, [command]#startx# komutunu kullanarak [application]*X*'i başlatın.

source: For additional information about [command]#df# and an explanation of the options available (such as the [option]#-h# option used in this example), see the `df(1)` man page.
tr: [command]#df# komutu hakkında ek bilgi ve kullanılabilir seçeneklerin (bu örnekte kullanılan [option]#-h# seçeneği gibi) bir açıklaması için, `df(1)` kılavuz sayfasına bakın.

source: Is Your RAM Not Being Recognized?
tr: RAM'iniz Tanınmıyor Mu?

source: In some cases the kernel does not recognize all of your memory (RAM), which causes the system to use less memory than is installed. You can find out how much RAM is being utilized using the [command]#free -m# command. If the displayed total amount of memory does not match your expectations, it is likely that at least one of your memory modules is faulty. On BIOS-based systems, you can use the [application]*Memtest86+* utility to test your system's memory - see xref:advanced/Boot_Options.adoc#sect-boot-options-memtest[Loading the Memory (RAM) Testing Mode] for details.
tr: Bazı durumlarda, çekirdek tüm belleğinizi (RAM) tanımaz, bu da sistemin kurulu olandan daha az bellek kullanmasına neden olur. [command]#free -m# komutunu kullanarak ne kadar RAM kullanıldığını öğrenebilirsiniz. Görüntülenen toplam bellek miktarı beklentilerinizi karşılamıyorsa, bellek modüllerinizden en az biri arızalı olabilir. BIOS tabanlı sistemlerde, sisteminizin belleğini test etmek için [application]*Memtest86+* yardımcı programını kullanabilirsiniz - ayrıntılar için xref:advanced/Boot_Options.adoc#sect-boot-options-memtest[Bellek (RAM) Test Modunu Yükleme] bölümüne bakın.

source: If you have 4GB or more memory installed, but {PRODUCT} only shows around 3.5GB or 3.7GB, you have probably installed a 32-bit version of {PRODUCT} on a 64bit kernel. For modern systems, use the 64-bit (x86_64) version.
tr: 4 GB veya daha fazla bellek kuruluysa ancak {PRODUCT} yalnızca yaklaşık 3,5 GB veya 3,7 GB gösteriyorsa, muhtemelen 64 bit bir çekirdeğe {PRODUCT}'nın 32 bit sürümünü kurdunuz. Modern sistemler için 64 bit (x86_64) sürümünü kullanın.

source: Some hardware configurations have a part of the system's RAM reserved and unavailable to the main system. Notably, laptop computers with integrated graphics cards will reserve some memory for the GPU. For example, a laptop with 4{nbsp}GB of RAM and an integrated Intel graphics card will show only roughly 3.7{nbsp}GB of available memory, even with a 64-bit system.
tr: Bazı donanım yapılandırmalarında sistem RAM'inin bir kısmı ayrılmıştır ve ana sistem tarafından kullanılamaz. Özellikle tümleşik grafik kartlarına sahip dizüstü bilgisayarlar GPU için bir miktar bellek ayıracaktır. Örneğin, 4{nbsp}GB RAM'e ve tümleşik Intel grafik kartına sahip bir dizüstü bilgisayar, 64 bit sistemde bile yalnızca yaklaşık 3,7{nbsp}GB kullanılabilir bellek gösterecektir.

source: Additionally, the [application]*kdump* crash kernel dumping mechanism reserves some memory for the secondary kernel used in case of the primary kernel crashing. This reserved memory will also not be displayed as available when using the [command]#free# command. For details about [application]*kdump* and its memory requirements, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++http://docs.fedoraproject.org/++[].
tr: Ek olarak, [application]*kdump* çekirdek çökme döküm mekanizması, birincil çekirdeğin çökmesi durumunda kullanılan ikincil çekirdek için bir miktar bellek ayırır. Bu ayrılan bellek de, [command]#free# komutu çalıştırıldığında kullanılabilir olarak görüntülenmeyecektir. [application]*kdump* ve bellek gereksinimleriyle ilgili ayrıntılar için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Sistem Yöneticisi Kılavuzuna_ bakın.

source: If you made sure that your memory does not have any issues, you can try and set the amount of memory manually using the [option]#mem=# kernel option.
tr: Belleğinizde herhangi bir sorun olmadığından eminseniz, [option]#mem=# çekirdek seçeneğini kullanarak bellek miktarını elle ayarlamayı deneyebilirsiniz.

source: Configuring the Memory Manually
tr: Belleği Elle Yapılandırma

source: In the list of options, find the kernel line - that is, the line beginning with the keyword `linux` (or, in some cases, `linux16`). Append the following option to the end of this line:
tr: Seçenekler listesinde çekirdek satırını, yani `linux` (veya bazı durumlarda `linux16`) anahtar kelimesiyle başlayan satırı bulun. Bu satırın sonuna aşağıdaki seçeneği ekleyin:

source: Replace _xx_ with the amount of RAM you have in megabytes.
tr: _xx_ değerini megabayt cinsinden sahip olduğunuz RAM miktarıyla değiştirin.

source: Wait for the system to boot and log in. Then, open a command line and execute the [command]#free -m# command again. If total amount of RAM displayed by the command matches your expectations, append the following to the line beginning with `GRUB_CMDLINE_LINUX` in the `/etc/default/grub` file to make the change permanent:
tr: Sistemin önyüklemesini bekleyin ve oturum açın. Ardından bir komut satırı açın ve [command]#free -m# komutunu tekrar çalıştırın. Komut tarafından görüntülenen toplam RAM miktarı beklentilerinize uyuyorsa, değişikliği kalıcı hale getirmek için `/etc/default/grub` dosyasında `GRUB_CMDLINE_LINUX` ile başlayan satırın sonuna aşağıdakini ekleyin:

source: After you updated the file and saved it, refresh the boot loader configuration so that the change will take effect. Run the following command with root privileges:
tr: Dosyayı güncelleyip kaydettikten sonra, değişikliğin etkili olması için önyükleyici yapılandırmasını yenileyin. Aşağıdaki komutu root ayrıcalıklarıyla çalıştırın:

source: In `/etc/default/grub`, the above example would look similar to the following:
tr: `/etc/default/grub` dosyasında, yukarıdaki örnek aşağıdakine benzer şekilde görünecektir:
