Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/install/After_Installation.po
Languages: fi, uk

source: After the Installation
fi: Asennuksen jälkeen
uk: Після встановлення

source: This chapter describes the initial setup tools which open after you finish the installation, reboot the system, and log in for the first time.
fi: Tässä luvussa kuvataan ensimmäiset asetustyökalut, jotka avautuvat, kun olet suorittanut asennuksen, käynnistänyt järjestelmän uudelleen ja kirjautunut sisään ensimmäisen kerran.
uk: У цьому розділі описуються інструменти початкового налаштування, які відкриваються після завершення встановлення, перезавантаження системи та першого входу до системи.

source: Two separate configuration tools are part of {PRODUCT}. If you installed the [application]*GNOME* desktop environment (the default {PRODUCT} environment, installed for example as part of the {PRODUCT} Workstation Edition), the [application]*GNOME Initial Setup* utility will open; for all other graphical environments, the [application]*Initial Setup* tool serves the same purpose.
fi: Kaksi erillistä määritystyökalua on osa tuotetta {PRODUCT}. Jos asensit [application]*GNOME*-työpöytäympäristön (oletus {PRODUCT}-ympäristö, joka on asennettu esimerkiksi osana {PRODUCT} Workstation Edition -versiota), [application]*GNOME Initial Setup* -apuohjelma avautuu. kaikissa muissa graafisissa ympäristöissä [sovellus]*Alkuasetukset* -työkalu palvelee samaa tarkoitusta.
uk: Два окремі інструменти налаштування є частиною {PRODUCT}. Якщо ви встановили робоче середовище [application]*GNOME* (середовище {PRODUCT} за замовчуванням, встановлене, наприклад, як частина {PRODUCT} Workstation Edition), відкриється утиліта [application]*GNOME Initial Setup*; для всіх інших графічних середовищ інструмент [application]*Initial Setup* служить тій самій меті.

source: Both of these tools will allow you to configure user-specific settings which have not been configured during the installation. Some of the settings are available both in the graphical installer (or as Kickstart commands) as well as in the initial-setup utilities; in that case, they will only be displayed after the first reboot if you skipped them during the installation. This means that, for example, if you configured a user account before the installation finished, you will not be prompted to do so again after the installation completes.
fi: Molempien työkalujen avulla voit määrittää käyttäjäkohtaisia asetuksia, joita ei ole määritetty asennuksen aikana. Jotkut asetuksista ovat käytettävissä sekä graafisessa asennusohjelmassa (tai Kickstart-komentoina) että alkuasetusapuohjelmissa; siinä tapauksessa ne näkyvät vain ensimmäisen uudelleenkäynnistyksen jälkeen, jos ohitit ne asennuksen aikana. Tämä tarkoittaa, että jos esimerkiksi määritit käyttäjätilin ennen asennuksen päättymistä, sinua ei kehoteta tekemään niin uudelleen asennuksen päätyttyä.
uk: Обидва ці інструменти дозволять вам налаштувати параметри користувача, які не були налаштовані під час інсталяції. Деякі параметри доступні як у графічному інсталяторі (або як команди Kickstart), так і в утилітах початкового налаштування; у цьому випадку вони відображатимуться лише після першого перезавантаження, якщо ви пропустили їх під час встановлення. Це означає, що, наприклад, якщо ви налаштували обліковий запис користувача до завершення інсталяції, вам не буде запропоновано зробити це знову після завершення інсталяції.

source: GNOME Initial Setup
fi: GNOME-alkuasetukset
uk: Початкове налаштування GNOME

source: The [application]*GNOME Initial Setup* utility will be displayed after you log in for the first time with any user account, as long as your first login is in the [application]*GNOME* desktop environment.
fi: [Application]*GNOME Initial Setup* -apuohjelma tulee näkyviin, kun kirjaudut sisään ensimmäisen kerran millä tahansa käyttäjätilillä, kunhan ensimmäinen kirjautumisesi tapahtuu [application]*GNOME*-työpöytäympäristössä.
uk: Утиліта [application]*GNOME Initial Setup* відобразиться після того, як ви вперше ввійдете в будь-який обліковий запис користувача, за умови, що ваш перший вхід буде виконано в середовищі робочого столу [application]*GNOME*.

source: GNOME Initial Setup with language selection displayed.
fi: GNOME-alkuasetukset ja kielen valinta näytetään.
uk: Початкове налаштування GNOME з вибором мови.

source: This utility allows you to configure several user-specific settings, such as system language or the default keyboard layout. Use the `Next` and `Previous` buttons at the top of the window to navigate between screens. Some screens (`Configure online accounts` in particular) are optional and can be skipped using the `Skip` button in the top right corner.
fi: Tämän apuohjelman avulla voit määrittää useita käyttäjäkohtaisia asetuksia, kuten järjestelmän kielen tai oletusnäppäimistöasettelun. Käytä "Seuraava"- ja "Edellinen"-painikkeita ikkunan yläosassa navigoidaksesi näytöstä toiseen. Jotkut näytöt (erityisesti "Määritä online-tilit") ovat valinnaisia, ja ne voidaan ohittaa käyttämällä "Ohita" -painiketta oikeassa yläkulmassa.
uk: Ця утиліта дозволяє налаштувати кілька індивідуальних параметрів, наприклад мову системи або розкладку клавіатури за замовчуванням. Для переходу між екранами використовуйте кнопки «Далі» та «Назад» у верхній частині вікна. Деякі екрани (зокрема «Налаштувати облікові записи онлайн») є необов’язковими, і їх можна пропустити, натиснувши кнопку «Пропустити» у верхньому правому куті.

source: After you finish configuring all screens, click `Start using Fedora` to exit the utility. After that, the `Getting Started` page from GNOME help will be displayed, and you can either browse the help content, or close it and start using your desktop.
fi: Kun olet määrittänyt kaikki näytöt, sulje apuohjelma napsauttamalla "Aloita Fedoran käyttö". Tämän jälkeen GNOME-ohjeen Aloitussivu tulee näkyviin, ja voit joko selata ohjesisältöä tai sulkea sen ja aloittaa työpöydän käytön.
uk: Після завершення налаштування всіх екранів натисніть `Почати використання Fedora`, щоб вийти з утиліти. Після цього відобразиться сторінка `Початок роботи` з довідки GNOME, і ви зможете або переглянути вміст довідки, або закрити її та почати використовувати свою систему.

source: Common Post-installation Tasks
fi: Yleisiä asennuksen jälkeisiä tehtäviä
uk: Типові завдання після інсталяції

source: After you finish the installation and go through one of the initial setup utilities described above, your system is ready for use. However, other administrative tasks not covered by the installer or the initial setup utilities may still be necessary, depending on how you plan to use your system. The list below describes some of the more common tasks usually performed immediately after a new installation.
fi: Kun olet suorittanut asennuksen ja käynyt läpi jonkin yllä kuvatuista alkuasennuksen apuohjelmista, järjestelmäsi on valmis käytettäväksi. Muut hallinnolliset tehtävät, joita asennusohjelma tai alkuasennuksen apuohjelmat eivät kuitenkaan kata, voivat kuitenkin olla tarpeen, riippuen siitä, miten aiot käyttää järjestelmääsi. Alla olevassa luettelossa kuvataan joitain yleisimmistä tehtävistä, jotka yleensä suoritetaan välittömästi uuden asennuksen jälkeen.
uk: Після завершення інсталяції та виконання однієї з утиліт початкового налаштування, описаних вище, ваша система готова до використання. Однак, залежно від того, як ви плануєте використовувати свою систему, можуть знадобитися інші адміністративні завдання, які не охоплюються інсталятором або утилітами початкового налаштування. У наведеному нижче списку описано деякі з найпоширеніших завдань, які зазвичай виконуються одразу після нової інсталяції.

source: Recover a lost `root` password
fi: Palauta kadonnut "root"-salasana
uk: Відновлення втраченого `root` пароля

source: The `root` password, which is configured during the installation, is required for accessing the system as the `root` user. Without this password you will not be able to configure your system or install additional software. If you lost or forgot your `root` password, you can reset it by following the steps described in xref:install/Troubleshooting.adoc#sect-trouble-after-reset-root-password[Resetting the Root Password].
fi: "Root"-salasana, joka määritetään asennuksen aikana, tarvitaan pääsyyn järjestelmään "root"-käyttäjänä. Ilman tätä salasanaa et voi määrittää järjestelmääsi tai asentaa lisäohjelmistoja. Jos kadotit tai unohdit "root"-salasanasi, voit nollata sen noudattamalla ohjeita, jotka on kuvattu kohdassa xref:install/Troubleshooting.adoc#sect-trouble-after-reset-root-password[Root-salasanan nollaaminen].
uk: Пароль `root`, який налаштовується під час інсталяції, потрібен для доступу до системи від імені користувача `root`. Без цього пароля ви не зможете налаштувати систему або встановити додаткове програмне забезпечення. Якщо ви втратили або забули пароль root, ви можете скинути його, виконавши кроки, описані в xref:install/Troubleshooting.adoc#sect-trouble-after-reset-root-password[Скидання пароля root].

source: Configure the network
fi: Määritä verkko
uk: Налаштування мережі

source: In most cases, network access is configured during the installation process, either in the [application]*Anaconda* installation program (see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Network & Hostname]) or in a Kickstart file (see xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-network[network (optional) - Configure Network Interfaces]). For information on configuring the network after the installation, see the [citetitle]_{PRODUCT} Networking Guide_, available at link:++https://docs.fedoraproject.org/++[].
fi: Useimmissa tapauksissa verkkoyhteys määritetään asennuksen aikana joko [application]*Anaconda*-asennusohjelmassa (katso xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Network & Hostname]) tai Kickstart-tiedostossa (katso xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-network[verkko (valinnainen) - Määritä verkkoliitännät]). Lisätietoja verkon määrittämisestä asennuksen jälkeen on [citetitle]_{PRODUCT} Networking Guide_ -oppaassa, joka on saatavilla link:++https://docs.fedoraproject.org/++[].
uk: У більшості випадків мережевий доступ налаштовується під час процесу встановлення або в програмі встановлення [application]*Anaconda* (див. xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Мережа та ім'я хосту]) або у файлі Kickstart (див. xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-network[мережа (необов’язково) — налаштування мережевих інтерфейсів]). Щоб отримати інформацію щодо налаштування мережі після інсталяції, перегляньте [citetitle]_{PRODUCT} Networking Guide_, доступний за посиланням:++https://docs.fedoraproject.org/++[].

source: Perform an initial system update
fi: Suorita ensimmäinen järjestelmäpäivitys
uk: Виконайте початкове оновлення системи

source: If you installed {PRODUCT} from a full installation ISO image (such as the Workstation live image or full Server DVD), it is recommended to perform an initial system update, because your installation media likely contained older versions of software packages. During the initial update, all installed packages are updated to their latest available versions. Updates to packages provide security fixes, bug fixes and enhancements.
fi: Jos asensit {PRODUCT} täydellisestä asennuksen ISO-levykuvasta (kuten Workstationin live-levykuva tai täydellinen palvelin-DVD), on suositeltavaa suorittaa ensimmäinen järjestelmäpäivitys, koska asennusmediasi sisälsi todennäköisesti ohjelmistopakettien vanhempia versioita. Ensimmäisen päivityksen aikana kaikki asennetut paketit päivitetään uusimpiin saatavilla oleviin versioihinsa. Pakettien päivitykset sisältävät tietoturvakorjauksia, virheenkorjauksia ja parannuksia.
uk: Якщо ви встановили {PRODUCT} із повного інсталяційного образу ISO (наприклад, live-образу Workstation або повного DVD-диска сервера), рекомендується виконати початкове оновлення системи, оскільки ваш інсталяційний носій, імовірно, містив старіші версії програмних пакетів. Під час початкового оновлення всі встановлені пакети оновлюються до останніх доступних версій. Оновлення пакетів містять виправлення безпеки, виправлення помилок і вдосконалення.

source: Install driver updates
fi: Asenna ohjainpäivitykset
uk: Встановіть оновлення драйверів

source: Configure additional repositories
fi: Määritä lisää asennuslähteitä
uk: Налаштуйте додаткові репозиторії

source: New software is installed from _package repositories_. Package repositories are organized sets of software and metadata that can be accessed by the [application]*DNF* package manager. By default, several update repositories provided by {PRODUCT} are configured automatically and you can install updates and additional software from those. However, if you want to set up additional repositories, for example ones containing your own software, some extra steps are needed.
fi: Uusi ohjelmisto asennetaan _asennuslähteestä_Asennuslähteet ovat järjestettyjä ohjelmisto- ja metatietojoukkoja, joita [sovellus]*DNF*-pakettien hallinta voi käyttää. Oletuksena useat {PRODUCT}:n tarjoamat asennuslähteet määritetään automaattisesti, ja voit asentaa päivityksiä ja lisäohjelmistoja niistä. Jos kuitenkin haluat määrittää lisää asennuslähteitä, esimerkiksi sellaisia, jotka sisältävät oman ohjelmistosi, tarvitaan joitain lisävaiheita.
uk: Нове програмне забезпечення встановлюється з _репозиторіїв пакетів_. Репозиторії пакетів — це організовані набори програмного забезпечення та метаданих, до яких може отримати доступ менеджер пакетів [application]*DNF*. За замовчуванням кілька сховищ, наданих {PRODUCT}, налаштовуються автоматично, і ви можете інсталювати оновлення та додаткове програмне забезпечення з них. Однак, якщо ви хочете налаштувати додаткові сховища, наприклад ті, що містять ваше власне програмне забезпечення, потрібні деякі додаткові дії.

source: For information about configuring additional software repositories, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
fi: Lisätietoja muiden asennuslähteiden määrittämisestä on [citetitle]_{PRODUCT} System Administrator's Guide -oppaassa_, joka on saatavilla link:++https://docs.fedoraproject.org/++[].
uk: Щоб отримати інформацію про налаштування додаткових сховищ програмного забезпечення, перегляньте [citetitle]_{PRODUCT} Посібник системного адміністратора_, доступний за посиланням:++https://docs.fedoraproject.org/++[].

source: Install additional packages
fi: Asenna lisäpaketteja
uk: Встановлення додаткових пакетів

source: Switch to a graphical login
fi: Vaihda graafiseen kirjautumiseen
uk: Перехід на графічний вхід

source: Depending on the options you chose during the installation process, it is possible that your system does not have a graphical interface, instead offering only a text-based prompt. If this is the case and you wish to enable a graphical desktop after the installation, you must install the [application]*X Window System* and your preferred desktop environment (either [application]*GNOME* or [application]*KDE*).
fi: Riippuen asennuksen aikana valitsemistasi vaihtoehdoista, on mahdollista, että järjestelmässäsi ei ole graafista käyttöliittymää, vaan se tarjoaa vain tekstipohjaisen kehotteen. Jos näin on ja haluat ottaa graafisen työpöydän käyttöön asennuksen jälkeen, sinun on asennettava [sovellus]*X Window System* ja haluamasi työpöytäympäristö (joko [sovellus]*GNOME* tai [sovellus]*KDE*) .
uk: Залежно від параметрів, які ви вибрали під час процесу встановлення, можливо, ваша система не має графічного інтерфейсу, натомість пропонує лише текстову підказку. Якщо це так, і ви бажаєте ввімкнути графічний робочий стіл після інсталяції, вам потрібно встановити [application]*X Window System* і бажане робоче середовище ([application]*GNOME* або [application]*KDE*) .
