Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f30/nav.po
Languages: es, zh_hans

source: xref:index.adoc[Installation Guide]
es: xref:index.adoc[Guía de Instalación]
zh_hans: xref:index.adoc[安装指南]

source: xref:Preface.adoc[Preface]
es: xref:Preface.adoc[Preámbulo]
zh_hans: xref:Preface.adoc[序言]

source: xref:Introduction.adoc[Introduction]
es: xref:Introduction.adoc[Introducción]
zh_hans: xref:Introduction.adoc[简介]

source: xref:Downloading_Fedora.adoc[Downloading Fedora]
es: xref:Downloading_Fedora.adoc[Descargar Fedora]
zh_hans: xref:Downloading_Fedora.adoc[下载Fedora]

source: Installing Fedora
es: Instalar Fedora
zh_hans: 安装Fedora

source: xref:install/Preparing_for_Installation.adoc[Preparing for Installation]
es: xref:install/Preparing_for_Installation.adoc[Preparando la Instalación]
zh_hans: xref:install/Preparing_for_Installation.adoc[安装前准备]

source: xref:install/Booting_the_Installation.adoc[Booting the Installation]
es: xref:install/Booting_the_Installation.adoc[Iniciando la Instalación]
zh_hans: xref:install/Booting_the_Installation.adoc[启动安装介质]

source: xref:install/Installing_Using_Anaconda.adoc[Installing Using Anaconda]
es: xref:install/Installing_Using_Anaconda.adoc[Instalar Usando Anaconda]
zh_hans: xref:install/Installing_Using_Anaconda.adoc[使用Anaconda进行安装]

source: xref:install/After_Installation.adoc[After the Installation]
es: xref:install/After_Installation.adoc[Después de la Instalación]
zh_hans: xref:install/After_Installation.adoc[安装后准备]

source: xref:install/Troubleshooting.adoc[Troubleshooting]
es: xref:troubleshooting.adoc[Solución de errores]
zh_hans: xref:install/Troubleshooting.adoc[疑难解答]

source: Advanced Installation Options
es: Opciones Avanzadas de Instalación
zh_hans: 高级安装选项

source: xref:advanced/Boot_Options.adoc[Boot Options]
es: xref:advanced/Boot_Options.adoc[Opciones de Arranque]
zh_hans: xref:advanced/Boot_Options.adoc[启动选项]

source: xref:advanced/Kickstart_Installations.adoc[Automating the Installation with Kickstart]
es: xref:advanced/Kickstart_Installations.adoc[Automatizando la Instalación con Kickstart]
zh_hans: xref:advanced/Kickstart_Installations.adoc[使用Kickstart实现安装步骤自动化]

source: xref:advanced/Network_based_Installations.adoc[Setting Up an Installation Server]
es: xref:advanced/Network_based_Installations.adoc[Configurando un Servidor de Instalación]
zh_hans: xref:advanced/Network_based_Installations.adoc[搭建安装服务器]

source: xref:advanced/VNC_Installations.adoc[Installing Using VNC]
es: xref:advanced/VNC_Installations.adoc[Instalación Usando VNC]
zh_hans: xref:advanced/VNC_Installations.adoc[使用VNC进行安装]

source: xref:advanced/Upgrading_Your_Current_System.adoc[Upgrading Your Current System]
es: xref:advanced/Upgrading_Your_Current_System.adoc[Actualizar Su Sistema Actual]
zh_hans: xref:advanced/Upgrading_Your_Current_System.adoc[升级你当前的操作系统]

source: Technical Appendixes
es: Apéndices Técnicos
zh_hans: 技术名词附录

source: xref:appendixes/Kickstart_Syntax_Reference.adoc[Kickstart Syntax Reference]
es: xref:appendixes/Kickstart_Syntax_Reference.adoc[Referencia Sintáctica Kickstart]
zh_hans: xref:appendixes/Kickstart_Syntax_Reference.adoc[Kickstart语法参考]

source: xref:appendixes/Disk_Partitions.adoc[An Introduction to Disk Partitions]
es: xref:appendixes/Disk_Partitions.adoc[Una Introducción al Particionado de Discos]
zh_hans: xref:appendixes/Disk_Partitions.adoc[一段关于磁盘分区的介绍]

source: xref:appendixes/Understanding_LVM.adoc[Understanding LVM]
es: xref:appendixes/Understanding_LVM.adoc[Entendiendo LVM]
zh_hans: xref:appendixes/Understanding_LVM.adoc[理解LVM]

source: xref:Revision_History.adoc[Revision History]
es: xref:Revision_History.adoc[Historial de modificaciones]
zh_hans: xref:Revision_History.adoc[修订历史]
