Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f36/pages/advanced/Kickstart_Installations.po
Languages: pt_br

source: Automating the Installation with Kickstart
pt_br: Automatizando a Instalação com o Kickstart

source: Kickstart installations offer a means to automate the installation process, either partially or fully. Kickstart files contain answers to all questions normally asked by the installation program, such as what time zone do you want the system to use, how should the drives be partitioned or which packages should be installed. Providing a prepared Kickstart file when the installation begins therefore allows the you to perform the installation automatically, without need for any intervention from the user. This is especially useful when deploying {PRODUCT} on a large number of systems at once.
pt_br: As instalações Kickstart oferecem um meio de automatizar o processo de instalação, parcial ou totalmente. Os arquivos Kickstart contêm respostas para todas as perguntas normalmente feitas pelo programa de instalação, como o fuso horário que você deseja que o sistema use, como as unidades devem ser particionadas ou quais pacotes devem ser instalados. Fornecer um arquivo Kickstart preparado quando a instalação começa, portanto, permite que você execute a instalação automaticamente, sem a necessidade de qualquer intervenção do usuário. Isso é especialmente útil ao implantar o {PRODUCT} em um grande número de sistemas ao mesmo tempo.

source: All Kickstart scripts and the log files of their execution are stored in the `/tmp` directory to assist with debugging installation issues.
pt_br: Todos os scripts Kickstart e os arquivos de log de sua execução são armazenados no diretório `/tmp` para auxiliar na depuração de problemas de instalação.

source: How to Perform a Kickstart Installation
pt_br: Como Realizar uma Instalação com Kickstart

source: Kickstart installations can be performed using a local DVD, a local hard drive, or via NFS, FTP, HTTP, or HTTPS.
pt_br: As instalações com Kickstart podem ser realizadas usando um DVD local, um disco rígido local ou via NFS, FTP, HTTP ou HTTPS.

source: To use Kickstart, you must:
pt_br: Para usar o Kickstart, você deve:

source: Create a Kickstart file.
pt_br: Criar um arquivo Kickstart.

source: Create boot media or configure a network boot (PXE) server which will be used to begin the installation. Note that live media cannot be used for Kickstart installations - use installation media that can boot directly into the installer, such as the standard or netinstall ISO image from the Server edition.
pt_br: Crie uma mídia de inicialização ou configure um servidor de inicialização de rede (PXE) que será usado para iniciar a instalação. Observe que a mídia live não pode ser usada para instalações Kickstart — use a mídia de instalação que pode inicializar diretamente no instalador, como a imagem ISO padrão ou netinstall da edição Servidor.

source: Make the Kickstart file available on removable media, a hard drive, or a network location.
pt_br: Disponibilizar o arquivo Kickstart em uma mídia removível, um disco rígido ou um local de rede.

source: Start the Kickstart installation by booting the installer and using a boot option to tell the installer where to find the Kickstart file.
pt_br: Iniciar a instalação do Kickstart inicializando o instalador e usando uma opção de inicialização para dizer ao instalador onde encontrar o arquivo Kickstart.

source: This chapter explains these steps in detail.
pt_br: Este capítulo explica essas etapas em detalhes.

source: Creating a Kickstart File
pt_br: Criando um Arquivo Kickstart

source: The Kickstart file itself is a plain text file, containing keywords listed in xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference], which serve as directions for the installation. Any text editor able to save files as ASCII text (such as [application]*Gedit* or [application]*vim* on Linux systems or [application]*Notepad* on Windows systems) can be used to create and edit Kickstart files.
pt_br: O próprio arquivo Kickstart é um arquivo de texto simples, contendo palavras-chave listadas em xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Referência da Sintaxe do Kickstart], que servem como instruções para a instalação. Qualquer editor de texto capaz de salvar arquivos como texto ASCII (como [application]*Gedit* ou [application]*vim* em sistemas Linux ou [application]*Notepad* em sistemas Windows) pode ser usado para criar e editar arquivos Kickstart.

source: The recommended approach to creating Kickstart files is to perform a manual installation on one system first. After the installation completes, all choices made during the installation are saved into a file named `anaconda-ks.cfg`, located in the `/root/` directory on the installed system. You can then copy this file, make any changes you need, and use the resulting configuration file in further installations.
pt_br: A abordagem recomendada para criar arquivos Kickstart é executar uma instalação manual em um sistema primeiro. Após a conclusão da instalação, todas as escolhas feitas durante a instalação são salvas em um arquivo chamado `anaconda-ks.cfg`, localizado no diretório `/root/`no sistema instalado. Em seguida, você pode copiar esse arquivo, fazer as alterações necessárias e usar o arquivo de configuração resultante em outras instalações.

source: When creating a Kickstart file, keep in mind the following:
pt_br: Ao criar um arquivo Kickstart, tenha em mente o seguinte:

source: Lines starting with a pound sign (`#`) are treated as comments and are ignored.
pt_br: As linhas que começam com uma cerquilha (`#`) são tratadas como comentários e são ignoradas.

source: Sections must be specified *in order*. Items within the sections do not have to be in a specific order unless otherwise specified. The correct section order is:
pt_br: As seções devem ser especificadas *em ordem*. Os itens nas seções não precisam estar em uma ordem específica, a menos que especificado de outra forma. A ordem correta das seções é:

source: The command section which contains actual Kickstart commands and options as listed in xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference]. Note that some commands, such as [command]#install#, are mandatory, but most commands are optional.
pt_br: A seção de comando que contém os comandos e opções reais do Kickstart, conforme listado em xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Referência da Sintaxe do Kickstart]. Observe que alguns comandos, como [command]#install#, são obrigatórios, mas a maioria dos comandos são opcionais.

source: The [command]#%packages# section which contains a list of packages and package groups to be installed. See xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-packages[%packages (required) - Package Selection] for details.
pt_br: A seção [command]#%packages# que contém uma lista de pacotes e grupos de pacotes a serem instalados. Veja xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-packages[%packages (obrigatório) - Seleção de Pacotes] para detalhes.

source: The [command]#%pre# and [command]#%post# sections, containing a pre-installation and post-installation scripts. These two sections can be in any order and are not mandatory. See xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-preinstall[%pre (optional) - Pre-installation Script] and xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-postinstall[%post (optional) - Post-installation Script] for details.
pt_br: As seções [command]#%pre# e [command]#%post#, contendo scripts de pré-instalação e pós-instalação. Essas duas seções podem estar em qualquer ordem e não são obrigatórias. Veja xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-preinstall[%pre (opcional) - Script de Pré-instalação] e xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-postinstall[%post (opcional) - Script de Pós-instalação] para obter detalhes.

source: The [command]#%packages#, [command]#%pre# and [command]#%post# sections must end with [command]#%end#, otherwise the installation program will refuse the Kickstart file. The main command section has no special ending statement.
pt_br: As seções [command]#%packages#, [command]#%pre# e [command]#%post# devem terminar com [command]#%end#. Caso contrário, o programa de instalação recusará o arquivo Kickstart. A seção de comando principal não possui instrução final especial.

source: Omitting any required item results in the installation program prompting the user for an answer to the related item, just as the user would be prompted during a typical installation. Once the answer is given, the installation will continue. Note that if the system you are installing has no display, you will not be able to see the prompt, and the installation will appear to have failed.
pt_br: A omissão de qualquer item obrigatório resulta no programa de instalação solicitando ao usuário uma resposta para o item relacionado, da mesma forma que o usuário seria solicitado durante uma instalação típica. Assim que a resposta for dada, a instalação continuará. Observe que se o sistema que você está instalando não tiver tela, você não conseguirá ver o prompt e a instalação parecerá ter falhado.

source: Verifying the Kickstart File
pt_br: Verificando o Arquivo Kickstart

source: When creating or customizing your kickstart file, it is useful to verify that it is valid before attempting to use it in an installation. {PRODUCT} includes the [application]*ksvalidator* command line utility which can be used to do this. This tool is a part of the [package]*pykickstart* package. To install this package, execute the following command:
pt_br: Ao criar ou personalizar seu arquivo Kickstart, é útil verificar se ele é válido antes de tentar usá-lo em uma instalação. O {PRODUCT} inclui o utilitário de linha de comando [application]*ksvalidator* que pode ser usado para fazer isso. Esta ferramenta faz parte do pacote [package]*pykickstart*. Para instalar este pacote, execute o seguinte comando:

source: After installing the package, you can validate a Kickstart file using the following command:
pt_br: Depois de instalar o pacote, você pode validar um arquivo Kickstart usando o seguinte comando:

source: $ [command]#ksvalidator _/path/to/kickstart.ks_#
pt_br: $ [command]#ksvalidator _/caminho/para/kickstart.ks_#

source: Replace _/path/to/kickstart.ks_ with the path to the Kickstart file you want to verify.
pt_br: Substitua _/caminho/para/kickstart.ks_ pelo caminho para o arquivo Kickstart que você deseja verificar.

source: For more information about this tool, see the `ksvalidator(1)` man page.
pt_br: Para mais informações sobre esta ferramenta, veja a página man `ksvalidator(1)`.

source: Keep in mind that the validation tool has its limitations. The Kickstart file can be very complicated; [application]*ksvalidator* can make sure the syntax is correct and that the file does not include removed options, but it cannot guarantee the installation will be successful. It also does not attempt to validate the [command]#%pre#, [command]#%post# and [command]#%packages# sections of the Kickstart file.
pt_br: Lembre-se de que a ferramenta de validação tem suas limitações. O arquivo Kickstart pode ser muito complicado; [application]*ksvalidator* pode verificar se a sintaxe está correta e se o arquivo não inclui opções removidas, mas não pode garantir que a instalação será bem-sucedida. Ele também não tenta validar as seções [command]#%pre#, [command]#%post# e [command]#%packages# do arquivo Kickstart.

source: Making the Kickstart File Available
pt_br: Disponibilizando o Arquivo Kickstart

source: Once you create a Kickstart file, you can place it in one of the following locations:
pt_br: Depois de criar um arquivo Kickstart, você pode colocá-lo em um dos seguintes locais:

source: On *removable media*, such as a DVD or USB flash drive connected to the installation system
pt_br: Em *mídia removível*, como um DVD ou unidade flash USB conectada ao sistema de instalação

source: On a *hard drive* connected to the installation system
pt_br: Em um *disco rígido* conectado ao sistema de instalação

source: On a *network share* reachable from the installation system
pt_br: Em um *compartilhamento de rede* acessível a partir do sistema de instalação

source: Normally, a Kickstart file is copied to removable media or a hard drive, or made available on the network. Placing the file in a network location complements the usual approach to Kickstart installations, which is also network-based: the system is booted using a PXE server, the Kickstart file is downloaded from a network share, and software packages specified in the file are downloaded from remote repositories.
pt_br: Normalmente, um arquivo Kickstart é copiado para uma mídia removível ou um disco rígido, ou disponibilizado na rede. Colocar o arquivo em um local de rede complementa a abordagem usual para instalações Kickstart, que também é baseada em rede: o sistema é inicializado usando um servidor PXE, o arquivo Kickstart é baixado de um compartilhamento de rede e os pacotes de software especificados no arquivo são baixados de repositórios remotos.

source: xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Setting Up an Installation Server] offers some additional information about preparing for a network-based installation.
pt_br: xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Configurando um Servidor de Instalação] oferece algumas informações adicionais sobre a preparação para uma instalação baseada em rede.

source: Starting the Kickstart Installation
pt_br: Iniciando a Instalação com Kickstart

source: Once you have everything ready - you have created a valid Kickstart file and you have either local boot media or a PXE server available, you can start the Kickstart installation. You need to use the [option]#inst.ks=# boot option either in the boot menu (when booting from local media), or add this option to your PXE server configuration. For information about boot options used in Kickstart installations, see xref:advanced/Boot_Options.adoc#sect-boot-options-kickstart[Kickstart Boot Options].
pt_br: Depois de ter tudo pronto – você criou um arquivo Kickstart válido e tem a mídia de inicialização local ou um servidor PXE disponível, você pode iniciar a instalação do Kickstart. Você precisa usar a opção de inicialização [option]#inst.ks=# no menu de inicialização (ao inicializar a partir da mídia local) ou adicionar esta opção à configuração do servidor PXE. Para obter informações sobre as opções de inicialização usadas nas instalações do Kickstart, consulte xref:advanced/Boot_Options.adoc#sect-boot-options-kickstart[Opções de Inicialização do Kickstart].
