Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f36/pages/advanced/Network_based_Installations.po
Languages: pt_br

source: Setting Up an Installation Server
pt_br: Configurando um Servidor de Instalação

source: This appendix is intended for users with previous Linux experience. If you are a new user, you may want to install using minimal boot media or the distribution DVD instead.
pt_br: Este apêndice se destina a usuários com experiência anterior em Linux. Se você for um novo usuário, convém instalar usando a mídia de inicialização mínima ou o DVD de distribuição.

source: PXE Installation Overview
pt_br: Visão Geral da Instalação PXE

source: Preboot Execution Environment, or PXE, is a techonology that allows computers to boot directly from resources provided over the network. Installing Fedora over the network means you don't have to create media, and you can install to multiple computers or virtual machine simultaneously. The process involves a number of components and features working together to provide the resources required.
pt_br: Preboot Execution Environment, ou PXE, é uma tecnologia que permite que os computadores inicializem diretamente de recursos fornecidos pela rede. Instalar o Fedora pela rede significa que você não precisa criar mídia e pode instalar em vários computadores ou máquina virtual simultaneamente. O processo envolve vários componentes e recursos trabalhando juntos para fornecer os recursos necessários.

source: PXE-capable computer
pt_br: Computador compatível com PXE

source: Most modern computers have the capability to network boot. Typically, a function key pressed during boot will bring up a boot selection menu. In environments designed for unattended administration, systems will often be configured to first attempt booting from the network, then boot from local storage, and the installation server is configured to only offer the installation when required. Your computer's manual will provide specific instructions on setting boot priorities.
pt_br: A maioria dos computadores modernos tem a capacidade de inicialização pela rede. Normalmente, uma tecla de função pressionada durante a inicialização abrirá um menu de seleção de inicialização. Em ambientes projetados para administração autônoma, os sistemas geralmente são configurados para tentar inicializar pela rede e, em seguida, inicializar do armazenamento local, e o servidor de instalação é configurado para oferecer a instalação apenas quando necessário. O manual do seu computador fornecerá instruções específicas sobre como definir as prioridades de inicialização.

source: DHCP Server
pt_br: Servidor DHCP

source: When a system requests an address during network booting, the DHCP server also provides the location of files to boot. A network should have only one DHCP server.
pt_br: Quando um sistema solicita um endereço durante a inicialização da rede, o servidor DHCP também fornece a localização dos arquivos para inicializar. Uma rede deve ter apenas um servidor DHCP.

source: TFTP Server
pt_br: Servidor TFTP

source: Because the pre-boot environment is very simple, files must be provided in a very simple way. Trivial File Transfer Protocol, or TFTP, provides the system with the bootloader required to continue the installation process.
pt_br: Como o ambiente de pré-inicialização é muito simples, os arquivos devem ser fornecidos de uma maneira muito simples. O Trivial File Transfer Protocol, ou TFTP, fornece ao sistema o carregador de inicialização necessário para continuar o processo de instalação.

source: Bootloader
pt_br: Carregador de inicialização

source: Because the job of booting an operating system is too complex for the pre-boot environment, a bootloader is used to load the kernel and related files. It also provides configuration information to the installer, and can offer a menu to select from different configurations.
pt_br: Como a tarefa de inicializar um sistema operacional é muito complexa para o ambiente de pré-inicialização, um carregador de inicialização é usado para carregar o kernel e arquivos relacionados. Ele também fornece informações de configuração ao instalador e pode oferecer um menu para selecionar diferentes configurações.

source: Kernel and Initramfs
pt_br: Kernel e Initramfs

source: The kernel is the core of any Linux operating system, and the initramfs provides the kernel with required tools and resources. These files are also provided by tftp.
pt_br: O kernel é o núcleo de qualquer sistema operacional Linux e o initramfs fornece ao kernel as ferramentas e recursos necessários. Esses arquivos também são fornecidos pelo tftp.

source: Package repository
pt_br: Repositório de pacotes

source: A Fedora repository must be available for the installation. The example in this section uses the public Fedora mirrors as the repository source, but you can also use a repo on the local network provided by NFS, FTP, or HTTP. Repositories can be configured using the [option]#inst.repo=# boot option; see xref:advanced/Boot_Options.adoc#sect-boot-options-sources[Specifying the Installation Source] for details.
pt_br: Um repositório Fedora deve estar disponível para a instalação. O exemplo nesta seção usa os espelhos públicos do Fedora como a fonte do repositório, mas você também pode usar um repositório na rede local fornecido por NFS, FTP ou HTTP. Os repositórios podem ser configurados usando a opção de inicialização [option]#inst.repo=#; consulte xref:advanced/Boot_Options.adoc#sect-boot-options-sources[Especificando a Fonte de Instalação] para obter detalhes.

source: DHCP Server Configuration
pt_br: Configuração do Servidor DHCP

source: Installing and configuring dhcpd
pt_br: Instalando e configurando o dhcpd

source: Install the dhcp server package.
pt_br: Instale o pacote de servidor dhcp.

source: Create a simple configuration for the dhcp server at `/etc/dhcp/dhcpd.conf`
pt_br: Crie uma configuração simples para o servidor dhcp em `/etc/dhcp/dhcpd.conf`

source: Test your configuration and address any problems you discover.
pt_br: Teste sua configuração e resolva quaisquer problemas que encontrar.

source: Add entries to point clients to their bootloader and the server that provides it to your subnet configuration in `/etc/dhcp/dhcpd.conf`. Because DHCP clients provide the server with identifying information along with their address request, BIOS clients and UEFI clients can each be directed to the correct bootloader. Using latest processor architecture option codes, which may be found on the https://www.iana.org/assignments/dhcpv6-parameters/dhcpv6-parameters.xhtml#processor-architecture[IANA DHCPv6] registration page, allows multiple architectures to share a single DHCP server.
pt_br: Adicione entradas para apontar clientes para seu gerenciador de inicialização e o servidor que fornece isso para sua configuração de sub-rede em `/etc/dhcp/dhcpd.conf`. Como os clientes DHCP fornecem ao servidor informações de identificação junto com sua solicitação de endereço, os clientes BIOS e os clientes UEFI podem ser direcionados ao carregador de inicialização correto. Usando os códigos de opção mais recentes da arquitetura do processador, o que pode ser encontrado na página de registro de https://www.iana.org/assignments/dhcpv6-parameters/dhcpv6-parameters.xhtml#processor-architecture[DHCPv6 do IANA], permite que várias arquiteturas compartilhem um único servidor DHCP.

source: # refer to RFC4578 & IANA DHCPv6 for possible arch option values option arch code 93 = unsigned integer 16;
pt_br: # veja RFC4578 e IANA DHCPV6 por valores possíveis de opções de arquitetura option arch code 93 = unsigned integer 16;

source: Restart the dhcp service to check the configuration and make changes as needed.
pt_br: Reinicie o serviço dhcp para verificar a configuração e fazer as alterações necessárias.

source: Installing the tftp server
pt_br: Instalando o servidor tftp

source: Installing the tftp server
pt_br: Instalando o servidor tftp

source: Install the tftp server package.
pt_br: Instale o pacote do servidor tftp.

source: Start and enable the `tftp socket`. `systemd` will automatically start the `tftpd` service when required.
pt_br: Inicie e habilite o `soquete tftp`. `systemd` irá iniciar automaticamente o serviço` tftpd` quando necessário.

source: Providing and configuring bootloaders for PXE clients
pt_br: Fornecimento e configuração de carregadores de inicialização para clientes PXE

source: Getting the bootloader files
pt_br: Obtendo os arquivos do carregador de inicialização

source: Get the [package]*syslinux* bootloader for BIOS clients.
pt_br: Obtenha o carregador de inicialização [package]*syslinux* para clientes BIOS.

source: Install the [package]*syslinux* package.
pt_br: Instale o pacote [package]*syslinux*.

source: Create a directory for the bootloader files, and make them available there.
pt_br: Crie um diretório para os arquivos do carregador de inicialização e torne-os disponíveis lá.

source: Get the bootloader files for UEFI systems
pt_br: Obtenha os arquivos do carregador de inicialização para sistemas UEFI

source: Install the [package]*shim-x64* and [package]*grub2-efi-x64* packages. If your server is a BIOS system, you *must install the packages to a temporary install root*. Installing them directly on a BIOS machine will attempt to configure the system for UEFI booting and cause problems.
pt_br: Instale os pacotes [package]*shim-x64* e [package]*grub2-efi-x64*. Se o seu servidor for um sistema BIOS, você *deve instalar os pacotes em uma raiz de instalação temporária*. Instalá-los diretamente em uma máquina BIOS tentará configurar o sistema para inicialização UEFI e causar problemas.

source: Create a directory for the bootloader files, and make them available there.
pt_br: Crie um diretório para os arquivos do carregador de inicialização e torne-os disponíveis lá.

source: Configuring client bootloaders
pt_br: Configurando carregações de inicialização clientes

source: Create a boot menu for BIOS clients at `/var/lib/tftpboot/pxelinux.cfg/default`.
pt_br: Crie um menu de inicialização para clientes BIOS em `/var/lib/tftpboot/pxelinux.cfg/default`.

source: Create a boot menu for UEFI clients at `/var/lib/tftpboot/uefi/grub.cfg`.
pt_br: Crie um menu de inicialização para clientes UEFI em `/var/lib/tftpboot/uefi/grub.cfg`.

source: Getting the kernel and initrd
pt_br: Obtendo o kernel e initrd

source: Downloading the kernel and initrd
pt_br: Baixando o kernel e initrd

source: Create a directory for the files.
pt_br: Crie um diretório para os arquivos.

source: Download the kernel.
pt_br: Baixe o kernel.

source: Download the initrd
pt_br: Baixe o initrd

source: HTTP Installation Overview
pt_br: Visão Geral da Instalação via HTTP

source: HTTP/HTTPS boot is a technology that allows computers to boot directly from resources provided over the network. When used in conjunction with HTTPS the authenticity of the server is validated, and the use of HTTP offers a more reliable transport mechanism than PXE's TFTP. Installing Fedora this way avoids creating install media and allows multiple computers to install simultaneously. Many current UEFI implementations, including the EDK2 based firmware shipping with fedora's virtualization solutions, can directly boot from HTTP sources. A UEFI boot entry may be manually added that specifies a HTTP source via firmware menus. Alternatively, a DHCP server may automatically provide the required HTTP path.
pt_br: A inicialização HTTP/HTTPS é uma tecnologia que permite que os computadores inicializem diretamente a partir de recursos fornecidos pela rede. Quando usado em conjunto com HTTPS, a autenticidade do servidor é validada e o uso de HTTP oferece um mecanismo de transporte mais confiável do que o TFTP do PXE. Instalar o Fedora desta forma evita a criação de mídia de instalação e permite que vários computadores sejam instalados simultaneamente. Muitas implementações UEFI atuais, incluindo o envio de firmware baseado em EDK2 com as soluções de virtualização do Fedora, podem inicializar diretamente de fontes HTTP. Uma entrada de inicialização UEFI pode ser adicionada manualmente para especificar uma fonte HTTP por meio de menus de firmware. Como alternativa, um servidor DHCP pode fornecer automaticamente o caminho HTTP necessário.

source: Enrolling Certificatesll
pt_br: Registrando Certificados

source: While many machines are capable of HTTPS boot as well as HTTP, they will frequently need to have a certificate authority (CA) enrolled first. The CA is used to validate the certificates presented by the HTTPS server. This may be accomplished by enrolling the appropriate files from the fedora provided ca-certificates for public mirrors or the local HTTPS boot server's certificate.
pt_br: Embora muitas máquinas sejam capazes de inicializar por HTTPS e também HTTP, elas frequentemente precisam ter uma autoridade certificadora (CA) registrada primeiro. O CA é usado para validar os certificados apresentados pelo servidor HTTPS. Isso pode ser feito registrando os arquivos apropriados dos certificados de CA fornecidos pelo Fedora para espelhos públicos ou o certificado do servidor de inicialização HTTPS local.

source: DHCP Server Configuration for HTTP
pt_br: Configuração do Servidor DHCP para HTTP

source: The installation and configuration of a DHCP server for HTTP boot is identical to its configuration for <<pxe-dhcpd,PXE>> except that we need to amend the option arch conditions for HTTP clients
pt_br: A instalação e configuração de um servidor DHCP para inicialização HTTP é idêntica à sua configuração para <<pxe-dhcpd,PXE>>, exceto que precisamos alterar as condições do arco de opção para clientes HTTP

source: Providing repositories
pt_br: Fornecendo repositórios

source: The examples in this section use the public Fedora mirrors as the package source. For faster installations, installing to many systems, or more isolated environments, you may wish to maintain a local repository.
pt_br: Os exemplos nesta seção usam os espelhos públicos do Fedora como fonte do pacote. Para instalações mais rápidas, instalação em muitos sistemas ou ambientes mais isolados, você pode desejar manter um repositório local.

source: Fedora Infrastructure maintains instructions for configuring a local mirror at link:++https://fedoraproject.org/wiki/Infrastructure/Mirroring++[]. The preferred method for providing repositories is via HTTP, and you can refer to the [citetitle]_xref:fedora:system-administrators-guide:index.adoc[{PRODUCT} System Administrator's Guide]_ to configure `httpd`.
pt_br: Fedora Infrastructure mantém instruções para configurar um espelho local em link:++https://fedoraproject.org/wiki/Infrastructure/Mirroring++[]. O método preferido para fornecer repositórios é por HTTP e você pode conferir o [citetitle]_xref:fedora:system-administrators-guide:index.adoc[Guia do Administrador do Sistema {PRODUCT}_, para configurar `httpd`.

source: Advanced network installations with Cobbler
pt_br: Instalações de rede avançadas com Cobbler

source: For more complex environments, {PRODUCT} offers the [package]*cobbler* installation server. Tasks like managing kickstart configurations, coordinating repositories, maintaining dns records, dhcp servers, and even puppet manifests are effectively automated by [package]*cobbler*.
pt_br: Para ambientes mais complexos, o {PRODUCT} oferece o servidor de instalação [package]*cobbler*. Tarefas como gerenciar configurações de kickstart, coordenar repositórios, manter registros dns, servidores dhcp e até manifestos fantoches são efetivamente automatizados por [package]*cobbler*.

source: While levaraging all of the features provided by cobbler can be relatively simple, the full functionality of this powerful tool is too broad to be documented in this guide. The cobbler community provides documentation at link:++https://cobbler.github.io/++[] to accompany the packages in the Fedora repository.
pt_br: Embora aproveitar todos os recursos fornecidos pelo cobbler possa ser relativamente simples, a funcionalidade completa desta ferramenta poderosa é muito ampla para ser documentada neste guia. A comunidade do cobbler fornece documentação no link:++https://cobbler.github.io/++[] para acompanhar os pacotes no repositório Fedora.

source: Alternatively, you may also be interested in **Foreman**. You can find official documentation as well as downloads on the project website at link:++https://www.theforeman.org/++[].
pt_br: Como alternativa, você também pode estar interessado em **Foreman**. Você pode encontrar a documentação oficial, bem como downloads no site do projeto em link:++https://www.theforeman.org/++[].
