Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/nav.po
Languages: fi, it, tr, uk

source: xref:index.adoc[Installation Guide]
fi: xref:index.adoc[Asennusohje]
it: xref:index.adoc[Guida d'installazione]
tr: xref:index.adoc[Kurulum Kılavuzu]
uk: xref:index.adoc[Підручник зі встановлення]

source: xref:Preface.adoc[Preface]
fi: xref:Preface.adoc[Esipuhe]
it: xref:Preface.adoc[Prefazione]
tr: xref:Preface.adoc[Ön Söz]
uk: xref:Preface.adoc[Передмова]

source: xref:Introduction.adoc[Introduction]
fi: xref:Introduction.adoc[Johdanto]
it: xref:Introduction.adoc[Introduzione]
tr: xref:Introduction.adoc[Giriş]
uk: xref:Introduction.adoc[Вступ]

source: xref:Downloading_Fedora.adoc[Downloading Fedora]
fi: xref:Downloading_Fedora.adoc[Fedoran lataaminen]
it: xref:Downloading_Fedora.adoc[Scaricare Fedora]
tr: xref:Downloading_Fedora.adoc[Fedora'yı İndirme]
uk: xref:Downloading_Fedora.adoc[Отримання Fedora]

source: Installing Fedora
fi: Fedoran asennus
it: Installare Fedora
tr: Fedora'yı Kurma
uk: Встановлення Fedora

source: xref:install/Preparing_for_Installation.adoc[Preparing for Installation]
fi: xref:install/Preparing_for_Installation.adoc[Asennuksen valmistelu]
it: xref:install/Preparing_for_Installation.adoc[Preparazione per l'installazione]
tr: xref:install/Preparing_for_Installation.adoc[Kurulum için Hazırlama]
uk: xref:install/Preparing_for_Installation.adoc[Приготування до встановлення]

source: xref:install/Booting_the_Installation.adoc[Booting the Installation]
fi: xref:install/Booting_the_Installation.adoc[Asennuksen käynnistäminen]
it: xref:install/Booting_the_Installation.adoc[Avviare l'installazione]
tr: xref:install/Booting_the_Installation.adoc[Kurulumu Önyükleme]
uk: xref:install/Booting_the_Installation.adoc[Завантаження образу для встановлення]

source: xref:install/Installing_Using_Anaconda.adoc[Installing Using Anaconda]
fi: xref:install/Installing_Using_Anaconda.adoc[Asentaminen Anacondan avulla]
it: xref:install/Installing_Using_Anaconda.adoc[Installazione usando Anaconda]
tr: xref:install/Installing_Using_Anaconda.adoc[Anaconda Kullanarak Kurma]
uk: xref:install/Installing_Using_Anaconda.adoc[Встановлення за допомогою Anaconda]

source: xref:install/After_Installation.adoc[After the Installation]
fi: xref:install/After_Installation.adoc[Asennuksen jälkeen]
it: xref:install/After_Installation.adoc[Dopo l'installazione]
tr: xref:install/After_Installation.adoc[Kurulumdan Sonra]
uk: xref:install/After_Installation.adoc[Після встановлення]

source: xref:install/Troubleshooting.adoc[Troubleshooting]
fi: xref:install/Troubleshooting.adoc[Ongelmien karttoittaminen]
it: xref:install/Troubleshooting.adoc[Risoluzione dei problemi]
tr: xref:install/Troubleshooting.adoc[Sorun Giderme]
uk: xref:install/Troubleshooting.adoc[Усування проблем]

source: Advanced Installation Options
fi: Asennuksen lisäasetukset
it: Opzioni avanzate d'installazione
tr: Gelişmiş Kurulum Seçenekleri
uk: Додаткові параметри встановлення

source: xref:advanced/Boot_Options.adoc[Boot Options]
fi: xref:advanced/Boot_Options.adoc[Käynnistysvaihtoehdot]
it: xref:advanced/Boot_Options.adoc[Opzioni d'avvio]
tr: xref:advanced/Boot_Options.adoc[Önyükleme Seçenekleri]
uk: xref:advanced/Boot_Options.adoc[Параметри завантаження]

source: xref:advanced/Kickstart_Installations.adoc[Automating the Installation with Kickstart]
fi: xref:advanced/Kickstart_Installations.adoc[Asennuksen automatisointi Kickstartin avulla]
it: xref:advanced/Kickstart_Installations.adoc[Automatizzare l'installazione con Kickstart]
tr: xref:advanced/Kickstart_Installations.adoc[Kickstart ile Kurulumu Otomatikleştirme]
uk: xref:advanced/Kickstart_Installations.adoc[Автоматизація встановлення за допомогою Kickstart]

source: xref:advanced/Network_based_Installations.adoc[Setting Up an Installation Server]
fi: xref:advanced/Network_based_Installations.adoc[Asennuspalvelimen asettaminen]
it: xref:advanced/Network_based_Installations.adoc[Configurazione di un server d'installazione]
tr: xref:advanced/Network_based_Installations.adoc[Kurulum Sunucusu Ayarlama]
uk: xref:advanced/Network_based_Installations.adoc[Налаштовування сервера для встановлення]

source: xref:advanced/VNC_Installations.adoc[Installing Using VNC]
fi: xref:advanced/VNC_Installations.adoc[Asennus VNC:n avulla]
it: xref:advanced/VNC_Installations.adoc[Installazione mediante VNC]
tr: xref:advanced/VNC_Installations.adoc[VNC Kullanarak Kurma]
uk: xref:advanced/VNC_Installations.adoc[Встановлення за допомогою VNC]

source: xref:advanced/Upgrading_Your_Current_System.adoc[Upgrading Your Current System]
fi: xref:advanced/Upgrading_Your_Current_System.adoc[Nykyisen järjestelmän päivittäminen]
it: xref:advanced/Upgrading_Your_Current_System.adoc[Aggiorna il tuo sistema corrente]
tr: xref:advanced/Upgrading_Your_Current_System.adoc[Mevcut Sisteminizi Yükseltme]
uk: xref:advanced/Upgrading_Your_Current_System.adoc[Оновлення поточної системи]

source: Technical Appendixes
fi: Tekniset liitteet
it: Appendice tecnica
tr: Teknik Ekler
uk: Технічні додатки

source: xref:appendixes/Kickstart_Syntax_Reference.adoc[Kickstart Syntax Reference]
fi: xref:appendixes/Kickstart_Syntax_Reference.adoc[Kickstart-syntaksiviite]
tr: xref:appendixes/Kickstart_Syntax_Reference.adoc[Kickstart Söz Dizimi Referansı]
uk: xref:appendixes/Kickstart_Syntax_Reference.adoc[Довідник із синтаксису Kickstart]

source: xref:appendixes/Disk_Partitions.adoc[An Introduction to Disk Partitions]
fi: xref:appendixes/Disk_Partitions.adoc[Johdanto levyosioihin]
tr: xref:appendixes/Disk_Partitions.adoc[Disk Bölümlerine Giriş]
uk: xref:appendixes/Disk_Partitions.adoc[Вступ до поділу диска на розділи]

source: xref:appendixes/Understanding_LVM.adoc[Understanding LVM]
fi: xref:appendixes/Understanding_LVM.adoc[LVM:n ymmärtäminen]
tr: xref:appendixes/Understanding_LVM.adoc[LVM'yi Anlama]
uk: xref:appendixes/Understanding_LVM.adoc[Основи LVM]

source: xref:Revision_History.adoc[Revision History]
fi: xref:Revision_History.adoc[Versiohistoria]
it: xref:Revision_History.adoc[Cronologia delle revisioni ]
tr: xref:Revision_History.adoc[Revizyon Geçmişi]
uk: xref:Revision_History.adoc[Журнал модифікацій]
