Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/Downloading_Fedora.po
Languages: id, pt_br

source: Downloading Fedora
id: Mengunduh Fedora
pt_br: Baixando o Fedora

source: Fedora Editions
id: Edisi Fedora
pt_br: Edições do Fedora

source: Fedora provides three primary Editions tailored for some specific use cases. link:++https://getfedora.org++[] offers Fedora Cloud for scalable infrastructure, Fedora Server for organizational infrastructure, and Fedora Workstation for the developer and desktop user.
id: Fedora menyediakan tiga edisi utama yang disesuaikan untuk beberapa kasus penggunaan tertentu. link:++https://getfedora.org++[] menawarkan Fedora Cloud untuk infrastruktur yang dapat diskalakan, Fedora Server untuk infrastruktur organisasi, dan Fedora Workstation untuk pengguna pengembang dan desktop.
pt_br: O Fedora fornece três Edições principais personalizadas para alguns casos de uso específicos. link:++https://getfedora.org++[] oferece o Fedora Cloud para infraestrutura escalável, o Fedora Server para infraestrutura organizacional e o Fedora Workstation para desenvolvedor e usuário de desktop.

source: For alternative desktop environments or media built for more niche purposes, check out link:++https://spins.fedoraproject.org++[Fedora Spins].
id: Untuk lingkungan desktop alternatif atau media yang dibangun untuk tujuan lebih spesifik, periksalah link:++https://spins.fedoraproject.org++[Fedora Spins].
pt_br: Para ambientes alternativos de desktop ou mídia criados para fins mais específicos, consulte o link:++https://spins.fedoraproject.org++[Fedora Spins].

source: Each of these downloads provides a different set of default packages, but you can add to your system after the initial installation to customize it for your needs. The installation process is the same for all spins and Editions, so you can use this guide for any choice you make.
id: Masing-masing unduhan ini menyediakan kumpulan paket default yang berbeda, tetapi Anda dapat menambahkan ke sistem Anda setelah instalasi awal untuk menyesuaikannya dengan kebutuhan Anda. Proses instalasi adalah sama untuk semua spin dan Edisi, sehingga Anda dapat menggunakan panduan ini untuk setiap pilihan yang Anda buat.
pt_br: Cada um desses downloads fornece um conjunto diferente de pacotes padrão, mas você pode adicionar ao seu sistema após a instalação inicial para personalizá-lo para suas necessidades. O processo de instalação é o mesmo para todas as variedades e edições, portanto, você pode usar este guia para qualquer escolha que fizer.

source: Which Architecture Is My Computer?
id: Arsitektur Manakah Komputer Saya?
pt_br: Qual arquitetura é o meu computador?

source: Most modern systems are 64{nbsp}bit x86 architecture. If your computer was manufactured after 2007, or you aren't sure, you probably have a `x86_64` system.
id: Kebanyakan sistem modern adalah arsitektur x86 64{nbsp}bit. Jika komputer Anda diproduksi setelah 2007, atau Anda tidak yakin, Anda mungkin memiliki sistem `x86_64`.
pt_br: A maioria dos sistemas modernos tem a arquitetura x86 de 64{nbsp}bits. Se o seu computador foi fabricado após 2007 ou você não tem certeza, provavelmente possui um sistema `x86_64`.

source: Changing a Fedora installation from one architecture to another is not supported. Use the following table to determine the architecture of your computer according to the type of processor. Consult your manufacturer's documentation for details on your processor, or resources such as link:++http://ark.intel.com/++[] or link:++http://products.amd.com/++[], if necessary.
pt_br: Não há suporte a mudar uma instalação do Fedora de uma arquitetura para outra. Use a tabela a seguir para determinar a arquitetura do seu computador de acordo com o tipo de processador. Consulte a documentação do fabricante para obter detalhes sobre o processador ou recursos como o link:++http://ark.intel.com/++[] ou o link:++http://products.amd.com/++[], se necessário.

source: Processor and architecture types
id: Tipe prosesor dan arsitektur
pt_br: Tipos de processador e arquitetura

source: Media Types
id: Tipe Media
pt_br: Tipos de mídias

source: Several media types are available. Choose the one that best suits your requirements.
id: Tersedia beberapa tipe media. Pilih salah satu yang paling sesuai dengan kebutuhan Anda.
pt_br: Vários tipos de mídias estão disponíveis. Escolha aquela que melhor se adéqua aos seus requisitos.

source: Live Image
id: Image Live
pt_br: Imagem live

source: Live images allow you to preview Fedora before installing it. Instead of booting directly into the installer, a live image loads the same environment you'll get after installation. Fedora Workstation and Fedora Spins are live images.
id: Image live memungkinkan Anda untuk melihat pratinjau Fedora sebelum menginstalnya. Daripada boot langsung ke installer, image live memuat lingkungan yang sama seperti yang Anda akan dapat setelah instalasi. Fedora Workstation dan Fedora Spin adalah image live.
pt_br: Imagens live permitem que você experimente o Fedora antes de instalá-lo. Em vez de inicializar diretamente no instalador, uma imagem live carrega o mesmo ambiente que você terá após a instalação. O Fedora Workstation e o Fedora Spins são imagens live.

source: Use a live image to install your favorite system, test Fedora on new hardware, troubleshoot, or share with friends.
id: Gunakan image live untuk menginstal sistem favorit Anda, menguji Fedora pada perangkat keras baru, memecahkan masalah, atau berbagi dengan teman.
pt_br: Use uma imagem live para instalar seu sistema favorito, experimente o Fedora em um novo hardware, solucione problemas ou compartilhe com os amigos.

source: DVD Image
id: Image DVD
pt_br: Imagem DVD

source: DVD images boot directly into the installation enviroment, and allow you to choose from a variety of packages that are provided with it. In Fedora 21, the DVD option is only available in the *Fedora Server* Edition.
id: Image DVD boot langsung ke lingkungan instalasi, dan memungkinkan Anda untuk memilih dari berbagai paket yang disediakan dengannya. Di Fedora 21, opsi DVD hanya tersedia dalam Edisi *Fedora Server*.
pt_br: As imagens DVD são inicializadas diretamente no ambiente de instalação e permitem escolher entre uma variedade de pacotes fornecidos. No Fedora 21, a opção DVD está disponível apenas na Edição *Fedora Server*.

source: Use the Fedora Server DVD image when you want customized Fedora Server installations using an offline installation source.
id: Gunakan image DVD Fedora Server ketika Anda ingin menyesuaikan instalasi Server Fedora menggunakan sumber instalasi luring.
pt_br: Use a imagem DVD do Fedora Server quando desejar instalações personalizadas do Fedora Server usando uma fonte de instalação offline.

source: netinstall Image
id: Image netinstall
pt_br: Imagem netinstall

source: The netinstall image boots directly into the installation environment, and uses the online Fedora package repositories as the installation source. With a netinstall image, you can select a wide variety of packages to create a customized installation of Fedora.
id: Image netinstall boot langsung ke lingkungan instalasi, dan menggunakan repositori paket Fedora daring sebagai sumber instalasi. Dengan image netinstall, Anda dapat memilih berbagai paket untuk membuat instalasi Fedora yang disesuaikan.
pt_br: A imagem netinstall é inicializada diretamente no ambiente de instalação e usa os repositórios de pacotes online do Fedora como fonte de instalação. Com uma imagem netinstall, você pode selecionar uma grande variedade de pacotes para criar uma instalação personalizada do Fedora.

source: The Fedora Server netinstall image is a universal one, and can be used to install any Fedora Edition or your own set of favorite packages.
id: Image netinstall Fedora Server itu universal, dan dapat digunakan untuk menginstal setiap Edisi Fedora atau set paket favorit Anda sendiri.
pt_br: A imagem netinstall do Fedora Server é universal e pode ser usada para instalar qualquer Edição Fedora ou seu próprio conjunto de pacotes favoritos.

source: ARM images
id: Image ARM
pt_br: Imagens ARM

source: For many ARM systems, Fedora provides preconfigured filesystem images. Write the image to removable media and boot directly into a Fedora installation that's ready to use.
id: Untuk banyak sistem ARM, Fedora menyediakan image sistem berkas yang telah dikonfigurasikan. Tulis image ke media lepasan dan boot langsung ke instalasi Fedora yang siap digunakan.
pt_br: Para muitos sistemas ARM, o Fedora fornece imagens de sistema de arquivos pré-configuradas. Escreva a imagem na mídia removível e inicialize diretamente em uma instalação do Fedora pronta para uso.

source: ARM devices often require special setup procedures that aren't covered in this guide. Start learning about Fedora ARM at link:++https://fedoraproject.org/wiki/Architectures/ARM++[]
id: Perangkat ARM sering memerlukan prosedur penyiapan khusus yang tidak tercakup dalam panduan ini. Mulailah belajar tentang Fedora ARM di link:++https:/fedoraproject.org/wiki/architectures/ARM++[]
pt_br: Os dispositivos ARM geralmente exigem procedimentos de configuração especiais que não são abordados neste guia. Comece a aprender sobre o Fedora ARM no link:++https://fedoraproject.org/wiki/Architectures/ARM++[]

source: Cloud Images
id: Image Cloud
pt_br: Imagens Cloud

source: Fedora Cloud images are preconfigured filesystem images with very few packages installed by default. They include special tools for interacting with cloud platforms, and are not intended to be used outside of cloud environments.
id: Image Fedora Cloud adalah image sistem berkas yang telah dikonfigurasikan dengan sangat sedikit paket yang diinstal secara default. Mereka termasuk alat khusus untuk berinteraksi dengan platform cloud, dan tidak dimaksudkan untuk digunakan di luar lingkungan cloud.
pt_br: As imagens do Fedora Cloud são imagens pré-configuradas do sistema de arquivos com muito poucos pacotes instalados por padrão. Eles incluem ferramentas especiais para interagir com plataformas em nuvem e não se destinam a ser usados fora dos ambientes em nuvem.

source: Boot Images
id: Image Boot
pt_br: Imagens de inicialização

source: The tiny images at link:++https://boot.fedoraproject.org/++[] are written to CDs, USB drives, or even floppy disks. The BFO image loads installation media from Fedora's servers and directly loads an installation environment, like the netinstall ISO.
id: Image kecil di link:++https://boot.fedoraproject.org/++[] ditulis ke CD, USB drive, atau bahkan floppy disk. Image BFO memuat media instalasi dari server Fedora dan secara langsung memuat lingkungan instalasi, seperti ISO netinstall.
pt_br: As pequenas imagens em link:++https://boot.fedoraproject.org/++[] são gravadas em CDs, unidades USB ou até disquetes. A imagem do BFO carrega a mídia de instalação a partir dos servidores do Fedora e carrega diretamente um ambiente de instalação, como a ISO netinstall.

source: BFO images work like PXE deployments, without having to set up a server.
id: Image BFO bekerja seperti penggelaran PXE, tanpa harus menyiapkan server.
pt_br: As imagens BFO funcionam como implantações PXE, sem a necessidade de configurar um servidor.
