Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f29/pages/_partials/install/CustomSpoke_AddBtrfs.po
Languages: tr

source: Creating a Btrfs Layout
tr: Btrfs Düzeni Oluşturma

source: _Btrfs_ is a type of file system, but it has several features characteristic of a storage device. It is designed to make the file system tolerant of errors, and to facilitate the detection and repair of errors when they occur. It uses checksums to ensure the validity of data and metadata, and maintains snapshots of the file system that can be used for backup or repair.
tr: _Btrfs_ bir tür dosya sistemi türüdür, ancak bir depolama aygıtına özgü birtakım özelliklere sahiptir. Dosya sistemini hatalara dayanıklı hale getirmek ve hatalar oluştuğunda tespit ve onarımını kolaylaştırmak için tasarlanmıştır. Verilerin ve üst verilerin doğruluğunu sağlamak için sağlama toplamları kullanır ve yedekleme veya onarım için kullanılabilen dosya sisteminin anlık görüntülerini tutar.

source: Creating a Btrfs layout is somewhat similar to LVM (described in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Creating a Logical Volume Managament (LVM) Layout]) with slightly different terminology. A Btrfs _volume_ is the equivalent of an LVM volume group, and a Btrfs _subvolume_ is similar to a LVM logical volume. An important difference to note is how [application]*Anaconda* reports sizes for separate mount points: For LVM, the exact size of each logical volume is shown next to each mount point in the left pane, while with Btrfs, the total size of the entire volume is shown next to each subvolume.
tr: Bir Btrfs düzeni oluşturmak, biraz farklı terimler kullanarak LVM'ye (xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Mantıksal Birim Yönetimi (Logical Volume Management - LVM) Düzeni Oluşturma] bölümünde açıklanmıştır) benzer. Bir Btrfs _birimi_, bir LVM birim grubuna eş değerdir ve bir Btrfs _alt birimi_, bir LVM mantıksal birimine benzer. Unutulmaması gereken önemli bir fark, [application]*Anaconda*'nın ayrı bağlama noktaları için boyutları nasıl bildirdiğidir: LVM için sol bölmedeki her bağlama noktasının yanında her mantıksal birimin tam boyutu gösterilirken, Btrfs için her alt birimin yanında tüm birimin toplam boyutu gösterilir.

source: Some partition types - notably the `/boot` and `/usr` directories and the BIOS Boot and EFI partitions - can not be placed on Btrfs subvolumes. Use standard physical volumes for them (or an LVM logical volume for `/usr`). See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for more information.
tr: Bazı bölüm türleri - özellikle `/boot` ve `/usr` dizinleri ve BIOS Önyükleme ve EFI bölümleri - Btrfs alt birimlerine yerleştirilemez. Onlar için standart fiziksel birimler (veya `/ usr` için bir LVM mantıksal birimi) kullanın. Daha fazla bilgi için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın.

source: Create Btrfs Subvolume
tr: Btrfs Alt Birimi Oluştur

source: The Manual Partitioning screen
tr: Elle Bölümlendirme ekranı

source: Follow the procedure below to create Btrfs volumes and subvolumes:
tr: Btrfs birimleri ve alt birimleri oluşturmak için aşağıdaki adımları izleyin:

source: Creating Btrfs Subvolumes and Volumes
tr: Btrfs Birimleri ve Alt Birimleri Oluşturma

source: Click the `+` button at the bottom of the list showing existing mount points. A new dialog window will open.
tr: Mevcut bağlama noktalarını gösteren listenin altındaki `+` düğmesine tıklayın. Yeni bir iletişim penceresi açılacaktır.

source: In the new dialog window, specify a mount point for which you want to create a separate logical volume - for example, `/`. Optionally, specify a size for the volume using standard units such as MB or GB (for example, `50GB`). Then, click `Add mount point` to add the volume and return to the main partitioning screen.
tr: Yeni iletişim penceresinde, ayrı bir mantıksal birim oluşturmak istediğiniz bir bağlama noktası belirtin - örneğin, `/`. İsteğe bağlı olarak, MB veya GB gibi standart birimler kullanarak birim için bir boyut belirtin (örneğin, `50GB`). Ardından, birimi eklemek ve ana bölümlendirme ekranına geri dönmek için `Bağlama noktası ekle` düğmesine tıklayın.

source: When creating a mount point for swap on Btrfs, specify the mount point as `swap`.
tr: Btrfs üzerinde takas için bir bağlama noktası oluştururken, bağlama noktasını `swap` olarak belirtin.

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume. Select the newly created mount point in the left pane to configure it further, and convert it to a Btrfs subvolume by changing the `Device Type` option to `Btrfs`. Then, click `Update Settings` in the bottom right corner of the screen.
tr: Bu adımdan sonra bağlama noktası öntanımlı ayarlar kullanılarak, yani bir LVM mantıksal birimi olarak oluşturulur. Daha fazla yapılandırmak için sol bölmede yeni oluşturulan bağlama noktasını seçin ve `Aygıt Türü` seçeneğini `Btrfs` olarak değiştirerek bir Btrfs alt birimine dönüştürün. Ardından, ekranın sağ alt köşesindeki `Ayarları Güncelle` düğmesine tıklayın.

source: In the `Volume` menu, you can see that the subvolume has been assigned to an automatically created volume, which is named after the {PRODUCT} variant you are installing (for example, `fedora-server00`. Click the `Modify` button under the drop-down menu to access the volume settings.
tr: `Birim` menüsünde, alt birimin kurduğunuz {PRODUCT} çeşidinin adını taşıyan (örneğin, `fedora-server00`) otomatik olarak oluşturulmuş bir birime atandığını görebilirsiniz. Birim ayarlarına erişmek için açılır menünün altındaki `Değiştir` düğmesine tıklayın.

source: In the `Configure Volume` dialog, you can change the volume's name, its `RAID level` (see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types] for information about available RAID types), and you can also specify which physical devices (disks) this volume should reside on. You can select one or more disks which will be used to hold this volume by holding down kbd:[Ctrl] and clicking each disk in the list.
tr: `Birim Yapılandır` iletişim kutusunda birimin adını, `RAID seviyesini` (kullanılabilir RAID türleri hakkında bilgi için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Aygıt, Dosya Sistemi ve RAID Türleri] bölümüne bakın) değiştirebilir ve ayrıca bu birimin hangi fiziksel aygıtların (disklerin) üzerinde bulunması gerektiğini belirtebilirsiniz. Bu birimi tutmak için kullanılacak bir veya daha fazla diski kbd:[Ctrl] tuşuna basılı tutup listedeki her diski tıklayarak seçebilirsiniz.

source: If you select a redundant RAID type (such as `RAID1 (Redundancy)`), the volume will take up twice its actual size on your disks. A 5 GB volume with RAID1 will take up 10 GB of space.
tr: Yedekli bir RAID türü seçerseniz (`RAID1 (Yedeklilik)` gibi), disklerinizde birim gerçek boyutunun iki katı kadar yer kaplayacaktır. RAID1 ile 5 GB'lık bir birim 10 GB alan kaplayacaktır.

source: You can also make sure that the volume is encrypted by selecting the `Encrypt` option; this will enable LUKS encryption for the entire volume. See the [citetitle]_{PRODUCT} Security Guide_, available at link:++https://docs.fedoraproject.org/++[], for information about LUKS disk encryption.
tr: Ayrıca, `Şifrele` seçeneğini seçerek birimin şifrelenmiş olduğundan emin olabilirsiniz; bu, tüm birim için LUKS şifrelemesini etkinleştirecektir. LUKS ile disk şifreleme hakkında bilgi için link:++https://docs.fedoraproject.org/++[] adresindeki [citetitle]_{PRODUCT} Güvenlik Kılavuzuna_ bakın.

source: Additionally, you can set a fixed size for the volume by selecting the `Fixed` option from the `Size policy` menu and entering a size for the volume group.
tr: Ek olarak, `Boyut politikası` menüsünden `Sabit` seçeneğini seçerek ve birim grubu için bir boyut girerek birim için sabit bir boyut ayarlayabilirsiniz.

source: After you finish configuring the Btrfs volume settings, click `Save` to return to the main `Manual Partitioning` screen.
tr: Btrfs birim ayarlarını yapılandırmayı bitirdikten sonra, ana `Elle Bölümlendirme` ekranına dönmek için `Kaydet` düğmesine tıklayın.

source: If you need to create more than one Btrfs volume, open the `Volume` drop-down menu and select the `Create a new volume group` option. A new dialog window will open, identical to the one described in the previous step. Again, select a name, storage devices, encryption settings, RAID level and size policy for the new volume, and click `Save`. The new volume will then become available in the `Volume Group` drop-down menu; you can then go through your existing mount points and change this setting to assign them to a different volume.
tr: Birden fazla Btrfs birimi oluşturmanız gerekiyorsa, `Birim` açılır menüsünü açın ve `Yeni bir birim grubu oluştur` seçeneğini seçin. Önceki adımda açıklananla aynı olan yeni bir iletişim penceresi açılacaktır. Aynı şekilde, yeni birim için bir ad, depolama aygıtları, şifreleme ayarları, RAID seviyesi ve boyut politikası seçin ve `Kaydet` düğmesine tıklayın. Yeni birim daha sonra `Birim Grubu` açılır menüsünde kullanılabilir hale gelecektir; daha sonra mevcut bağlama noktalarınızın üzerinden geçebilir ve bunları farklı bir birime atamak için bu ayarı değiştirebilirsiniz.

source: Configure other settings specific to the subvolume - its `Mount Point`, `Desired Capacity`, `File System`, and `Name`. Press `Update Settings` to apply any changes to the configuration.
tr: Alt birime özgü diğer ayarları yapılandırın - `Bağlama Noktası`, `İstenen Kapasite`, `Dosya Sistemi` ve `Ad`. Değişiklikleri yapılandırmaya uygulamak için `Ayarları Güncelle` düğmesine basın.

source: Repeat this procedure for any additional Btrfs subvolumes you want to create. Note that when creating additional subvolumes, a new volume is not automatically created each time; instead, any additional subvolumes are assigned to an existing volume.
tr: Oluşturmak istediğiniz ek Btrfs alt birimleri için bu adımları tekrarlayın. Ek alt birimler oluştururken, her seferinde otomatik olarak yeni bir birim oluşturulmadığını unutmayın; bunun yerine, ek alt birimler var olan bir birime atanır.

source: For each mount point you create, review its settings and make sure that it is assigned to the correct volume, that it has sufficient capacity, and that it has a descriptive name so you can identify the subvolume later if you need to.
tr: Oluşturduğunuz her bağlama noktası için ayarlarını gözden geçirin ve doğru birime atandığından, yeterli kapasiteye sahip olduğundan ve gerekirse daha sonra alt birimi tanımlayabilmeniz için açıklayıcı bir ada sahip olduğundan emin olun.
