Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f29/pages/_partials/install/CustomSpoke_FileSystems.po
Languages: id

source: Device, File System and RAID Types
id: Peranti, Sistem Berkas, dan Tipe RAID

source: {PRODUCT} supports multiple types of devices and file systems. The lists below offer a short description of each available device, file system and RAID type and notes on their usage.
id: {PRODUCT} mendukung beberapa jenis perangkat dan sistem berkas. Daftar di bawah ini menawarkan deskripsi singkat dari masing-masing perangkat yang tersedia, sistem berkas dan tipe RAID serta catatan tentang penggunaannya.

source: To select a device type or a file system of a partition or a logical volume, select it in the list in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Manual Partitioning] and select a `Device Type` and a `File System` from their respective drop-down menus on the right side of the screen. Then, click `Update Settings` and repeat this process for all mount points you want to modify.
id: Untuk memilih jenis perangkat atau sistem berkas partisi atau volume logis, pilih dalam daftar di xref:sect-installation-gui-manual-partitioning[Pemartisian Manual] dan pilih `Tipe Peranti` dan`Sistem Berkas` dari masing-masing drop-down menu di sisi kanan layar. Kemudian, klik `Perbarui Pengaturan` dan ulangi proses ini untuk semua titik kait yang ingin Anda ubah.

source: To configure software RAID, make sure that you have enough physical hard drives selected as installation targets (the number of separate drives required for each type of RAID is noted in its description). Then, choose a RAID level when creating or modifying a Btrfs volume or LVM volume group, or select `Software RAID` as the device type to create software RAID with standard partitions. For detailed instructions, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Creating a Btrfs Layout], xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Creating a Logical Volume Managament (LVM) Layout], and xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-swraid[Creating Software RAID] as needed.
id: Untuk mengonfigurasi RAID perangkat lunak, pastikan Anda memiliki cukup hard disk fisik yang dipilih sebagai target penginstalan (jumlah drive terpisah yang diperlukan untuk setiap jenis RAID dicatat dalam deskripsinya). Kemudian, pilih tingkat RAID saat membuat atau memodifikasi volume Btrfs atau grup volume LVM, atau pilih `RAID Perangkat Lunak` sebagai jenis perangkat untuk membuat RAID perangkat lunak dengan partisi standar. Untuk petunjuk rinci, lihat xref:sect-installation-gui-manual-partitioning-btrfs[Membuat Tata Letak Btrfs], xref:sect-installation-gui-manual-partitioning-lvm[Membuat Tata Letak Logical Volume Managament (LVM)], dan xref:sect-installation-gui-manual-partitioning-swraid[Membuat RAID Perangkat Lunak] sesuai kebutuhan.

source: Device Types
id: Tipe Peranti

source: `Standard Partition` - A standard partition can contain a file system or swap space. Standard partitions are most commonly used for `/boot` and the BIOS Boot and EFI System partitions. LVM logical volumes or Btrfs subvolumes are recommended for most other uses. See xref:appendixes/Disk_Partitions.adoc#appe-disk-partitions-overview[An Introduction to Disk Partitions] for additional information about the concepts behind physical partitions.
id: `Partisi Standar` - Sebuah partisi standar dapat berisi sistem berkas atau ruang swap. Partisi standar paling sering digunakan untuk `/boot` dan boot BIOS dan partisi Sistem EFI. Volume logis LVM atau subvolume Btrfs direkomendasikan untuk sebagian besar kegunaan lainnya. Lihat xref:appendixes/Disk_Partitions.adoc#appe-disk-partitions-overview[Pengenalan ke Partisi Disk] untuk informasi tambahan tentang konsep di balik partisi fisik.

source: `LVM` - Choosing `LVM` as the `Device Type` creates an LVM logical volume and a volume group to contain it (unless one already exists, in which case the new volume is assigned to the existing group). LVM can improve performance when using physical disks and allows you to use multiple disks for a single mount point. For information on how to create a logical volume, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Creating a Logical Volume Managament (LVM) Layout]. Also see xref:appendixes/Understanding_LVM.adoc#appe-lvm-overview[Understanding LVM] for some additional information about LVM in general.
id: `LVM` - Memilih `LVM` sebagai `Tipe Peranti` membuat volume logis LVM dan sebuah grup volume untuk memuatnya (kecuali yang sudah ada, dalam hal ini volume baru ditugaskan ke grup yang ada). LVM dapat meningkatkan kinerja ketika menggunakan disk fisik dan memungkinkan Anda untuk menggunakan beberapa disk untuk satu titik kait. Untuk informasi tentang cara membuat volume logis, lihat sect-installation-gui-manual-partitioning-lvm[Membuat Tata Letak Logical Volume Managament (LVM)]. Lihat juga xref:appendixes/Understanding_LVM.adoc#appe-lvm-overview[Memahami LVM] untuk beberapa informasi tambahan tentang LVM pada umumnya.

source: `LVM Thin Provisioning` - Using thin provisioning, you can manage a storage pool of free space, known as a _thin pool_, which can be allocated to an arbitrary number of devices when needed by applications. The thin pool can be expanded dynamically when needed for cost-effective allocation of storage space.
id: `LVM Thin Provisioning` - Menggunakan thin provisioning, Anda dapat mengelola pool penyimpanan ruang bebas, yang dikenal sebagai _thin pool_, yang dapat dialokasikan untuk sebarang banyaknya perangkat bila diperlukan oleh aplikasi. Thin pool dapat diperluas secara dinamis bila diperlukan untuk alokasi ruang penyimpanan yang hemat biaya.

source: `RAID` - Creating two or more software RAID partitions allows you to create a software RAID device. One RAID partition is assigned to each disk on the system. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-swraid[Creating Software RAID] for instructions on creating software RAID.
id: `RAID` - Membuat dua atau lebih perangkat lunak partisi RAID memungkinkan Anda untuk membuat perangkat RAID perangkat lunak. Satu partisi RAID ditetapkan ke setiap disk pada sistem. Lihat xref:sect-installation-gui-manual-partitioning-swraid[Membuat RAID Perangkat Lunak] untuk petunjuk tentang cara membuat RAID perangkat lunak.

source: `BTRFS` - Btrfs is a file system with several device-like features. It is capable of addressing and managing more files, larger files, and larger volumes than the ext2, ext3, and ext4 file systems. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Creating a Btrfs Layout] for more information about creating Btrfs volumes.
id: `BTRFS` - Btrfs adalah sistem berkas dengan beberapa fitur seperti perangkat. Hal ini mampu menangani dan mengelola lebih banyak berkas, berkas yang lebih besar, dan volume yang lebih besar daripada sistem berkas ext2, ext3, dan ext4. Lihat xref:sect-installation-gui-manual-partitioning-btrfs[Membuat Tata Letak Btrfs] untuk informasi lebih lanjut tentang membuat volume Btrfs.

source: File Systems
id: Sistem Berkas

source: `ext4` - The ext4 file system is based on the ext3 file system and features a number of improvements. These include support for larger file systems and larger files, faster and more efficient allocation of disk space, no limit on the number of subdirectories within a directory, faster file system checking, and more robust journaling. Ext4 is the default and recommended file system used by {PRODUCT} Workstation and Cloud. The maximum supported size of a single ext4 file system is 50 TB.
id: `ext4` - Sistem berkas ext4 didasarkan pada sistem berkas ext3 dan sejumlah perbaikan. Ini termasuk dukungan untuk sistem berkas yang lebih besar dan berkas yang lebih besar, lebih cepat, dan lebih efisien alokasi ruang disk, tidak ada batasan pada jumlah subdirektori dalam direktori, pemeriksaan sistem berkas yang lebih cepat, dan jurnal yang lebih kuat. Ext4 adalah sistem berkas baku dan direkomendasikan untuk digunakan oleh {PRODUCT} Workstation dan Cloud. Ukuran maksimum yang didukung dari satu sistem berkas ext4 adalah 50 TB.

source: `ext3` - The ext3 file system is based on the ext2 file system and has one main advantage - journaling. Using a journaling file system reduces time spent recovering a file system after a crash, as there is no need to check the file system for metadata consistency by running the [command]#fsck# utility every time a crash occurs.
id: `ext3` - Sistem berkas ext3 didasarkan pada sistem berkas ext2 dan memiliki satu keuntungan utama - jurnal. Menggunakan sistem berkas jurnal mengurangi waktu yang dihabiskan untuk memulihkan berkas sistem setelah crash, karena tidak perlu untuk memeriksa sistem berkas untuk konsistensi metadata dengan menjalankan utilitas [command]#fsck# setiap kali terjadi crash.

source: `ext2` - An ext2 file system supports standard Unix file types, including regular files, directories, or symbolic links. It provides the ability to assign long file names, up to 255 characters.
id: `ext2` - Sebuah sistem berkas ext2 mendukung tipe berkas Unix standar, termasuk berkas biasa, direktori, atau taut simbolik. Ini menyediakan kemampuan untuk menetapkan nama berkas yang panjang, hingga 255 karakter.

source: `swap` - Swap partitions are used to support virtual memory. In other words, data is written to a swap partition when there is not enough RAM to store the data your system is processing. A swap partition should always be created; see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for details such as the recommended size.
id: `swap` - Partisi swap digunakan untuk mendukung memori virtual. Dengan kata lain, data ditulis ke partisi swap ketika tidak cukup RAM untuk menyimpan data yang diproses sistem Anda. Sebuah partisi swap harus selalu dibuat; lihat xref:sect-installation-gui-manual-partitioning-recommended[Skema Partisi Yang Direkomendasikan] untuk rincian seperti ukuran yang disarankan.

source: `xfs` - XFS is a highly scalable, high-performance file system that supports file systems up to 16 exabytes (approximately 16 million terabytes), files up to 8 exabytes (approximately 8 million terabytes), and directory structures containing tens of millions of entries. XFS also supports metadata journaling, which facilitates quicker crash recovery. The maximum supported size of a single XFS file system is 500 TB. Starting with {PRODUCT}{nbsp}22, XFS is the default and recommended file system on {PRODUCT} Server.
id: `xfs` - XFS adalah sistem berkas yang sangat mampu diperbesar, berkinerja tinggi yang mendukung sistem berkas hingga 16 exabyte (sekitar 16 juta terabyte), berkas hingga 8 exabyte (sekitar 8 juta terabyte), dan struktur direktori yang berisi puluhan juta entri. XFS juga mendukung jurnal metadata, yang memfasilitasi pemulihan crash yang lebih cepat. Ukuran maksimum yang didukung dari satu sistem berkas XFS adalah 500 TB. Dimulai dengan {PRODUCT}{nbsp}22, XFS adalah sistem berkas baku dan direkomendasikan di server {PRODUCT}.

source: Note that the size of an XFS file system can not currently be reduced without destroying and recreating the file system. If you expect that you will need to adjust the sizes of your file systems often, using XFS is not recommended, as it makes administration substantially more time-consuming.
id: Perhatikan bahwa ukuran sistem berkas XFS saat ini tidak dapat dikurangi tanpa merusak dan menciptakan ulang sistem berkas. Jika Anda berharap bahwa Anda akan perlu untuk sering menyesuaikan ukuran sistem berkas Anda, menggunakan XFS tidak dianjurkan, karena membuat administrasi secara substansial lebih memakan waktu.

source: `vfat` - The VFAT file system is a Linux file system that is compatible with Microsoft Windows long file names on the FAT file system.
id: `vfat` - Sistem berkas VFAT adalah sistem berkas Linux yang kompatibel dengan nama berkas panjang Microsoft Windows pada sistem berkas FAT.

source: `BIOS Boot` - A very small partition required for booting from a device with a GUID partition table (GPT) on BIOS systems and UEFI systems in BIOS compatibility mode. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for details.
id: `Boot BIOS` - Partisi yang sangat kecil yang diperlukan untuk boot dari perangkat dengan tabel partisi GUID (GPT) pada sistem BIOS dan sistem UEFI dalam mode kompatibilitas BIOS. Lihat xref:sect-installation-gui-manual-partitioning-recommended[Skema Pemartisian Yang Direkomendasikan] untuk rincian.

source: `EFI System Partition` - A small partition required for booting a device with a GUID partition table (GPT) on a UEFI system. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for details.
id: `Partisi Sistem EFI` - Sebuah partisi kecil yang diperlukan untuk boot perangkat dengan tabel partisi GUID (GPT) pada sistem UEFI. Lihat xref:sect-installation-gui-manual-partitioning-recommended[Skema Pemartisian Yang Direkomendasikan] untuk rincian.

source: Software RAID Types
id: Tipe-tipe RAID Perangkat Lunak

source: `RAID0 (Performance)` - Distributes data across multiple disks. Level 0 RAID offers increased performance over standard partitions and can be used to pool the storage of multiple disks into one large virtual device. Note that Level 0 RAIDs offer no redundancy and that the failure of one device in the array destroys data in the entire array. RAID 0 requires at least two disks.
id: `RAID0 (Kinerja)` - Mendistribusikan data di beberapa disk. RAID Level 0 menawarkan peningkatan kinerja melalui partisi standar dan dapat digunakan untuk pool penyimpanan beberapa disk ke dalam satu perangkat virtual yang besar. Perhatikan bahwa RAID Level 0 tidak menawarkan redundansi dan bahwa kegagalan satu perangkat dalam larik menghancurkan data di seluruh larik. RAID 0 memerlukan setidaknya dua disk.

source: `RAID1 (Redundancy)` - Mirrors all data from one partition onto one or more other disks. Additional devices in the array provide increasing levels of redundancy. RAID 1 requires at least two disks.
id: `RAID1 (Redundansi)` - Mencermin semua data dari satu partisi ke satu atau lebih disk lainnya. Perangkat tambahan dalam larik menyediakan peningkatan tingkat redundansi. RAID 1 memerlukan setidaknya dua disk.

source: `RAID4 (Error Checking)` - Distributes data across multiple disks and uses one disk in the array to store parity information which safeguards the array in case any disk within the array fails. Because all parity information is stored on one disk, access to this disk creates a "bottleneck" in the array's performance. Level 4 RAID requires at least three disks.
id: `RAID4 (Pemeriksaan Kesalahan)` - Mendistribusikan data di beberapa disk dan menggunakan satu disk dalam larik untuk menyimpan informasi paritas yang melindungi larik dalam kasus disk dalam larik gagal. Karena semua informasi paritas disimpan di satu disk, akses ke disk ini akan membuat "bottleneck" dalam kinerja larik. RAID level 4 memerlukan setidaknya tiga disk.

source: `RAID5 (Distributed Error Checking)` - Distributes data and parity information across multiple disks. Level 5 RAIDs therefore offer the performance advantages of distributing data across multiple disks, but do not share the performance bottleneck of level 4 RAIDs because the parity information is also distributed through the array. RAID 5 requires at least three disks.
id: `RAID5 (Pemeriksaan Kesalahan Terdistribusi)` - Mendistribusikan data dan informasi paritas di beberapa disk. Oleh karena itu, RAID Level 5 menawarkan keunggulan kinerja mendistribusikan data di beberapa disk, tetapi tidak berbagi hambatan kinerja RAID level 4 karena informasi paritas juga didistribusikan melalui larik. RAID 5 memerlukan setidaknya tiga disk.

source: `RAID6 (Redundant Error Checking)` - Level 6 RAIDs are similar to level 5 RAIDs, but instead of storing only one set of parity data, they store two sets. RAID 6 requires at least four disks.
id: `RAID6 (Pemeriksaan Kesalahan Redundan)` - RAID Level 6 mirip dengan RAID Level 5, tapi bukan hanya menyimpan satu set data paritas, mereka menyimpan dua set. RAID 6 memerlukan setidaknya empat disk.

source: `RAID10 (Performance, Redundancy)` - Level 10 RAIDs are nested RAIDs or hybrid RAIDs. They are constructed by distributing data over mirrored sets of disks. For example, a level 10 RAID array constructed from four RAID partitions consists of two mirrored pairs of striped partitions. RAID 10 requires at least four disks.
id: `RAID10 (Kinerja, Redundansi)` - RAID Level 10 adalah RAID bersarang atau RAID hibrida. Mereka dibangun dengan mendistribusikan data melalui cermin set disk. Misalnya, jajaran RAID level 10 dibuat dari empat partisi RAID yang terdiri dari dua pasang cermin dari partisi striped. RAID 10 memerlukan setidaknya empat disk.
