Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f29/pages/_partials/install/CustomSpoke_RecommendedScheme.po
Languages: tr

source: Recommended Partitioning Scheme
tr: Tavsiye Edilen Bölümlendirme Düzeni

source: In most cases, at least the following mount points should always be created:
tr: Çoğu durumda, en azından aşağıdaki bağlama noktaları her zaman oluşturulmalıdır:

source: This partition contains the operating system kernel, which allows {PRODUCT} to boot. It also contains other files used during the bootstrap process. Due to the limitations of most firmware, creating a separate, small standard partition for this directory is recommended. In most scenarios, a 500 MB `/boot` partition is adequate.
tr: Bu bölüm, {PRODUCT}'nın önyüklenmesini sağlayan işletim sistemi çekirdeğini içerir. Ayrıca, önyükleme işlemi sırasında kullanılan diğer dosyaları da içerir. Çoğu ürün yazılımının sınırlamaları nedeniyle bu dizin için ayrı, küçük bir standart bölüm oluşturulması tavsiye edilir. Çoğu durumda, 500 MB `/boot` bölümü yeterlidir.

source: If your system has a hardware RAID controller, be aware that some BIOS types do not support booting from it. In that case, the `/boot` partition must be created on a partition outside of the RAID array, such as on a separate hard drive.
tr: Sisteminizde bir donanımsal RAID denetleyicisi varsa, bazı BIOS türlerinin ondan önyükleme yapmayı desteklemediğini unutmayın. Bu durumda `/boot` bölümü, ayrı bir sabit disk gibi RAID dizisinin dışındaki bir bölümde oluşturulmalıdır.

source: Also note that the `/boot` directory can not be placed on a LVM logical volume or a Btrfs subvolume. Use a standard partition.
tr: Ayrıca `/boot` dizininin bir LVM mantıksal birimine veya bir Btrfs alt birimine yerleştirilemeyeceğini unutmayın. Standart bir bölüm kullanın.

source: `/` (root) - 10 GB
tr: `/` (kök) - 10 GB

source: This is where the root directory is located. The root directory is the top level of the directory structure. By default, all files are written to this partition unless a different partition is mounted in the path being written to (for example, `/boot` or `/home`). If you follow the recommended scheme described in this section, this will be the partition where most software packages will be installed.
tr: Kök dizinin bulunduğu yer burasıdır. Kök dizin, dizin yapısının en üst düzeyidir. Öntanımlı olarak, yazılan yola farklı bir bölüm bağlanmadıkça (örneğin, `/boot` veya `/home`) tüm dosyalar bu bölüme yazılır. Bu bölümde açıklanan tavsiye edilen düzeni takip ederseniz, çoğu yazılım paketinin kurulacağı bölüm burası olacaktır.

source: For a minimal installation, a 5 GB root partition will be sufficient. However, for most common installations which include extra packages and a graphical user interface, the root partition should be at least 10 GB; with 20 GB being sufficient for most common use cases.
tr: Asgari bir kurulum için 5 GB'lık bir kök bölümü yeterli olacaktır. Bununla birlikte, fazladan paketler ve bir grafiksel kullanıcı arayüzü içeren en yaygın kurulumlar için, kök bölüm en az 10 GB olmalıdır; 20 GB en yaygın kullanım durumları için yeterlidir.

source: The `/` mount point is the top of the Linux Filesystem Hierarchy, and is referred to as the _root file system_, or root. The `/root` directory, sometimes pronounced "pass:attributes[{blank}]_slash-root_pass:attributes[{blank}]", is the home directory for the `root` user.
tr: `/` bağlama noktası, Linux Dosya Sistemi Hiyerarşisinin en üstündedir ve _kök dosya sistemi_ veya kök olarak adlandırılır. Bazen "pass:attributes[{blank}]_slash-root_pass:attributes[{blank}]" olarak da telaffuz edilen `/root` dizini, `root` kullanıcısının ev dizinidir.

source: `/home` - at least 10 GB
tr: `/home` - en az 10 GB

source: To store user data separately from system data, create a dedicated mount point for the `/home` directory. This partition should be sized based on the amount of data that will be stored locally, number of users, and so on. This will allow you to upgrade or reinstall {PRODUCT} without erasing user data files. During the installation, a separate `/home` partition will be created if there are 50 GB or more free space for your {PRODUCT} installation.
tr: Kullanıcı verilerini sistem verilerinden ayrı olarak depolamak için, `/home` dizini için ayrı bir bağlama noktası oluşturun. Bu bölüm, yerel olarak depolanacak veri miktarına, kullanıcı sayısına vb. göre boyutlandırılmalıdır. Bu, kullanıcı veri dosyalarını silmeden {PRODUCT}'yı yükseltmenize veya yeniden kurmanıza olanak tanır. Kurulum sırasında, {PRODUCT} kurulumunuz için 50 GB veya daha fazla boş alan varsa ayrı bir `/home` bölümü oluşturulacaktır.

source: When using {PRODUCT} as a workstation for normal use with a graphical environment, this mount point should have the most disk space assigned to it, as it will likely hold the most data (user settings, images, videos, etc).
tr: {PRODUCT}'yı grafiksel bir ortamla normal kullanım için bir iş istasyonu olarak kullanırken, bu bağlama noktası büyük olasılıkla en fazla miktarda veriyi (kullanıcı ayarları, resimler, videolar, vb.) tutacağından, disk alanının çoğu ona atanmış olmalıdır.

source: swap - based on your system parameters
tr: takas - sistem parametrelerinize göre

source: Swap partitions support virtual memory; data is written to them when there is not enough RAM to store the data your system is processing. This partition's size is a function of system memory workload, not total system memory, and therefore is not equal to the total system memory size. Therefore, it is important to analyze what applications a system will be running and the load those applications will serve in order to determine the system memory workload. Application providers and developers should be able to provide some guidance.
tr: Takas bölümleri sanal belleği destekler; sisteminizin işlediği verileri depolamak için yeterli RAM olmadığında veriler onlara yazılır. Bu bölümün boyutu, toplam sistem belleğinin değil, sistem belleği iş yükünün bir işlevidir ve bu nedenle toplam sistem belleği boyutuna eşit değildir. Bu nedenle, sistem belleği iş yükünü belirlemek için bir sistemin hangi uygulamaları çalıştıracağını ve bu uygulamaların hizmet edeceği yükü değerlendirmek önemlidir. Uygulama sağlayıcıları ve geliştiricileri bu konuda bazı tavsiyelerde bulunabilirler.

source: When the system runs out of swap space, the kernel terminates processes as the system RAM memory is exhausted. Configuring too much swap space results in storage devices being allocated but idle and is a poor use of resources. Too much swap space can also hide memory leaks. The maximum size for a swap partition and other additional information can be found in the `mkswap(8)` man page.
tr: Sistemin takas alanı tükendiğinde çekirdek, sistem RAM belleğinin tamamı kullanıldığında işlemleri sonlandırır. Çok fazla takas alanı yapılandırmak, depolama aygıtlarının tahsis edilmesine, ancak boşta olmasına ve kaynakların yetersiz kullanımına neden olur. Çok fazla takas alanı, bellek sızıntılarını da gizleyebilir. Bir takas bölümü için azami boyut ve diğer ek bilgiler `mkswap(8)` kılavuz sayfasında bulunabilir.

source: The table below provides the recommended size of a swap partition depending on the amount of RAM in your system and whether you want sufficient memory for your system to hibernate. If you let the installation program partition your system automatically, the swap partition size will be established using these guidelines. Automatic partitioning setup assumes hibernation is not in use, and the maximum size of the swap partition is limited to 10% of the total size of the hard drive. If you want to set up enough swap space to allow for hibernation, or if you want to set the swap partition size to more than 10% of the system's storage space, you must edit the partitioning layout manually.
tr: Aşağıdaki tablo, sisteminizdeki RAM miktarına ve sisteminizin hazırda bekletme için yeterli belleğe sahip olmasını isteyip istemediğinize bağlı olarak bir takas bölümü için tavsiye edilen boyutu sağlamaktadır. Kurulum programının sisteminizi otomatik olarak bölümlendirmesine izin verirseniz, takas bölümünün boyutu bu yönergeler kullanılarak belirlenecektir. Otomatik bölümlendirme ayarları, hazırda bekletmenin kullanılmadığını varsayar ve takas bölümünün azami boyutu, sabit diskin toplam boyutunun %10'u ile sınırlıdır. Hazırda bekletmeye izin vermek için yeterli takas alanı ayarlamak veya takas bölümü boyutunu sistemin depolama alanının %10'undan fazlasına ayarlamak istiyorsanız, bölümlendirme düzenini elle düzenlemelisiniz.

source: Recommended System Swap Space
tr: Tavsiye Edilen Sistem Takas Alanı

source: |Amount of RAM in the system|Recommended swap space|Recommended swap space if allowing for hibernation |less than 2 GB|2 times the amount of RAM|3 times the amount of RAM |2 GB - 8 GB|Equal to the amount of RAM|2 times the amount of RAM |8 GB - 64 GB|0.5 times the amount of RAM|1.5 times the amount of RAM |more than 64 GB|workload dependent|hibernation not recommended
tr: |Sistemdeki RAM miktarı|Tavsiye edilen takas alanı|Hazırda bekletmeye izin veriliyorsa tavsiye edilen takas alanı |2 GB'den az|RAM miktarının 2 katı|RAM miktarının 3 katı |2 GB - 8 GB|RAM miktarına eşit|RAM miktarının 2 katı |8 GB - 64 GB|RAM miktarının yarısı|RAM miktarının 1 buçuk katı |64 GB'den fazla|iş yüküne bağlı|hazırda bekletme tavsiye edilmez

source: At the border between each range listed above (for example, a system with 2 GB, 8 GB, or 64 GB of system RAM), discretion can be exercised with regard to chosen swap space and hibernation support. If your system resources allow for it, increasing the swap space may lead to better performance.
tr: Yukarıda listelenen her aralık arasındaki sınırda (örneğin, 2 GB, 8 GB, veya 64 GB RAM miktarına sahip bir sistem), seçilen takas alanı ve hazırda bekletme desteği konusunda takdir yetkisi kullanılabilir. Sistem kaynaklarınız buna izin veriyorsa, takas alanını artırmak daha iyi performans sağlayabilir.

source: Distributing swap space over multiple storage devices - particularly on systems with fast drives, controllers and interfaces - also improves swap space performance.
tr: Takas alanını birden çok depolama aygıtına dağıtmak da - özellikle hızlı diskler, denetleyiciler ve arayüzler içeren sistemlerde - takas alanı performansını iyileştirir.

source: BIOS Boot (1 MB) or EFI System Partition (200 MB)
tr: BIOS Önyükleme (1 MB) veya EFI Sistem Bölümü (200 MB)

source: The [application]*GRUB2* boot loader can be installed either in the _Master Boot Record_ (MBR) or the _GUID Partition Table_ (GPT) of the boot device. In order to determine which of these methods to use, the installation program considers the following variations:
tr: [application]*GRUB2* önyükleyicisi, önyükleme aygıtının _Ana Önyükleme Kaydına_ (Master Boot Record - MBR) veya _GUID Bölümlendirme Tablosuna_ (GUID Partition Table - GPT) kurulabilir. Bu yöntemlerden hangisinin kullanılacağını belirlemek için kurulum programı aşağıdaki durumları dikkate alır:

source: Systems with BIOS firmware and UEFI systems in BIOS compatibility mode
tr: BIOS ürün yazılımına sahip sistemler ve BIOS uyumluluk modundaki UEFI sistemleri

source: If the disk is already formatted, the partitioning scheme is retained. If the disk is not formatted, or you have erased all existing partitions from the disk, the installer will choose the following:
tr: Disk zaten biçimlendirilmişse, bölümlendirme düzeni korunur. Disk biçimlendirilmemişse veya mevcut tüm bölümleri diskten sildiyseniz, kurucu şunu seçecektir:

source: MBR if the size of the disk is less than 2 TB (terabytes)
tr: Diskin boyutu 2 TB'den (terabayt) azsa MBR

source: GPT if the size of the disk is more than 2 TB
tr: Diskin boyutu 2 TB'den fazlaysa GPT

source: You can force the installer to use GPT on disks smaller than 2 TB by using the [option]#inst.gpt# boot option as described in xref:advanced/Boot_Options.adoc#chap-anaconda-boot-options[Boot Options]. However, the opposite is not possible - you can not use MBR on disks larger than 2 TB.
tr: xref:advanced/Boot_Options.adoc#chap-anaconda-boot-options[Önyükleme Seçenekleri] bölümünde açıklandığı gibi [option]#inst.gpt# önyükleme seçeneğini kullanarak kurucuyu 2 TB'den küçük disklerde GPT kullanmaya zorlayabilirsiniz. Ancak bunun tersi mümkün değildir - 2 TB'den büyük disklerde MBR kullanamazsınız.

source: You need to create a _BIOS Boot_ partition with a size of 1 MB to install on a system with BIOS firmware if the disk containing the boot loader uses GPT. If the disk uses a MBR, no special partition is necessary on a BIOS system.
tr: Önyükleyiciyi içeren disk GPT kullanıyorsa, BIOS ürün yazılımlı bir sisteme kurmak için 1 MB boyutunda bir _BIOS Önyükleme_ bölümü oluşturmanız gerekir. Disk MBR kullanıyorsa, BIOS sisteminde özel bir bölüme gerek yoktur.

source: Systems with UEFI firmware
tr: UEFI ürün yazılımına sahip sistemler

source: Only GPT is allowed on UEFI systems. In order to install on a formatted disk with a MBR, it must be reformated and relabeled. All data currently on the disk will be lost.
tr: UEFI sistemlerinde yalnızca GPT'ye izin verilir. MBR ile biçimlendirilmiş bir diske kurmak için, disk yeniden biçimlendirilmeli ve yeniden etiketlenmelidir. Diskte bulunan tüm veriler kaybedilecektir.

source: UEFI-based systems require an _EFI System Partition_ at least 50 MB in size (recommended size is 200 MB), regardless of the partitioning scheme.
tr: UEFI tabanlı sistemler, bölümlendirme düzeninden bağımsız olarak en az 50 MB boyutunda bir _EFI Sistem Bölümü_ gerektirir (tavsiye edilen boyut 200 MB'dir).

source: If your system requires either a BIOS Boot partition or an EFI System Partition based on the requirements detailed above, this partition must be created as a standard physical partition. It can not reside on an LVM volume or a Btrfs subvolume.
tr: Sisteminiz, yukarıda ayrıntıları verilen gereksinimlere göre bir BIOS Önyükleme bölümü veya bir EFI Sistem Bölümü gerektiriyorsa, bu bölümün standart bir fiziksel bölüm olarak oluşturulması gerekir. Bir LVM biriminde veya bir Btrfs alt biriminde bulunamaz.

source: Also note that if your system does not require any of these partitions, they will not be shown in the `File System` menu in mount point options.
tr: Ayrıca, sisteminiz bu bölümlerden herhangi birine ihtiyaç duymuyorsa, bunların bağlama noktası seçeneklerinde `Dosya Sistemi` menüsünde gösterilmeyeceğini unutmayın.

source: Many systems have more partitions than the minimum listed above. Choose partitions based on your particular needs. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-advice[Advice on Partitions] for additional information and advice.
tr: Çoğu sistem, yukarıda listelenen asgari bölümlerden daha fazla bölüme sahiptir. Bölümleri kendi ihtiyaçlarınıza göre seçin. Ek bilgi ve tavsiye için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-advice[Bölümlerle İlgili Tavsiyeler] bölümüne bakın.

source: Only assign storage capacity to those partitions you require immediately. You may allocate free space at any time, to meet needs as they occur.
tr: Yalnızca hemen ihtiyaç duyduğunuz bölümlere depolama kapasitesi atayın. İhtiyaçları ortaya çıktıkça karşılamak için istediğiniz zaman boş alan tahsis edebilirsiniz.

source: If you are not sure how best to configure the partitions for your computer, accept the automatic default partition layout provided by the installation program as described in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination].
tr: Bilgisayarınız için bölümleri en iyi şekilde nasıl yapılandıracağınızdan emin değilseniz, xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Kurulum Hedefi] bölümünde açıklandığı gibi kurulum programı tarafından sağlanan otomatik öntanımlı bölümlendirme düzenini kabul edin.
