Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f29/pages/_partials/install/InitialSetupHub.po
Languages: id

source: Initial Setup
id: Penyiapan Awal

source: The `Initial Setup` screen is shown after the installation finishes and the installed system boots for the first time, before the first login, assuming the following conditions have been met:
id: Layar `Penyiapan Awal` ditampilkan setelah instalasi selesai dan sistem yang terinstal di-boot untuk pertama kalinya, sebelum login pertama, dengan asumsi kondisi berikut telah terpenuhi:

source: Your software selection contained a graphical environment (for example, you installed the system using a {PRODUCT} Workstation live image).
id: Pilihan perangkat lunak Anda berisi lingkungan grafis (misalnya, Anda menginstal sistem menggunakan image live {PRODUCT} Workstation).

source: The graphical environment you have installed is *not* [application]*GNOME Desktop Environment* (it provides its own initial setup utility which is described in xref:After_Installation.adoc#sect-gnome-initial-setup[GNOME Initial Setup]).
id: Lingkungan grafis yang telah Anda instal adalah *bukan* [application]*Lingkungan Desktop GNOME* (ini menyediakan utilitas penyiapan awal sendiri yang dijelaskan dalam xref:After_Installation.adoc#sect-gnome-initial-setup[Penyiapan Awal GNOME]).

source: The [package]*initial-setup* package has been installed.
id: Paket [package]*initial-setup* telah terinstal.

source: You have not configured every screen available in the graphical installer.
id: Anda belum mengonfigurasi setiap layar yang tersedia di penginstal grafis.

source: The main Initial Setup screen. This example shows all options; not all of them may be shown
id: Layar Penyiapan Awal utama. Contoh ini menunjukkan semua pilihan; tidak semua dari mereka dapat ditampilkan

source: [application]*Initial Setup* allows you to configure several system settings. All of these can also be configured during the installation, but they are not required to finish it. Only the settings which have *not* been configured during the installation will be shown; for example, if you did not create a non-`root` user account during the installation, [application]*Initial Setup* will start after the first reboot, and you will be able to configure one. If you configured all available options during the instalaltion, [application]*Initial Setup* will not be displayed at all.
id: [application]*Penyiapan Awal* memungkinkan Anda untuk mengkonfigurasi beberapa pengaturan sistem. Semua ini juga dapat dikonfigurasi selama instalasi, tetapi mereka tidak diharuskan untuk menyelesaikannya. Hanya pengaturan yang *belum* dikonfigurasi selama instalasi akan ditampilkan; misalnya, jika Anda tidak membuat akun pengguna non-`root` selama instalasi, [application]*Penyiapan Awal* akan dimulai setelah reboot pertama, dan Anda akan dapat mengkonfigurasinya. Jika Anda mengkonfigurasi semua pilihan yang tersedia selama instalasi, [application]*Penyiapan Awal* tidak akan ditampilkan sama sekali.

source: To configure any aspect of the system available in the utility, click any of the links available in the main window (for example, `Create User`). Each link leads to a separate screen with separate options; these screens are the same ones which were available during the graphical installation. If you need help, press `Help` in the top left corner to open a new window containing directions for that screen.
id: Untuk mengonfigurasi setiap aspek dari sistem yang tersedia dalam utilitas, klik salah satu taut yang tersedia di jendela utama (misalnya, `Membuat pengguna`). Setiap tautan mengarah ke layar terpisah dengan pilihan terpisah; layar ini adalah yang sama yang tersedia selama instalasi grafis. Jika Anda memerlukan bantuan, tekan `Bantuan` di pojok kiri atas untuk membuka jendela baru yang berisi petunjuk untuk layar tersebut.

source: After you finish configuring any screen, press the `Done` button in the top left corner to return to the main [application]*Initial Setup* menu. After you finish configuring all settings, click `Finish Configuration` in the bottom right corner to save all configured settings. The configuration utility will close and you will be able to log in to the system.
id: Setelah Anda selesai mengonfigurasi layar apa pun, tekan tombol `Selesai` di pojok kiri atas untuk kembali ke menu utama [application]*Penyiapan Awal*. Setelah Anda selesai mengkonfigurasi semua pengaturan, klik `Akhiri Konfigurasi` di sudut kanan bawah untuk menyimpan semua pengaturan yang dikonfigurasi. Utilitas konfigurasi akan menutup dan Anda akan dapat masuk ke sistem.

source: It is possible to configure [application]*Initial Setup* to display all available options, even if they have been already configured during the installation. To do so, you must use a Kickstart file at the start of the installation, and this file must contain the following command:
id: Dimungkinkan untuk mengkonfigurasi [application]*Penyiapan Awal* untuk menampilkan semua pilihan yang tersedia, bahkan jika mereka telah sudah dikonfigurasi selama instalasi. Untuk melakukannya, Anda harus menggunakan berkas Kickstart pada awal instalasi, dan berkas ini harus berisi perintah berikut:

source: The [option]#--reconfig# option specifies that all options should be displayed. See xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart] for information about Kickstart installations.
id: Opsi [option]#--reconfig# menentukan bahwa semua opsi akan ditampilkan. Lihat xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Mengotomatisasi Instalasi dengan Kickstart] untuk informasi tentang instalasi Kickstart.

source: Normally, it is not possible to return to [application]*Initial Setup* after you close it and log in to the system. You can make it display again (after the next reboot, before a login prompt is displayed), by executing the following command as `root`:
id: Biasanya, tidak mungkin kembali ke [application]*Penyiapan Awal* setelah Anda menutupnya dan masuk ke sistem. Anda dapat membuatnya tampil lagi (setelah reboot berikutnya, sebelum prompt login ditampilkan), dengan mengeksekusi perintah berikut sebagai `root`:

source: Then, reboot your system.
id: Kemudian, reboot sistem Anda.
