Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f29/pages/_partials/install/SourceSpoke.po
Languages: pt_br

source: Installation Source
pt_br: Fonte de Instalação

source: The `Installation Source` screen allows you to specify a location (local or on the network) from which packages will be downloaded and installed on your system. This screen will be configured automatically in most cases, but you can change your settings or add additional sources.
pt_br: A tela `Fonte de Instalação` permite que você especifique uma localização (local ou na rede) da qual os pacotes serão baixados e instalados no seu sistema. A tela será configurada automaticamente na maioria dos casos, mas você pode mudar suas configurações ou adicionar fontes adicionais.

source: Normally, when you first enter the `Installation Summary` screen, the installer will attempt to configure an installation source based on the type of media you used to boot. The full {PRODUCT} Server DVD will configure the source as local media, the netinst ISO image will configure the closest network mirror, etc. This process takes some time, especially if the default source is a network mirror. If you plan to use a custom installation source, use the [option]#inst.askmethod# boot option to skip the initial configuration; this will allow you to enter this screen immediately. See xref:advanced/Boot_Options.adoc#sect-boot-options-sources[Specifying the Installation Source] for information about boot options.
pt_br: Normalmente, quando você entra pela primeira vez na tela `Resumo da Instalação`, o instalador tentará configurar uma fonte de instalação baseada no tipo de mídia que você usou para inicializar. O DVD completo do {PRODUCT} Server configurará a fonte como mídia local, a imagem ISO netinst configurará o espelho de rede mais próximo, etc. Este processo leva algum tempo, especialmente se a fonte padrão é um espelho de rede. Se você planeja usar uma fonte de instalação personalizada, use a opção de inicialização [option]#inst.askmethod# para pular a configuração inicial; isto permitirá que você entre nesta tela imediatamente. Veja xref:advanced/Boot_Options.adoc#sect-boot-options-sources[Especificando a Fonte de Instalação] para informações sobre opções de inicialização.

source: The Installation Source screen
pt_br: A tela Fonte de Instalação

source: The following options are available. Note that not all of them may be displayed.
pt_br: As opções a seguir estão disponíveis. Note que nem todas elas podem ser exibidas.

source: Auto-detected installation media
pt_br: Detectar automaticamente a mídia de instalação

source: This is the option selected by default if you started the installer from media containing an installation source, such as a live DVD. No additional configuration is necessary. You can click the `Verify` button check the media integrity.
pt_br: Esta é a opção selecionada por padrão se você iniciar o instalador a partir de uma mídia contendo uma fonte de instalação, como um DVD live. Nenhuma configuração adicional é necessária. Você pode clicar no botão `Verificar` para checar a integridade da mídia.

source: ISO file
pt_br: Arquivo ISO

source: This option will appear if the installation program detected a partitioned hard drive with mountable file systems during boot. Select this option, click the btn:[Choose an ISO] button, and browse to the installation ISO file's location on your system. You can click the `Verify` button to check the file's integrity.
pt_br: Esta opção aparecerá se o programa de instalação detectar uma unidade de disco rígido com um sistema de arquivo montável durante a inicialização. Selecione esta opção, clique no botão btn:[Escolher uma ISO], e procure pelos arquivos ISO de instalação localizados no seu sistema. Você pode clicar no botão `Verificar` para chegar a integridade dos arquivos.

source: On the network
pt_br: Na rede

source: Use this option to download packages to be installed from a network location instead of local media. This is the default selection on network installation media.
pt_br: Use esta opção para baixar pacotes para serem instalados a partir de uma rede em vez de uma mídia local. Esta é a seleção padrão na mídia de instalação de rede.

source: In most cases, the `Closest mirror` option available from the protocol selection drop-down menu is preferable. If this option is selected, packages for your system will be downloaded from the most suitable location (mirror).
pt_br: Na maioria dos casos, a opção `Espelho mais próximo` disponível pelo menu suspenso de seleção de protocolo é preferível. Se essa opção está selecionada, os pacotes para seu sistema serão baixados a partir do local mais adequado (espelho).

source: To manually configure a network-based installation source, use the drop-down menu to specify the protocol to be used when downloading packages. This setting depends on the server you want to use. Then, type the server address (without the protocol) into the address field. If you choose NFS, a second input field will appear where you can specify custom `NFS mount options`.
pt_br: Para configurar manualmente um fonte de instalação baseada em rede, use o menu suspenso para especificar o protocolo a ser usado quando estiver baixando pacotes. Esta configuração depende do servidor que você quer usar. Então, digite o endereço do servidor (sem o protocolo) no campo endereço. Se você escolher NFS, um segundo campo de entrada aparecerá, onde você pode especificar `opções de montagem NFS` personalizadas.

source: When selecting an NFS installation source, you must specify the address with a colon (`:`) character separating the host name from the path. For example:
pt_br: Quando selecionar uma fonte de instalação NFS, você deve especificar o endereço com o caractere dois pontos (`:`) separando o nome de host do caminho. Por exemplo:

source: `pass:attributes[{blank}]_server.example.com_:pass:attributes[{blank}]_/path/to/directory_pass:attributes[{blank}]`
pt_br: `pass:attributes[{blank}]_server.example.com_:pass:attributes[{blank}]_/caminho/do/diretorio_pass:attributes[{blank}]`

source: To configure a proxy for an HTTP or HTTPS source, click the btn:[Proxy setup] button. Check `Enable HTTP proxy` and type the URL into the `Proxy URL` box. If the proxy server requires authentication, check `Use Authentication` and enter your user name and password. Click btn:[OK] to finish the configuration.
pt_br: Para configurar um proxy para uma fonte HTTP ou HTTPS, clique no botão btn:[Configurar proxy] . Marque `Habilitar proxy HTTP` e digite o URL na caixa `Proxy URL`. Se o servidor proxy requer autenticação, marque `Usar Autenticação` e digite seu nome de usuário e senha. Clique em btn:[OK] para finalizar a configuração.

source: If your HTTP or HTTPS URL refers to a repository mirror list, mark the check box under the address field.
pt_br: Se o seu URL HTTP ou HTTPS refere-se a uma lista de espelhos de repositório, marque a caixa de seleção sob o campo de endereço.

source: You can also specify additional repositories in the `Additional repositories` section to gain access to more installation environments and software add-ons. All environments and add-ons will be available for selection in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Software Selection] once you finish configuring the sources.
pt_br: Você também pode especificar repositórios adicionais na seção `Repositórios adicionais` para obter acesso a mais ambientes de instalação e add-ons de software. Todos os ambientes e add-ons estarão disponíveis para seleção em xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Seleção de Software] uma vez que você termine de configurar as fontes.

source: To add a repository, click the btn:[+] button. To delete a repository, select one in the list and click the btn:[-] button. Click the arrow icon to revert to the previous list of repositories, i.e. to replace current entries with those that were present at the time you entered the `Installation Source` screen. To activate or deactivate a repository, click the check box in the `Enabled` column at each entry in the list.
pt_br: Para adicionar um repositório, clique no botão btn:[+]. Para excluir um repositório, selecione um na lista e clique no botão btn:[-]. Clique no ícone de seta para reverter para a última lista de repositórios, por exemplo, para substituir entradas atuais com aquelas que estavam presentes no momento que você entrou na tela `Fonte de Instalação`. Para ativar ou desativar um repositório, clique a caixa de seleção na coluna `Habilitado` em cada entrada da lista.

source: You can name your additional repository and configure it the same way as the primary repository on the network using the input fields on the right side of the section.
pt_br: Você pode nomear seu repositório adicional e configurá-lo da mesma maneira que o repositório primário na rede usando os campos de entrada no lado direito da seção.

source: Once you have selected your installation source, click `Done` in the top left corner to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
pt_br: Uma vez que você tenha selecionado sua fonte de instalação, clique em `Pronto` no canto superior esquerdo para retornar ao xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Resumo da Instalação].
