Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f29/pages/_partials/install/SummaryHub.po
Languages: fi, fr

source: Installation Summary
fi: Asennuksen yhteenveto
fr: Résumé de l’installation

source: The `Installation Summary` screen is the central location for setting up an installation. Most of the options which can be configured during the installation can be accessed from here.
fi: "Asennusyhteenveto"-näyttö on keskeinen paikka asennuksen määrittämiselle. Useimmat vaihtoehdot, jotka voidaan määrittää asennuksen aikana, ovat käytettävissä täältä.
fr: L’écran `Résumé de l’installation` est l’endroit central pour configurer l’installation. La plupart des options qui peuvent être configurées pendant l’installation sont accessibles à partir de cet écran.

source: The Installation Summary screen
fi: Asennuksen yhteenveto -näyttö
fr: L’écran Résumé de l’installation

source: If you used a Kickstart option or a boot option to specify an installation repository on a network, but no network is available at the start of the installation, the installer will display the `Network Configuration` screen for you to set up a network connection prior to displaying the `Installation Summary` screen.
fi: Jos käytit Kickstart-vaihtoehtoa tai käynnistysvaihtoehtoa määrittääksesi ohjelmistolähteen verkossa, mutta verkkoa ei ole käytettävissä asennuksen alussa, asennusohjelma näyttää "Verkkoasetukset"-näytön, jossa voit määrittää verkkoyhteyden ennen "Asennusyhteenveto"-näytön näyttämistä.
fr: Si vous avez utilisé une option Kickstart ou une option de démarrage pour spécifier un dépôt d’installation réseau, mais qu’aucun réseau n’est disponible au début de l’installation, le programme d’installation affichera l’écran `Configuration réseau` pour que vous puissiez établir une connexion au réseau avant d’afficher l’écran `Résumé de l’installation`.

source: The summary screen consists of several links to other screens, separated into categories. These links can be in several different states, which are graphically indicated:
fi: Yhteenvetoruutu koostuu useista linkeistä muihin näyttöihin, jotka on jaettu luokkiin. Nämä linkit voivat olla useassa eri tilassa, jotka on esitetty graafisesti:
fr: L’écran de résumé est constitué de plusieurs liens vers d’autres écrans, séparés en catégories. Ces liens peuvent se trouver dans plusieurs états différents, qui sont indiqués graphiquement :

source: A *warning symbol* (yellow triangle with an exclamation mark) next to an icon means that a screen requires your attention before you start the installation. This typically happens with the `Installation Destination` screen, because even though there is a default automatic partitioning variant, you always have to at least confirm this selection, even if you do not want to make any changes.
fi: *Varoitussymboli* (keltainen kolmio huutomerkillä) kuvakkeen vieressä tarkoittaa, että näyttö vaatii huomiota ennen asennuksen aloittamista. Tämä tapahtuu yleensä "Asennuskohde"-näytössä, koska vaikka oletusarvoinen automaattinen osiointiversio on olemassa, sinun on aina vähintään vahvistettava tämä valinta, vaikka et haluaisi tehdä muutoksia.
fr: Un *symbole d’avertissement* (triangle jaune avec un point d’exclamation) à côté d’une icône signifie qu’un écran requiert votre attention avant que vous ne commenciez l’installation. Cela se produit généralement avec l’écran `Destination de l’installation`, car même s’il existe une variante de partitionnement automatique par défaut, vous devez toujours au moins confirmer cette sélection, même si vous ne voulez effectuer aucune modification.

source: If a link is *greyed out*, it means that the installer is currently configuring this section, and you must wait for the configuration to finish before accessing that screen. This typically happens when you change the installation source in the `Installation Source` screen and the installer is probing the new source location and gathering a list of available packages.
fi: Jos linkki on *harmaa*, se tarkoittaa, että asennusohjelma määrittää parhaillaan tätä osaa, ja sinun on odotettava määrityksen valmistumista ennen kuin pääset kyseiseen näyttöön. Tämä tapahtuu yleensä, kun vaihdat asennuslähdettä "Asennuslähde"-näytössä ja asennusohjelma etsii uutta lähdesijaintia ja kerää luettelon saatavilla olevista paketeista.
fr: Si un lien est *grisé*, cela signifie que l’installateur est en train de configurer cette section, et que vous devez attendre que la configuration soit terminée avant d’accéder à cet écran. Cela se produit généralement lorsque vous changez la source d’installation dans l’écran `Source d’installation` et que l’installateur sonde la nouvelle source et rassemble la liste des paquets disponibles.

source: Screens with *black text and no warning symbol* mean that this screen does not require your attention. You can still change your settings in these screens, but it is not necessary to do so to complete the installation. This typically happens with localization settings, as these are either detected automatically, or set up on the previous screen where you select your language and locale.
fi: Näytöt, joissa on *musta teksti ilman varoitussymbolia* tarkoittavat, että tämä näyttö ei vaadi huomiotasi. Voit silti muuttaa asetuksiasi näissä näytöissä, mutta sitä ei tarvitse tehdä asennuksen viimeistelemiseksi. Tämä tapahtuu yleensä lokalisointiasetuksissa, koska ne joko tunnistetaan automaattisesti tai ne määritetään edellisessä näytössä, jossa valitset kielen ja maa-alueen.
fr: Les écrans avec du *texte noir et sans symbole d’avertissement* sont des écrans qui ne requièrent pas votre attention. Vous pouvez modifier les paramètres de ces écrans, mais il n’est pas nécessaire de le faire pour terminer l’installation. Cela se produit généralement avec les paramètres de localisation, car ceux-ci sont soit détectés automatiquement, soit configurés sur l’écran précédent où vous sélectionnez votre langue et votre région.

source: A warning message is displayed at the bottom of the summary screen, and the `Begin Installation` button is greyed out, as long as at least one item has not been configured yet.
fi: Yhteenvetonäytön alareunassa näkyy varoitusviesti, ja Aloita asennus -painike näkyy harmaana, niin kauan kuin vähintään yhtä kohdetta ei ole vielä määritetty.
fr: Un message d’avertissement est affiché au bas de l’écran de résumé, et le bouton `Commencer l’installation` est grisé, tant qu’au moins un élément n’a pas encore été configuré.

source: Icon States in Installation Summary
fi: Kuvakkeen tilat asennuksen yhteenvedossa
fr: Icônes d’état dans le Résumé de l’installation

source: A screenshot of several icons in the Installation Summary screen
fi: Kuvakaappaus useista kuvakkeista Asennusyhteenveto-näytössä
fr: Une capture d’écran de plusieurs icônes dans l’écran Résumé de l’installation

source: Each screen also has an explanatory text below its title, showing settings currently configured in that screen. This text may be concatenated; in that case, move your mouse cursor over it and wait until a tooltip with the full text appears.
fi: Jokaisen näytön otsikon alla on myös selittävä teksti, joka näyttää kyseiselle näytölle tällä hetkellä määritetyt asetukset. Tämä teksti voidaan ketjuttaa; siirrä siinä tapauksessa hiiren osoitin sen päälle ja odota, kunnes koko tekstin sisältävä työkaluvihje tulee näkyviin.
fr: Chaque écran comporte également, sous son titre, un texte explicatif indiquant les paramètres actuellement configurés dans cet écran. Ce texte peut être concaténé ; dans ce cas, déplacez le curseur de votre souris dessus et attendez qu’une infobulle contenant le texte complet apparaisse.

source: Tooltip in the Installation Summary
fi: Työkaluvinkki asennuksen yhteenvedossa
fr: Infobulle dans le Résumé de l’installation

source: An entry in the Installation Summary shows a truncated description and a tooltip with full text.
fi: Asennusyhteenvedon merkintä näyttää katkaistun kuvauksen ja työkaluvihjeen, jossa on koko teksti.
fr: Une entrée dans le Résumé d’installation montre une description tronquée et une infobulle avec le texte complet.

source: Once you configure everything required for the installation, you can press the `Begin Installation` button to start installing {PRODUCT}. This will take you to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Configuration and Installation Progress]. Note that as the text below this button says, nothing will be written to your hard drive before you press this button. You can press `Quit` at any point; this will discard all changes you made in the installer so far and reboot the system.
fr: Une fois que vous avez configuré tout ce qui est nécessaire à l’installation, vous pouvez appuyer sur le bouton `Commencer l’installation` pour lancer l’installation de {PRODUCT}. Cela vous amènera à l’écran xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Configuration et état d’avancement de l’installation]. Notez que, comme le dit le texte sous ce bouton, rien ne sera écrit sur votre disque dur avant que vous n’appuyiez sur ce bouton. Vous pouvez appuyer sur `Quitter` à tout moment ; cela annulera toutes les modifications que vous avez faites dans l’installateur jusqu’à présent et redémarrera le système.
