Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/appendixes/Disk_Partitions.po
Languages: ko, pt_br

source: An Introduction to Disk Partitions
ko: 디스크 파티션 소개
pt_br: Uma introdução às partições de disco

source: This section discusses basic disk concepts, disk repartitioning strategies, the partition naming scheme used by Linux systems, and related topics.
ko: 이 부분은 리눅스 시스템과 관련된 주제에 사용되는 기본적인 디스크 개념, 디스크 파티션 전략, 파티션 이름 체계를 토의합니다.
pt_br: Esta seção discute conceitos básicos de disco, estratégias de reparticionamento de disco, o esquema de nomenclatura de partição usado por sistemas Linux e tópicos relacionados.

source: If you are comfortable with disk partitions, you can skip ahead to xref:sect-disk-partitions-making-room[Strategies for Disk Repartitioning] for more information on the process of freeing up disk space to prepare for a {PRODUCT} installation.
ko: 만약 디스크 파티션에 익숙하다면, {PRODUCT} 설치를 준비하기 위해 디스크 공간을 확보하는 과정에서 더 많은 정보를 위해 xref:sect-disk-partitions-making-room[디스크 재구성을 위한 전략]으로 건너 뛸 수 있습니다.
pt_br: Se você se sentir confortável com partições de disco, pode pular para xref:sect-disk-partitions-making-room[Estratégias para reparticionamento de disco] para obter mais informações sobre o processo de liberação de espaço em disco para se preparar para uma instalação do {PRODUCT}.

source: Hard Disk Basic Concepts
ko: 하드 디스크 기본 개념
pt_br: Conceitos básicos de disco rígido

source: Hard disks perform a very simple function - they store data and reliably retrieve it on command.
ko: 하드 디스크는 매우 단순한 기능을 수행합니다 - 이들은 자료를 저장하고 신뢰하도록 명령에 따라 이를 끌어냅니다.
pt_br: Os discos rígidos executam uma função muito simples - eles armazenam dados e os recuperam de forma confiável sob comando.

source: When discussing issues such as disk partitioning, it is important to have a understanding of the underlying hardware; however, since the theory is very complicated and expansive, only the basic concepts will be explained here. This appendix uses a set of simplified diagrams of a disk drive to help explain what is the process and theory behind partitions.
ko: 디스크 파티셔닝과 같은 문제를 토의 할 때에, 기본 하드웨어를 이해하는 것이 중요합니다; 아뭏튼, 이론은 매우 복잡하고 광범위하여, 여기서에서는 기본 개념만 설명 할 것입니다. 이 부록에서는 디스크 드라이브의 간략화된 다이어그램 설정을 사용하여 파티션 뒤에 있는 처리와 이론을 설명합니다.
pt_br: Ao discutir questões como particionamento de disco, é importante entender o hardware subjacente; entretanto, como a teoria é muito complicada e extensa, apenas os conceitos básicos serão explicados aqui. Este apêndice usa um conjunto de diagramas simplificados de uma unidade de disco para ajudar a explicar o que é o processo e a teoria por trás das partições.

source: xref:figu-partitions-unused-drive[An Unused Disk Drive], shows a brand-new, unused disk drive.
ko: xref:figu-partitions-unused-drive[사용하지 않는 디스크 드라이브], 사용하지 않은 신규 디스크 드라이브를 보여줍니다.
pt_br: xref:figu-partitions-unused-drive[Uma unidade de disco não usada], mostra uma unidade de disco nova e não usada.

source: An Unused Disk Drive
ko: 사용하지 않는 디스크 드라이브
pt_br: Uma unidade de disco não usada

source: Image of an unused disk drive.
ko: 사용하지 않는 디스크 드라이브 이미지.
pt_br: Imagem de uma unidade de disco não usada.

source: File Systems
ko: 파일 시스템
pt_br: Sistemas de arquivos

source: Disk Drive with a File System
ko: 파일 시스템이 있는 디스크 드라이브
pt_br: Unidade de disco com um sistema de arquivos

source: Image of a formatted disk drive.
ko: 초기화된 디스크 드라이브 이미지.
pt_br: Imagem de uma unidade de disco formatada.

source: As xref:figu-partitions-formatted-drive[Disk Drive with a File System], implies, the order imposed by a file system involves some trade-offs:
ko: xref:figu-partitions-formatted-drive[파일 시스템이 있는 디스크 드라이브]에서 의미 하듯이, 파일 시스템에 의해 부과되는 순서에는 몇 가지 절충안이 포함됩니다:
pt_br: Como xref:figu-partitions-formatted-drive[Unidade de disco com um sistema de arquivos] sugere, a ordem imposta por um sistema de arquivos envolve algumas desvantagens:

source: A small percentage of the driver's available space is used to store file system-related data and can be considered as overhead.
ko: 드라이버의 사용 가능한 공간 중의 적은 비율이 파일 시스템-연관된 자료를 저장하는 데 사용되었으며 오버헤드로 간주될 수 있습니다.
pt_br: Uma pequena porcentagem do espaço disponível da unidade é usada para armazenar dados relacionados ao sistema de arquivos e pode ser considerada uma sobrecarga.

source: A file system splits the remaining space into small, consistently-sized segments. For Linux, these segments are known as _blocks_ footnote:[Blocks really *are* consistently sized, unlike our illustrations. Keep in mind, also, that an average disk drive contains thousands of blocks. The picture is simplified for the purposes of this discussion.].
ko: 파일 시스템은 나머지 공간을 일정한 크기의 작은 세그먼트로 분할합니다. 리눅스의 경우에, 이들 세그먼트는 블럭으로 알려져 있습니다 footnote: [블럭은 *실제로* 우리의 그림(삽화)과 다르게 크기가 일정합니다. 또한, 평균 디스크 드라이브에는 수천 개의 블럭이 포함되어 있다는 점을 기억하세요. 그림은 이와 같은 논의 목적을 위해 단순화했습니다.].
pt_br: Um sistema de arquivos divide o espaço restante em segmentos pequenos e de tamanho consistente. Para Linux, esses segmentos são conhecidos como _blocos_ footnote:[Os blocos realmente *têm* tamanhos consistentes, ao contrário de nossas ilustrações. Lembre-se também de que uma unidade de disco comum contém milhares de blocos. A imagem é simplificada para os fins desta discussão.].

source: Note that there is no single, universal file system. As xref:figu-partitions-different-file-system[Disk Drive with a Different File System], shows, a disk drive may have one of many different file systems written on it. Different file systems tend to be incompatible; that is, an operating system that supports one file system (or a handful of related file system types) may not support another. However, {PRODUCT} supports a wide variety of file systems (including many commonly used by other operating systems such as Microsoft Windows), making data interchange between different file systems easy.
ko: 단일의 범용 파일 시스템은 없습니다. xref:Disk_Partitions.adoc#figu-partitions-different-file-system[다른 파일 시스템을 가지는 디스크 드라이브]로, 디스크 드라이브는 많은 파일 시스템 중 하나가 기록되어 있을 는 것을 보여줍니다. 다른 파일 시스템은 호환되지 않는 경향이 있습니다; 이는, 하나의 파일 시스템(또는 소수의 연관 파일 시스템 유형)을 지원하는 운영 체제는 다른 파일 시스템을 지원하지 않을 수도 있습니다. 아무튼, {PRODUCT}는 광범위한 파일 시스템(마이크로소프트 윈도우와 같은 다른 운영 체제에 의해 일반적으로 사용되는 것을 포함하여)을 지원하며, 다른 파일 시스템 간에 손쉽게 자료 교환을 만듭니다.
pt_br: Observe que não existe um sistema de arquivos universal único. Como xref:figu-partitions-different-file-system[Unidade de disco com um sistema de arquivos diferente] mostra, uma unidade de disco pode ter um dos muitos sistemas de arquivos diferentes escritos nela. Diferentes sistemas de arquivos tendem a ser incompatíveis; ou seja, um sistema operacional que oferece suporte a um sistema de arquivos (ou vários tipos de sistemas de arquivos relacionados) pode não oferecer suporte a outro. No entanto, o {PRODUCT} oferece suporte a uma ampla variedade de sistemas de arquivos (incluindo muitos comumente usados por outros sistemas operacionais como o Microsoft Windows), facilitando a troca de dados entre diferentes sistemas de arquivos.

source: Disk Drive with a Different File System
ko: 다른 파일 시스템이 있는 디스크 드라이브
pt_br: Unidade de disco com um sistema de arquivos diferente

source: Image of a disk drive with a different file system.
ko: 다른 파일 시스템이 있는 디스크 드라이브의 이미지.
pt_br: Imagem de uma unidade de disco com um sistema de arquivos diferente.

source: Writing a file system to disk is only the first step. The goal of this process is to actually *store* and *retrieve* data. The figure below shows a drive disk after some data have been written to it:
ko: 파일 시스템을 디스크에 쓰는 것은 첫 번째 단계일 뿐입니다. 이와 같은 처리의 목표는 실제로 자료를 *저장*하고 *검색*하는 것입니다. 아래 그림은 일부 자료가 기록된 후의 드라이브 디스크를 보여줍니다:
pt_br: Escrever um sistema de arquivos no disco é apenas a primeira etapa. O objetivo deste processo é realmente *armazenar* e *recuperar* dados. A figura abaixo mostra um disco de unidade depois que alguns dados foram escritos nele:

source: Disk Drive with Data Written to It
ko: 자료가 기록된 디스크 드라이브
pt_br: Unidade de disco com dados escritos

source: Image of a disk drive with data written to it.
ko: 자료가 기록된 디스크 드라이버의 이미지.
pt_br: Imagem de uma unidade de disco com dados escritos nela.

source: As xref:figu-partitions-drive-with-data[Disk Drive with Data Written to It], shows, some of the previously-empty blocks are now holding data. However, by just looking at this picture, we cannot determine exactly how many files reside on this drive. There may only be one file or many, as all files use at least one block and some files use multiple blocks. Another important point to note is that the used blocks do not have to form a contiguous region; used and unused blocks may be interspersed. This is known as _fragmentation_. Fragmentation can play a part when attempting to resize an existing partition.
pt_br: Como xref:figu-partitions-drive-with-data[Unidade de disco com dados escritos] mostra, alguns dos blocos anteriormente vazios agora contêm dados. No entanto, apenas olhando para esta imagem, não podemos determinar exatamente quantos arquivos residem nesta unidade. Pode haver apenas um arquivo ou vários, pois todos os arquivos usam pelo menos um bloco e alguns arquivos usam vários blocos. Outro ponto importante a se notar é que os blocos usados não precisam formar uma região contígua; blocos usados e não usados podem ser intercalados. Isso é conhecido como _fragmentação_. A fragmentação pode desempenhar um papel ao tentar redimensionar uma partição existente.

source: As with most computer-related technologies, disk drives changed over time after their introduction. In particular, they got bigger. Not larger in physical size, but bigger in their capacity to store information. And, this additional capacity drove a fundamental change in the way disk drives were used.
pt_br: Como acontece com a maioria das tecnologias relacionadas a computadores, as unidades de disco mudaram com o tempo após sua introdução. Em particular, eles ficaram maiores. Não é maior em tamanho físico, mas maior em sua capacidade de armazenar informações. E essa capacidade adicional levou a uma mudança fundamental na maneira como as unidades de disco eram usadas.

source: Partitions: Turning One Drive Into Many
ko: 파티션: 하나의 드라이버를 다수로 전환하기
pt_br: Partições: transformando uma unidade em muitas

source: Disk drives can be divided into _partitions_. Each partition can be accessed as if it was a separate disk. This is done through the addition of a _partition table_.
ko: 디스크 드라이버는 파티션에서 나눠 질 수 있습니다. 각각의 파티션은 만약 분리된 디스크가 있는 것처럼 접근 될 수 있습니다. 이는 파티션 테이블의 추가를 통해서 수행됩니다.
pt_br: As unidades de disco podem ser divididas em _partições_. Cada partição pode ser acessada como se fosse um disco separado. Isso é feito através da adição de uma _tabela de partição_.

source: There are several reasons for allocating disk space into separate disk partitions, for example:
ko: 디스크 공간을 별도의 디스크 파티션에 할당하는데 몇 가지 이유가 있으며, 다음과 같은 예입니다:
pt_br: Existem vários motivos para alocar espaço em disco em partições de disco separadas, por exemplo:

source: Logical separation of the operating system data from the user data
ko: 사용자 자료에서 운영체제 시스템 자료의 논리적인 분할
pt_br: Separação lógica dos dados do sistema operacional dos dados do usuário

source: Ability to use different file systems
ko: 다른 파일 시스템 사용에 대한 능력
pt_br: Capacidade de usar diferentes sistemas de arquivos

source: Ability to run multiple operating systems on one machine
ko: 하나의 장비에 다중 운영체제를 실행하는 능력
pt_br: Capacidade de executar vários sistemas operacionais em uma máquina

source: There are currently two partitioning layout standards for physical hard disks: Master Boot Record (*MBR*) and GUID Partition Table (*GPT*). *MBR* is an older method of disk partitioning used with BIOS-based computers. *GPT* is a newer partitioning layout that is a part of the Unified Extensible Firmware Interface (*UEFI*). This section and xref:sect-disk-partitions-extended[Partitions Within Partitions - An Overview of Extended Partitions] mainly describe the _Master Boot Record_ (*MBR*) disk partitioning scheme. For information about the _GUID Partition Table_ (*GPT*) partitioning layout, see xref:sect-disk-partitioning-guid-partition-table[GUID Partition Table (GPT)].
pt_br: Atualmente, existem dois padrões de layout de particionamento para discos rígidos físicos: Master Boot Record ou Registro Mestre de Inicialização (*MBR*), e GUID Partition Table ou Tabela de Partição GUID (*GPT*). *MBR* é um método mais antigo de particionamento de disco usado com computadores baseados em BIOS. *GPT* é um layout de particionamento mais recente que faz parte da Unified Extensible Firmware Interface (*UEFI *). Esta seção e xref:sect-disk-partitions-extended[Partições dentro de partições - uma visão geral das partições estendidas] descreve principalmente o esquema de particionamento de disco _Master Boot Record_ (*MBR*). Para obter informações sobre o layout de particionamento _GUID Partition Table_ (*GPT*), consulte xref:sect-disk-partitioning-guid-partition-table[Tabela de Partição GUID (GPT)].

source: While the diagrams in this chapter show the partition table as being separate from the actual disk drive, this is not entirely accurate. In reality, the partition table is stored at the very start of the disk, before any file system or user data. But for clarity, they are separate in our diagrams.
pt_br: Embora os diagramas neste capítulo mostrem a tabela de partição separada da unidade de disco real, isso não é totalmente preciso. Na realidade, a tabela de partição é armazenada bem no início do disco, antes de qualquer sistema de arquivos ou dados do usuário. Mas, para maior clareza, eles estão separados em nossos diagramas.

source: Disk Drive with Partition Table
ko: 파티션 표가 있는 디스크 드라이브
pt_br: Unidade de disco com tabela de partição

source: Image of an unused disk drive with a partition table.
ko: 파티션 표가 있는 사용하지 않는 디스크 드라이브의 이미지.
pt_br: Imagem de uma unidade de disco não usada com uma tabela de partição.

source: As xref:figu-partitions-partition-table[Disk Drive with Partition Table] shows, the partition table is divided into four sections or four _primary_ partitions. A primary partition is a partition on a hard drive that can contain only one logical drive (or section). Each section can hold the information necessary to define a single partition, meaning that the partition table can define no more than four partitions.
pt_br: Como xref:figu-partitions-partition-table[Unidade de disco com tabela de partição] mostra, a tabela de partição é dividida em quatro seções ou quatro partições _primárias_. Uma partição primária é uma partição em um disco rígido que pode conter apenas uma unidade lógica (ou seção). Cada seção pode conter as informações necessárias para definir uma única partição, o que significa que a tabela de partição pode definir no máximo quatro partições.

source: Each partition table entry contains several important characteristics of the partition:
ko: 각각 파티션 표 항목은 파티션의 몇 가지 중요한 특성을 포함합니다:
pt_br: Cada entrada da tabela de partição contém várias características importantes da partição:

source: The points on the disk where the partition starts and ends
ko: 파티션 시작과 끝의 위치에 있는 디스크 지점
pt_br: Os pontos do disco onde a partição começa e termina

source: The partition's type
ko: 파티션 유형
pt_br: O tipo da partição

source: The type is a number that identifies the partition's anticipated usage. Some operating systems use the partition type to denote a specific file system type, to flag the partition as being associated with a particular operating system, to indicate that the partition contains a bootable operating system, or some combination of the three.
pt_br: O tipo é um número que identifica o uso antecipado da partição. Alguns sistemas operacionais usam o tipo de partição para denotar um tipo específico de sistema de arquivos, para sinalizar a partição como associada a um sistema operacional específico, para indicar que a partição contém um sistema operacional inicializável ou alguma combinação dos três.

source: See xref:figu-partitions-single-part[Disk Drive With Single Partition] for an example of a disk drive with single partition.
ko: 단일 파티션을 갖고 있는 디스크 드라이버의 예를 위해 xref:figu-partitions-single-part[단일 파티션을 갖고 있는 디스크 드라이브]를 참고하세요.
pt_br: Consulte xref:figu-partitions-single-part[Unidade de disco com partição única] para obter um exemplo de unidade de disco com partição única.

source: Disk Drive With Single Partition
ko: 단일 파티션이 있는 디스크 드라이브
pt_br: Unidade de disco com partição única

source: Image of a disk drive with a single partition.
ko: 단일 파티션이 있는 디스크 드라이브의 이미지.
pt_br: Imagem de uma unidade de disco com uma única partição.

source: The single partition in this example is labeled as `DOS`. This label shows the *partition type*, with `DOS` being one of the most common ones. The table below shows a list of some of the commonly used partition types and hexadecimal numbers used to represent them.
pt_br: A partição única neste exemplo é rotulada como `DOS`. Este rótulo mostra o *tipo de partição*, sendo `DOS` um dos mais comuns. A tabela abaixo mostra uma lista de alguns dos tipos de partição comumente usados e números hexadecimais usados para representá-los.

source: Partition Types
ko: 파티션 유형
pt_br: Tipos de partição

source: |Partition Type|Value|Partition Type|Value |Empty|00|Novell Netware 386|65 |DOS 12-bit FAT|01|PIC/IX|75 |XENIX root|02|Old MINIX|80 |XENIX usr|03|Linux/MINUX|81 |DOS 16-bit <=32M|04|Linux swap|82 |Extended|05|Linux native|83 |DOS 16-bit >=32|06|Linux extended|85 |OS/2 HPFS|07|Amoeba|93 |AIX|08|Amoeba BBT|94 |AIX bootable|09|BSD/386|a5 |OS/2 Boot Manager|0a|OpenBSD|a6 |Win95 FAT32|0b|NEXTSTEP|a7 |Win95 FAT32 (LBA)|0c|BSDI fs|b7 |Win95 FAT16 (LBA)|0e|BSDI swap|b8 |Win95 Extended (LBA)|0f|Syrinx|c7 |Venix 80286|40|CP/M|db |Novell|51|DOS access|e1 |PReP Boot|41|DOS R/O|e3 |GNU HURD|63|DOS secondary|f2 |Novell Netware 286|64|BBT|ff
pt_br: |Tipo de partição|Valor|Tipo de partição|Valor |Vazio|00|Novell Netware 386|65 |DOS FAT de 12 bits|01|PIC/IX|75 |XENIX raiz|02|MINIX antigo|80 |XENIX usr|03|Linux/MINUX|81 |DOS 16 bits <=32M|04|Linux swap|82 |Estendida|05|Linux native|83 |DOS 16 bits >=32|06|Estendida Linux|85 |OS/2 HPFS|07|Amoeba|93 |AIX|08|Amoeba BBT|94 |AIX inicializável|09|BSD/386|a5 |OS/2 gerenciador de inicialização|0a|OpenBSD|a6 |Win95 FAT32|0b|NEXTSTEP|a7 |Win95 FAT32 (LBA)|0c|BSDI fs|b7 |Win95 FAT16 (LBA)|0e|BSDI swap|b8 |Win95 estendida (LBA)|0f|Syrinx|c7 |Venix 80286|40|CP/M|db |Novell|51|Acesso DOS|e1 |Boot PReP|41|DOS R/O|e3 |GNU HURD|63|DOS secundário|f2 |Novell Netware 286|64|BBT|ff

source: Partitions Within Partitions - An Overview of Extended Partitions
ko: 파티션 안에 있는 파티션 - 확장 파티션 개요
pt_br: Partições dentro de partições - uma visão geral das partições estendidas

source: An extended partition is like a disk drive in its own right - it has its own partition table which points to one or more partitions (now called _logical partitions_, as opposed to the four _primary partitions_) contained entirely within the extended partition itself. xref:figu-partitions-extended[Disk Drive With Extended Partition], shows a disk drive with one primary partition and one extended partition containing two logical partitions (along with some unpartitioned free space).
pt_br: Uma partição estendida é como uma unidade de disco por si só – ela tem sua própria tabela de partição que aponta para uma ou mais partições (agora chamadas de _partições lógicas_, ao contrário das quatro _partições primárias_) contidas inteiramente na própria partição estendida. xref:figu-partitions-extended[Unidade de disco com partição estendida], mostra uma unidade de disco com uma partição primária e uma partição estendida contendo duas partições lógicas (junto com algum espaço livre não particionado).

source: Disk Drive With Extended Partition
ko: 확장된 파티션이 있는 디스크 드라이브
pt_br: Unidade de disco com partição estendida

source: Image of a disk drive with an extended partition.
ko: 확장된 파티션이 있는 디스크 드라이브의 이미지.
pt_br: Imagem de uma unidade de disco com uma partição estendida.

source: As this figure implies, there is a difference between primary and logical partitions - there can only be four primary partitions, but there is no fixed limit to the number of logical partitions that can exist. However, due to the way in which partitions are accessed in Linux, no more than 12 logical partitions should be defined on a single disk drive.
pt_br: Como esta figura indica, há uma diferença entre partições primárias e lógicas – pode haver apenas quatro partições primárias, mas não há um limite fixo para o número de partições lógicas que podem existir. No entanto, devido à maneira como as partições são acessadas no Linux, não mais do que 12 partições lógicas devem ser definidas em uma única unidade de disco.

source: GUID Partition Table (GPT)
ko: GUID 파티션 표 (GPT)
pt_br: Tabela de Partição GUID (GPT)

source: GUID Partition Table (*GPT*) is a newer partitioning scheme based on using Globally Unique Identifiers (*GUID*). *GPT* was developed to cope with limitations of the *MBR* partition table, especially with the limited maximum addressable storage space of a disk. Unlike *MBR*, which is unable to address storage space larger than 2.2 terabytes, *GPT* can be used with hard disks larger than this; the maximum addressable disk size is 2.2 zettabytes. In addition, *GPT* by default supports creating up to 128 primary partitions. This number could be extended by allocating more space to the partition table.
pt_br: A Tabela de Partição GUID, ou GUID Partition Table (* GPT *), é um esquema de particionamento mais recente baseado no uso de identificadores globais exclusivos (*GUID*). *GPT* foi desenvolvido para lidar com as limitações da tabela de partição *MBR*, especialmente com o espaço de armazenamento máximo endereçável limitado de um disco. Ao contrário do *MBR*, que não consegue lidar com espaço de armazenamento maior que 2,2 terabytes, o *GPT* pode ser usado com discos rígidos maiores do que isso; o tamanho máximo do disco endereçável é 2,2 zetabytes. Além disso, *GPT* por padrão oferece suporte à criação de até 128 partições primárias. Esse número pode ser estendido com a alocação de mais espaço para a tabela de partição.

source: *GPT* disks use logical block addressing (LBA) and the partition layout is as follows:
ko: *GPT* 디스크는 논리 블록 주소(LBA)를 사용하고 파티션 배열은 다음과 같습니다:
pt_br: Os discos *GPT* usam endereçamento de bloco lógico (LBA) e o layout da partição é o seguinte:

source: The _primary *GPT* header_ begins on the second logical block (*LBA* 1) of the device. The header contains the disk GUID, the location of the primary partition table, the location of the secondary GPT header, and CRC32 checksums of itself and the primary partition table. It also specifies the number of partition entries of the table.
pt_br: O _cabeçalho primário do *GPT*_ começa no segundo bloco lógico (*LBA* 1) do dispositivo. O cabeçalho contém o GUID do disco, a localização da tabela de partição primária, a localização do cabeçalho GPT secundário e somas de verificação CRC32 de si mesmo e a tabela de partição primária. Ele também especifica o número de entradas de partição da tabela.

source: The _primary *GPT* table_ includes, by default, 128 partition entries, each with an entry size 128 bytes, its partition type GUID and unique partition GUID.
ko: 기본 GPT 테이블에는 기본적으로 각각 항목 크기가 128 바이트인 파티션 항목 128개, 이와 같은 파티션 유형 GUID와 고유 파티션 GUID가 포함됩니다.
pt_br: A _tabela primária do *GPT*_ inclui, por padrão, 128 entradas de partição, cada uma com um tamanho de entrada de 128 bytes, seu tipo de partição GUID e GUID de partição exclusivo.

source: The _secondary *GPT* table_ is identical to the primary *GPT* table. It is used mainly as a backup table for recovery in case the primary partition table is corrupted.
ko: 보조(secondary) *GPT* 테이블은 기본(primary) *GPT* 테이블과 동일합니다. 이는 기본 파티션 테이블이 망가진 경우에 복구를 위한 복구(백업) 테이블처럼 주로 사용됩니다.
pt_br: A _tabela secundária do *GPT*_ é idêntica à tabela primária. É usada principalmente como uma tabela de backup para recuperação, caso a tabela de partição primária esteja corrompida.
