Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/appendixes/Disk_Partitions.po
Languages: ko, pt_br

source: The _secondary *GPT* header_ is located on the last logical sector of the disk and it can be used to recover *GPT* information in case the primary header is corrupted. It contains the disk GUID, the location of the secondary partition table and the primary *GPT* header, CRC32 checksums of itself and the secondary partition table, and the number of possible partition entries.
pt_br: O _cabeçalho secundário do *GPT*_ está localizado no último setor lógico do disco e pode ser usado para recuperar informações do *GPT* caso o cabeçalho primário esteja corrompido. Ele contém o GUID do disco, a localização da tabela de partição secundária e o cabeçalho *GPT* primário, somas de verificação CRC32 de si mesmo e a tabela de partição secundária e o número de entradas de partição possíveis.

source: There must be a BIOS boot partition for the boot loader to be installed successfully onto a disk that contains a GPT (GUID Partition Table). This includes disks initialized by [application]*Anaconda*. If the disk already contains a BIOS boot partition, it can be reused.
pt_br: Deve haver uma partição de inicialização do BIOS para que o carregador de inicialização seja instalado com êxito em um disco que contém GPT (Tabela de Partição GUID). Isso inclui discos inicializados pelo [application]*Anaconda*. Se o disco já contém uma partição de inicialização do BIOS, ele pode ser reutilizado.

source: Strategies for Disk Repartitioning
ko: 디스크 재-파티션을 위한 전략
pt_br: Estratégias para reparticionamento de disco

source: There are several different ways that a disk can be repartitioned. This section discusses the following possible approaches:
ko: 디스크는 재파티션 할 수 있는 몇 가지 다른 방법이 있습니다. 이 부분은 다음 가능한 접근을 토의합니다:
pt_br: Existem várias maneiras diferentes de reparticionar um disco. Esta seção discute as seguintes abordagens possíveis:

source: Unpartitioned free space is available
ko: 분할되지 않는 여유 공간을 사용 할 수 있습니다
pt_br: Espaço livre não particionado está disponível

source: An unused partition is available
ko: 사용되지 않는 파티션을 사용 할 수 있습니다
pt_br: Uma partição não utilizada está disponível

source: Free space in an actively used partition is available
ko: 동적으로 사용된 파티션에 있는 여유 공간을 사용 할 수 있습니다
pt_br: O espaço livre em uma partição usada ativamente está disponível

source: Note that this section discusses the aforementioned concepts only theoretically and it does not include any procedures showing how to perform disk repartitioning step-by-step. Such detailed information are beyond the scope of this document.
pt_br: Observe que esta seção discute os conceitos mencionados acima apenas teoricamente e não inclui nenhum procedimento que mostre como executar o reparticionamento de disco passo a passo. Essas informações detalhadas estão além do escopo deste documento.

source: Keep in mind that the following illustrations are simplified in the interest of clarity and do not reflect the exact partition layout that you encounter when actually installing {PRODUCT}.
pt_br: Tenha em mente que as ilustrações a seguir são simplificadas para fins de clareza e não refletem o layout de partição exato que você encontra ao instalar {PRODUCT}.

source: Using Unpartitioned Free Space
ko: 파티션 되어 있지 않은 여유 공간 사용하기
pt_br: Usando espaço livre não particionado

source: In this situation, the partitions already defined do not span the entire hard disk, leaving unallocated space that is not part of any defined partition. xref:figu-partitions-unused-space[Disk Drive with Unpartitioned Free Space], shows what this might look like.
pt_br: Nessa situação, as partições já definidas não ocupam todo o disco rígido, deixando espaço não alocado que não faz parte de nenhuma partição definida. xref:figu-partitions-unused-space[Unidade de disco com espaço livre não particionado], mostra como isso pode ser.

source: Disk Drive with Unpartitioned Free Space
ko: 파티션 되어 있지 않은 여유 공간을 갖는 디스크 드라이브
pt_br: Unidade de disco com espaço livre não particionado

source: Image of a disk drive with unpartitioned free space
ko: 파티션 되어 있지 않는 여유 공간을 갖는 디스크 드라이브의 이미지
pt_br: Imagem de uma unidade de disco com espaço livre não particionado

source: In the above example, `1` represents an undefined partition with unallocated space and `2` represents a defined partition with allocated space.
ko: 위의 예제에서, '1'은 할당되지 않은 공간에 정의되지 않은 파티션을 나타내고 '2'는 할당된 공간에 정의된 파티션을 나타냅니다.
pt_br: No exemplo acima, `1` representa uma partição indefinida com espaço não alocado e` 2` representa uma partição definida com espaço alocado.

source: An unused hard disk also falls into this category. The only difference is that *all* the space is not part of any defined partition.
ko: 사용하지 않는 하드 디스크도 또한 이런 종류에 속합니다. 단지 차이점은 *모든* 공간이 정의된 파티션의 일부가 아니라는 것입니다.
pt_br: Um disco rígido não utilizado também se enquadra nesta categoria. A única diferença é que *todo* o espaço não faz parte de nenhuma partição definida.

source: In any case, you can create the necessary partitions from the unused space. Unfortunately, this scenario, although very simple, is not very likely (unless you have just purchased a new disk just for {PRODUCT}). Most pre-installed operating systems are configured to take up all available space on a disk drive (see xref:sect-disk-partitions-active-partition[Using Free Space from an Active Partition]).
pt_br: Em qualquer caso, você pode criar as partições necessárias a partir do espaço não utilizado. Infelizmente, este cenário, embora muito simples, não é muito provável (a menos que você tenha acabado de adquirir um novo disco apenas para {PRODUCT}). A maioria dos sistemas operacionais pré-instalados são configurados para ocupar todo o espaço disponível em uma unidade de disco (consulte xref:sect-disk-partitions-active-partition[Usando espaço livre de uma partição ativa]).

source: Using Space from an Unused Partition
ko: 사용되지 않는 파티션에서 공간 사용하기
pt_br: Usando espaço de uma partição não usada

source: In this case, maybe you have one or more partitions that you do not use any longer. xref:figu-partitions-unused-partition[Disk Drive with an Unused Partition], illustrates such a situation.
ko: 이와 같은 경우에, 아마도 더 이상 사용하지 않는 하나 또는 그 이상의 파티션을 가지고 있습니다. xref:figu-partitions-unused-partition[사용하지 않는 파티션인 디스크 드라이브], 이와 같은 상태를 표시합니다.
pt_br: Nesse caso, talvez você tenha uma ou mais partições que não usa mais. xref:figu-partitions-unused-partition[Unidade de disco com uma partição não usada], ilustra tal situação.

source: Disk Drive with an Unused Partition
ko: 사용되지 않는 파티션을 갖는 디스크 드라이브
pt_br: Unidade de disco com uma partição não usada

source: Image of a disk drive with an unused partition
ko: 사용되지 않는 파티션을 갖는 디스크 드라이브의 이미지
pt_br: Imagem de uma unidade de disco com uma partição não usada

source: In the above example, `1` represents an unused partition and `2` represents reallocating an unused partition for Linux.
ko: 위의 예에서, `1`은 사용하지 않는 파티션을 나타내고 `2`는 리눅스에서 사용하지 않는 파티션을 재할당하는 것을 나타냅니다.
pt_br: No exemplo acima, `1` representa uma partição não usada e `2` representa a realocação de uma partição não usada para Linux.

source: In this situation, you can use the space allocated to the unused partition. You first must delete the partition and then create the appropriate Linux partition(s) in its place. You can delete the unused partition and manually create new partitions during the installation process.
pt_br: Nessa situação, você pode usar o espaço alocado para a partição não usada. Você deve primeiro deletar a partição e então criar a(s) partição(ões) Linux apropriada(s) em seu lugar. Você pode excluir a partição não usada e criar manualmente novas partições durante o processo de instalação.

source: Using Free Space from an Active Partition
ko: 동적인 파티션에서 여유 공간 사용하기
pt_br: Usando espaço livre de uma partição ativa

source: This is the most common situation. It is also, unfortunately, the hardest to handle. The main problem is that, even if you have enough free space, it is presently allocated to a partition that is already in use. If you purchased a computer with pre-installed software, the hard disk most likely has one massive partition holding the operating system and data.
pt_br: Esta é a situação mais comum. Infelizmente, também é o mais difícil de manusear. O principal problema é que, mesmo se você tiver espaço livre suficiente, ele está atualmente alocado para uma partição que já está em uso. Se você comprou um computador com software pré-instalado, o disco rígido provavelmente tem uma partição enorme contendo o sistema operacional e os dados.

source: Aside from adding a new hard drive to your system, you have two choices:
ko: 새로운 하드 드라이브를 당신의 시스템에 추가하는 측면에서, 당신은 다음 두 가지 선택을 갖고 있습니다:
pt_br: Além de adicionar um novo disco rígido ao sistema, você tem duas opções:

source: *Destructive Repartitioning*
ko: *파괴적인 재-파티션닝*
pt_br: *Reparticionamento destrutivo*

source: In this case, the single large partition is deleted and several smaller ones are created instead. Any data held in the original partition is destroyed. This means that making a complete backup is necessary. It is highly recommended to make two backups, use verification (if available in your backup software), and try to read data from the backup *before* deleting the partition.
pt_br: Nesse caso, a única partição grande é excluída e várias outras menores são criadas. Todos os dados contidos na partição original são destruídos. Isso significa que é necessário fazer um backup completo. É altamente recomendável fazer dois backups, usar a verificação (se disponível em seu software de backup) e tentar ler os dados do backup *antes* de excluir a partição.

source: If an operating system was installed on that partition, it must be reinstalled if you want to use that system as well. Be aware that some computers sold with pre-installed operating systems may not include the installation media to reinstall the original operating system. You should check whether this applies to your system is *before* you destroy your original partition and its operating system installation.
pt_br: Se um sistema operacional foi instalado nessa partição, ele deve ser reinstalado se você quiser usar esse sistema também. Esteja ciente de que alguns computadores vendidos com sistemas operacionais pré-instalados podem não incluir a mídia de instalação para reinstalar o sistema operacional original. Você deve verificar se isso se aplica ao seu sistema é *antes* de destruir a partição original e a instalação do sistema operacional.

source: After creating a smaller partition for your existing operating system, you can reinstall software, restore your data, and start the installation. xref:figu-partitions-destructive-repartitioning[Disk Drive Being Destructively Repartitioned] shows this being done.
pt_br: Depois de criar uma partição menor para o sistema operacional existente, você pode reinstalar o software, restaurar seus dados e iniciar a instalação. xref:figu-partitions-destructive-repartitioning[Unidade de disco sendo repartida de forma destrutiva] mostra isso sendo feito.

source: Disk Drive Being Destructively Repartitioned
ko: 파괴적으로 재-파티션 되어 있는 디스크 드라이브
pt_br: Unidade de disco sendo repartida de forma destrutiva

source: Image of a disk drive being destructively repartitioned
ko: 파괴적으로 재-파티션 되어 있는 디스크 드라이브의 이미지
pt_br: Imagem de uma unidade de disco sendo reparticionada de forma destrutiva

source: In the above example, `1` represents before and `2` represents after.
ko: 위의 예에서, `1`은 이전을 나타내고 `2`는 이후를 나타냅니다.
pt_br: No exemplo acima, `1` representa antes e `2` representa depois.

source: Any data previously present in the original partition is lost.
ko: 원래 파티션에 나타나는 이전의 모든 자료가 손실됩니다.
pt_br: Todos os dados anteriormente presentes na partição original são perdidos.

source: *Non-Destructive Repartitioning*
ko: *비-파괴적인 재-파티션닝*
pt_br: *Reparticionamento não destrutivo*

source: With non-destructive repartitioning you execute a program that makes a big partition smaller without losing any of the files stored in that partition. This method is usually reliable, but can be very time-consuming on large drives.
pt_br: Com o reparticionamento não destrutivo, você executa um programa que reduz o tamanho de uma partição grande sem perder nenhum dos arquivos armazenados nessa partição. Esse método geralmente é confiável, mas pode consumir muito tempo em unidades grandes.

source: While the process of non-destructive repartitioning is rather straightforward, there are three steps involved:
ko: 비-파괴적으로 다시 파티션을 처리 할 때에는 다소 간단하지만, 다음 세가지 단계가 포함됩니다:
pt_br: Embora o processo de reparticionamento não destrutivo seja bastante direto, há três etapas envolvidas:

source: Compress and backup existing data
ko: 기존 자료 압축과 백업
pt_br: Compactar e fazer backup dos dados existentes

source: Resize the existing partition
ko: 기존 파티션 크기를 조정합니다
pt_br: Redimensionar a partição existente

source: Create new partition(s)
ko: 새로운 파티션 생성
pt_br: Criar nova(s) partição(ões)

source: Each step is described further in more detail.
ko: 각 단계에 대해서 더 자세히 설명합니다.
pt_br: Cada etapa é descrita mais detalhadamente.

source: Compress Existing Data
ko: 기존 자료를 압축합니다
pt_br: Compactar dados existentes

source: Disk Drive Being Compressed
ko: 압축되는 디스크 드라이브
pt_br: Unidade de disco sendo compactada

source: Image of a disk drive being compressed
ko: 압축되어진 디스크 드라이브의 이미지
pt_br: Imagem de uma unidade de disco sendo compactada

source: This step is crucial. Without it, the location of the data could prevent the partition from being resized to the extent desired. Note also that, for one reason or another, some data cannot be moved. If this is the case (and it severely restricts the size of your new partition(s)), you may be forced to destructively repartition your disk.
pt_br: Esta etapa é crucial. Sem ela, a localização dos dados pode impedir que a partição seja redimensionada para a extensão desejada. Observe também que, por um motivo ou outro, alguns dados não podem ser movidos. Se for este o caso (e isso restringe severamente o tamanho de sua(s) nova(s) partição(ões)), você pode ser forçado a reparticionar seu disco de forma destrutiva.

source: Resize the Existing Partition
ko: 기존 파티션 크기를 조정합니다
pt_br: Redimensionar a partição existente

source: xref:figu-partitions-resize-existing[Disk Drive with Partition Resized] shows the actual resizing process. While the actual result of the resizing operation varies depending on the software used, in most cases the newly freed space is used to create an unformatted partition of the same type as the original partition.
pt_br: xref:figu-partitions-resize-existing[Unidade de disco com partição redimensionada] mostra o processo real de redimensionamento. Embora o resultado real da operação de redimensionamento varie dependendo do software usado, na maioria dos casos, o espaço recém-liberado é usado para criar uma partição não formatada do mesmo tipo da partição original.

source: Disk Drive with Partition Resized
ko: 파티션 크기 조정되어 있는 디스크 드라이브
pt_br: Unidade de disco com partição redimensionada

source: Image of a disk drive with a resized partition
ko: 크기가 조정되어 있는 파티션을 갖고 있는 디스크 드라이브의 이미지
pt_br: Imagem de uma unidade de disco com uma partição redimensionada

source: It is important to understand what the resizing software you use does with the newly freed space, so that you can take the appropriate steps. In the case illustrated here, it would be best to delete the new DOS partition and create the appropriate Linux partition(s).
pt_br: É importante entender o que o software de redimensionamento que você usa faz com o espaço recém-liberado, para que você possa executar as etapas apropriadas. No caso ilustrado aqui, seria melhor excluir a nova partição DOS e criar a(s) partição(ões) Linux apropriada(s).

source: As the previous step implied, it may or may not be necessary to create new partitions. However, unless your resizing software is Linux-aware, it is likely that you must delete the partition that was created during the resizing process. xref:figu-partitions-final-configuration[Disk Drive with Final Partition Configuration], shows this being done.
pt_br: Como a etapa anterior sugeriu, pode ou não ser necessário criar novas partições. No entanto, a menos que seu software de redimensionamento seja compatível com o Linux, é provável que você precise excluir a partição que foi criada durante o processo de redimensionamento. xref:figu-partitions-final-configuration[Unidade de disco com configuração de partição final], mostra que isso está sendo feito.

source: Disk Drive with Final Partition Configuration
ko: 최종 파티션 구성을 갖고 있는 디스크 드라이브
pt_br: Unidade de disco com configuração de partição final

source: Image of a disk drive with final partition configuration
ko: 최종 파티션 구성을 갖고 있는 디스크 드라이브의 이미지
pt_br: Imagem de uma unidade de disco com configuração de partição final

source: Partition Naming Schemes and Mount Points
ko: 파티션 이름 체계와 적재 지점
pt_br: Esquemas de nomenclatura de partição e pontos de montagem

source: Partition Naming Scheme
ko: 파티션 이름 체계
pt_br: Esquema de nomenclatura de partição

source: Linux uses a naming scheme that is file-based, with file names in the form of `/dev/pass:attributes[{blank}]_xxyN_pass:attributes[{blank}]`.
ko: 리눅스는 `/dev/pass:attributes[{blank}]_xxyN_pass:attributes[{blank}]`의 형태로 파일 이름을 갖는 파일-기반형 이름 체계를 사용합니다.
pt_br: O Linux usa um esquema de nomenclatura baseado em arquivo, com nomes de arquivo na forma de `/dev/pass:attributes[{blank}]_xxyN_pass:attributes[{blank}]`.

source: Device and partition names consist of the following:
ko: 장치 및 파티션은 다음으로 구성됩니다:
pt_br: Os nomes do dispositivo e partição consistem no seguinte:

source: This is the name of the directory in which all device files reside. Because partitions reside on hard disks, and hard disks are devices, the files representing all possible partitions reside in `/dev/`.
ko: 이는 모든 장치 파일이 존재하는 것과 같은 디렉토리 명칭입니다.. 왜냐하면 파티션은 하드 디스크에 위치하고, 그리고 하드 디스크는 '/dev/'에 위치하는 모든 사용 가능한 파티션을 대표하는 파일 장치입니다.
pt_br: Este é o nome do diretório no qual residem todos os arquivos do dispositivo. Como as partições residem em discos rígidos, e discos rígidos são dispositivos, os arquivos que representam todas as partições possíveis residem em `/dev/`.

source: The first two letters of the partition name indicate the type of device on which the partition resides, usually `sd`.
ko: 파티션 이름의 처음 두 글자는 통상적으로 `sd`로 파티션이 상주하는 것 같은 장치 유형으로 나타냅니다.
pt_br: As primeiras duas letras do nome da partição indicam o tipo de dispositivo no qual a partição reside, geralmente `sd`.

source: This letter indicates which device the partition is on. For example, `/dev/sda` for the first hard disk, `/dev/sdb` for the second, and so on.
ko: 이 문자는 파티션이 있는 장치를 표시합니다. 예를 들면, 첫 번째 하드 디스크는 `/dev/sda`, 두 번째는 `/dev/sdb` 등과 같습니다.
pt_br: Esta letra indica em qual dispositivo a partição está. Por exemplo, `/dev/sda` para o primeiro disco rígido, `/dev/sdb` para o segundo e assim por diante.

source: The final number denotes the partition. The first four (primary or extended) partitions are numbered `1` through `4`. Logical partitions start at `5`. So, for example, `/dev/sda3` is the third primary or extended partition on the first hard disk, and `/dev/sdb6` is the second logical partition on the second hard disk.
pt_br: O número final denota a partição. As primeiras quatro partições (primárias ou estendidas) são numeradas de `1` a `4`. As partições lógicas começam em `5`. Assim, por exemplo, `/dev/sda3` é a terceira partição primária ou estendida no primeiro disco rígido, e `/dev/sdb6` é a segunda partição lógica no segundo disco rígido.

source: Even if your system can identify and refer to all types of disk partitions, it might not be able to *read* the file system and therefore access stored data on every partition type. However, in many cases, it is possible to successfully access data on a partition dedicated to another operating system.
pt_br: Mesmo que seu sistema possa identificar e referir-se a todos os tipos de partições de disco, ele pode não ser capaz de *ler* o sistema de arquivos e, portanto, acessar os dados armazenados em cada tipo de partição. No entanto, em muitos casos, é possível acessar com êxito os dados em uma partição dedicada a outro sistema operacional.

source: Disk Partitions and Mount Points
ko: 디스크 파티션과 적재 지점
pt_br: Partições de disco e pontos de montagem

source: Each partition is used to form part of the storage necessary to support a single set of files and directories. This is done by associating a partition with a directory through a process known as _mounting_. Mounting a partition makes its storage available starting at the specified directory (known as a _mount point_).
pt_br: Cada partição é usada para fazer parte do armazenamento necessário para suportar um único conjunto de arquivos e diretórios. Isso é feito associando uma partição a um diretório por meio de um processo conhecido como _montagem_ ou, em inglês, _mounting_. A montagem de uma partição torna seu armazenamento disponível a partir do diretório especificado (conhecido como _ponto de montagem_).

source: For example, if partition `/dev/sda5` is mounted on `/usr/`, that would mean that all files and directories under `/usr/` physically reside on `/dev/sda5`. So the file `/usr/share/doc/FAQ/txt/Linux-FAQ` would be stored on `/dev/sda5`, while the file `/etc/gdm/custom.conf` would not.
pt_br: Por exemplo, se a partição `/dev/sda5` está montada em `/usr/`, isso significa que todos os arquivos e diretórios em `/usr/` residem fisicamente em `/dev/sda5`. Portanto, o arquivo `/usr/share/doc/FAQ/txt/Linux-FAQ` seria armazenado em `/dev/sda5`, enquanto o arquivo `/etc/gdm/custom.conf` não.

source: Continuing the example, it is also possible that one or more directories below `/usr/` would be mount points for other partitions. For instance, a partition (say, `/dev/sda7`) could be mounted on `/usr/local/`, meaning that `/usr/local/man/whatis` would then reside on `/dev/sda7` rather than `/dev/sda5`.
pt_br: Continuando o exemplo, também é possível que um ou mais diretórios abaixo de `/usr/` sejam pontos de montagem para outras partições. Por exemplo, uma partição (digamos, `/dev/sda7`) poderia ser montada em `/usr/local/`, o que significa que `/usr/local/man/whatis` residiria então em `/dev/sda7` do que `/dev/sda5`.

source: How Many Partitions?
ko: 파티션은 몇 개인가요?
pt_br: Quantas partições?

source: At this point in the process of preparing to install {PRODUCT}, you should give some consideration to the number and size of the partitions to be used by your new operating system. However, there is no one right answer to this question. It depends on your needs and requirements.
pt_br: Neste ponto do processo de preparação para instalar o {PRODUCT}, você deve levar em consideração o número e o tamanho das partições a serem usadas por seu novo sistema operacional. No entanto, não há uma resposta certa para essa pergunta. Depende de suas necessidades e requisitos.

source: See xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for more information about the recommended partitioning scheme.
ko: 권장 파티션 구성표에 대한 더 많은 정보는 xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[권장 파티션 구성표]를 참고하세요.
pt_br: Veja xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de particionamento recomendado] para mais informações sobre o esquema de particionamento recomendado.

source: This appendix is not necessarily applicable to architectures other than AMD64, Intel{nbsp}64, and Arm SystemReady. However, the general concepts mentioned here may apply.
ko: 이 부록은 AMD64, Intel{nbsp}64와 암(arm) 시스템레디라기 보다 구조에 필수적으로 적용되는 것은 아닙니다. 하지만, 이 곳에 언급된 일반적인 개념은 적용 될 수 있습니다.

source: partitions/unused-drive.png
ko: 파티션/unused-drive.png
