Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/appendixes/Disk_Partitions.po
Languages: ko, pt_br

source: To store data on a disk drive, it is necessary to _format_ the disk drive first. Formatting (usually known as "`making a _file system_pass:attributes[{blank}]`") writes information to the drive, creating order out of the empty space in an unformatted drive.
ko: 디스크 드라이브에서 자료를 저장하려면, 우선 디스크 드라이브를 초기화(format)가 필요합니다. 초기화는 (일반적으로 "`file system_pass:attributes[{blank}] 만들기`"로 알려졌으며) 드라이브에 정보를 작성하며, 초기화 되지 않은 드라이브에 빈 공간에서 순서를 만듭니다.

source: Whether the partition is "`active`"
ko: 파티션이 "활성화"인지 여부

source: In case four partitions are insufficient for your needs, you can use _extended partitions_ to create up additional partitions. You do this by setting the type of a partition to "`Extended`".
ko: 4개의 파티션인 경우는 자신의 목적에 따라 불충분하면, 추가 파티션을 생성하기 위하여 확장 파티션을 사용 할 수 있습니다. 당신은 파티션 유형을 "`확장 파티션`"으로 설정 할 수 있습니다.

source: To preserve backward compatibility with MBR disks, the first sector (*LBA* 0) of *GPT* is reserved for *MBR* data and it is called "`protective MBR`".
ko: MBR 디스크와의 역-호환성을 유지하기 위해, *GPT*의 첫 번째 섹터(*LBA* 0)는 *MBR* 자료용으로 예약되어 있고 "`보호 MBR`"이라고 칭합니다.
