Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/_partials/install/CustomSpoke.po
Languages: es

source: Manual Partitioning
es: Particionado manual

source: The `Manual Partitioning` screen allows you to create a storage configuration for your {PRODUCT} system manually, giving you a greater control over your system's storage.
es: La pantalla `Particionado Manual` le permite crear una configuración de almacenamiento para su sistema {PRODUCT} manualmente, dándole un gran control sobre el almacenamiento del sistema.

source: In most other installers for both Linux and other operating systems, disk partitioning usually takes a "bottom-up" approach. In these installers, you first create underlying devices such as LVM physical volumes, then you create a layout such as LVM on top of them, then you create file systems on top of logical volumes, and the last step is usually assigning a mount point to each volume as needed.
es: En la mayoría de otros instaladores tanto de Linux como de otros sistemas operativos, la partición del disco suele adoptar un enfoque de "abajo hacia arriba". En estos instaladores, primero crea dispositivos subyacentes como volúmenes físicos LVM, luego crea un diseño como LVM encima de ellos, después usted crea los sistemas de archivos encima de los volúmenes lógicos y como último paso normalmente se asigna un punto de montaje para cada volumen según sea necesario.

source: [application]*Anaconda* uses an opposite approach. First, you create all separate mount points you need, and everything needed to create them (creating a volume group, logical volumes inside it, and physical volumes where the volume group will reside) is performed automatically. You can then adjust the automatic settings as you require.
es: [application]*Anaconda* usa un enfoque opuesto. Primero, usted crea los puntos de montaje separados que necesite y todo lo necesario para crearlos (creando un grupo volumen, volúmenes lógicos dentro y volúmenes físicos donde residirá el grupo volumen) se lleva a cabo automáticamente. A continuación puede ajustar la configuración automática según sus necesidades.

source: The Manual Partitioning screen. At this point
es: Pantalla de Particionado Manual. En este punto

source: Click the `+` button to add a mount point. In the dialog window that opens, choose a mount point such as `/` or `/home`, and the desired capacity for the mount point (such as `10GB` or `500MB`). Note that specifying the mount point is mandatory, but you do not have to specify the capacity at this point; this is useful when adding a mount point which you want to make larger than the current available space permits. Then, click `Add mount point` to add it to the list using the default settings, which means it will be created as a logical volume, and a new volume group will be created for it unless one already exists.
es: Pulse el botón `+` para añadir un punto de montaje. En la ventana de diálogo que se abre elija un punto de montaje como `/` u `/home`y la capacidad deseada para el punto de montaje (como `10GB` o `500MB`). Advierta que el especificar el punto de montaje es obligatorio, pero no tiene que especificar la capacidad en este punto; esto es útil cuando añada un punto de montaje que desea hacer más grande que los espacios permitidos actualmente disponibles. Después, pulse `Añadir punto de montaje` para añadirlo a la lista usando los ajustes predeterminados, lo que significa que será creado como un volumen lógico y se creará también un nuevo grupo de volumen para él a no ser que ya exista uno.

source: Then, select the newly created mount point in the list on the left side. A set of controls will display on the right side of the screen, allowing you to change its mount point, the device on which it will physically reside, its capacity, file system, etc. When you change any settings, press `Update Settings` on the bottom right. This will save the adjusted configuration; you can now create another mount point, or select a different existing one and adjust its settings as well.
es: Después, seleccione el punto de montaje recientemente creado en la lista del lado izquierdo. Se mostrarán una serie de controles en el lado derecho de la pantalla que le permite cambiar su punto de montaje, el dispositivo en el que reside físicamente, su capacidad, sistema de archivos, etc. Cuando cambie cualquier ajuste, pulse `Actualizar Ajustes` abajo a la derecha. Esto guardará la configuración ajustada; usted puede ahora crear otro punto de montaje o seleccionar otro de los existentes y establecer sus ajustes también.

source: To remove a mount point, select it in the list and press the `-` button below.
es: Para quitar un punto de montaje, selecciónelo de la lista y pulse el botón `-` de abajo.

source: Below the list of existing mount points are two fields, showing you how much free space is left on your storage devices and how much total space they have.
es: Debajo de la lista de puntos de montaje existentes hay dos campos, mostrando cuánto espacio libre queda en sus dispositivos de almacenamiento y cuanto espacio total tienen.

source: Click the `pass:attributes[{blank}]_X_ storage devices selected` to view a summary of currently selected storage devices; this may help you with orientation in more complicated storage schemas. Devices displayed here are the ones you have selected in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]. If you want to add or remove any storage devices from your configuration, return to that screen and change your selection.
es: Puse `pass:attributes[{blank}]_X_ dispositivos de almacenamiento seleccionados` para ver un resumen de los dispositivos de almacenamiento actualmente seleccionados; esto puede ayudar a orientarse en esquemas de almacenamiento más complicados. Los dispositivos que se muestran aquí son los que ha seleccionado en xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Destino de la Instalación]. Si desea añadir o borrar cualquier dispositivo de almacenamiento de su configuración, vuelva a esta pantalla y cambie la selección.

source: You can press the `Reset All` button in the bottom right corner at any time to reset the storage configuration to the state it was in when you last opened the `Manual Partitioning` screen. This means that if you modify the storage configuration, leave the screen, and then come back, the Reset button will reset the configuration back to the already modified state, discarding only the changes you have made recently, not all changes to the storage configuration since you booted the installer.
es: Usted puede pulsar el botón You can press the `Reset Todo` en la esquina inferior derecha en cualquier momento para reajustar la configuración de almacenamiento al estado en el que estaba cuando usted abrió por última vez la pantalla `Particionado Manual`. Esto significa que si usted modifica la configuración de almacenamiento, deja la pantalla y después vuelve, el botón Reset reseteará la configuración de vuelta al estado ya modificado, descartando solo los cambios que haya hecho recientemente, no a todos los cambios de la configuración de almacenamiento que haya hecho desde que arrancó el instalador.

source: To discard all changes, and to also detect any new drives which have not been detected when the installer started (usually when you attached a new drive after you started), press the button marked by a circular arrow in the set of controls below the list of mount points on the left side of the screen. In the dialog window that opens, press `Rescan Disks` and wait until the scanning process completes. Then, press `OK` to return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]; all detected disks including any new ones will be displayed in the `Local Standard Disks` section.
es: Para descartar todos los cambios y también para detectar cualquier nuevo dispositivo que no haya sido detectado cuando inició el instalador (normalmente cuando engancha un nuevo dispositivo después de iniciar), pulse el botón marcado con una flecha circular en el conjunto de controles debajo de la lista de puntos de montaje en el lado izquierdo de la pantalla. En la ventana de diálogo que se abre, pulse `Rescanear Discos` ay espere hasta que el proceso de escaneo se complete. Después pulse `OK` para volver a xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Destino de la Instalación]; todos los discos detectados, incluyendo los nuevos se visualizarán en la sección `Discos Estándar Locales`.

source: Rescan Disks
es: Volver a Buscar Discos

source: The Rescan Disks dialog
es: El diálogo Volver a Buscar Discos

source: After you finish configuring your system storage, press `Done` in the top left corner to save the configuration and return to the `Installation Summary` screen. At this point, the installer will check if your storage configuration is valid. If an error was detected, a message will be displayed at the bottom of the screen. Click the message to open a dialog window explaining what kind of error has been detected (for example, you put `/boot` on a Btrfs subvolume, or you did not create a BIOS Boot partition when your system requires one).
es: Después de que termine de configurar el almacenamiento del sistema, pulse `Hecho` en la esquina superior izquierda para guardar la configuración y volver a la pantalla `Resumen de la Instalación`. En este punto, el instalador comprobará si su configuración de almacenamiento es válida. Si detecta un error se mostrará un mensaje en la parte inferior de la pantalla. Pulse el mensaje para abrir una ventana de diálogo explicando que clase de error ha sido detectado (por ejemplo, ha puesto `/boot` en un subvolumen Btrfs o no ha creado una partición BIOS Boot cuando su sistema requiere una).

source: If such a message is displayed, go back and fix any issues found by the installer; otherwise you will not be able to proceed with the installation. You can also press `Done` again to return to the `Installation Summary` anyway, but a storage configuration error will prevent you from starting the actual installation process.
es: Si se muestra este mensaje, vuelva atrás y corrija las cuestiones encontradas por el instalador; de otro modo no será capaz de continuar con la instalación. Puede presionar `Hecho` otra vez para volver a `Resumen de la Instalación` de todos modos, pero un error de configuración de almacenamiento evitará que inicie el actual proceso de instalación.
