Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/_partials/install/CustomSpoke_AddPhysical.po
Languages: tr

source: Creating Standard Partitions
tr: Standart Bölümler Oluşturma

source: _Standard partitions_ are the most common type of partition, with the widest support across operating systems. For example, Microsoft Windows uses exclusively physical partitions and can not natively work with LVM or Btrfs. Most {PRODUCT} partitioning setups will also require at least one standard partition for the `/boot` directory, and possibly also another standard partition with the BIOS Boot or EFI System file system to store the boot loader.
tr: _Standart bölümler_, işletim sistemleri arasında en geniş desteğe sahip en yaygın bölüm türüdür. Örneğin, Microsoft Windows yalnızca fiziksel bölümler kullanır ve LVM veya Btrfs ile doğrudan çalışamaz. Çoğu {PRODUCT} bölümlendirme kurulumu, ayrıca `/boot` dizini için en az bir standart bölüm ve önyükleyiciyi depolamak için BIOS Önyükleme veya EFI Sistem dosya sistemine sahip muhtemelen başka bir standart bölüm gerektirir.

source: See xref:appendixes/Disk_Partitions.adoc#appe-disk-partitions-overview[An Introduction to Disk Partitions] for additional information about the concepts behind physical partitions.
tr: Fiziksel bölümlerin arkasındaki kavramlar hakkında ek bilgi için, xref:appendixes/Disk_Partitions.adoc#appe-disk-partitions-overview[Disk Bölümlerine Giriş] bölümüne bakın.

source: Create Standard Partition
tr: Standart Bölüm Oluştur

source: The Manual Partitioning screen
tr: Elle Bölümlendirme ekranı

source: Follow the procedure below to create mount points on standard physical partitions:
tr: Standart fiziksel bölümlerde bağlama noktaları oluşturmak için aşağıdaki adımları izleyin:

source: Click the `+` button at the bottom of the list showing existing mount points. A new dialog window will open.
tr: Mevcut bağlama noktalarını gösteren listenin altındaki `+` düğmesine tıklayın. Yeni bir iletişim penceresi açılacaktır.

source: In the new dialog window, specify a mount point for which you want to create a separate mount point - for example, `/`. Optionally, specify a size for the partition using standard units such as MB or GB (for example, `50GB`). Then, click `Add mount point` to add the mount point and return to the main partitioning screen.
tr: Yeni iletişim penceresinde, ayrı bir bağlama noktası oluşturmak istediğiniz bir bağlama noktası belirtin - örneğin, `/`. İsteğe bağlı olarak, MB veya GB gibi standart birimler kullanarak bölüm için bir boyut belirtin (örneğin, `50GB`). Ardından, bağlama noktasını eklemek ve ana bölümlendirme ekranına geri dönmek için `Bağlama noktası ekle` düğmesine tıklayın.

source: When creating a swap partition, specify the mount point as `swap`. For a BIOS Boot partition, use `biosboot`. For an EFI System Partition, use `/boot/efi`.
tr: Bir takas bölümü oluştururken, bağlama noktasını `swap` olarak belirtin. BIOS Önyükleme bölümü için `biosboot` kullanın. EFI Sistem Bölümü için `/boot/efi` kullanın.

source: For information about these partition types, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
tr: Bu bölüm türleri hakkında bilgi için, xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın.

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume. Select the newly created mount point in the left pane to configure it further, and convert it to a physical partition by changing the `Device Type` option to `Standard Partition`. Then, click `Update Settings` in the bottom right corner of the screen.
tr: Bu adımdan sonra bağlama noktası öntanımlı ayarlar kullanılarak, yani bir LVM mantıksal birimi olarak oluşturulur. Daha fazla yapılandırmak için sol bölmede yeni oluşturulan bağlama noktasını seçin ve `Aygıt Türü` seçeneğini `Standart Bölüm` olarak değiştirerek fiziksel bir bölüme dönüştürün. Ardından, ekranın sağ alt köşesindeki `Ayarları Güncelle` düğmesine tıklayın.

source: In the `Device(s)` section on the right side of the screen, you can see that the partition has been assigned to one or more hard drives. Click the `Modify` button to configure on which drive this partition will be created.
tr: Ekranın sağ tarafındaki `Aygıt(lar)` bölümünde, bölümün bir veya daha fazla sabit diske atandığını görebilirsiniz. Bu bölümün hangi diskte oluşturulacağını yapılandırmak için `Değiştir` düğmesine tıklayın.

source: In the `Configure Mount Point` dialog, you can specify which physical devices (disks) this volume *may* reside on. You can select one or more disks which will be used to hold this volume by holding down kbd:[Ctrl] and clicking each disk in the list. If you select multiple disks here, [application]*Anaconda* will determine where exactly the partition should be created based on how you configured the rest of the installation. If you want to make sure that this partition is placed on a specific hard drive, select only that drive and unselect all others.
tr: `Bağlama Noktası Yapılandır` iletişim kutusunda, bu birimin hangi fiziksel aygıtlarda (diskler) *bulunabileceğini* belirleyebilirsiniz. Bu birimi tutmak için kullanılacak bir veya daha fazla diski kbd:[Ctrl] tuşuna basılı tutup listedeki her diski tıklayarak seçebilirsiniz. Burada birden fazla disk seçerseniz, [application]*Anaconda* kurulumun geri kalanını nasıl yapılandırdığınıza bağlı olarak bölümün tam olarak nerede oluşturulması gerektiğini belirleyecektir. Bu bölümün belirli bir sabit diskte oluşturulduğundan emin olmak istiyorsanız, yalnızca o diski seçin ve diğerlerinin seçimini kaldırın.

source: After you finish configuring the partition's location, click `Save` to return to the main `Manual Partitioning` screen.
tr: Bölümün konumunu yapılandırmayı bitirdikten sonra, ana `Elle Bölümlendirme` ekranına dönmek için `Kaydet` düğmesine tıklayın.

source: Configure other settings specific to the partition - its `Mount Point`, `Desired Capacity`, and `File System`. Press `Update Settings` to apply any changes to the configuration.
tr: Bölüme özgü diğer ayarları yapılandırın - `Bağlama Noktası`, `İstenen Kapasite` ve `Dosya Sistemi`. Değişiklikleri yapılandırmaya uygulamak için `Ayarları Güncelle` düğmesine basın.

source: Repeat this procedure for any additional standard partitions you want to create.
tr: Oluşturmak istediğiniz ek standart bölümler için bu adımları tekrarlayın.
