Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/_partials/install/FilterSpoke_AddiSCSI.po
Languages: es, id

source: Add iSCSI Target
es: Añadir Objetivo iSCSI
id: Menambahkan Target iSCSI

source: To use iSCSI storage devices, the installer must be able to discover them as _iSCSI targets_ and be able to create an iSCSI session to access them. Both of these steps may require a user name and password for _Challenge Handshake Authentication Protocol_ (CHAP) authentication.
es: Para usar dispositivos de almacenamiento iSCSI, el instalador debe ser capaz de descubrirlos como _objetivos iSCSI_ y ser capaz de crear una sesuñib iSCSI para acceder a ellos. Ambos pasos pueden requerir un nombre de usuario y contraseña para autenticiación _Challenge Handshake Authentication Protocol_ (CHAP).
id: Untuk menggunakan perangkat penyimpanan iSCSI, penginstal harus dapat menemukannya sebagai _target iSCSI_ dan dapat membuat sesi iSCSI untuk mengaksesnya. Kedua langkah ini mungkin memerlukan nama pengguna dan sandi untuk otentikasi _Challenge Handshake Authentication Protocol_ (CHAP).

source: You can also configure an iSCSI target to authenticate the iSCSI initiator on the system to which the target is attached (_reverse CHAP_), both for discovery and for the session. Used together, CHAP and reverse CHAP are called _mutual CHAP_ or _two-way CHAP_. Mutual CHAP provides the greatest level of security for iSCSI connections, particularly if the user name and password are different for CHAP authentication and reverse CHAP authentication.
es: También puede configurar un objetivo iSCSI para autenticar el iniciador iSCSI sobre el sistema al que están enganchado el objetivo (_CHAP reverso_), tanto para el descubrimiento como para la sesión. Usados juntos, CHAP y CHAP reverso se denominan _CHAP mutuo_ o _CHAP de dos caminos_. CHAP mutuo suministra el mayor nivel de seguridad para conexiones iSCSI, particularmente si el nombre de usuario y la contraseña son diferentes para la autenticación CHAP y para la autenticación CHAP reversa.
id: Anda juga dapat mengonfigurasi target iSCSI untuk mengautentikasi inisiator iSCSI pada sistem tempat target dipasang (_reverse CHAP_), baik untuk pencarian maupun untuk sesi. Digunakan bersama, CHAP dan reverse CHAP disebut _mutual CHAP_ atau _two-way CHAP_. Mutual CHAP memberikan tingkat keamanan tertinggi untuk koneksi iSCSI, terutama jika nama pengguna dan kata sandi berbeda untuk otentikasi CHAP dan otentikasi CHAP terbalik.

source: Follow the procedure below to add an iSCSI storage target to your system.
es: Siga el procedimiento de abajo para añadir un objetivo de almacenamiento iSCSI a su sistema.
id: Ikuti prosedur di bawah untuk menambahkan target penyimpanan iSCSI ke sistem Anda.

source: Click the `Add iSCSI Target` button in the bottom right corner of the xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks] screen. A new dialog window titled `Add iSCSI Storage Target` will open.
es: Pulse el botón `Añadir Objetivo iSCSI` en la esquina inferior derecha de la pantalla xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Destino de la Instalación - Discos Especializados y en Red]. Se abrirá una nueva ventana de diálogo titulada `Añadir Objetivo de Almacenamiento iSCSI`.
id: Klik tombol `Tambah Target iSCSI` di pojok kanan bawah dari layar xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Tujuan Instalasi - Disk Khusus & Jaringan]. Sebuah jendela dialog baru berjudul `Tambah Target Penyimpanan iSCSI` akan terbuka.

source: Enter the IP address of the iSCSI target in the `Target IP Address` field.
es: Introduzca la dirección IP del objetivo iSCSI en el campo `Dirección IP Objetivo`.
id: Masukkan alamat IP dari target iSCSI dalam ruas `Alamat IP Target`.

source: Provide a name in the `iSCSI Initiator Name` field for the iSCSI initiator in _iSCSI Qualified Name_ (IQN) format. A valid IQN entry contains:
es: Suministre un nombre en el campo `Nombre de Iniciador iSCSI` para el iniciador iSCSI en el formato _Nombre Cualificado iSCSI_ (IQN). Una entrada válida IQN contiene:
id: Berikan suatu nama dalam ruas `Nama Inisiator iSCSI` bagi inisiator iSCSI dalam format _iSCSI Qualified Name_ (IQN). Suatu entri IQN yang valid mengandung:

source: The string `iqn.` (including the period).
es: La cadena `iqn.` (incluyendo el punto).
id: String `iqn.` (termasuk titik).

source: A date code specifying the year and month in which your organization's Internet domain or subdomain name was registered, represented as four digits for the year, a dash, and two digits for the month, followed by a period. For example, represent September 2010 as `2010-09.`
es: Un código de fecha especificando el año y el mes en el que el nombre de dominio o subdominio en Internet de su organización fue registrado, representado como cuatro dígitos para el año, un guión y dos dígitos para el mes seguido de un punto. Por ejemplo, representa Septiembre de 2010 cómo `2010-09.`
id: Kode tanggal yang menentukan tahun dan bulan di mana domain Internet atau nama subdomain organisasi Anda didaftarkan, direpresentasikan sebagai empat digit untuk tahun, satu tanda hubung, dan dua digit untuk bulan, diikuti dengan titik. Misalnya, wakili September 2010 sebagai `2010-09.`

source: Your organization's Internet domain or subdomain name, presented in *reverse* order (with the top-level domain first). For example, represent the subdomain storage.example.com as `com.example.storage`.
es: El nombre de dominio o subdominio de Internet de su organización, presentado en orden *inverso* order (cn el dominio de nivel más alto primero). Por ejemplo, representa el subdominio storage.example.com como `com.example.storage`.
id: Nama domain atau subdomain Internet organisasi Anda, disajikan dalam urutan *terbalik* (dengan domain level teratas lebih dulu). Misalnya, gambarkan subdomain storage.example.com sebagai `com.example.storage`.

source: A colon (`:`) followed by a string which uniquely identifies this particular iSCSI initiator within your domain or subdomain. For example, `:diskarrays-sn-a8675309`
es: Dos puntos (`:`) seguidos de una cadena que identifica inequívocamente este iniciador iSCSI concreto dentro de su dominio o subdominio. Por ejemplo, `:diskarrays-sn-a8675309`
id: Titik dua (`:`) diikuti dengan string yang secara unik mengidentifikasi inisiator iSCSI ini dalam domain atau subdomain Anda. Misalnya, `:diskarrays-sn-a8675309`

source: A complete IQN will therefore look as follows:
es: Un IQN completo parecerá por lo tanto como sigue:
id: Oleh karena itu, IQN lengkap akan terlihat sebagai berikut:

source: An example using the correct format is also displayed below the input field for reference.
es: También se muestra un ejemplo con el formato correcto debajo del campo de entrada como referencia.
id: Contoh menggunakan format yang benar juga ditampilkan di bawah kolom input untuk referensi.

source: Specify the type of authentication to use for iSCSI discovery using the `Discovery Authentication Type` drop-down menu. Depending on which type of authentication you selected, additional input fields (such as `CHAP Username` and `CHAP Password` may then become visible. Fill in your authentication credentials; these should be provided by your organization.
es: Especificar el tipo de autenticación a usar para el descubrimiento iSCSI usando el menú desplegable `Tipo de Autenticación de Descubrimiento`. Dependiendo del tipo de autenticación que seleccione, pueden llegar a ser visibles campos de entrada adicionales (como `Nombre de Usuario CHAP` y `Contraseña CHAP`. Complete sus credenciales de autenticación; estas serían suministradas por su organización.
id: Tentukan jenis otentikasi yang akan digunakan untuk penemuan iSCSI menggunakan menu tarik-turun `Jenis Otentikasi Pencarian`. Bergantung pada jenis otentikasi yang Anda pilih, bidang masukan tambahan (seperti `Nama Pengguna CHAP` dan `Kata Sandi CHAP` mungkin akan terlihat. Isi kredensial otentikasi Anda; ini harus disediakan oleh organisasi Anda.

source: Click the `Start Discovery` button. The installer will now attempt to discover an iSCSI target based on the information you provided, and if the target requires CHAP or reverse CHAP authentication, it will attempt to use the credentials you provided. This process may take some time (generally less than 30 seconds), depending on your network.
es: Pulse el botón `Comenzar Descubrimiento`. El instalador intentará ahora descubrir un objetivo iSCSI en base a la información que usted ha dado y si el objetivo requiere autenticación CHAP o CHAP inversa, intentará usar las credenciales que usted ha suministrado. Este proceso puede tomar algún tiempo (generalmente menos de 30 segundos), dependiendo de su red.
id: Klik tombol `Mulai Pencarian`. Pemasang sekarang akan mencoba menemukan target iSCSI berdasarkan informasi yang Anda berikan, dan jika target memerlukan otentikasi CHAP atau reverse CHAP, itu akan mencoba menggunakan kredensial yang Anda berikan. Proses ini mungkin memakan waktu (biasanya kurang dari 30 detik), tergantung pada jaringan Anda.

source: If the discovery was *not* successful, an error message will be displayed in the dialog window. This message will vary based on which part of the discovery failed. If the installer did not find the target you specified at all, you should check the IP address; if the problem is an authentication error, make sure you entered all CHAP and reverse CHAP credentials correctly and that you have access to the iSCSI target.
es: Si el descubrimiento *no* tiene éxito, se mostrará un mensaje de error en el cuadro de diálogo. Este mensaje variará dependiendo de en que parte del descubrimiento haya fallado. Si el instalador no ha encontrado el objetivo que usted ha especificado de ningún modo debería comprobar la dirección IP address; si el problema es un error de autenticación, asegúrese que ha introducido todas las credenciales CHAP y CHAP inversa correctamente y que tiene acceso al iSCSI objetivo.
id: Jika pencarian itu *tidak* berhasil, pesan kesalahan akan ditampilkan di jendela dialog. Pesan ini akan bervariasi berdasarkan bagian mana dari pencarian yang gagal. Jika penginstal tidak menemukan target yang Anda tentukan sama sekali, Anda harus memeriksa alamat IP; jika masalahnya adalah kesalahan otentikasi, pastikan Anda memasukkan semua kredensial CHAP dan reverse CHAP dengan benar dan Anda memiliki akses ke target iSCSI.

source: The `No nodes discovered` error message may also mean that all nodes on the address you specified are already configured. During discovery, [application]*Anaconda* ignores nodes which have already been added.
es: El mensaje de error `Sin nodos descubiertos` puede también significar que todos los nodos en la dirección que ha especificado están ya configurados. Durante el descubrimiento [application]*Anaconda* ignora los nodos que ya han sido añadidos.
id: Pesan kesalahan `Tidak ada simpul yang ditemukan` mungkin juga berarti bahwa semua simpul di alamat yang Anda tentukan sudah dikonfigurasi. Selama pencarian, [application]*Anaconda* mengabaikan simpul-simpul yang telah ditambahkan.

source: If the discovery was successful, you will see a list of all discovered nodes.
es: Si el descubrimiento tuvo éxito, verá una lista de todos los nodos descubiertos.
id: Jika pencarian berhasil, Anda akan melihat daftar semua simpul yang ditemukan.

source: Select one or more nodes you want to log in to by marking or unmarking the check box next to each node discovered on the target. Below the list, select again the type of authentication you want to use; you can also select the `Use the credentials from discovery` option if the CHAP/reverse CHAP user name and password you used to discover the target are also valid for logging in to it.
es: Seleccione uno o más de los nodos a los que desee acceder marcando o desmarcando las cajas de confirmación próximas a cada nodo descubierto sobre el objetivo. Debajo de la lista, seleccione otra vez el tipo de autenticación que desea usar; puede también seleccionar la opción `Usar las credenciales del descubrimiento` si el nombre de usuario y la contraseña CHAP/CHAP reverso que ha usado para descubrir el objetivo son también válidos para acceder a él.
id: Pilih satu atau lebih simpul yang ingin Anda masuki dengan menandai atau menghapus tanda kotak centang di sebelah setiap simpul yang ditemukan pada target. Di bawah daftar, pilih lagi jenis otentikasi yang ingin Anda gunakan; Anda juga dapat memilih opsi Ê»Gunakan kredensial dari pencarian` jika nama pengguna dan sandi CHAP/reverse CHAP yang Anda gunakan untuk menemukan target juga valid untuk masuk ke sana.

source: After selecting all nodes you want to use, click `Log In` to initiate an iSCSI session. [application]*Anaconda* will attempt to log in to all selected nodes. If the login process is succesful, the `Add iSCSI Storage Target` dialog will close, and all nodes you have configured will now be shown in the list of network disks in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks].
es: Después de seleccionar todos los nodos que desea usar, pulse `Acceder` para iniciar una sesión iSCSI. [application]*Anaconda* intentará acceder a todos los nodos seleccionados. Si el proceso de acceso tiene éxito, se cerrará el cuadro de diálogo `Añadir Objetivo de Almacenamiento iSCSI` y todos los nodos que haya configurado se mostrarán en la lista de discos en red en xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Destino de la Instalación - Discos Especializados y en Red].
id: Setelah memilih semua simpul yang ingin Anda gunakan, klik `Log Masuk` untuk memulai sesi iSCSI. [application]*Anaconda* akan mencoba masuk ke semua simpul yang dipilih. Jika proses log masuk berhasil, dialog `Tambahkan Target Penyimpanan iSCSI` akan ditutup, dan semua simpul yang telah Anda konfigurasikan sekarang akan ditampilkan dalam daftar disk jaringan di xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Tujuan Instalasi - Disk Khusus & Jaringan].

source: You can repeat this procedure to discover additional iSCSI targets, or to add more nodes from a previously configured target. However, note that once you click the `Start Discovery` button for the first time, you will not be able to change the `iSCSI Initiator Name`. If you made an error when configuring the initiator name, you must restart the installation.
es: Puede repetir este procedimiento para descubrir objetivos iSCSI adicionales o para añadir más nodos de objetivos previamente configurados. Sin embargo, advierta que una vez que ha pulsado el botón `Iniciar Descubrimiento` por primera vez, no será capaz de cambiar el `Nombre del Iniciador iSCSI`. Si tiene un error cuando configure el nombre del iniciados, debe reiniciar la instalación.
id: Anda dapat mengulangi prosedur ini untuk menemukan target iSCSI tambahan, atau untuk menambahkan lebih banyak simpul dari target yang dikonfigurasi sebelumnya. Namun demikian, perhatikan bahwa setelah Anda mengklik tombol `Mulai Pencarian` untuk pertama kalinya, Anda tidak akan dapat mengubah `Nama Inisiator iSCSI`. Jika Anda membuat kesalahan saat mengkonfigurasi nama inisiator, Anda harus memulai ulang penginstalan.
