Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/_partials/install/FilterSpoke.po
Languages: tr

source: Installation Destination - Specialized & Network Disks
tr: Kurulum Hedefi - Özelleştirilmiş ve Ağ Diskleri

source: This part of the `Installation Destination` screen allows you to configure non-local storage devices, namely iSCSI and FCoE storage. This section will mostly be useful to advanced users who have a need for networked disks. For instructions on setting up local hard drives, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination].
tr: `Kurulum Hedefi` ekranının bu kısmı, iSCSI ve FCoE depolama gibi yerel olmayan depolama aygıtlarını yapılandırmanıza olanak tanımaktadır. Bu bölüm çoğunlukla ağa bağlı disklere ihtiyaç duyan ileri düzey kullanıcılar için faydalı olacaktır. Yerel sabit disklerin kurulumuyla ilgili talimatlar için xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Kurulum Hedefi] bölümüne bakın.

source: This section only explains how to make existing network disks available inside the installer. It does not explain how to set up your network or a storage server, only how to connect to them.
tr: Bu bölümde sadece mevcut ağ disklerinin kurucu içerisinde nasıl kullanılabilir hale getirileceği açıklanmaktadır. Bu bölüm, ağınızı veya depolama sunucusunu nasıl kuracağınızı değil, sadece bunlara nasıl bağlanacağınızı açıklamaktadır.

source: Installation Destination - Network Storage Filters
tr: Kurulum Hedefi - Ağ Depolama Filtreleri

source: A list of currently configured network storage devices
tr: Yapılandırılmış ağ depolama aygıtlarının bir listesi

source: The screen contains a list of all currently available (discovered) network storage devices. When the screen is opened for the first time, the list will be empty in most cases because no network storage has been discovered - the installer makes no attempt at discovering this unless you configure network disks using a Kickstart file.
tr: Ekran, kullanılabilir tüm (keşfedilen) ağ depolama aygıtlarının bir listesini içermektedir. Ekran ilk kez açıldığında, ağ depolama alanı keşfedilmediği için liste çoğu durumda boş olacaktır - bir Kickstart dosyası kullanarak ağ disklerini yapılandırmazsanız kurucu bunu keşfetmeye çalışmaz.

source: To add one or more storage devices to the screen so you can search them and use them in the installation, click `Add iSCSI Target` or `Add FCoE SAN` in the bottom right corner of the screen, and follow the instructions in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination-add-iscsi[Add iSCSI Target] or xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination-add-fcoe[Add FCoE SAN], depending on which type of network storage you want to add.
tr: Aramak ve kurulumda kullanmak için ekrana bir veya daha fazla depolama aygıtı eklemek için, ekranın sağ alt köşesindeki `iSCSI Hedefi Ekle` veya `FCoE SAN Ekle` düğmesine tıklayın ve eklemek istediğiniz ağ depolama türüne bağlı olarak xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination-add-iscsi[iSCSI Hedefi Ekle] veya xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination-add-fcoe[FCoE SAN Ekle] bölümündeki talimatları izleyin.

source: Network storage devices successfully discovered and configured by the installer will then be displayed in the main list, along with identifying information such as `Name`, `WWID`, `Model` and `Target`. To sort the list by a specific column (for example `WWID`), click the column's heading.
tr: Kurucu tarafından başarıyla keşfedilen ve yapılandırılan ağ depolama aygıtları, `Ad`, `WWID`, `Model` ve `Hedef` gibi tanımlayıcı bilgilerle birlikte ana listede görüntülenecektir. Listeyi belirli bir sütuna (örneğin `WWID`) göre sıralamak için sütunun başlığına tıklayın.

source: On lower display resolutions, the list may be too wide to fit on the screen, and some of the columns or buttons may be hidden initially. Use the horizontal scroll bar at the bottom of the list to move your view and see all available table columns and controls.
tr: Düşük ekran çözünürlüklerinde, liste ekrana sığamayacak kadar geniş olabilir ve başlangıçta bazı sütun veya düğmeler gizlenebilir. Görünümünüzü taşımak ve kullanılabilir tüm tablo sütunlarını ve denetimleri görmek için listenin altındaki yatay kaydırma çubuğunu kullanın.

source: There are three tabs on the top of the list, which display different information:
tr: Listenin üstünde farklı bilgiler gösteren üç sekme vardır:

source: Search
tr: Ara

source: Displays all available devices, regardless of their type, and allows you to filter them either by their _World Wide Identifier_ (WWID) or by the port, target, or logical unit number (LUN) at which they are accessed.
tr: Türlerine bakılmaksızın kullanılabilir tüm aygıtları görüntüler ve bunları _Dünya Genelinde Tanımlayıcılarına_ (World Wide Identifier - WWID) veya erişildikleri bağlantı noktası, hedef veya mantıksal birim numarasına (Logical Unit Number - LUN) göre filtrelemenize olanak tanır.

source: Multipath Devices
tr: Çok Yollu Aygıtlar

source: Storage devices accessible through more than one path, such as through multiple SCSI controllers or Fiber Channel ports on the same system.
tr: Aynı sistemdeki birden fazla SCSI denetleyicisi veya Fiber Kanal bağlantı noktası gibi birden fazla yoldan erişilebilen depolama aygıtları.

source: The installation program only detects multipath storage devices with serial numbers that are 16 or 32 characters long.
tr: Kurulum programı, sadece 16 veya 32 karakter uzunluğunda seri numarasına sahip çok yollu depolama aygıtlarını algılamaktadır.

source: Other SAN Devices
tr: Diğer SAN Aygıtları

source: Devices available on a Storage Area Network (SAN).
tr: Bir Depolama Alan Ağında (Storage Area Network - SAN) bulunan cihazlar.

source: Depending on the tab you are currently in, you can filter the discovered devices by using the `Filter By` field. Some of the filtering options are automatically populated based on discovered devices (for example, if you select `Filter By:` `Vendor`, another drop-down menu will appear showing all vendors of all discovered devices). Other filters require your input (for example when filtering by WWID), and present you with a text input field instead of a drop-down menu.
tr: Üzerinde bulunduğunuz sekmeye bağlı olarak, `Filtreleme Ölçütü` alanını kullanarak keşfedilen aygıtları filtreleyebilirsiniz. Bazı filtreleme seçenekleri, keşfedilen aygıtlara göre otomatik olarak doldurulur (örneğin, `Filtreleme Ölçütü:` `Sağlayıcı` seçeneğini seçerseniz, keşfedilen tüm aygıtların tüm sağlayıcılarını gösteren başka bir açılır menü görünecektir). Diğer filtreler için (örneğin WWID ile filtreleme yaparken) sizden bir girdi beklenir ve açılır menü yerine size bir metin giriş alanı sunulur.

source: In the list (regardless of how it is filtered), each device is presented on a separate row, with a check box to its left. Mark the check box to make the device available during the installation process; this will cause this device (node) to be shown in the `Specialized & Network Disks` section in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]. There, you can select the disk as an installation target and proceed with either manual or automatic partitioning.
tr: Listede (nasıl filtrelendiğine bakılmaksızın), her aygıt sol tarafında bir onay kutusuyla birlikte ayrı bir satırda gösterilir. Kurulum işlemi sırasında aygıtı kullanılabilir hale getirmek için onay kutusunu işaretleyin; bu, bu aygıtın (düğüm) xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Kurulum Hedefindeki] `Özelleştirilmiş ve Ağ Diskleri` bölümünde gösterilmesini sağlayacaktır. Burada, diski bir kurulum hedefi olarak seçebilir ve elle veya otomatik bölümlendirme ile devam edebilirsiniz.

source: Devices that you select here are not automatically wiped by the installation process. Selecting a device on this screen does not, in itself, place data stored on the device at risk. Also note that any devices that you do not select here to form part of the installed system can be added to the system after installation by modifying the `/etc/fstab` file.
tr: Burada seçtiğiniz aygıtlar kurulum işlemi tarafından otomatik olarak silinmez. Bu ekranda bir aygıt seçilmesi, kendi başına, aygıtta depolanan verileri riske atmaz. Ayrıca, kurulu sistemin bir parçasını oluşturmak için burada seçmediğiniz tüm aygıtların kurulumdan sonra `/etc/fstab` dosyası değiştirilerek sisteme eklenebileceğini unutmayın.

source: When you have selected the storage devices to make available during installation, click `Done` to return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination].
tr: Kurulum sırasında kullanılabilir hale getirilecek depolama aygıtlarını seçtikten sonra, xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Kurulum Hedefine] dönmek için `Bitti` düğmesine tıklayın.
