Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/_partials/install/KeyboardSpoke.po
Languages: id

source: Keyboard Layout
id: Tata Letak Papan Ketik

source: The `Keyboard Layout` screen allows you to set up one or more keyboard layouts for your system and a way to switch between them. One keyboard layout is configured automatically based on your selection in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Welcome Screen and Language Selection], but you can change this layout and add additional ones before you begin the installation.
id: Layar `Tata Letak Papan Tik` memungkinkan Anda menyiapkan satu atau lebih tata letak papan tik untuk sistem Anda dan suatu cara untuk berpindah antar mereka. Satu tata letak papan tik dikonfigurasi secara otomatis berbasis pada pilihan Anda dalam xref:sect-installation-gui-welcome[Layar Selamat Datang dan Pemilihan Bahasa], tapi Anda dapat mengubah tata letak ini dan menambahkan yang lain sebelum Anda memulai instalasi.

source: Keyboard layouts are a separate setting from system languages, and these two settings can be mixed as you see fit.
id: Tata letak papan tik adalah suatu pengaturan terpisah dari bahasa sistem, dan dua pengaturan ini dapat dicampur sesuai kehendak Anda.

source: All settings configured in this screen will be available on the installed system, and they will also become immediately available inside the installer. You can use the keyboard icon in the top right corner of any screen, or the keyboard switch you configured in this screen, to cycle between your configured layouts.
id: Semua pengaturan yang dikonfigurasi dalam layar ini akan tersedia pada sistem yang diinstal, dan mereka juga akan seketika tersedia di dalam installer. Anda dapat memakai ikon papan tik di pojok kanan atas sebarang layar, atau saklar papan tik yang Anda konfigurasi dalam layar ini, untuk berputar antara tata letak yang Anda konfigurasi.

source: The keyboard layout configuration screen
id: Layar konfigurasi tata letak papan tik

source: The left half of the screen contains a window listing all currently configured layouts. The order in which the layouts are displayed is important - the same order will be used when switching between layouts, and the first listed layout will be the default on your system.
id: Separuh kiri layar berisi sebuah jendela dengan daftar semua tata letak yang saat ini terkonfigurasi. Urutan ditampilkannya tata letak penting - urutan yang sama akan dipakai ketika bertukar antar tata letak, dan tata letak pertama dalam daftar akan menjadi baku pada sistem Anda.

source: The text field on the right side of the screen can be used to test the currently selected layout.
id: Ruas teks di sisi kanan layar dapat dipakai untuk menguji tata letak yang saat ini dipilih.

source: You can click a layout in the list to highlight it. At the bottom of the list, there is a set of buttons:
id: Anda dapat mengklik suatu tata letak dalam daftar untuk menyorotnya. Di dasar daftar, ada sekumpulan tombol:

source: The `+` button adds a new layout. When you press this button, a new window opens with a list of all available layouts, grouped by language. You can find a layout by browsing the list, or you can use the search bar at the bottom of this window. When you find the layout you want to add, highlight it and press `Add`.
id: Tombol `+` menambah tata letak baru. Ketika Anda menekan tombol ini, suatu jendela terbuka dengan daftar dari semua tata letak yang tersedia, dikelompokkan menurut bahasa. Anda dapat menemukan suatu tata letak dengan meramban daftar, atau Anda dapat memakai bilah pencarian di dasar jendela ini. Ketika Anda menemukan tata letak yang ingin Anda tambahkan, sorot itu dan tekan `Tambah`.

source: The `-` button removes the currently highlighted layout.
id: Tombol `-` menghapus tata letak yang saat ini disorot.

source: The up and down buttons can be used to move the highlighted layout up or down in the list.
id: Tombol naik dan turun dapat dipakai untuk memindah tata letak yang disorot naik atau turun dalam daftar.

source: The keyboard button opens a new window which offers a visual representation of the highlighted layout.
id: Tombol papan tik membuka suatu jendela baru yang menawarkan representasi visual dari tata letak yang disorot.

source: If you use a layout that cannot accept Latin characters, such as `Russian`, you are advised to also add the `English (United States)` layout and configure a keyboard combination to switch between the two layouts. If you only select a layout without Latin characters, you may be unable to enter a valid `root` password and user credentials later in the installation process. This may prevent you from completing the installation.
id: Bila Anda memakai suatu tata letak yang tidak bisa menerima karakter Latin, seperti misalnya `Rusia`, Anda disarankan untuk juga menambahkan tata letak `Inggris (Amerika Serikat)` dan mengonfigurasi suatu kombinasi papan tik untuk berpindah antar kedua tata letak. Bila Anda hanya memilih suatu tata letak tanpa karakter Latin, Anda mungkin tidak bisa memasukkan kata sandi `root` dan kredensial pengguna nanti dalam proses instalasi. Ini bisa menghalangi Anda menyelesaikan instalasi.

source: You can also optionally configure a keyboard switch which can be used to cycle between available layouts. To do so, click the `Options` button on the right side of the screen. The `Layout Switching Options` dialog will open, allowing you to configure one or more keys or key combinations for switching. Select one or more key combinations using the check boxes next to them, and click `OK` to confirm your selection.
id: Anda juga dapat mengonfigur suatu pemindahan papan tik yang dapat dipakai untuk memutar antar tata letak yang tersedia. Untuk melakukannya, klik tombol `Opsi` pada sisi kanan layar. Dialog `Opsi Pergantian Tata Letak` akan membuka, mengizinkan Anda mengonfigur satu atau lebih tombol atau kombinasi tombol untuk berpindah. Pilih satu atau lebih kombinasi tombol memakai kotak-kotak centang di sebelah mereka, dan klik `OK` untuk mengonfirmasi pilihan Anda.

source: After you finish configuring keyboard layouts and switches, click `Done` in the top left corner to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
id: Setelah Anda selesai mengonfigurasi tata letak papan tik dan pergantian, klik `Selesai` di pojok kiri atas untuk kembali ke xrefsect-installation-gui-installation-summary[Ringkasan Instalasi].
