Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/_partials/install/SoftwareSpoke.po
Languages: id, pt_br, tr

source: Software Selection
id: Pemilihan Perangkat Lunak
pt_br: Seleção de Programas
tr: Yazılım Seçimi

source: The `Software Selection` screen allows you to choose a _Base Environment_ and _Add-ons_. These options control which software packages will be installed on your system during the installation process.
id: Layar `Pemilihan Perangkat Lunak` memungkinkan Anda memilih suatu _Lingkungan Dasar_ dan _Add-on_. Opsi-opsi ini mengendalikan paket-paket perangkat lunak mana yang akan dipasang pada sistem Anda selama proses instalasi.
pt_br: A tela `Seleção de Programas` permite que você escolha um _Ambiente Base_ e _Complementos_. Essas opções controlam quais pacotes de software serão instalados em seu sistema durante o processo de instalação.
tr: `Yazılım Seçimi` ekranı bir _Temel Ortam_ ve _Eklentiler_ seçmenize olanak tanımaktadır. Bu seçenekler, kurulum işlemi sırasında sisteminize hangi yazılım paketlerinin kurulacağını belirlemektedir.

source: This screen is only available if xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-source[Installation Source] is properly configured and only after the installer has downloaded package metadata from the source.
id: Layar ini hanya tersedia bila xref:sect-installation-gui-installation-source[Sumber Instalasi] dikonfigurasi secara benar dan hanya setelah installer mengunduh metadata paket dari sumber.
pt_br: Esta tela está disponível apenas se xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-source[Fonte de instalação] está configurada corretamente e somente após o instalador ter baixado os metadados do pacote da fonte.
tr: Bu ekran sadece xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-source[Kurulum Kaynağı] düzgün yapılandırılmışsa ve kurucu paket üst verilerini kaynaktan indirdikten sonra kullanılabilir.

source: It is not possible to select specific packages during a manual installation. You can only select pre-defined environments and add-ons. If you need to control exactly which packages are installed, you must use a Kickstart file and define the packages in the [command]#%packages# section. See xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart] for information about Kickstart installations.
id: Tidak mungkin untuk memilih paket spesifik selama suatu instalasi manual. Anda hanya dapat memilih lingkungan terpradefinisi dan add-on. Bila Anda perlu mengendalikan secara eksak paket mana yang dipasang, Anda mesti memakai suatu berkas Kickstart dan mendefinisikan paket-paket dalam bagian [command]#%packages#. Lihat xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Mengotomatiskan Instalasi dengan Kickstart] untuk informasi tentang instalasi Kickstart.
pt_br: Não é possível selecionar pacotes específicos durante uma instalação manual. Você só pode selecionar ambientes e complementos predefinidos. Se você precisa controlar exatamente quais pacotes são instalados, você deve usar um arquivo Kickstart e definir os pacotes na seção [command]#%packages#. Veja xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automatizando a Instalação com o Kickstart] para informações sobre as instalações do Kickstart.
tr: Elle kurulum sırasında belirli paketleri seçmek mümkün değildir. Sadece önceden tanımlanmış ortamları ve eklentileri seçebilirsiniz. Tam olarak hangi paketlerin kurulacağını belirleme ihtiyacı duyuyorsanız, bir Kickstart dosyası kullanmalı ve [command]#%packages# bölümünde paketleri tanımlamalısınız. Kickstart kurulumları hakkında bilgi için xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Kickstart ile Kurulumu Otomatikleştirme] bölümüne bakın.

source: The availability of environments and add-ons depends on your installation source. By default, the selection depends on the installation media you used to start the installation; Fedora{nbsp}Server installation image will have different environments and add-ons available for selection than, for example, the Fedora{nbsp}Cloud image. You can change this by configuring a different installation source containing different environments.
id: Ketersediaan lingkungan dan add-on bergantung pada sumber instalasi. Bakunya, pilihan bergantung pada media instalasi yang Anda pakai untuk memulai instalasi; image instalasi Fedora{nbsp}Server akan punya lingkungan dan add-on yang dapat dipilih yang berbeda dengan, misalnya, image Fedora{nbsp}Cloud. Anda dapat mengubah ini dengan mengonfigurasi suatu sumber instalasi lain yang memuat lingkungan yang berbeda.
pt_br: A disponibilidade de ambientes e complementos depende de sua fonte de instalação. Por padrão, a seleção depende da mídia de instalação usada para iniciar a instalação; A imagem de instalação do Fedora{nbsp}Server terá diferentes ambientes e complementos disponíveis para seleção do que, por exemplo, a imagem da Fedora{nbsp}Cloud. Você pode alterar isso configurando uma fonte de instalação diferente contendo ambientes diferentes.
tr: Ortamların ve eklentilerin kullanılabilir olma durumu kurulum kaynağınıza bağlıdır. Öntanımlı olarak, seçimler kurulumu başlatmak için kullandığınız kurulum ortamına bağlıdır; Fedora{nbsp}Server kurulum kalıbında, örneğin Fedora{nbsp}Cloud kalıbından farklı ortamlar ve eklentiler kullanılabilir olacaktır. Farklı ortamlar içeren farklı bir kurulum kaynağı yapılandırarak bunu değiştirebilirsiniz.

source: The Software Selection screen. On the left side
id: Layar Pemilihan Perangkat Lunak. Pada sisi kiri
pt_br: A tela Seleção de programas. No lado esquerdo
tr: Yazılım Seçimi ekranı. Sol tarafta

source: To configure your software selection, first choose an environment on the left side of the screen. Only one environment can be chosen, even if more are available. Then, on the right side of the screen, select one or more add-ons which you want to install by marking the check boxes next to each add-on.
id: Untuk mengonfigurasi pemilihan perangkat lunak Anda, pertama pilih suatu lingkungan pada sisi kiri layar. Hanya satu lingkungan yang dapat dipilih, bahkan bila tersedia lebih. Lalu, pada sisi kanan layar, pilih satu atau lebih add-on yang ingin Anda pasang dengan menandai kotak centang di sebelah setiap add-on.
pt_br: Para configurar sua seleção de programas, primeiro escolha um ambiente no lado esquerdo da tela. Apenas um ambiente pode ser escolhido, mesmo se houver mais disponíveis. Em seguida, no lado direito da tela, selecione um ou mais complementos que deseja instalar marcando as caixas de seleção ao lado de cada complemento.
tr: Yazılım seçiminizi yapılandırmak için önce ekranın sol tarafında bir ortam seçin. Daha fazlası kullanılabilir olsa bile sadece bir ortam seçilebilir. Ardından, ekranın sağ tarafında, her eklentinin yanındaki onay kutularını işaretleyerek yüklemek istediğiniz bir veya daha fazla eklentiyi seçin.

source: The list of add-ons is divided into two parts by a horizontal line. Add-ons above this line are defined as part of your chosen environment; if you select a different environment, the add-ons available here will change. The add-ons displayed below the separator are not specific to your chosen environment.
id: Daftar add-on dibagi menjadi dua oleh sebuah garis horisontal. Add-on di atas garis ini didefinisikan sebagai bagian dari lingkungan yang Anda pilih; bila Anda memilih suatu lingkungan yang berbeda, add-on yang tersedia di sini akan berubah. Add-on yang ditampilkan di bawah pemisah tidak spesifik ke lingkungan yang Anda pilih.
pt_br: A lista de complementos é dividida em duas partes por uma linha horizontal. Os complementos acima desta linha são definidos como parte do ambiente escolhido; se você selecionar um ambiente diferente, os complementos disponíveis aqui serão alterados. Os complementos exibidos abaixo do separador não são específicos para o ambiente escolhido.
tr: Eklentilerin listesi yatay bir çizgi ile iki bölüme ayrılmıştır. Bu çizginin üzerindeki eklentiler seçtiğiniz ortamın bir parçası olarak tanımlanır; farklı bir ortam seçerseniz, burada bulunan eklentiler değişecektir. Ayırıcının altında görüntülenen eklentiler seçtiğiniz ortama özgü değildir.

source: Environments and add-ons are defined using a `comps.xml` file in your installation source (for example, in the `repodata/` directory on the full Fedora{nbsp}Server installation DVD). Review this file to see exactly which packages will be installed as part of a certain environment or add-on. For more information about the `comps.xml` file, see xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-packages[%packages (required) - Package Selection].
id: Lingkungan dan add-on didefinisikan memakai sebuah berkas `comps.xml` dalam sumber instalasi Anda (misalnya, dalam direktori `repodata/` pada DVD instalasi Fedora{nbsp}Server penuh. Tinjau berkas ini untuk melihat secara eksak paket mana yang akan dipasang sebagai bagian dari lingkungan atau add-on tertentu. Untuk informasi lebih jauh tentang berkas `comps.xml`, lihat xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-packages[%packages (diperlukan) - Pemilihan Paket].
pt_br: Ambientes e complementos são definidos usando um arquivo `comps.xml` em sua fonte de instalação (por exemplo, no diretório`repodata/` no DVD de instalação do Fedora{nbsp}Server completo). Revise este arquivo para ver exatamente quais pacotes serão instalados como parte de um determinado ambiente ou complemento. Para obter mais informações sobre o arquivo `comps.xml` , consulte xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-packages[%packages (obrigatório) - Seleção de Pacotes].
tr: Ortamlar ve eklentiler, kurulum kaynağınızdaki bir `comps.xml` dosyası kullanılarak tanımlanır (örneğin, tam Fedora{nbsp}Server kurulum DVD'sindeki `repodata/` dizininde). Belirli bir ortamın veya eklentinin bir parçası olarak hangi paketlerin yükleneceğini tam olarak görmek için bu dosyayı inceleyin. `comps.xml` dosyası hakkında daha fazla bilgi için, xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-packages[%packages (gerekli) - Paket Seçimi] bölümüne bakın.

source: After you finish configuring your software selection, click `Done` in the top left corner to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
id: Setelah Anda selesai mengonfigurasi tata letak papan tik dan pergantian, klik `Selesai` di pojok kiri atas untuk kembali ke xref:sect-installation-gui-installation-summary[Ringkasan Instalasi].
pt_br: Uma vez que você tenha finalizado a configuração da seleção de programas, clique em `Pronto` no canto superior esquerdo para retornar ao xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Resumo da Instalação].
tr: Yazılım seçiminizi yapılandırmayı tamamladıktan sonra, xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Kurulum Özetine] dönmek için sol üst köşedeki `Bitti` düğmesine tıklayın.
