Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/_partials/install/StorageSpoke_BootLoader.po
Languages: id, tr

source: Boot Loader Installation
id: Instalasi Boot Loader
tr: Önyükleyici Kurulumu

source: {PRODUCT} uses [application]*GRUB2* (GRand Unified Bootloader version 2) as its boot loader. The boot loader is the first program that runs when the computer starts and is responsible for loading and transferring control to an operating system. [application]*GRUB2* can boot any compatible operating system (including Microsoft Windows) and can also use chain loading to transfer control to other boot loaders for unsupported operating systems.
id: {PRODUCT} memakai [application]*GRUB2* (GRand Unified Bootloader version 2) sebagai boot loader. Boot loader adalah program pertama yang berjalan ketika komputer mulai dan bertanggung jawab memuat dan memindah kendali ke suatu sistem operasi. [application]*GRUB2* bisa mem-boot sebarang sistem operasi yang kompatibel (termasuk Microsoft Windows) dan juga dapat memakai chain loading untuk menransfer kendali ke boot loader lain untuk sistem operasi yang tidak didukung.
tr: {PRODUCT}, önyükleyici olarak [application]*GRUB2* (GRand Unified Bootloader sürüm 2) kullanmaktadır. Önyükleyici, bilgisayar başlatıldığında çalışan ilk programdır ve bir işletim sistemini yüklemek ve denetimi ona aktarmaktan sorumludur. [application]*GRUB2* herhangi bir uyumlu işletim sistemini (Microsoft Windows dahil) önyükleyebilir ve ayrıca desteklenmeyen işletim sistemleri için denetimi diğer önyükleyicilere aktarmak üzere zincirleme yüklemeyi kullanabilir.

source: Installing [application]*GRUB2* may overwrite your existing boot loader.
id: Memasang [application]*GRUB2* mungkin menimpa boot loader Anda yang ada.
tr: [application]*GRUB2* kurulması, mevcut önyükleyicinizin üzerine yazabilir.

source: If you have other operating systems already installed, the {PRODUCT} installer will attempt to automatically detect and configure the boot loader to start them. You can manually configure any additional operating systems after you finish the installation, if they are not detected properly. For instructions on editing [application]*GRUB2* configuration, see the [citetitle]_{PRODUCT} System{nbsp}Administrator's{nbsp}Guide_, available at link:++http://docs.fedoraproject.org/++[]
tr: Kurulu başka işletim sistemleriniz varsa, {PRODUCT} kurucusu otomatik olarak algılamaya ve önyükleyiciyi onları başlatması için yapılandırmaya çalışacaktır. Düzgün algılanmazlarsa, kurulumu bitirdikten sonra ek işletim sistemlerini elle yapılandırabilirsiniz. [application]*GRUB2* yapılandırmasını düzenleme talimatları için, link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Sistem{nbsp}Yöneticisi{nbsp}Kılavuzuna_ bakın.

source: If you are installing Fedora system with more than one disk, you may want to manually specify where the bootloader should be installed. Click the `Full disk summary and bootloader` link at the bottom of the `Installation Destination` screen. The `Selected Disks` dialog will appear. The bootloader will be installed on the device of your choice, or on a UEFI system, the `EFI system partition` will be created on that device during guided partitioning.
id: Bila Anda memasang sistem Fedora dengan lebih dari satu disk, Anda mungkin ingin menyatakan secara manual di mana boot loader mesti dipasang. Klik tautan `Ringkasan disk lengkap dan boot loader` di dasar layar `Tujuan Instalasi`. Dialog `Disk yang Dipilih` akan muncul. Boot loader akan dipasang pada peranti pilihan Anda, atau pada suatu sistem UEFI, `Partisi sistem EFI` akan dibuat pada peranti itu selama pemartisian terpandu.
tr: Birden fazla disk içeren Fedora sistemi kuruyorsanız, önyükleyicinin nereye kurulacağını elle belirtmek isteyebilirsiniz. `Kurulum Hedefi` ekranının altındaki `Tam disk özeti ve önyükleyici` bağlantısını tıklayın. `Seçilen Diskler` iletişim penceresi görünecektir. Önyükleyici, seçtiğiniz aygıta kurulacaktır, veya bir UEFI sisteminde, rehberli bölümlendirme sırasında `EFI sistem bölümü` o aygıt üzerinde oluşturulacaktır.

source: Boot Device Selection
id: Pemilihan Perangkat Boot
tr: Önyükleme Aygıtı Seçimi

source: The Selected Disks dialog
id: Dialog Disk yang Dipilih
tr: Seçilen Diskler iletişim penceresi

source: In the `Boot` column, a "tick" icon marks one of the devices as the intended boot device. To change the boot device, select a device from the list and click the `Set as Boot Device` button to install the boot loader there instead. Only one device can be set as the boot device.
id: Dalam kolom `Boot`, ikon "centang" menandai satu dari perangkat yang dimaksudkan sebagai peranti boot. Untuk mengubah peranti boot, pilih suatu peranti dari daftar dan klik tombol `Jadikan Peranti Boot` untuk memasang boot loader di sana sebagai pengganti. Hanya satu peranti yang dapat ditata sebagai peranti boot.
tr: `Önyükleyici` sütununda, "onay" simgesi aygıtlardan birini istenen önyükleme aygıtı olarak işaretler. Önyükleme aygıtını değiştirmek için listeden bir aygıt seçin ve önyükleyiciyi oraya yüklemek için `Önyükleme Aygıtı Olarak Belirle` düğmesine tıklayın. Önyükleme aygıtı olarak sadece bir aygıt belirlenebilir.

source: To decline installation of a new boot loader, select the device currently marked for boot and click the `Do not install bootloader` button. This will remove the tick and ensure [application]*GRUB2* is not installed on any device.
id: Untuk menolak instalasi boot loader baru, pilih peranti yang saat ini ditandai untuk boot dan klik tombol `Jangan pasang boot loader`. Ini akan menghapus centang dan memastikan [application]*GRUB2* tidak dipasang di perangkat mana pun.
tr: Yeni bir önyükleyicinin kurulumunu reddetmek için, önyükleme için işaretlenmiş olan aygıtı seçin ve `Önyükleyici kurma` düğmesine tıklayın. Bu onay işaretini kaldıracak ve [application]*GRUB2*'nin herhangi bir cihaza kurulmamasını sağlayacaktır.

source: If you choose not to install a boot loader for any reason, you will not be able to boot the system directly, and you must use another boot method, such as a stand-alone commercial boot loader application. Use this option only if you are sure you have another way to boot your system.
id: Bila Anda memilih untuk tidak memasang boot loader dengan alasan apa pun, Anda tidak akan bisa boot ke sistem secara langsung, dan Anda mesti memakai metoda boot lain, seperti misalnya aplikasi boot loader komersial yang berdiri sendiri. Gunakan opsi ini hanya bila Anda yakin bahwa Anda punya cara lain untuk mem-boot sistem Anda.
tr: Herhangi bir nedenle bir önyükleyici kurmamayı seçerseniz, sistemi doğrudan önyükleyemezsiniz ve tek başına bir ticari önyükleyici uygulaması gibi başka bir önyükleme yöntemi kullanmanız gerekmektedir. Bu seçeneği sadece sisteminizi önyüklemenin başka bir yolunun olduğundan eminseniz kullanın.

source: The boot loader may also require a special partition to be created, depending on whether your system uses BIOS or UEFI firmware and also depending on whether the boot drive has a _GUID Partition Table_ (GPT) or a `Master Boot Record` (MBR, also known as msdos) label. If you use automatic partitioning, the installer will create this partition if needed. For details, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
id: Boot loader mungkin juga perlu dibuatkan suatu partisi khusus, bergantung pada apakah sistem Anda memakai BIOS atau firmware UEFI dan juga bergantung pada apakah drive boot memiliki _GUID Partition Table_ (GPT) atau `Master Boot Record` (MBR, juga dikenal sebagai msdos). Bila Anda memakai pemartisian otomatis, installer akan membuat partisi ini bila diperlukan. Untuk rincian, lihat xref:sect-installation-gui-manual-partitioning-recommended[Skema Pemartisian yang Disarankan].
tr: Önyükleyici, sisteminizin BIOS veya UEFI ürün yazılımı kullanıp kullanmadığına ve ayrıca önyükleme sürücüsünün _GUID Bölümleme Tablosu_ (GPT) veya `Ana Önyükleme Kaydı` (MBR, msdos olarak da bilinir) olmasına bağlı olarak özel bir bölümün oluşturulmasını gerektirebilir. Otomatik bölümlendirme kullanıyorsanız, kurucu gerekirse bu bölümü oluşturacaktır. Ayrıntılar için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın.
