Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/_partials/install/SummaryHub.po
Languages: id, tr

source: Installation Summary
id: Ringkasan Instalasi
tr: Kurulum Özeti

source: The `Installation Summary` screen is the central location for setting up an installation. Most of the options which can be configured during the installation can be accessed from here.
id: Layar `Ringkasan Instalasi` adalah lokasi pusat untuk menyiapkan suatu instalasi. Kebanyakan opsi yang dapat dikonfigurasi selama instalasi dapat diakses dari sini.
tr: `Kurulum Özeti` ekranı, kurulumun merkezi konumudur. Kurulum sırasında yapılandırılabilen seçeneklerin çoğuna buradan erişilebilir.

source: The Installation Summary screen
id: Layar Ringkasan Instalasi
tr: Kurulum Özeti ekranı

source: If you used a Kickstart option or a boot option to specify an installation repository on a network, but no network is available at the start of the installation, the installer will display the `Network Configuration` screen for you to set up a network connection prior to displaying the `Installation Summary` screen.
id: Jika Anda menggunakan opsi Kickstart atau opsi boot untuk menentukan repositori instalasi pada jaringan, namun tidak ada jaringan yang tersedia di awal penginstalan, penginstal akan menampilkan layar `Konfigurasi Jaringan` bagi Anda untuk mengatur koneksi jaringan sebelum menampilkan layar `Ringkasan Instalasi`.
tr: Ağ üzerinde bir kurulum deposu belirtmek için bir Kickstart veya önyükleme seçeneği kullandıysanız, ancak kurulumun başlangıcında kullanılabilir bir ağ yoksa, kurucu `Kurulum Özeti` ekranını görüntülemeden önce bir ağ bağlantısı ayarlamanız için `Ağ Yapılandırması` ekranını görüntüleyecektir.

source: The summary screen consists of several links to other screens, separated into categories. These links can be in several different states, which are graphically indicated:
id: Layar ringkasan terdiri dari beberapa tautan ke layar lain, dipisahkan ke dalam kategori. Tautan-tautan ini bisa dalam keadaan yang berbeda, yang ditunjukkan secara grafis:
tr: Özet ekranı, kategorilere ayrılmış şekilde diğer ekranlara giden birkaç bağlantıdan oluşmaktadır. Bu bağlantılar, grafiksel olarak belirtilen birkaç farklı durumda olabilir:

source: A *warning symbol* (yellow triangle with an exclamation mark) next to an icon means that a screen requires your attention before you start the installation. This typically happens with the `Installation Destination` screen, because even though there is a default automatic partitioning variant, you always have to at least confirm this selection, even if you do not want to make any changes.
id: Sebuah *simbol peringatan* (segitiga kuning dengan tanda seru) di samping ikon berarti bahwa layar memerlukan perhatian Anda sebelum Anda memulai instalasi. Hal ini biasanya terjadi dengan layar `Tujuan Instalasi`, karena meskipun ada varian partisi otomatis default, Anda selalu harus setidaknya mengkonfirmasi pilihan ini, bahkan jika Anda tidak ingin membuat perubahan.
tr: Bir simgenin yanındaki *uyarı sembolü* (ünlem işareti olan sarı üçgen), kuruluma başlamadan önce o ekranla ilgilenmeniz gerektiği anlamına gelmektedir. Bu genellikle `Kurulum Hedefi` ekranında olur, çünkü öntanımlı bir otomatik bölümlendirme şekli olsa da, herhangi bir değişiklik yapmak istemeseniz bile bu seçimi her zaman en azından onaylamanız gerekmektedir.

source: If a link is *greyed out*, it means that the installer is currently configuring this section, and you must wait for the configuration to finish before accessing that screen. This typically happens when you change the installation source in the `Installation Source` screen and the installer is probing the new source location and gathering a list of available packages.
id: Bila suatu tautan *diwarnai kelabu*, itu berarti bahwa penginstal saat ini mengonfigurasi bagian ini, dan Anda harus menunggu konfigurasi selesai sebelum mengakses layar itu. Ini biasanya terjadi ketika Anda mengubah sumber instalasi di layar `Sumber Instalasi` dan penginstal memeriksa lokasi sumber baru dan mengumpulkan daftar paket yang tersedia.
tr: Bir bağlantı *gri renkteyse*, kurucu şu anda bu bölümü yapılandırıyor demektir ve bu ekrana erişmeden önce yapılandırmanın bitmesini beklemeniz gerekmektedir. Bu genellikle `Kurulum Kaynağı` ekranındaki kurulum kaynağını değiştirdiğinizde ve kurucu yeni kaynak konumunu sorgularken ve kullanılabilir paketlerin bir listesini alırken olur.

source: Screens with *black text and no warning symbol* mean that this screen does not require your attention. You can still change your settings in these screens, but it is not necessary to do so to complete the installation. This typically happens with localization settings, as these are either detected automatically, or set up on the previous screen where you select your language and locale.
id: Layar dengan *teks hitam dan tanpa simbol peringatan* berarti layar ini tidak memerlukan perhatian Anda. Anda masih dapat mengubah pengaturan dalam layar-layar ini, tapi tidak perlu untuk melengkapi instalasi. Ini biasanya terjadi dengan pengaturan pelokalan, karena ini dideteksi secara otomatis, atau disiapkan pada layar sebelumnya saat Anda memilih bahasa dan lokal.
tr: *Siyah metin içeren ve uyarı sembolü olmayan* ekranlar, bu ekranla ilgilenmeniz gerekmediği anlamına gelmektedir. Bu ekranlarda ayarlarınızı yine de değiştirebilirsiniz, ancak kurulumu tamamlamak için bunu yapmanız gerekmez. Bu genellikle yerelleştirme ayarlarında olur, çünkü bunlar otomatik olarak algılanır veya dilinizi ve yerel ayarınızı seçtiğiniz önceki ekranda ayarlanır.

source: A warning message is displayed at the bottom of the summary screen, and the `Begin Installation` button is greyed out, as long as at least one item has not been configured yet.
id: Suatu pesan peringatan ditampilkan di dasar layar ringkasan, dan tombol `Mulai Instalasi` diwarnai kelabu, selama paling tidak satu butir belum dikonfigurasi.
tr: Özet ekranının altında bir uyarı mesajı görüntülenir ve en az bir öge henüz yapılandırılmamış olduğu sürece `Kuruluma Başla` düğmesi gri renkte görünür.

source: Icon States in Installation Summary
id: Keadaan Ikon dalam Ringkasan Instalasi
tr: Kurulum Özetindeki Simge Durumları

source: A screenshot of several icons in the Installation Summary screen
id: Suatu tangkapan layar dari beberapa ikon dalam layar Ringkasan Instalasi
tr: Kurulum Özeti ekranında birkaç simgenin ekran görüntüsü

source: Each screen also has an explanatory text below its title, showing settings currently configured in that screen. This text may be concatenated; in that case, move your mouse cursor over it and wait until a tooltip with the full text appears.
id: Setiap layar juga memiliki teks penjelasan di bawah judulnya, menampilkan pengaturan yang saat ini dikonfigurasi dalam layar itu. Teks ini mungkin disingkat; dalam hal itu, gerakkan kursor tetikus Anda di atasnya dan tunggu sampai tooltip dengan teks lengkap muncul.
tr: Ayrıca her ekranın başlığının altında, o ekranda yapılandırılmış olan ayarları gösteren açıklayıcı bir metin bulunur. Bu metin kırpılmış olabilir; bu durumda, fare imlecinizi üzerine getirin ve tam metne sahip bir araç ipucu görünene kadar bekleyin.

source: Tooltip in the Installation Summary
id: Tooltip dalam Ringkasan Instalasi
tr: Kurulum Özetinde İpucu Metni

source: An entry in the Installation Summary shows a truncated description and a tooltip with full text.
id: Suatu entri dalam Ringkasan Instalasi menampilkan deskripsi terpotong dan suatu tooltip dengan teks lengkap.
tr: Kurulum Özetinde, kırpılmış bir açıklama ve tam metin içeren bir araç ipucu gösteren bir öge.

source: Once you configure everything required for the installation, you can press the `Begin Installation` button to start installing {PRODUCT}. This will take you to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Configuration and Installation Progress]. Note that as the text below this button says, nothing will be written to your hard drive before you press this button. You can press `Quit` at any point; this will discard all changes you made in the installer so far and reboot the system.
id: Sekali Anda mengonfigurasi semua yang diperlukan untuk instalasi, Anda dapat menekan tombol `Mulai Instalasi` untuk mulai memasang {PRODUCT}. Ini akan membawa Anda ke xref:sect-installation-gui-installation-progress[Kemajuan Konfigurasi dan Instalasi]. Perhatikan bahwa seperti yang dikatakan oleh teks di bawah tombol ini, tidak ada yang akan ditulis ke hard disk Anda sebelum Anda menekan tombol ini. Anda dapat menekan `Keluar` kapan pun; ini akan membuang semua perubahan yang Anda buat dalam installer sampai saat ini dan mem-boot ulang sistem.
tr: Kurulum için gereken her şeyi yapılandırdıktan sonra, {PRODUCT} kurmaya başlamak için `Kuruluma Başla` düğmesine basabilirsiniz. Bu sizi xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Yapılandırma ve Kurulum İlerlemesi] bölümüne götürecektir. Bu düğmenin altındaki metnin dediği gibi, bu düğmeye basmadan önce sabit sürücünüze hiçbir şey yazılmayacağını unutmayın. İstediğiniz zaman `Çık` düğmesine basabilirsiniz; bu, kurucuda yaptığınız tüm değişiklikleri atacak ve sistemi yeniden başlatacaktır.
