Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/install/After_Installation.po
Languages: es

source: After the Installation
es: Tras la instalación del sistema

source: This chapter describes the initial setup tools which open after you finish the installation, reboot the system, and log in for the first time.
es: Este capítulo describe las herramientas de configuración inicial que se abren después de terminar la instalación, reinicie el sistema y acceda por primera vez.

source: Two separate configuration tools are part of {PRODUCT}. If you installed the [application]*GNOME* desktop environment (the default {PRODUCT} environment, installed for example as part of the {PRODUCT} Workstation Edition), the [application]*GNOME Initial Setup* utility will open; for all other graphical environments, the [application]*Initial Setup* tool serves the same purpose.
es: Dos herramientas de configuración distinta son parte de {PRODUCT}. Si instala el entorno de escritorio [application]*GNOME* (el entorno predeterminado {PRODUCT}, instalado por ejemplo como parte de {PRODUCT} Workstation Edition), se abrirá la utilidad [application]*GNOME Initial Setup*; para los demás entornos gráficos, la herramienta [application]*Initial Setup* sirve para el mismo propósito.

source: Both of these tools will allow you to configure user-specific settings which have not been configured during the installation. Some of the settings are available both in the graphical installer (or as Kickstart commands) as well as in the initial-setup utilities; in that case, they will only be displayed after the first reboot if you skipped them during the installation. This means that, for example, if you configured a user account before the installation finished, you will not be prompted to do so again after the installation completes.
es: Ambas herramientas le permitirán configurar ajustes específicos de usuario que no han sido configurados durante la instalación. Algunos de los ajustes están disponibles tanto en el instalador gráfico (o como comandos Kickstart) como en las utilidades de ajuste inicial; en este caso sólo se mostrarán después del primer reinicio si usted se las ha saltado durante la instalación. Esto significa que, por ejemplo, si usted configuró una cuenta de usuario antes de terminar la instalación, no se le pedirá que lo haga otra vez después de que se complete la instalación.

source: GNOME Initial Setup
es: Configuración Inicial GNOME

source: The [application]*GNOME Initial Setup* utility will be displayed after you log in for the first time with any user account, as long as your first login is in the [application]*GNOME* desktop environment.
es: La utilidad [application]*GNOME Initial Setup* se mostrará después de que usted acceda por primera vez con cualquier cuenta de usuario, siempre que su primer acceso sea en el entorno de escritorio [application]*GNOME*.

source: GNOME Initial Setup with language selection displayed.
es: Configuración Inicial GNOME mostrando la selección de idioma.

source: This utility allows you to configure several user-specific settings, such as system language or the default keyboard layout. Use the `Next` and `Previous` buttons at the top of the window to navigate between screens. Some screens (`Configure online accounts` in particular) are optional and can be skipped using the `Skip` button in the top right corner.
es: Esta utilidad le permite configurar diversos ajustes específicos de usuario, como el idioma del sistema o el esquema de teclado predeterminado. Use los botones `Siguiente` y `Anterior` en la parte superior de la ventana para navegar entre pantallas. Algunas pantalla (en particular `Configurar cuentas en línea`) son opcionales y se pueden saltar usando el botón `Saltar` en la esquina superior derecha.

source: After you finish configuring all screens, click `Start using Fedora` to exit the utility. After that, the `Getting Started` page from GNOME help will be displayed, and you can either browse the help content, or close it and start using your desktop.
es: Después de que finalice de configurar todas las pantallas, pulse `Empezar a usar Fedora` para salir de la utilidad. Después de esto se mostrará la página `Iniciando` de ayuda de GNOME y usted puede o bien navegar a través del contenido de la ayuda o cerrarla y empezar a usar su escritorio.

source: Common Post-installation Tasks
es: Tareas Comunes de Post Instalación

source: After you finish the installation and go through one of the initial setup utilities described above, your system is ready for use. However, other administrative tasks not covered by the installer or the initial setup utilities may still be necessary, depending on how you plan to use your system. The list below describes some of the more common tasks usually performed immediately after a new installation.
es: Después de que termine la instalación y vaya a través de las utilidades de configuración descritas arriba, su sistema está listo para usar. Sin embargo, pueden ser todavía necesarias otras tareas administrativas no cubiertas por el instalador o las utilidades de configuración inicial, dependiendo de cómo planee usar su sistema. La lista de abajo describe algunas de las tareas más comunes que se llevan a cabo normalmente después de una nueva instalación.

source: Recover a lost `root` password
es: Recuperar una contraseña de `root` perdida

source: The `root` password, which is configured during the installation, is required for accessing the system as the `root` user. Without this password you will not be able to configure your system or install additional software. If you lost or forgot your `root` password, you can reset it by following the steps described in xref:install/Troubleshooting.adoc#sect-trouble-after-reset-root-password[Resetting the Root Password].
es: La contraseña de `root`, que se configura durante la instalación, es requerida para acceder al sistema como usuario `root`. Sin esta contraseña no será capaz de configurar su sistema o instalar software adicional. Si pierde u olvida su contraseña de `root`, puede restablecerla siguiendo los pasos descritos en xref:Troubleshooting.adoc#sect-trouble-after-reset-root-password[Restableciendo la Contraseña de Root].

source: Configure the network
es: Configurar la red

source: In most cases, network access is configured during the installation process, either in the [application]*Anaconda* installation program (see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Network & Hostname]) or in a Kickstart file (see xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-network[network (optional) - Configure Network Interfaces]). For information on configuring the network after the installation, see the [citetitle]_{PRODUCT} Networking Guide_, available at link:++https://docs.fedoraproject.org/++[].
es: En la mayoría de los casos el acceso a la red se configura durante el proceso de instalación, bien en el programa de instalación [application]*Anaconda* (vea xref:Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Red y Nombre de Host]) o en un archivo Kickstart (vea xref:../appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-network[red (opcional) - Configurar Interfaces de Red]). Para más información sobre la configuración de la red después de la instalación, vea [citetitle]_{PRODUCT} Guía de Red_, disponible en link:++http://docs.fedoraproject.org/++[].

source: Perform an initial system update
es: Llevar a cabo una actualización inicial del sistema

source: If you installed {PRODUCT} from a full installation ISO image (such as the Workstation live image or full Server DVD), it is recommended to perform an initial system update, because your installation media likely contained older versions of software packages. During the initial update, all installed packages are updated to their latest available versions. Updates to packages provide security fixes, bug fixes and enhancements.
es: Si ha instalado {PRODUCT} desde una imagen ISO de instalación completa (como una imagen viva de Estación de Trabajo o un DVD de Servidor completo), se recomienda que lleve a cabo una actualización inicial del sistema, puesto que su medio de instalación es posible que contenga versiones más antiguas de los paquetes de software. Durante la actualización inicial todos los paquetes instalados se actualizan a la última versión disponible. Actualizar los paquetes suministra correcciones de seguridad, correcciones de gazapos y mejoras.

source: Install driver updates
es: Instalar actualizaciones de controlador

source: Configure additional repositories
es: Configurar repositorios adicionales

source: New software is installed from _package repositories_. Package repositories are organized sets of software and metadata that can be accessed by the [application]*DNF* package manager. By default, several update repositories provided by {PRODUCT} are configured automatically and you can install updates and additional software from those. However, if you want to set up additional repositories, for example ones containing your own software, some extra steps are needed.
es: El nuevo software se instala desde _repositorios de paquetes_. Los repositorios de paquetes son conjuntos organizados de software y metadatos a los que puede acceder el administrador de paquetes [application]*DNF*. De modo predeterminado, se configuran automáticamente diversos repositorios de actualización suministrador por {PRODUCT} y usted puede instalar actualizaciones o software adicional desde ellos. Sin embargo, si desea configurar repositorios adicionales, por ejemplo los que contengan su propio software, son necesarios algunos pasos más.

source: For information about configuring additional software repositories, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
es: Para información sobre la configuración de repositorios de software adicionales, vea la [citetitle]_{PRODUCT} Guía de Administrador del Sistema_, disponible en link:++https://docs.fedoraproject.org/++[].
