Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/install/Booting_the_Installation.po
Languages: pt_br

source: Booting the Installation
pt_br: Inicializando a instalação

source: This chapter will explain how to boot the installer from local media or a network server as well as how to navigate the boot menu and use custom options.
pt_br: Este capítulo explicará como inicializar o instalador a partir da mídia local ou de um servidor de rede, bem como navegar no menu de inicialização e usar opções personalizadas.

source: Preparing to Boot
pt_br: Preparando para inicializar

source: After you have made a bootable USB flash drive or a CD or DVD using the steps described in xref:install/Preparing_for_Installation.adoc#sect-preparing-boot-media[Preparing Boot Media], you are ready to boot the installation. Note that the steps described below are generic and the exact steps will vary somewhat depending on your system - particularly on your motherboard manufacturer.
pt_br: Depois de criar uma unidade flash USB inicializável ou um CD ou DVD usando as etapas descritas em xref:install/Preparing_for_Installation.adoc#sect-preparing-boot-media[Preparando a mídia de inicialização], você está pronto para inicializar a instalação. Observe que as etapas descritas abaixo são genéricas e as etapas exatas variam um pouco dependendo do seu sistema - principalmente do fabricante da placa-mãe.

source: {PRODUCT} does not support UEFI booting for 32-bit x86 systems. Only BIOS boot is supported on these systems.
pt_br: {PRODUCT} não tem suporte a inicialização UEFI para sistemas x86 de 32 bits. Apenas a inicialização do BIOS é compatível com esses sistemas.

source: Also note that {PRODUCT} only fully supports version 2.2 of the UEFI specification. Hardware that supports version 2.3 or later will boot and work normally, but the additional functionality defined by these later specifications will not be available. The UEFI specifications are available from link:++https://www.uefi.org/specs/agreement/++[].
pt_br: Observe também que {PRODUCT} só oferece suporte total à versão 2.2 da especificação UEFI. O hardware que oferece suporte à versão 2.3 ou posterior inicializará e funcionará normalmente, mas a funcionalidade adicional definida por essas especificações posteriores não estará disponível. As especificações UEFI estão disponíveis em link:++https://www.uefi.org/specs/agreement/++[].

source: To boot the {PRODUCT} installer, follow these steps:
pt_br: Para inicializar o instalador do {PRODUCT}, siga estas etapas:

source: Booting the {PRODUCT} Installer
pt_br: Inicializando o instalador do {PRODUCT}

source: Plug in the boot USB drive, or insert the boot CD or DVD into your computer's optical disc drive. Alternatively, if you plan on booting from a network boot (PXE) server, make sure that the network cable is plugged in.
pt_br: Conecte a unidade USB de inicialização ou insira o CD ou DVD de inicialização na unidade de disco óptico do computador. Como alternativa, se você planeja inicializar a partir de um servidor de inicialização de rede (PXE), certifique-se de que o cabo de rede esteja conectado.

source: Restart the system. Once it starts rebooting, it should display a prompt similar to the following (usually at the bottom of the screen):
pt_br: Reinicie o sistema. Assim que iniciar a reinicialização, ele deverá exibir um prompt semelhante ao seguinte (geralmente na parte inferior da tela):

source: Press F12 to select boot device, or Del to enter SETUP
pt_br: Pressione F12 para selecionar o dispositivo de inicialização ou Del para entrar na CONFIGURAÇÃO

source: Follow the on-screen instructions to access the boot menu. If no instructions are displayed (some systems only display a graphical logo during early stages of boot), try pressing kbd:[F12], kbd:[F11], kbd:[F10] or kbd:[Del] several times; these are most commonly used keys. Note that there is usually a very short time window provided to access the menu; once it passes, you need to restart the system and try again.
pt_br: Siga as instruções na tela para acessar o menu de inicialização. Se nenhuma instrução for exibida (alguns sistemas exibem apenas um logotipo gráfico durante os estágios iniciais da inicialização), tente pressionar kbd:[F12], kbd:[F11], kbd:[F10] ou kbd:[Del] várias vezes; essas são as chaves mais comumente usadas. Observe que geralmente há uma janela de tempo muito curta fornecida para acessar o menu; assim que passar, você precisará reiniciar o sistema e tentar novamente.

source: Some older systems may not support choosing a boot device at startup. In that case, enter the system's SETUP (BIOS), and change the default boot order so that your boot media (CD, DVD, USB or network) has higher priority than internal hard drives.
pt_br: Alguns sistemas mais antigos podem não ter suporta à escolha de um dispositivo de inicialização na inicialização. Nesse caso, entre no SETUP do sistema (BIOS) e altere a ordem de inicialização padrão para que a mídia de inicialização (CD, DVD, USB ou rede) tenha prioridade mais alta do que os discos rígidos internos.

source: On Mac hardware, hold down the kbd:[Option] key to enter the boot media selection menu.
pt_br: No hardware do Mac, mantenha pressionada a tecla kbd:[Opção] para entrar no menu de seleção da mídia de inicialização.

source: When your system's boot menu opens, select an entry such as `Boot from USB` if you created a bootable USB drive, `Boot from CD/DVD` if you are using an optical disc to install {PRODUCT}, or `Boot from PXE` if you want to boot from a network location.
pt_br: Quando o menu de inicialização do seu sistema abrir, selecione uma entrada como `Boot from USB` se você criou uma unidade USB inicializável,`Boot from CD/DVD` se você estiver usando um disco óptico para instalar {PRODUCT} ou `Boot from PXE` se você deseja inicializar de um local de rede.

source: Wait until the boot menu is displayed. The boot menu is described further in this chapter.
pt_br: Aguarde até que o menu de inicialização seja exibido. O menu de inicialização é descrito posteriormente neste capítulo.

source: The Boot Menu
pt_br: O menu de inicialização

source: In most cases, when you boot the {PRODUCT} installer from your prepared boot media or server, the boot menu will be the first thing that appears. From this menu, you can either start the actual installation, or you can use the boot media to rescue an existing system.
pt_br: Na maioria dos casos, quando você inicializa o instalador do {PRODUCT} a partir de sua mídia de inicialização ou servidor preparado, o menu de inicialização será a primeira coisa a aparecer. A partir deste menu, você pode iniciar a instalação real ou usar a mídia de inicialização para recuperar um sistema existente.

source: The way the boot menu will look and function will vary somewhat depending on your system's firmware - BIOS systems use the [application]*SYSLINUX* boot loader, and UEFI systems use [application]*GRUB2*. However, both of the menus described below function very similarly from a user's point of view.
pt_br: A aparência e função do menu de inicialização variam um pouco dependendo do firmware do sistema - os sistemas BIOS usam o carregador de inicialização [application]*SYSLINUX* e os sistemas UEFI usam [application]*GRUB2*. No entanto, os dois menus descritos a seguir funcionam de maneira muito semelhante, do ponto de vista do usuário.

source: The final entry in the list is `Troubleshooting`pass:attributes[{blank}]; this is a submenu. Selecting this entry and pressing kbd:[Enter] will display a new set of selections, where you can choose to install in basic graphics mode (useful if you want to do a manual graphical installation but your system has issues with the default graphical installer), rescue an existing system, or test your system's memory modules for errors (on BIOS systems only). The troubleshooting menu also allows you to exit the boot menu and boot normally from your system's hard drive via the `Boot from local drive` option.
pt_br: A entrada final na lista está Troubleshooting pass:attributes[{blank}]; este é um submenu para solução de problemas. Selecionando esta entrada e pressionando kbd:[Enter] irá exibir um novo conjunto de seleções, onde você pode escolher instalar no modo gráfico básico (útil se você deseja fazer uma instalação gráfica manual, mas seu sistema tem problemas com o instalador gráfico padrão), recuperar um sistema existente ou testar os módulos de memória do sistema em busca de erros (apenas em sistemas BIOS). O menu de "troubleshooting" também permite que você saia do menu de inicialização e inicialize normalmente a partir do disco rígido do sistema através da opção `Boot from local drive`.

source: Every menu entry in the list is a predefined set of boot options, and these options can be customized to change some aspects of the installer's behavior. To edit the default set of boot options, press kbd:[Tab] on BIOS systems, or kbd:[e] on UEFI systems. The key to use is also displayed at the bottom of the screen.
pt_br: Cada entrada de menu na lista é um conjunto predefinido de opções de inicialização e essas opções podem ser personalizadas para alterar alguns aspectos do comportamento do instalador. Para editar o conjunto padrão de opções de inicialização, pressione kbd:[Tab] em sistemas BIOS ou kbd:[e] em sistemas UEFI. A chave a ser usada também é exibida na parte inferior da tela.

source: Editing boot options in [application]*GRUB2* (on UEFI systems) will display the entire configuration for the selected entry. Actual boot options are configured on the line which starts with the `linux` (or `linux16` or `linuxefi`) keyword. Do not modify any other lines in the configuration.
pt_br: A edição das opções de inicialização em [application]*GRUB2* (em sistemas UEFI) exibirá toda a configuração da entrada selecionada. As opções reais de inicialização são configuradas na linha que começa com a palavra-chave `linux` (ou `linux16` ou `linuxefi`). Não modifique nenhuma outra linha na configuração.

source: On systems with BIOS firmware, only the actual boot options are displayed when you press kbd:[Tab].
pt_br: Em sistemas com firmware BIOS, apenas as opções de inicialização reais são exibidas quando você pressiona kbd:[Tab].

source: When editing the default set of options, you can change the existing ones as well as append additional ones. Once you finish, press kbd:[Enter] on BIOS or kbd:[Ctrl + X] on UEFI to boot the installer using your customized options.
pt_br: Ao editar o conjunto padrão de opções, você pode alterar as existentes, bem como adicionar outras. Quando terminar, pressione kbd:[Enter] no BIOS ou kbd:[Ctrl + X] no UEFI para inicializar o instalador usando suas opções personalizadas.

source: Editing boot options on a system with BIOS firmware
pt_br: Editando opções de inicialização em um sistema com firmware BIOS

source: The boot menu.
pt_br: O menu de inicialização.

source: Editing boot options on a system with UEFI firmware
pt_br: Editando opções de inicialização em um sistema com firmware UEFI

source: All available [application]*Anaconda* boot options are described in xref:advanced/Boot_Options.adoc#sect-boot-options-available[Available Boot Options].
pt_br: Todas as opções de inicialização do [application]*Anaconda* disponíveis são descritas em xref:advanced/Boot_Options.adoc#sect-boot-options-available[Opções de inicialização disponíveis].
