Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f36/pages/install/Preparing_for_Installation.po
Languages: pt_br

source: Preparing for Installation
pt_br: Preparando para Instalação

source: This chapter describes the steps you need take before you begin the installation. Not every step must be strictly followed - for example, if you plan to use the default installation settings, you do not need to gather system information such as disk device labels/UUIDs or network information such as the system's IP address. However, you should still go through this chapter, as it also describes the available types of installation media and how to prepare boot media and installation sources.
pt_br: Este capítulo descreve as etapas que você precisa executar antes de iniciar a instalação. Nem todas as etapas devem ser seguidas rigorosamente ­— por exemplo, se você planeja usar as configurações de instalação padrão, não precisa coletar informações do sistema, como rótulos/UUIDs de dispositivos de disco ou informações de rede, como o endereço IP do sistema. No entanto, você ainda deve ler este capítulo, pois também descreve os tipos disponíveis de mídia de instalação e como preparar a mídia de inicialização e as fontes de instalação.

source: Upgrade or Install?
pt_br: Atualização ou Instalação?

source: If you already have Fedora installed and want to upgrade your installation to the current version, there are two basic ways to do so:
pt_br: Se você já tem o Fedora instalado e deseja atualizar sua instalação para a versão atual, há duas formas básicas de fazê-lo:

source: Automatic upgrade using [application]*dnf system upgrade*
pt_br: Atualização automática usando [application]*dnf system upgrade*

source: The preferred way to upgrade your system is an automatic upgrade using the [application]*dnf system upgrade* utility. For information on performing an automatic upgrade, see link:++https://fedoraproject.org/wiki/DNF_system_upgrade++[Fedora Wiki dnf system upgrade].
pt_br: A maneira preferida de atualizar seu sistema é uma atualização automática usando o utilitário [application]*dnf system upgrade*. Para obter informações sobre como realizar uma atualização automática, consulte o link:++https://fedoraproject.org/wiki/DNF_system_upgrade++[dnf system upgrade no Fedora Wiki].

source: Manual Reinstallation
pt_br: Reinstalação Manual

source: You can upgrade to the latest version of Fedora manually instead of relying on [application]*dnf system upgrade*. This involves booting the installer as if you were performing a clean installation, letting it detect your existing Fedora system, and overwriting the root partition while preserving data on other partitions and volumes. The same process can also be used to reinstall the system, if you need to. For detailed information, see xref:advanced/Upgrading_Your_Current_System.adoc#sect-upgrading-fedora-manual-reinstall[Manual System Upgrade or Reinstallation].
pt_br: Você pode atualizar para a versão mais recente do Fedora manualmente, em vez de confiar no [application]*dnf system upgrade*. Isso envolve inicializar o instalador como se você estivesse executando uma instalação limpa, permitindo detectar o sistema Fedora existente e substituindo a partição raiz, preservando dados em outras partições e volumes. O mesmo processo também pode ser usado para reinstalar o sistema, se necessário. Para obter informações detalhadas, consulte xref:advanced/Upgrading_Your_Current_System.adoc#sect-upgradeing-fedora-manual-uninstall[Atualização ou Reinstalação Manual do Sistema].

source: Always back up your data before performing an upgrade or reinstalling your system, no matter which method you choose.
pt_br: Sempre faça backup dos seus dados antes de executar uma atualização ou reinstalar o sistema, independentemente do método escolhido.

source: Preparing Boot Media
pt_br: Preparando a Mídia de Inicialização

source: Fedora images are `Hybrid ISOs` and can be used to create installation media with both optical and USB disks, for booting on both BIOS and UEFI systems.
pt_br: As imagens do Fedora são `ISOs híbridas` e podem ser usadas para criar mídia de instalação com discos ópticos e USB, para inicializar nos sistemas BIOS e UEFI.

source: [application]*Fedora Media Writer* has been significantly improved and is now the official, tested and supported way to make bootable media. [application]*Fedora Media Writer* supports Linux, macOS, and Windows. It is an easy way to make bootable USB media to install Fedora (or other operating systems). Using [application]*Fedora Media Writer* is strongly encouraged, although other USB media creation software can work as well.
pt_br: O [application]*Fedora Media Writer* foi melhorado significativamente e é agora a maneira oficial, testada e suportada para fazer mídias inicializáveis. O [application]*Fedora Media Writer* suporta Linux, macOS e Windows. É uma maneira fácil de criar mídia USB inicializável para instalar o Fedora (ou outros sistemas operacionais). Usar o [application]*Fedora Media Writer* é fortemente recomendado, apesar de outro software de criação de mídia USB possa funcionar também.

source: Some of the new additions to [application]*Fedora Media Writer* are that Fedora Workstation and Server are easily and quickly accessible from the selection on the main screen. Further choices are available if you select the button below _Custom image_. This offers a selection of various Fedora Spins, such as Xfce or Mate.
pt_br: Algumas das novas adições ao [application]*Fedora Media Writer* são que o Fedora Workstation e Server são fácil e rapidamente acessíveis a partir da seleção na janela principal. Mais opções estão disponíveis se você selecionar as opções abaixo de _Selecionar a versão do Fedora_. Essa opção oferece uma seleção de vários Spins do Fedora, como o Xfce ou Mate.

source: Historically, universal USB creation tools, such as [application]*Unetbootin*, are a popular way to create USB installers from ISOs intended for optical media. They typically create a filesystem on the USB drive by extracting files from the image, and writing [application]*syslinux* bootloader to the device.
pt_br: Historicamente, as ferramentas universais de criação de USB, como o [application]*Unetbootin*, são uma maneira popular de criar instaladores USB a partir de ISOs destinadas para mídia óptica. Elas normalmente criam um sistema de arquivos na unidade USB extraindo arquivos de uma imagem e gravando o carregador de inicialização [application]*syslinux* no dispositivo.

source: These methods circumvent the boot-loader configuration built into Fedora images, which are pre-partitioned and designed to boot on UEFI systems with SecureBoot enabled as well as BIOS systems, and thus they do not produce consistent results with Fedora images, especially on UEFI systems.
pt_br: Estes métodos contornam a configuração do carregador de inicialização embutida nas imagens do Fedora, que são pré-particionadas e projetadas para inicializar em sistemas UEFI com SecureBoot habilitado, bem como em sistemas BIOS, e, portanto, não produzem resultados consistentes com imagens do Fedora, especialmente em sistemas UEFI.

source: The best results are produced by utilities that use a direct write method and do not modify the Fedora image.
pt_br: Os melhores resultados são produzidos por utilitários que usam um método de escrita direta e não modificam a imagem do Fedora.

source: Always think twice before writing an image to the device. The media creation methods described in this article are destructive. All data on the USB stick are deleted during the process, so make sure you have a back up of the data on the USB stick. Double check that you have selected correct device to write the image to!
pt_br: Sempre pense duas vezes antes de gavar uma imagem em um dispositivo. Os métodos de criação de mídia descritos nesse artigo são destrutivos. Todos os dados no pendrive USB são excluídos durante o processo, então tenha certeza que você tem um backup dos dados no dispositivo USB. Verifique duas vezes se você selecionou o dispositivo correto para gravar a imagem também!

source: Installing and running Fedora Media Writer
pt_br: Instalando e executando o Fedora Media Writer

source: On Fedora
pt_br: No Fedora

source: On Fedora 25 or later, [application]*Fedora Media Writer* is available in the default repository. You can use `dnf` to install the package.
pt_br: No Fedora 25 ou superior, o [application]*Fedora Media Writer* está disponível no repositório padrão. Você pode usar o `dnf` para instalar o pacote.

source: To install the [application]*Fedora Media Writer* using:
pt_br: Para instalar o [application]*Fedora Media Writer* use:

source: Run the [application]*Fedora Media Writer*:
pt_br: Execute o [application]*Fedora Media Writer*:

source: or in [application]*Gnome 3* select *Activities* and then click on [application]*Fedora Media Writer*.
pt_br: ou no [application]*Gnome 3* selecione *Atividades* e então clique no [application]*Fedora Media Writer*.

source: On other Linux distributions
pt_br: Em outras distribuições Linux

source: The best way to install [application]*Fedora Media Writer* on various Linux distributions is to use the pre-built _Flatpak_ package. The package can be obtained from the official Flatpak repository https://flathub.org/apps/details/org.fedoraproject.MediaWriter[Flathub.org].
pt_br: A melhor maneira de instalar o [application]*Fedora Media Writer* em várias distribuições Linux é usar o pacote _Flatpak_ pré-construído. O pacote pode ser obtido a partir do repositório Flatpak oficial https://flathub.org/apps/details/org.fedoraproject.MediaWriter[Flathub.org].

source: To setup *Flatpak* on your Linux system, follow the guidelines on the https://flatpak.org/setup/[Flatpak documentation] page.
pt_br: Para configurar o *Flatpak* no seu sistema Linux, siga as instruções na página https://flatpak.org/setup/[Documentação do Flatpak].

source: Run the application:
pt_br: Execute a aplicação:

source: On Windows
pt_br: No Windows

source: Download the latest Windows Installer file from link:++https://getfedora.org++[GetFedora.org]. The server automatically detects the running system and offers you the correct installation file for your Windows version.
pt_br: Baixe o último arquivo Instalador do Windows a partir do link:++https://getfedora.org++[GetFedora.org]. O servidor detecta automaticamente o sistema atual e oferece a você o arquivo de instalação correto para sua versão do Windows.

source: Run the installation by double clicking the installer, and then continue through the set-up wizard. The Wizard lets you customize the software's installation if you choose to.
pt_br: Execute a instalação clicando duas vezes no instalador, e continue pelo assistente de configuração. O Assistente permite que você personalize a instalação do software se você quiser.

source: Run the application by clicking on a launcher.
pt_br: Execute a aplicação clicando em um atalho.

source: In Windows 8 and 10, the [application]*Fedora Media Writer* launcher will be placed in the _All apps_ menu under _F_. In Windows 10, you can just type [application]*Fedora Media Writer* in the search box on the task bar.
pt_br: No Windows 8 e 10, o atalho do [application]*Fedora Media Writer* será colocado no menu _Todos os aplicativos_ em _F_. No Windows 10, você pode digitar [application]*Fedora Media Writer* na caixa de pesquisa na barra de tarefas.

source: On macOS
pt_br: No macOS

source: Download the latest Macintosh Disk Image (the package will have a .dmg extension) from link:++https://getfedora.org++[GetFedora.org]. The server automatically detects the running system and offers a correct package for your macOS.
pt_br: Baixe a mais recente imagem de disco do Macintosh (o pacote terá uma extensão .dmg) no link:++https: //getfedora.org++[GetFedora.org]. O servidor detecta automaticamente o sistema em execução e oferece um pacote correto para o seu macOS.

source: Open the `.dmg` file, and press and hold the kbd:[Ctrl] key while clicking on the [application]*Fedora Media Writer* application.
pt_br: Abra o arquivo `.dmg`, pressione e segure a tecla kbd:[Ctrl] enquanto clica no aplicativo [application]*Fedora Media Writer*.

source: Press "`Open`" in the pop-up menu.
pt_br: Pressione "`Abrir`" no menu que surgir.

source: Click the "`Open`" button in the confirmation dialog, if it appears.
pt_br: Clique no botão "`Abrir`" no diálogo de confirmação, se aparecer.

source: Writing the ISO image to the USB Media.
pt_br: Gravando a imagem ISO em uma mídia USB.

source: Select the Fedora Edition you wish to make a bootable USB drive for.
pt_br: Selecione a Edição do Fedora para a qual você deseja criar uma unidade USB inicializável.

source: Fedora Media Writer Main Screen: Choose your Edition of Fedora
pt_br: Tela principal do Fedora Media Writer: Escolha sua Edição do Fedora

source: Image of Fedora Media Writer Main Screen
pt_br: Imagem da tela principal do Fedora Media Writer

source: The main selection lets you choose one of the default Fedora editions, Fedora *Workstation* or *Server*. [application]*Fedora Media Writer* displays more details about the edition before you can proceed with downloading the image and the USB creation. You can choose a different architecture, if you select _Other variants_.
pt_br: A seleção principal permite que você escolha uma das edições padrão do Fedora, *Workstation* ou *Server*. [application]*Fedora Media Writer* exibe mais detalhes sobre a edição antes de você prosseguir com o download da imagem e a criação do USB. Você pode escolher uma arquitetura diferente, se selecionar _Outras variantes_.

source: Select "`Create Live USB`" to proceed.
pt_br: Selecione "`Criar USB Live`" para continuar.

source: Fedora Media Writer Distro Information
pt_br: Informações da Distro no Fedora Media Writer

source: Image of Fedora Media Writer Distro Information Screen
pt_br: Imagem da tela de Informações da Distro do Fedora Media Writer

source: Fedora Media Writer will automatically download the ISO for you. If you have downloaded the ISO before and placed it in the _Downloads_ directory, it will be immediately available to use.
pt_br: O Fedora Media Writer baixará automaticamente o ISO para você. Se você tiver baixado o ISO antes e colocado no diretório _Downloads_, ela estará imediatamente disponível para uso.

source: Fedora Media Writer Automatic Download
pt_br: Download Automático do Fedora Media Writer

source: Image of Fedora Media Writer Automatic Download
pt_br: Imagem do Download Automático do Fedora Media Writer

source: Plug in a USB drive on which you want to create the bootable media.
pt_br: Conecte uma unidade USB na qual você deseja criar uma mídia inicializável.

source: To write the image onto the media, click the red btn:[Write to disk] button.
pt_br: Para gravar a imagem na mídia, clique no botão vermelho btn:[Write to disk].

source: Fedora Media Writer Write to USB Device
pt_br: Escrita do Fedora Media Writer para um Dispositivo USB

source: Image of Fedora Media Writer write to device red button
pt_br: Imagem do botão vermelho de escrita para dispositivo do Fedora Media Writer

source: Other methods to create a live USB
pt_br: Outros métodos para criar um USB live

source: Using the *Fedora Media Writer* is highly recommended for everybody, because it offers a reliable way to create a live USB stick for Fedora installation.
pt_br: O uso do *Fedora Media Writer* é altamente recomendado para todos, porque oferece uma maneira confiável de criar um dispositivo USB para instalação do Fedora.

source: However, some experienced users may prefer to go through the creation process manually. If you decide to do so, you have to download the installation images and use an application to write them onto the USB stick.
pt_br: No entanto, alguns usuários experientes podem preferir passar pelo processo de criação manualmente. Se você decidir fazer isso, deverá baixar as imagens de instalação e usar um aplicativo para gravá-las no dispositivo USB.

source: If you have downloaded and verified the installation images manually, you still can write them onto the USB stick using *Fedora Media Writer*.
pt_br: Se você baixou e verificou as imagens de instalação manualmente, você ainda pode gravá-las no dispositivo USB usando o *Fedora Media Writer*.

source: Downloading Boot and Installation Images
pt_br: Baixando Imagens de Inicialização e Instalação

source: The Fedora Project offers different Editions tailored for some specific use cases. Choose the Fedora Edition best for you. You can also build your own by customizing Fedora after it's installed or by using a kickstart file as described in xref:advanced/Kickstart_Installations.adoc#sect-kickstart-file-create[Creating a Kickstart File]. Kickstart installation requires the `netinstall` media type, or a direct installation booting method such as PXE; kickstarts are not supported with live images.
pt_br: O Projeto Fedora oferece diferentes edições feitas sob medida para alguns casos de uso específicos. Escolha a melhor edição do Fedora para você. Você também pode construir sua própria personalizando o Fedora após estar instalado, ou usando um arquivo kickstart conforme descrito em xref:advanced/Kickstart_Installations.adoc#sect-kickstart-file-create[Criando um arquivo Kickstart] . A instalação Kickstart requer o tipo de mídia `netinstall` ou um método de inicialização de instalação direta, como PXE; kickstarts não são suportados com imagens live.

source: Read more about Fedora Workstation, Fedora Cloud, Fedora Server and the available media types in xref:Downloading_Fedora.adoc#chap-downloading-fedora[Downloading Fedora].
pt_br: Leia mais sobre Fedora Workstation, Fedora Cloud, Fedora Server e os tipos de mídia disponíveis em xref:Downloading_Fedora.adoc#chap-downloading-fedora[Baixando o Fedora].

source: You can also choose a Fedora _Spin_ featuring favorite alternative desktops or tools for specialized tasks at link:++https://spins.fedoraproject.org++[].
pt_br: Você também pode escolher um Fedora _Spin_ apresentando desktops alternativos favoritos ou ferramentas para tarefas especializadas em link:++https://spins.fedoraproject.org++[].

source: Verifying the Downloaded Image
pt_br: Verificando a Imagem Baixada

source: Because transmission errors or other problems may corrupt the Fedora image you have downloaded, it is important to verify the file's integrity. After the images are created, an operation is performed on the file that produces a value called a `checksum` using a complex mathematical algorithm. The operation is sufficiently complex that *any change* to the original file will produce a different checksum.
pt_br: Como erros de transmissão ou outros problemas podem corromper a imagem do Fedora que você baixou, é importante verificar a integridade do arquivo. Depois que as imagens são criadas, uma operação é realizada no arquivo que produz um valor chamado `soma de verificação`, ou "checksum", usando um algoritmo matemático complexo. A operação é suficientemente complexa para que *qualquer alteração* no arquivo original produza uma soma de verificação diferente.

source: By calculating the image's `checksum` on your own computer and comparing it to the original `checksum`, you can verify the image has not been tampered with or corrupted. The original checksum values are provided at link:++https://getfedora.org/security/++[], and are [command]#gpg# signed to demonstrate their integrity.
pt_br: Calculando a `soma de verificação` da imagem em seu próprio computador e comparando-o com a `soma de verificação` original, você pode verificar se a imagem não foi adulterada ou corrompida. Os valores de soma de verificação originais são fornecidos em link:++https://getfedora.org/security/++[], e são assinados com [command]#gpg# para demonstrar sua integridade.

source: Verifying checksums on Windows systems
pt_br: Verificando checksums em sistemas Windows

source: Download the Fedora image of your choice from link:++https://getfedora.org/++[] and the corresponding checksum file from link:++https://getfedora.org/security/++[]
pt_br: Baixe a imagem do Fedora de sua escolha no link:++https://fedoraproject.org/get-fedora++[] e o arquivo de soma de verificação correspondente em link:++https://getfedora.org/security/++[]

source: Open a [command]#powershell# session.
pt_br: Abra uma sessão do [command]#powershell#.

source: Change to the directory containing the downloaded files.
pt_br: Mude para o diretório que contém os arquivos baixados.

source: Directory: C:\Users\Pete\Downloads
pt_br: Diretório: C:\Usuários\Pete\Downloads

source: Mode LastWriteTime Length Name ---- ------------- ------ ---- -a--- 11/25/2014 12:39 PM 272 Fedora-Server-21-x86_64-CHECKSUM -a--- 11/25/2014 12:39 PM 2047868928 Fedora-Server-DVD-x86_64-21.iso
pt_br: Modo LastWriteTime Tamanho Nome ---- ------------- ------ ---- -a--- 11/25/2014 12:39 PM 272 Fedora-Server-21-x86_64-CHECKSUM -a--- 11/25/2014 12:39 PM 2047868928 Fedora-Server-DVD-x86_64-21.iso

source: Load the resources required to calculate the checksum.
pt_br: Carregue os recursos necessários para calcular a soma de verificação.

source: Calculate the downloaded image's checksum. This will take a while!
pt_br: Calcule a soma de verificação da imagem baixada. Isso vai demorar um pouco!

source: Compare the calculated checksum to the expected checksum.
pt_br: Compare a soma de verificação calculada com a soma de verificação esperada.

source: Verifying checksums on Linux and macOS systems
pt_br: Verificando somas de verificação em sistemas Linux e macOS

source: Download the Fedora image of your choice from link:++https://fedoraproject.org/get-fedora++[] and the corresponding checksum file from link:++https://getfedora.org/security/++[]
pt_br: Baixe a imagem do Fedora de sua escolha no link:++https://fedoraproject.org/get-fedora++[] e o arquivo de soma de verificação correspondente em link:++https://getfedora.org/security/++[]

source: Open a terminal window, and navigate to the directory with the downloaded files.
pt_br: Abra uma janela de terminal e navegue até o diretório com os arquivos baixados.

source: Use the appropriate utility to verify the image checksum.
pt_br: Use o utilitário apropriado para verificar a soma de verificação da imagem.

source: For Linux:
pt_br: Para Linux:

source: For macOS:
pt_br: Para macOS:

source: Writing the images to USB media
pt_br: Gravando as imagens em mídia USB

source: Creating USB media with [application]*GNOME Disks*
pt_br: Criando mídia USB com o [application]*GNOME Discos*

source: On a system with [application]*GNOME*, or with the [package]*gnome-disk-utility* package installed, open `Disks` using the system menu.
pt_br: Em um sistema com [application]*GNOME*, ou com o pacote [package]*gnome-disk-utility* instalado, abra `Discos` usando o menu do sistema.

source: Click your USB device in the left column.
pt_br: Clique em seu dispositivo USB na coluna da esquerda.

source: Click the menu icon in the upper right corner of the window, and choose the `Restore Disk Image` option.
pt_br: Clique no ícone de menu no canto superior direito da janela e escolha a opção `Restaurar imagem de disco`.

source: Navigate to your image file and click `Start Restoring`. After a few minutes, it will report the process is complete and your installation media will be ready to use.
pt_br: Navegue até o arquivo de imagem e clique em `Iniciar restauração`. Após alguns minutos, ele relatará que o processo foi concluído e sua mídia de instalação estará pronta para uso.

source: Creating USB Media on the Linux command line
pt_br: Criando uma mídia USB na linha de comando do Linux

source: Open a terminal window and insert the usb drive.
pt_br: Abra uma janela de terminal e insira a unidade USB.
