Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f36/pages/install/Preparing_for_Installation.po
Languages: pt_br

source: Find the `device node` assigned to the drive. In the example below, the drive is given `sdd`.
pt_br: Encontre o `nó de dispositivo` atribuído à unidade. No exemplo abaixo, a unidade recebe `sdd`.

source: Use the [command]#dd# utility to write the image.
pt_br: Use o utilitário [command]#dd# para gravar a imagem.

source: # dd if=/path/to/Fedora-Live-Security-x86_64-21.iso of=/dev/sdd
pt_br: # dd if=/caminho/para/Fedora-Live-Security-x86_64-21.iso of=/dev/sdd

source: Pay extreme attention to the source (`if=`) and target (`of=`) device. The `dd` command destroys all data on the target device. If you made a mistake, you could lose important data.
pt_br: Preste muita atenção aos dispositivos de origem (`if=`) e de destino (`of=`). O comando `dd` destrói todos os dados no dispositivo de destino. Se você cometer um erro, poderá perder dados importantes.

source: Creating a Boot CD or DVD
pt_br: Criando um CD ou DVD de Inicialização

source: In addition to creating a bootable USB flash drive, you can also use the provided ISO images to create bootable optical media (a CD or DVD). This approach may be necessary when installing {PRODUCT} on an older system which cannot boot from USB.
pt_br: Além de criar uma unidade flash USB inicializável, você também pode usar as imagens ISO fornecidas para criar mídia ótica inicializável (um CD ou DVD). Esta abordagem pode ser necessária ao instalar {PRODUCT} em um sistema mais antigo que não pode inicializar a partir de USB.

source: The exact steps you need to take to burn a bootable CD or DVD from an ISO image will vary depending on what disc burning software you use. This procedure only offers a general overview.
pt_br: As etapas exatas que você precisa seguir para gravar um CD ou DVD inicializável a partir de uma imagem ISO variam dependendo do software de gravação de disco que você usa. Este procedimento oferece apenas uma visão geral.

source: Insert a blank CD or DVD into your system's CD or DVD burner.
pt_br: Insira um CD ou DVD virgem no gravador de CD ou DVD do seu sistema.

source: Open your system's burning software - for example, [application]*Brasero* on {PRODUCT} systems with [application]*GNOME* desktop environment, or [application]*Nero* on Windows systems. In the software's main menu, find an option which lets you burn an ISO image to a disc. For example, in [application]*Brasero*, this option is `Burn image` in the main menu on the left side of the window.
pt_br: Abra o software de gravação do seu sistema - por exemplo, [application]*Brasero* em sistemas {PRODUCT} com ambiente gráfico [application]*GNOME*, ou [application]*Nero* em sistemas Windows. No menu principal do software, encontre uma opção que permite gravar uma imagem ISO em um disco. Por exemplo, no [application]*Brasero*, esta opção é `Gravar imagem` no menu principal do lado esquerdo da janela.

source: When prompted, select the ISO image of {PRODUCT} to be burned, and the CD or DVD burner with a blank disc inside (if you have more than one drive).
pt_br: Quando solicitado, selecione a imagem ISO do {PRODUCT} a ser gravada e o gravador de CD ou DVD com um disco vazio dentro (se você tiver mais de uma unidade).

source: Confirm your selection, and wait for the disc to be burned.
pt_br: Confirme sua seleção e espere até que o disco seja gravado.
