Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/_partials/Feedback.po
Languages: ko, pt_br

source: We want feedback
ko: 우리는 응답을 원합니다
pt_br: Queremos feedback

source: indexterm:[feedback,contact information for this manual] If you find errors or have suggestions for improvement, we want your advice. Submit a report in Bugzilla against the product `{PRODUCT}` and the component `{BOOKID}`. The following link automatically loads this information for you: {BZURL}.
ko: 색인용어:[응답, 이 설명서에 대한 연락 정보] 오류를 찾았거나 개선을 위한 제안을 가지고 있으면, 우리는 당신의 조언을 구합니다. 제품 `{PRODUCT}`과 구성 `{BOOKID}`에 대해 버그질라에 보고를 제출합니다. 다음 연결은 자동으로 이 정보를 적재합니다: {BZURL}.
pt_br: indexterm:[feedback,informações de contato para este manual] Se você encontrar erros ou tiver sugestões de melhorias, queremos seu conselho. Envie um relatório no Bugzilla contra o produto `{PRODUCT}` e o componente `{BOOKID}`. O link a seguir carrega automaticamente esta informação para você: {BZURL}.

source: In Bugzilla:
ko: 버그질라에서:
pt_br: No Bugzilla:

source: Provide a short summary of the error or your suggestion in the `Summary` field.
ko: `요약` 부분에서 오류에 대한 간략한 요약 또는 당신의 제안을 제공합니다.
pt_br: Forneça um breve resumo do erro ou sua sugestão no campo `Summary`.

source: Copy the following template into the `Description` field and give us the details of the error or suggestion as specifically as you can. If possible, include some surrounding text so we know where the error occurs or the suggestion fits.
ko: 다음 템플릿트를 `설명` 부분에 복사하고 당신이 할 수 있는 한 구체적인 오류 또는 제안에 대한 상세한 정보를 우리에게 제공해 주세요. 만약 가능하다면, 주변 텍스트를 포함하면 오류가 발생한 장소 또는 제안에 맞는 위치를 알 수 있습니다.
pt_br: Copie o modelo a seguir no campo `Description` e forneça os detalhes do erro ou sugestão da maneira mais específica possível. Se possível, inclua algum texto ao redor para sabermos onde o erro ocorre ou a sugestão se encaixa.

source: Document URL:
ko: 문서 URL:
pt_br: URL do Documento:

source: Section number and name:
ko: 부분 번호와 이름:
pt_br: Nome e número de seção:

source: Error or suggestion:
ko: 오류 또는 제안:
pt_br: Erro or sugestão:

source: Additional information:
ko: 추가 정보:
pt_br: Informação adicional:

source: Click the btn:[Submit Bug] button.
ko: 누름 단추를 눌러주세요:[결점 제출] 누름단추.
pt_br: Clique no botão btn:[Submit Bug].
