Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f34/pages/advanced/VNC_Installations.po
Languages: pt_br

source: Installing Using VNC
pt_br: Instalando Usando VNC

source: The graphical installation interface is the recommended method of installing {PRODUCT}. However, in some cases, accessing the graphical interface directly is difficult or impossible. Some systems lack the capability to connect a display and a keyboard, making VNC a necessity for manual (non-Kickstart) installations.
pt_br: A interface de instalação gráfica é o método recomendado de instalação do {PRODUCT}. Porém, em alguns casos, acessar a interface gráfica diretamente é difícil ou impossível. Alguns sistemas não tem a capacidade de conectar uma tela e um teclado, fazendo do VNC uma necessidade para instalações manuais (não Kickstart).

source: To allow manual installations on _headless systems_ (systems without a directly connected display, keyboard and mouse), the [application]*Anaconda* installation program includes a _Virtual Network Computing_ (VNC) mode which allows the graphical mode of the installation program to run locally, but display on another system connected to the network. The VNC installation provides you with the full range of installation options.
pt_br: Para permitir instalações manuais em _sistemas headless_ (sistemas sem um monitor, teclado e mouse, conectado diretamente), o programa de instalação do [application]*Anaconda* inclui um modo _Virtual Network Computing_ (VNC) que permite que o modo gráfico do programa de instalação seja executado localmente , mas exibir em outro sistema conectado à rede. A instalação do VNC fornece uma gama completa de opções de instalação.

source: This chapter provides instructions on activating VNC mode on the installation system and connecting to it using a VNC viewer.
pt_br: Este capítulo fornece instruções sobre como ativar o modo VNC no sistema de instalação e conectar-se a ele usando um visualizador VNC.

source: Installing a VNC Viewer
pt_br: Instalando um Visualizador VNC

source: Performing a VNC installation requires a VNC viewer running on your workstation or another terminal computer. VNC viewers are available in the repositories of most Linux distributions; free VNC viewers are also available for other operating systems such as Windows. On Linux systems, use your package manager to search for a viewer for your distribution.
pt_br: A execução de uma instalação VNC requer um visualizador VNC em execução na estação de trabalho ou em outro computador terminal. Os visualizadores VNC estão disponíveis nos repositórios da maioria das distribuições Linux; visualizadores VNC gratuitos também estão disponíveis para outros sistemas operacionais, como o Windows. Em sistemas Linux, use seu gerenciador de pacotes para procurar um visualizador para sua distribuição.

source: The following VNC viewers are available in {PRODUCT}:
pt_br: Os seguintes visualizadores VNC estão disponíveis no {PRODUCT}:

source: [application]*TigerVNC* - A basic viewer independent of your desktop environment. Installed as the [package]*tigervnc* package.
pt_br: [application]*TigerVNC* - Um visualizador básico independente de seu ambiente de área de trabalho. Instalado como o pacote [package]*tigervnc*.

source: [application]*Vinagre* - A viewer for the [application]*GNOME* desktop environment. Installed as the [package]*vinagre* package.
pt_br: [application]*Vinagre* - Um visualizador para o ambiente [application]*GNOME*. Instalado como o pacote [package]*vinagre*.

source: [application]*KRDC* - A viewer integrated with the [application]*KDE* desktop environment. Installed as the [package]*kdenetwork-krdc* package.
pt_br: [application]*KRDC* - Um visualizador integrado ao ambiente [application]*KDE*. Instalado como o pacote [package]*kdenetwork-krdc*.

source: To install any of the viewers listed above, execute the following command as `root`:
pt_br: Para instalar qualquer um dos visualizadores listados acima, execute o seguinte comando como `root`:

source: # dnf install package
pt_br: # dnf install pacote

source: Replace _package_ with the package name of the viewer you want to use (for example, [package]*tigervnc*).
pt_br: Substitua _pacote_ pelo nome do pacote do visualizador que deseja usar (por exemplo, [package]*tigervnc*).

source: Procedures in this chapter assume you are using [application]*TigerVNC* as your VNC viewer. Specific instructions for other viewers may differ, but the general principles still apply.
pt_br: Os procedimentos neste capítulo presumem que você está usando o [application]*TigerVNC* como seu visualizador VNC. As instruções específicas para outros visualizadores podem ser diferentes, mas os princípios gerais ainda se aplicam.

source: Performing a VNC Installation
pt_br: Efetuando uma Instalação VNC

source: The [application]*Anaconda* installation program offers two modes for VNC installation: _Direct mode_ and _Connect mode_. The modes differ in the way the connection between the server and viewer is established. After you successfully connect, the installation will progress the same way regardless of the mode you used.
pt_br: O programa de instalação do [application]*Anaconda* oferece dois modos de instalação VNC: _Modo direto_ e _Modo conexão_. Os modos diferem na forma como a conexão entre o servidor e o visualizador é estabelecida. Depois de se conectar com sucesso, a instalação continuará da mesma maneira, independentemente do modo usado.

source: Direct Mode
pt_br: Modo Direto

source: In this mode, [application]*Anaconda* is configured to start the installation and wait for an incoming connection from VNC viewer before proceeding. While waiting for an incoming connection, the system's IP address and the port on which the installer expects the connection is displayed on the display or console if available; this implies that you need at least a serial console to connect using this mode, but you can work around this limitation if you know the default VNC port and the system's IP address.
pt_br: Neste modo, o [application]*Anaconda* é configurado para iniciar a instalação e esperar por uma conexão de entrada do visualizador VNC antes de prosseguir. Enquanto espera por uma conexão de entrada, o endereço IP do sistema e a porta na qual o instalador espera a conexão são exibidos no visor ou console, se disponível; isso significa que você precisa de pelo menos um console serial para se conectar usando este modo, mas você pode contornar essa limitação se souber a porta VNC padrão e o endereço IP do sistema.

source: Connect Mode
pt_br: Modo Conexão

source: In this mode, the VNC viewer is started on the remote system in _listening mode_. The VNC viewer waits for an incoming connection on a specified port. Then, [application]*Anaconda* is started and the host name/IP address and port number of the viewer are provided using a boot option or a Kickstart command. When the installation begins, the installation program establishes a connection with the listening VNC viewer using the specified host name/IP address and port number. Connect mode is therefore easier to use on systems with no local display or console, but it also may require additional preparation, because the viewer system must be able to accept incoming connections on the specified port, which usually requires changing firewall settings.
pt_br: Neste modo, o visualizador VNC é iniciado no sistema remoto no _modo de escuta_. O visualizador VNC espera por uma conexão de entrada em uma porta especificada. Então, o [application]*Anaconda* é iniciado e o nome do host/endereço IP e o número da porta do visualizador são fornecidos usando uma opção de inicialização ou um comando Kickstart. Quando a instalação começa, o programa de instalação estabelece uma conexão com o visualizador VNC de escuta usando o nome do host/endereço IP e o número da porta especificados. O modo de conexão é, portanto, mais fácil de usar em sistemas sem monitor ou console local, mas também pode exigir preparação adicional, porque o sistema do visualizador deve ser capaz de aceitar conexões de entrada na porta especificada, o que geralmente requer a alteração das configurações do firewall.

source: Choosing a VNC Installation Mode
pt_br: Escolhendo um Modo de Instalação VNC

source: Visual and Interactive access to the system
pt_br: Acesso visual e interativo ao sistema

source: If visual and interactive access to the system being installed is not available, then you should use Connect Mode.
pt_br: Se o acesso visual e interativo ao sistema que está sendo instalado não estiver disponível, você deve usar o Modo Conexão.

source: Network Connection Rules and Firewalls
pt_br: Regras de Conexão de Rede e Firewalls

source: If the system being installed is not allowed inbound connections by a firewall, then you must use Connect Mode or disable the firewall. Disabling a firewall may have security implications.
pt_br: Se o sistema que está sendo instalado não permitir conexões de entrada por um firewall, você deverá usar o Modo Conexão ou desabilitar o firewall. Desabilitar um firewall pode ter implicações de segurança.

source: If the remote system running the VNC viewer is not allowed incoming connections by a firewall, then you must use Direct Mode, or disable the firewall. Disabling a firewall may have security implications.
pt_br: Se o sistema remoto executando o visualizador VNC não tiver permissão para conexões de entrada por um firewall, você deve usar o Modo Direto ou desabilitar o firewall. Desativar um firewall pode ter implicações de segurança.

source: Installing in VNC Direct Mode
pt_br: Instalando em Modo Direto VNC

source: VNC Direct Mode is when the VNC viewer initiates a connection to the system being installed. [application]*Anaconda* will tell you when to initiate this connection.
pt_br: O Modo Direto VNC é quando o visualizador VNC inicia uma conexão com o sistema que está sendo instalado. [application]*Anaconda* lhe dirá quando iniciar esta conexão.

source: Starting VNC in Direct Mode
pt_br: Iniciando VNC no Modo Direto

source: Open the VNC viewer (for example, [application]*TigerVNC*) on the workstation you will be using to connect to the system being installed. A window similar to xref:figu-vnc-installations-connection-details[TigerVNC Connection Details] will be displayed with an input field allowing you to specify an IP address.
pt_br: Abra o visualizador VNC (por exemplo, [application]*TigerVNC*) na estação de trabalho que você usará para se conectar ao sistema que está sendo instalado. Uma janela semelhante a xref:figu-vnc-installations-connection-details[Detalhes da Conexão TigerVNC] será exibida com um campo de entrada permitindo que você especifique um endereço IP.

source: TigerVNC Connection Details
pt_br: Destalhes da conexão com TigerVNC

source: TigerVNC after startup
pt_br: TigerVNC após a inicialização

source: Boot the installation system and wait for the boot menu to appear. In the menu, edit boot options (see xref:install/Booting_the_Installation.adoc#sect-boot-menu[The Boot Menu]) and append the [option]#inst.vnc# option to the end of the command line.
pt_br: Inicialize o sistema de instalação e aguarde o menu de inicialização aparecer. No menu, edite as opções de inicialização (consulte xref:install/Booting_the_Installation.adoc#sect-boot-menu[O menu de inicialização]) e acrescente a opção [option]#inst.vnc# ao final da linha de comando.

source: Optionally, if you want to restrict VNC access to the installation system, add the [option]#inst.vncpassword=pass:attributes[{blank}]_PASSWORD_pass:attributes[{blank}]# boot option as well. Replace _PASSWORD_ with the password you want to use for the installation. The VNC password must be between 6 and 8 characters long.
pt_br: Opcionalmente, se você deseja restringir o acesso VNC ao sistema de instalação, adicione a opção de inicializaçãooption]#inst.vncpassword=pass:attributes[{blank}]_SENHA_pass:attributes[{blank}]# também. Substitua _SENHA_ pela senha que deseja usar para a instalação. A senha do VNC deve ter entre 6 e 8 caracteres.

source: Use a temporary password for the [option]#inst.vncpassword=# option. It should not be a real or root password you use on any system.
pt_br: Use uma senha temporária para a opção [option]#inst.vncpassword=#. Não deve ser uma senha real ou root que você usa em qualquer sistema.

source: Adding VNC Boot Options
pt_br: Adicionando opções de inicialização VNC

source: Editing boot options to activate VNC
pt_br: Editando opções de inicialização para ativar o VNC

source: Start the installation using the edited options. The system will initialize the installation program and start the necessary services. When the system is ready, you will see a message on the screen similar to the following:
pt_br: Inicie a instalação usando as opções editadas. O sistema inicializará o programa de instalação e iniciará os serviços necessários. Quando o sistema estiver pronto, você verá uma mensagem na tela semelhante à seguinte:

source: Note the IP address and port number (in the above example, `192.168.100.131:5901`).
pt_br: Note o endereço IP e número da porta (no exemplo acima, `192.168.100.131:5901`).

source: On the system running the VNC Viewer, enter the IP address and port number obtained in the previous step into the `Connection Details` dialog in the same format as it was displayed on the screen by the installer. Then, click `Connect`. The VNC viewer will now connect to the installation system. If you set up a VNC password, enter it when prompted and press `OK`.
pt_br: No sistema que executa o Visualizador VNC, insira o endereço IP e o número da porta obtidos na etapa anterior na caixa de diálogo `Detalhes da conexão` no mesmo formato em que foi exibido na tela pelo instalador. Em seguida, clique em `Conectar`. O visualizador VNC agora se conectará ao sistema de instalação. Se você configurar uma senha VNC, digite-a quando solicitado e pressione `OK`.

source: When the connection is successfully established, a new window will open on the system running the VNC viewer, displaying the installation menu. This window will provide full remote access to the installer until the installation finishes and the system reboots for the first time.
pt_br: Quando a conexão for estabelecida com sucesso, uma nova janela será aberta no sistema executando o visualizador VNC, exibindo o menu de instalação. Esta janela fornecerá acesso remoto completo ao instalador até que a instalação seja concluída e o sistema seja reinicializado pela primeira vez.

source: You can then proceed with xref:install/Installing_Using_Anaconda.adoc#chap-installing-using-anaconda[Installing Using Anaconda].
pt_br: Você pode, então, continuar com xref:install/Installing_Using_Anaconda.adoc#chap-installing-using-anaconda[Instando usando Anaconda].

source: Installing in VNC Connect Mode
pt_br: Instalando no modo conexão de VNC

source: VNC connect mode is when the system being installed initiates a connection to the VNC viewer running on a remote system. Before you start, make sure the remote system is configured to accept incoming connection on the port you want to use for VNC. The exact way to make sure the connection will not be blocked depends on your network and on your workstation's configuration. Information about configuring the firewall in {PRODUCT} is available in the [citetitle]_{PRODUCT} Security{nbsp}Guide_, available at link:++https://docs.fedoraproject.org/++[].
pt_br: O modo de conexão de VNC é quando o sistema que está sendo instalado inicia uma conexão com o visualizador VNC em execução em um sistema remoto. Antes de começar, certifique-se de que o sistema remoto esteja configurado para aceitar a conexão de entrada na porta que você deseja usar para VNC. A maneira exata de garantir que a conexão não seja bloqueada depende da rede e da configuração da estação de trabalho. Informações sobre como configurar o firewall no {PRODUCT} estão disponíveis no [citetitle]_{PRODUCT} Security{nbsp}Guide_ (guia de segurança), disponível em link:++https://docs.fedoraproject.org/++[].

source: Starting VNC in Connect Mode
pt_br: Iniciando VNC no modo conexão

source: Start the VNC viewer on the client system in listening mode. For example, on {PRODUCT} using [application]*TigerVNC*, execute the following command:
pt_br: Inicie o visualizador VNC no sistema cliente em modo de escuta. Por exemplo, no {PRODUCT} usando [application]*TigerVNC*, execute o seguinte comando:

source: $ [command]#vncviewer -listen _PORT_#
pt_br: $ [command]#vncviewer -listen _PORTA_#

source: Replace _PORT_ with the port number you want to use for the connection.
pt_br: Substitua _PORTA_ pelo número da porta que deseja usar para a conexão.

source: The terminal will display a message similar to the following example:
pt_br: O terminal exibirá uma mensagem semelhante ao seguinte exemplo:

source: TigerVNC Viewer Listening
pt_br: Escuta com visualizador TigerVNC

source: TigerVNC Viewer 64-bit v1.3.0 (20130924) Built on Sep 24 2013 at 16:32:56 Copyright (C) 1999-2011 TigerVNC Team and many others (see README.txt) See https://tigervnc.org/ for information on TigerVNC.
pt_br: Visualizador TigerVNC 64 bits v1.3.0 (20130924) Compilado em: Sep 24 2013 at 16:32:56 Copyright (C) 1999-2011 Equipe TigerVNC e muitos outros (veja README.txt) Veja https://tigervnc.org/ para informação sobre o TigerVNC.

source: Thu Feb 20 15:23:54 2014 main: Listening on port 5901
pt_br: Thu Feb 20 15:23:54 2014 main: Ouvindo na port 5901

source: When this message is displayed, the VNC viewer is ready and waiting for an incoming connection from the installation system.
pt_br: Quando esta mensagem é exibida, o visualizador VNC está pronto e aguardando uma conexão de entrada do sistema de instalação.

source: Boot the installation system and wait for the boot menu to appear. In the menu, edit boot options (see xref:install/Booting_the_Installation.adoc#sect-boot-menu[The Boot Menu]) and append the following options to the end of the command line:
pt_br: Inicialize o sistema de instalação e aguarde o menu de inicialização aparecer. No menu, edite as opções de inicialização (consulte xref:install/Booting_the_Installation.adoc#sect-boot-menu[O menu de inicialização]) e anexe as seguintes opções ao final da linha de comando:

source: [option]#inst.vnc inst.vncconnect=pass:attributes[{blank}]_HOST_:pass:attributes[{blank}]_PORT_#
pt_br: [option]#inst.vnc inst.vncconnect=pass:attributes[{blank}]_HOST_:pass:attributes[{blank}]_PORTA_#

source: Replace _HOST_ with the IP address of the system running the listening VNC viewer, and _PORT_ with the port number that the VNC viewer is listening on.
pt_br: Substitua _HOST_ pelo endereço IP do sistema executando o visualizador VNC de escuta e _PORTA_ pelo número da porta em que o visualizador VNC está escutando.

source: Start the installation. The system will initialize the installation program and start the necessary services. Once the initialization is finished, [application]*Anaconda* will attempt to connect to the IP address and port you provided in the previous step.
pt_br: Comece a instalação. O sistema inicializará o programa de instalação e iniciará os serviços necessários. Assim que a inicialização for concluída, o [application]*Anaconda* tentará se conectar ao endereço IP e à porta que você forneceu na etapa anterior.

source: Kickstart Considerations
pt_br: Considerações do kickstart

source: Commands for using a VNC installation are also available in Kickstart installations. Using just the [command]#vnc# command will set up an installation using Direct Mode. Options are available to set up an installation using Connect Mode. For more information about the [command]#vnc# command and options used in Kickstart files, see xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference].
pt_br: Os comandos para usar uma instalação com VNC também estão disponíveis nas instalações Kickstart. Usar apenas o comando [command]#vnc# configurará uma instalação usando o modo direto. As opções estão disponíveis para configurar uma instalação usando o modo conexão. Para obter mais informações sobre o comando [command]#vnc# e as opções usadas nos arquivos Kickstart, consulte xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Referência da sintaxe do Kickstart].

source: Considerations for Headless Systems
pt_br: Considerações para sistemas headless

source: When installing headless systems, the only choices are an automated Kickstart installation or an interactive VNC installation using connect mode. For more information about automated Kickstart installation, see xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference]. The general process for an interactive VNC installation is described below.
pt_br: Ao instalar sistemas headless, as únicas opções são uma instalação automatizada com Kickstart ou uma instalação interativa com VNC usando o modo conexão. Para obter mais informações sobre a instalação automatizada com Kickstart, consulte xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Referências da sintaxe do Kickstart]. O processo geral para uma instalação interativa com VNC é descrito abaixo.

source: Set up a PXE server that will be used to start the installation. Information about installing and performing basic configurating of a PXE server can be found in xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Setting Up an Installation Server].
pt_br: Configure um servidor PXE que será usado para iniciar a instalação. Informações sobre a instalação e execução da configuração básica de um servidor PXE podem ser encontradas em xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Configurando um servidor de instalação].

source: Configure the PXE server to use the boot options for a connect mode VNC installation. For information on these boot options, see xref:sect-vnc-installations-connect-mode[Installing in VNC Connect Mode].
pt_br: Configure o servidor PXE para usar as opções de inicialização para uma instalação VNC no modo de conexão. Para obter informações sobre essas opções de inicialização, consulte xref:sect-vnc-installations-connect-mode[Instalando no modo conexão de VNC].

source: Follow the procedure for a VNC Installation using connect mode as described in the xref:proc-vnc-installations-connect-mode[Starting VNC in Connect Mode]. However, when directed to boot the system, boot it from the PXE server.
pt_br: Siga o procedimento para uma instalação VNC usando o modo de conexão conforme descrito em xref:proc-vnc-installations-connect-mode[Iniciando VNC no modo conexão]. No entanto, quando instruído a inicializar o sistema, inicialize-o a partir do servidor PXE.
