Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/advanced/Boot_Options.po
Languages: pt_br

source: {PRODUCT} includes the [application]*Memtest86+* memory testing application. To start memory testing mode, choose Troubleshooting > `Memory test` at the boot menu. Testing will begin immediately. By default, [application]*Memtest86+* carries out ten tests in every pass; a different configuration can be specified by accessing the configuration screen using the kbd:[c] key. After the first pass completes, a message will appear at the bottom informing you of the current status, and another pass will start automatically.
pt_br: O {PRODUCT} inclui o aplicativo de teste de memória [application]*Memtest86+*. Para iniciar o modo de teste de memória, escolha Troubleshooting > `Memory test` no menu de inicialização. O teste começará imediatamente. Por padrão, [application]*Memtest86+* realiza dez testes em cada passagem; uma configuração diferente pode ser especificada acessando a tela de configuração usando a tecla kbd:[c]. Após a conclusão da primeira passagem, uma mensagem aparecerá na parte inferior informando sobre o status atual e outra passagem será iniciada automaticamente.

source: [application]*Memtest86+* only works on systems with BIOS firmware. Support for UEFI systems is currently unavailable.
pt_br: [application]*Memtest86+* só funciona em sistemas com firmware BIOS. O suporte para sistemas UEFI não está disponível no momento.

source: Memory Check Using Memtest86+
pt_br: Verificação de memória usando o Memtest86+

source: Memtest86+ testing the system memory
pt_br: Memtest86+ testando a memória do sistema

source: The main screen displayed while testing is in progress is divided into three main areas:
pt_br: A tela principal exibida durante o teste é dividida em três áreas principais:

source: The upper left corner shows information about your system's memory configuration - the amount of detected memory and processor cache and their throughputs and processor and chipset information. This information is detected when [application]*Memtest86+* starts.
pt_br: O canto superior esquerdo mostra informações sobre a configuração de memória do sistema – a quantidade de memória detectada e cache do processador e suas taxas de transferência e informações de processador e chipset. Esta informação é detectada quando o [application]*Memtest86+* é iniciado.

source: The upper right corner displays information about the tests - progress of the current pass and the currently running test in that pass as well as a description of the test.
pt_br: O canto superior direito exibe informações sobre os testes – progresso da aprovação atual e o teste em execução nessa passagem, bem como uma descrição do teste.

source: The central part of the screen is used to display information about the entire set of tests from the moment when the tool has started, such as the total time, the number of completed passes, number of detected errors and your test selection. On some systems, detailed information about the installed memory (such as the number of installed modules, their manufacturer, frequency and latency) will be also displayed here. After the each pass completes, a short summary will appear in this location. For example:
pt_br: A parte central da tela é usada para exibir informações sobre todo o conjunto de testes a partir do momento em que a ferramenta foi iniciada, como o tempo total, o número de passadas concluídas, o número de erros detectados e sua seleção de teste. Em alguns sistemas, informações detalhadas sobre a memória instalada (como o número de módulos instalados, seu fabricante, frequência e latência) também serão exibidas aqui. Após a conclusão de cada passagem, um breve resumo aparecerá neste local. Por exemplo:

source: If [application]*Memtest86+* detects an error, it will also be displayed in this area and highlighted red. The message will include detailed information such as which test detected a problem, the memory location which is failing, and others.
pt_br: Se [application]*Memtest86+* detectar um erro, ele também será exibido nesta área e destacado em vermelho. A mensagem incluirá informações detalhadas, como qual teste detectou um problema, o local da memória que está falhando e outros.

source: In most cases, a single successful pass (that is, a single run of all 10 tests) is sufficient to verify that your RAM is in good condition. In some rare circumstances, however, errors that went undetected on the first pass might appear on subsequent passes. To perform a thorough test on an important system, leave the tests running overnight or even for a few days in order to complete multiple passes.
pt_br: Na maioria dos casos, uma única passagem bem-sucedida (ou seja, uma única execução de todos os 10 testes) é suficiente para verificar se a RAM está em boas condições. Em algumas raras circunstâncias, no entanto, erros que não foram detectados na primeira passagem podem aparecer nas passagens subsequentes. Para realizar um teste completo em um sistema importante, deixe os testes em execução durante a noite ou mesmo por alguns dias para concluir várias passagens.

source: The amount of time it takes to complete a single full pass of [application]*Memtest86+* varies depending on your system's configuration (notably the RAM size and speed). For example, on a system with 2{nbsp}GB of DDR2 memory at 667{nbsp}MHz, a single pass will take roughly 20{nbsp}minutes to complete.
pt_br: A quantidade de tempo que leva para completar uma única passagem completa do [application]*Memtest86+* varia dependendo da configuração do seu sistema (notavelmente o tamanho da RAM e a velocidade). Por exemplo, em um sistema com 2{nbsp}GB de memória DDR2 667{nbsp}MHz, uma única passagem levará aproximadamente 20{nbsp}minutos para ser concluída.

source: To halt the tests and reboot your computer, press the kbd:[Esc] key at any time.
pt_br: Para interromper os testes e reiniciar o computador, pressione a tecla kbd:[Esc] a qualquer momento.

source: For more information about using [application]*Memtest86+*, see the official website at link:++https://www.memtest.org/++[]. A `README` file is also located in `/usr/share/doc/memtest86+-_version_pass:attributes[{blank}]/` on {PRODUCT} systems with the [package]*memtest86+* package installed.
pt_br: Para mais informações sobre o uso do [application]*Memtest86+*, veja o site oficial em link:++https://www.memtest.org/++[]. Um arquivo`README` também está localizado em `/usr/share/doc/memtest86+-_versão_pass:attributes[{blank}]/` em sistemas {PRODUCT} com o pacote [package]*memtest86+* instalado.

source: Verifying Boot Media
pt_br: Verificando a mídia de inicialização

source: You can test the integrity of an ISO-based installation source before using it to install {PRODUCT}. These sources include DVDs and ISO images stored on a local hard drive or NFS server. Verifying that the ISO images are intact before you attempt an installation helps to avoid problems that are often encountered during installation.
pt_br: Você pode testar a integridade de uma fonte de instalação baseada em ISO antes de usá-la para instalar o {PRODUCT}. Essas fontes incluem DVDs e imagens ISO armazenadas em um disco rígido local ou servidor NFS. Verificar se as imagens ISO estão intactas antes de tentar uma instalação ajuda a evitar problemas que são frequentemente encontrados durante a instalação.

source: To test the integrity of an ISO image, append the [option]#rd.live.check# to the boot loader command line. Note that this option is used automatically if you select the default installation option from the boot menu (`Test this media & install Fedora`).
pt_br: Para testar a integridade de uma imagem ISO, acrescente [option]#rd.live.check# à linha de comando do carregador de inicialização. Observe que esta opção é usada automaticamente se você selecionar a opção de instalação padrão no menu de inicialização (`Test this media & install Fedora`).

source: Booting Your Computer in Rescue Mode
pt_br: Inicializando seu computador em modo de recuperação

source: You may boot a command-line Linux system from an installation disc without actually installing {PRODUCT} on the computer. This enables you to use the utilities and functions of a running Linux system to modify or repair already installed operating systems.
pt_br: Você pode inicializar um sistema Linux de linha de comando a partir de um disco de instalação sem realmente instalar o {PRODUCT} no computador. Isso permite que você use os utilitários e funções de um sistema Linux em execução para modificar ou reparar sistemas operacionais já instalados.

source: To load the rescue system with the installation disk or USB drive, choose `Rescue a {PRODUCT} system` from the Troubleshooting submenu in the boot menu, or use the [option]#inst.rescue# boot option.
pt_br: Para carregar o sistema de recuperação com o disco de instalação ou unidade USB, escolha `Rescue a {PRODUCT} system` no submenu Troubleshooting no menu de inicialização ou use a opção de inicialização [option]#inst.rescue#.

source: Specify the language, keyboard layout and network settings for the rescue system with the screens that follow. The final setup screen configures access to the existing system on your computer.
pt_br: Especifique o idioma, o layout do teclado e as configurações de rede para o sistema de resgate com as telas a seguir. A tela de configuração final configura o acesso ao sistema existente em seu computador.

source: By default, rescue mode attaches an existing operating system to the rescue system under the directory `/mnt/sysimage/`.
pt_br: Por padrão, o modo de recuperação anexa um sistema operacional existente ao sistema de recuperação no diretório `/mnt/sysimage/`.
