Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/advanced/Boot_Options.po
Languages: pt_br

source: Boot Options
pt_br: Opções de inicialização

source: The [application]*Anaconda* installer includes a range of boot options for administrators, which modify the default behavior of the installation program by enabling or disabling certain functions. To use one or more boot options, you either have to boot from installation media and append these options at the boot menu (see xref:install/Booting_the_Installation.adoc#sect-boot-menu[The Boot Menu]), or you must add them into your PXE server configuration file if you are booting from a network (see xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Setting Up an Installation Server]).
pt_br: O instalador do [application]*Anaconda* inclui uma gama de opções de inicialização para administradores, que modificam o comportamento padrão do programa de instalação habilitando ou desabilitando certas funções. Para usar uma ou mais opções de inicialização, você deve inicializar a partir da mídia de instalação e anexar essas opções no menu de inicialização (consulte xref:install/Booting_the_Installation.adoc#sect-boot-menu[O menu de inicialização]) ou deve adicioná-los em seu arquivo de configuração do servidor PXE se você estiver inicializando de uma rede (consulte xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Configurando um servidor de instalação]).

source: You can use multiple options at the same time; in that case, separate them by a single space.
pt_br: Você pode usar várias opções ao mesmo tempo; nesse caso, separe-as por um único espaço.

source: There are two basic types of options described in this chapter:
pt_br: Existem dois tipos básicos de opções descritos neste capítulo:

source: Options presented as ending with an "equals" sign (`=`) require a value to be specified - they cannot be used on their own. For example, the [option]#inst.vncpassword=# option must also contain a value (in this case, a password). The correct form is therefore [option]#inst.vncpassword=pass:attributes[{blank}]_password_pass:attributes[{blank}]#. On its own, without a password specified, the option is invalid.
pt_br: As opções apresentadas terminando com um sinal de "igual" (`=`) exigem que um valor seja especificado – eles não podem ser usados por conta própria. Por exemplo, a opção [option]#inst.vncpassword=# também deve conter um valor (neste caso, uma senha). A forma correta é, portanto, [option]#inst.vncpassword=pass:attributes[{blank}]_password_pass:attributes[{blank}]#. Por si só, sem uma senha especificada, a opção é inválida.

source: Options presented without the "pass:attributes[{blank}]`=`pass:attributes[{blank}]" sign do not accept any values or parameters. For example, the [option]#rd.live.check# option forces [application]*Anaconda* to verify the installation media before starting the installation; if this option is present, the check will be performed, and if it is not present, the check will be skipped.
pt_br: As opções apresentadas sem o sinal "pass:attributes[{blank}]`=`pass:attributes[{blank}]" não aceitam quaisquer valores ou parâmetros. Por exemplo, a opção [option]#rd.live.check# força o [application]*Anaconda* a verificar a mídia de instalação antes de iniciar a instalação; se esta opção estiver presente, a verificação será realizada e, se não estiver presente, a verificação será ignorada.

source: In addition to the options described in this chapter, the boot prompt also accepts [application]*dracut* kernel options. A list of these options is available as the `dracut.cmdline(7)` man page.
pt_br: Além das opções descritas neste capítulo, o prompt de inicialização também aceita as opções de kernel [application]*dracut*. Uma lista dessas opções está disponível na página man `dracut.cmdline(7)`.

source: Boot options specific to the installation program always start with `inst.` in this guide. Currently, this prefix is optional - for example, [option]#resolution=1024x768# will work exactly the same as [option]#inst.resolution=1024x768#. However, it is expected that the `inst.` prefix will be mandatory in future releases.
pt_br: As opções de inicialização específicas para o programa de instalação sempre começam com `inst` neste guia. Atualmente, este prefixo é opcional – por exemplo, [option]#resolution=1024x768# funcionará exatamente da mesma forma que [option]#inst.resolution=1024x768#. No entanto, espera-se que o prefixo `inst` seja obrigatório em versões futuras.

source: Configuring the Installation System at the Boot Menu
pt_br: Configurando o sistema de instalação no menu de inicialização

source: The exact way to specify custom boot options is differs based on your system's architecture, firmware and the method you use to boot the installation. If you are booting from local media, you can specify options in the boot menu, before you begin the installation; if you are booting from a network using a PXE server, you must add boot options into the boot loader configuration file before you boot the installation system. For specific instructions, see xref:install/Booting_the_Installation.adoc#sect-boot-menu[The Boot Menu] if you are booting from local media, and xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Setting Up an Installation Server] if you are booting from a server.
pt_br: A maneira exata de especificar opções de inicialização personalizadas difere com base na arquitetura do seu sistema, firmware e o método que você usa para inicializar a instalação. Se estiver inicializando a partir da mídia local, você pode especificar opções no menu de inicialização, antes de iniciar a instalação; se estiver inicializando de uma rede usando um servidor PXE, você deve adicionar opções de inicialização ao arquivo de configuração do carregador de inicialização antes de inicializar o sistema de instalação. Para obter instruções específicas, consulte xref:install/Booting_the_Installation.adoc#sect-boot-menu[O menu de inicialização] se você estiver inicializando a partir da mídia local e xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Configurando um servidor de instalação] se estiver inicializando a partir de um servidor.

source: Available Boot Options
pt_br: Opções de inicialização disponíveis

source: The following options are available in {PRODUCT}:
pt_br: As seguintes opções estão disponíveis no {PRODUCT}:

source: Specifying the Installation Source
pt_br: Especificando a fonte de instalação

source: Specifies the installation source - that is, a location where the installation program can find the images and packages it requires. For example:
pt_br: Especifica a fonte de instalação – ou seja, um local onde o programa de instalação pode encontrar as imagens e pacotes de que necessita. Por exemplo:

source: The source must be either:
pt_br: A fonte deve ser:

source: an installable tree, which is a directory structure containing the installation program's images, packages and repodata as well as a valid `.treeinfo` file
pt_br: uma árvore instalável, que é uma estrutura de diretório contendo as imagens, pacotes e repodados do programa de instalação, bem como um arquivo `.treeinfo` válido

source: a DVD (a physical disk present in the system's DVD drive)
pt_br: um DVD (um disco físico presente na unidade de DVD do sistema)

source: an ISO image of the full {PRODUCT} installation DVD, placed on a hard drive or a network location accessible from the installation system
pt_br: uma imagem ISO do DVD de instalação completo do {PRODUCT}, colocado em um disco rígido ou um local de rede acessível a partir do sistema de instalação

source: This option allows for the configuration of different installation methods using different formats. The syntax is described in the table below.
pt_br: Esta opção permite a configuração de diferentes métodos de instalação usando diferentes formatos. A sintaxe é descrita na tabela a seguir.

source: Installation Sources
pt_br: Fontes de instalação

source: |Installation source|Option format |Any CD/DVD drive|[option]#inst.repo=cdrom# |Specific CD/DVD drive|[option]#inst.repo=cdrom:pass:attributes[{blank}]_device_pass:attributes[{blank}]# |Hard Drive|[option]#inst.repo=hd:pass:attributes[{blank}]_device_:/pass:attributes[{blank}]_path_pass:attributes[{blank}]# |HTTP Server|[option]#inst.repo=http://pass:attributes[{blank}]_host_pass:attributes[{blank}]/pass:attributes[{blank}]_path_pass:attributes[{blank}]# |HTTPS Server|[option]#inst.repo=https://pass:attributes[{blank}]_host_pass:attributes[{blank}]/pass:attributes[{blank}]_path_pass:attributes[{blank}]# |FTP Server|[option]#inst.repo=ftp://pass:attributes[{blank}]_username_:pass:attributes[{blank}]_password_pass:attributes[{blank}]@pass:attributes[{blank}]_host_pass:attributes[{blank}]/pass:attributes[{blank}]_path_pass:attributes[{blank}]# |NFS Server|[option]#inst.repo=nfs:[pass:attributes[{blank}]_options_:]pass:attributes[{blank}]_server_:/pass:attributes[{blank}]_path_pass:attributes[{blank}]# footnote:[This option uses NFS protocol version 3 by default. To use a different version, add [option]#+nfsvers=pass:attributes[{blank}]_X_pass:attributes[{blank}]# to _options_.]
pt_br: |Fonte de instalação|Formato da opção |Qualquer unidade de CD/DVD|[option]#inst.repo=cdrom# |Unidade de CD/DVD específica|[option]#inst.repo=cdrom:pass:attributes[{blank}]_dispositivo_:attributes[{blank}]# |Disco rígido|[option]#inst.repo=hd:pass:attributes[{blank}]_dispositivo_:/pass:attributes[{blank}]_caminho_pass:attributes[{blank}]# |Servidor HTTP|[option]#inst.repo=http://pass:attributes[{blank}]_host_pass:attributes[{blank}]/pass:attributes[{blank}]_caminho_pass:attributes[{blank}]# |Servidor HTTPS|[option]#inst.repo=https://pass:attributes[{blank}]_host_pass:attributes[{blank}]/pass:attributes[{blank}]_caminho_pass:attributes[{blank}]# |Servidor FTP|[option]#inst.repo=ftp://pass:attributes[{blank}]_usuário_:pass:attributes[{blank}]_senha_pass:attributes[{blank}]@pass:attributes[{blank}]_host_pass:attributes[{blank}]/pass:attributes[{blank}]_caminho_pass:attributes[{blank}]# |Servidor NFS|[option]#inst.repo=nfs:[pass:attributes[{blank}]_opções_:]pass:attributes[{blank}]_servidor_:/pass:attributes[{blank}]_caminho_pass:attributes[{blank}]# footnote:[Esta opção usa o protocolo NFS versão 3 por padrão. Para usar uma versão diferente, adicione [option]#+nfsvers=pass:attributes[{blank}]_X_pass:attributes[{blank}]# Às _opções_.]

source: Disk device names may be specified using the following formats:
pt_br: Os nomes dos dispositivos de disco podem ser especificados usando os seguintes formatos:

source: Kernel device name, for example `/dev/sda1` or `sdb2`
pt_br: Nome do dispositivo de kernel, por exemplo, `/dev/sda1` ou `sdb2`

source: File system label, for example `LABEL=Flash` or `LABEL=RHEL7`
pt_br: Rótulo do sistema de arquivos, por exemplo, `LABEL=Flash` ou `LABEL=RHEL7`

source: File system UUID, for example `UUID=8176c7bf-04ff-403a-a832-9557f94e61db`
pt_br: UUID do sistema de arquivos, por exemplo, `UUID=8176c7bf-04ff-403a-a832-9557f94e61db`

source: Non-alphanumeric characters must be represented as `\xpass:attributes[{blank}]_NN_pass:attributes[{blank}]`, where _NN_ is the hexadecimal representation of the character. For example, `\x20` is a white space ("").
pt_br: Os caracteres não alfanuméricos devem ser representados como `\xpass:attributes[{blank}]_NN_pass:attributes[{blank}]`, onde _NN_ é a representação hexadecimal do caractere. Por exemplo, `\x20` é um espaço em branco (" ").

source: Specifies the location of the installation program runtime image to be loaded. The syntax is the same as in xref:tabl-boot-options-sources[Installation Sources]. This option expects a path to a directory containing a valid `.treeinfo` file; the location of the runtime image will be read from this file if found. If a `.treeinfo` file is not available, [application]*Anaconda* will try to load the image from `LiveOS/squashfs.img`.
pt_br: Especifica a localização da imagem de tempo de execução do programa de instalação a ser carregada. A sintaxe é a mesma de xref:tabl-boot-options-sources[Fontes de instalação]. Esta opção espera um caminho para um diretório contendo um arquivo `.treeinfo` válido; a localização da imagem de tempo de execução será lida a partir deste arquivo, se encontrada. Se um arquivo `.treeinfo` não estiver disponível, o [application]*Anaconda* tentará carregar a imagem de `LiveOS/squashfs.img`.

source: By default, this boot option is used on the installation media and set to a specific label (for example, [option]#inst.stage2=hd:LABEL=F21\x20Server.x86_64#). If you modify the default label of the file system containing the runtime image, you must also edit this option to match the new label.
pt_br: Por padrão, esta opção de inicialização é usada na mídia de instalação e definida para um rótulo específico (por exemplo, [option]#inst.stage2=hd:LABEL=F21\x20Server.x86_64#). Se você modificar o rótulo padrão do sistema de arquivos que contém a imagem do tempo de execução, também deverá editar essa opção para corresponder ao novo rótulo.

source: With this boot option, the stage 2 image will be fetched from HTTP, HTTPS and FTP locations which are specified using the [option]#inst.stage2=# option sequentially in the order they are specified, until the image is successfully fetched. All other locations will be ignored.
pt_br: Com esta opção de inicialização, a imagem do estágio 2 será buscada nos locais HTTP, HTTPS e FTP que são especificados usando a opção [option]#inst.stage2=# sequencialmente na ordem em que são especificadas, até que a imagem seja buscada com sucesso. Todos os outros locais serão ignorados.

source: If you need to perform a driver update during the installation, use the [option]#inst.dd=# option. It can be used multiple times. The location of a driver RPM package can be specified using any of the formats described in xref:tabl-boot-options-sources[Installation Sources]. With the exception of the [option]#inst.dd=cdrom# option, the device name must always be specified. For example:
pt_br: Se você precisar realizar uma atualização de driver durante a instalação, use a opção [option]#inst.dd=#. Ela pode ser usada várias vezes. A localização de um pacote RPM de driver pode ser especificada usando qualquer um dos formatos descritos em xref:tabl-boot-options-sources[Fontes de instalação]. Com exceção da opção [option]#inst.dd=cdrom#, o nome do dispositivo deve sempre ser especificado. Por exemplo:

source: Using this option without any parameters (only as [option]#inst.dd#) will prompt the installation program to ask you for a driver update disk with an interactive menu.
pt_br: Usar esta opção sem nenhum parâmetro (apenas como [option]#inst.dd#) solicitará que o programa de instalação solicite um disco de atualização de driver com um menu interativo.

source: You should never attempt to perform a driver update during the installation unless a missing our faulty driver is preventing you from completing the installation. Updating drivers which are not essential during the installation should always be performed after the system is installed.
pt_br: Você nunca deve tentar realizar uma atualização de driver durante a instalação, a menos que a falta de um driver defeituoso o esteja impedindo de concluir a instalação. A atualização de drivers que não são essenciais durante a instalação deve sempre ser realizada após a instalação do sistema.

source: Prevents the installer from trying to automatically configure an installation source.
pt_br: Evita que o instalador tente configurar automaticamente uma fonte de instalação.

source: Normally, when you first enter the `Installation Summary` screen, the installer will attempt to configure an installation source based on the type of media you used to boot. The full {PRODUCT} Server DVD will configure the source as local media, the netinst ISO image will configure the closest network mirror, etc. This process takes time; therefore, if you plan to use a different source than the default, this option will allow you to enter the `Installation Source` screen immediately without having to wait for the initial configuration to finish.
pt_br: Normalmente, quando você entra pela primeira vez na tela `Resumo da Instalação`, o instalador tentará configurar uma fonte de instalação com base no tipo de mídia que você usou para inicializar. O DVD completo do {PRODUCT} Server configurará a fonte como mídia local, a imagem ISO netinst configurará o espelho de rede mais próximo, etc. Este processo leva tempo; portanto, se você planeja usar uma fonte diferente da padrão, esta opção permitirá que você entre na tela `Fonte de instalação` imediatamente, sem ter que esperar que a configuração inicial termine.

source: Using this option will leave the installation source configuration in an error state - you must manually specify a source in the `Installation Source` screen to proceed with the installation. Alternatively, you can use the [option]#inst.repo=# option described above to configure a specific source directly in the boot menu.
pt_br: Usar esta opção deixará a configuração da fonte de instalação em um estado de erro – você deve especificar manualmente uma fonte na tela `Fonte de instalação` para continuar com a instalação. Alternativamente, você pode usar a opção [option]#inst.repo=# descrita acima para configurar uma fonte específica diretamente no menu de inicialização.

source: Kickstart Boot Options
pt_br: Opções de inicialização do Kickstart

source: Gives the location of a Kickstart file to be used to automate the installation. Locations can be specified using any of the formats valid for [option]#inst.repo=#. See xref:tabl-boot-options-sources[Installation Sources] for valid formats.
pt_br: Fornece a localização de um arquivo Kickstart a ser usado para automatizar a instalação. Os locais podem ser especificados usando qualquer um dos formatos válidos para [option]#inst.repo=#. Veja xref:tabl-boot-options-sources[Fontes de instalação] para formatos válidos.

source: If you only specify a device and not a path, the installation program will look for the Kickstart file in `/ks.cfg` on the specified device. If you use this option without specifying a device, the installation program will use the following:
pt_br: Se você especificar apenas um dispositivo e não um caminho, o programa de instalação irá procurar o arquivo Kickstart em `/ks.cfg` no dispositivo especificado. Se você usar esta opção sem especificar um dispositivo, o programa de instalação usará o seguinte:

source: In the above example, _next-server_ is the DHCP `next-server` option or the IP address of the DHCP server itself, and _filename_ is the DHCP `filename` option, or `/kickstart/`. If the given file name ends with the `/` character, `pass:attributes[{blank}]_ip_-kickstart` is appended. For example:
pt_br: No exemplo acima, _next-server_ é a opção `next-server` do DHCP ou o endereço IP do próprio servidor DHCP, e _filename_ é a opção `filename` do DHCP, ou `/kickstart/`. Se o nome do arquivo fornecido terminar com o caractere `/`, `pass:attributes[{blank}]_ip_-kickstart` é anexado. Por exemplo:

source: Default Kickstart File Location
pt_br: Localização padrão do arquivo Kickstart

source: |DHCP server address|Client address|Kickstart file location |`192.168.122.1`|`192.168.122.100`|`192.168.122.1`:pass:attributes[{blank}]`/kickstart/192.168.122.100-kickstart`
pt_br: |Endereço do servidor DHCP|Endereço do cliente|Localização do arquivo Kickstart |`192.168.122.1`|`192.168.122.100`|`192.168.122.1`:pass:attributes[{blank}]`/kickstart/192.168.122.100-kickstart`

source: With this boot option, the Kickstart file will be fetched from HTTP, HTTPS and FTP locations which are specified using the [option]#inst.ks=# option sequentially in the order they are specified, until the file is successfully fetched. All other locations will be ignored.
pt_br: Com esta opção de inicialização, o arquivo Kickstart será obtido dos locais HTTP, HTTPS e FTP que são especificados usando a opção [option]#inst.ks=# sequencialmente na ordem em que são especificados, até que o arquivo seja obtido com sucesso. Todos os outros locais serão ignorados.

source: Adds headers to outgoing `HTTP` requests with the MAC addresses of all network interfaces. For example:
pt_br: Adiciona cabeçalhos às solicitações `HTTP` de saída com os endereços MAC de todas as interfaces de rede. Por exemplo:

source: This can be useful when using [option]#inst.ks=http# to provision systems.
pt_br: Isso pode ser útil ao usar [option]#inst.ks=http# para provisionar sistemas.

source: Adds a header to outgoing `HTTP` requests. This header will contain the system's serial number, read from `/sys/class/dmi/id/product_serial`. The header has the following syntax:
pt_br: Adiciona um cabeçalho para solicitações `HTTP` de saída. Este cabeçalho conterá o número de série do sistema, lido em `/sys/class/dmi/id/product_serial`. O cabeçalho possui a seguinte sintaxe:

source: Console, Environment and Display Options
pt_br: Opções de console, ambiente e exibição

source: This kernel option specifies a device to be used as the primary console. For example, to use a console on the first serial port, use [option]#console=ttyS0#. This option should be used along with the [option]#inst.text# option.
pt_br: Esta opção de kernel especifica um dispositivo a ser usado como console principal. Por exemplo, para usar um console na primeira porta serial, use [option]#console=ttyS0#. Esta opção deve ser usada junto com a opção [option]#inst.text#.

source: You can use this option multiple times. In that case, the boot message will be displayed on all specified consoles, but only the last one will be used by the installation program afterwards. For example, if you specify [option]#console=ttyS0 console=ttyS1#, the installation program will only use `ttyS1`.
pt_br: Você pode usar esta opção várias vezes. Nesse caso, a mensagem de inicialização será exibida em todos os consoles especificados, mas apenas o último será usado pelo programa de instalação posteriormente. Por exemplo, se você especificar [option]#console=ttyS0 console=ttyS1#, o programa de instalação usará apenas `ttyS1`.

source: Disables access to the root shell during the installation. This is useful with automated (Kickstart) installations - if you use this option, a user can watch the installation progress, but they cannot interfere with it by accessing the root shell by pressing kbd:[Ctrl + Alt + F2].
pt_br: Desabilita o acesso ao shell de root durante a instalação. Isso é útil com instalações automatizadas (Kickstart) – se você usar esta opção, um usuário pode observar o progresso da instalação, mas não pode interferir acessando o shell do root pressionando kbd:[Ctrl + Alt + F2].

source: Sets the language to be used during the installation. Language codes are the same as the ones used in the [command]#lang# Kickstart command as described in xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-lang[lang (optional) - Configure Language During Installation]. On systems where the [package]*system-config-language* package is installed, a list of valid values can also be find in `/usr/share/system-config-language/locale-list`.
pt_br: Define o idioma a ser usado durante a instalação. Os códigos de idioma são iguais aos usados no comando [command]#lang# do Kickstart, conforme descrito em xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-comandos-lang[lang (opcional) - Configurar idioma durante a instalação]. Em sistemas onde o pacote [package]*system-config-language* está instalado, uma lista de valores válidos também pode ser encontrada em `/usr/share/system-config-language/locale-list`.
