Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/advanced/Boot_Options.po
Languages: pt_br

source: If you perform the installation interactively, the language you specified using this option will be selected by default, but you will still be able to change it at the beginning of the graphical installation.
pt_br: Se você executar a instalação interativamente, o idioma que você especificou usando esta opção será selecionado por padrão, mas você ainda poderá alterá-lo no início da instalação gráfica.

source: Allows you to run the installation in single language mode - in other words, this option disables language selection for the installer and the installed system. If you also use the [option]#inst.lang=# option at the same time, the language you specify will be used. If you do not set the language, [application]*Anaconda* and the installed system will default to `en-US.UTF-8`.
pt_br: Permite que você execute a instalação no modo de um único idioma – em outras palavras, esta opção desativa a seleção do idioma para o instalador e o sistema instalado. Se você também usar a opção [option]#inst.lang=# ao mesmo tempo, o idioma que você especificar será usado. Se você não definir o idioma, o [application]*Anaconda* e o sistema instalado usarão como padrão `en-US.UTF-8`.

source: Configures geolocation usage in the installation program. Geolocation is used to pre-set the language and time zone, and uses the following syntax: [option]#inst.geoloc=pass:attributes[{blank}]_value_pass:attributes[{blank}]#
pt_br: Configura o uso de geolocalização no programa de instalação. A geolocalização é usada para predefinir o idioma e o fuso horário e usa a seguinte sintaxe: [option]#inst.geoloc=pass:attributes[{blank}]_valor_pass:attributes[{blank}]#

source: The _value_ parameter can be any of the following:
pt_br: O parâmetro _valor_ pode ser qualquer um dos seguintes:

source: Valid Values for the inst.geoloc Option
pt_br: Valores válidos para a opção inst.geoloc

source: |Disable geolocation|[option]#inst.geoloc=0# |Use the Fedora GeoIP API|[option]#inst.geoloc=provider_fedora_geoip# |Use the Hostip.info GeoIP API|[option]#inst.geoloc=provider_hostip#
pt_br: |Desabilitar geolocalização|[option]#inst.geoloc=0# |Usar a API GeoIP do Fedora|[option]#inst.geoloc=provider_fedora_geoip# |Usar a API GeoIP de Hostip.info|[option]#inst.geoloc=provider_hostip#

source: If this option is not specified, [application]*Anaconda* will use `provider_fedora_geoip`.
pt_br: Se esta opção não for especificada, o [application]*Anaconda* vai usar `provider_fedora_geoip`.

source: Specifies the keyboard layout to be used by the installation program. Layout codes are the same as the ones used in the [command]#keyboard# Kickstart command as described in xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-keyboard[keyboard (optional) - Configure Keyboard Layouts].
pt_br: Especifica o layout do teclado a ser usado pelo programa de instalação. Os códigos de layout são iguais aos usados no comando [command]#keyboard# do Kickstart, conforme descrito em xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-keyboard[keyboard (opcional) - Configurar layouts de teclado].

source: Forces the installation program to run in text mode instead of graphical mode. The text user interface is limited, for example, it does not allow you to modify the partition layout or set up LVM. When installing a system on a machine with a limited graphical capabilities, it is recommended to use VNC as described in xref:sect-boot-options-vnc[Enabling Remote Access Using VNC].
pt_br: Força o programa de instalação a ser executado no modo texto em vez do modo gráfico. A interface de usuário de texto é limitada, por exemplo, não permite que você modifique o layout da partição ou configure LVM. Ao instalar um sistema em uma máquina com recursos gráficos limitados, é recomendado usar o VNC conforme descrito em xref:sect-boot-options-vnc[Habilitando acesso remoto usando VNC].

source: Forces the installation program to run in command line mode. This mode does not allow any interaction, all options must be specified in a Kickstart file or on the command line.
pt_br: Força o programa de instalação a ser executado no modo de linha de comando. Este modo não permite nenhuma interação, todas as opções devem ser especificadas em um arquivo Kickstart ou na linha de comando.

source: Forces the installation program to run in graphical mode. This mode is the default.
pt_br: Força o programa de instalação a ser executado no modo gráfico. Este modo é o padrão.

source: Specifies the screen resolution in graphical mode. The format is _N_pass:attributes[{blank}]xpass:attributes[{blank}]_M_, where _N_ is the screen width and _M_ is the screen height (in pixels). The lowest supported resolution is `800x600`.
pt_br: Especifica a resolução da tela no modo gráfico. O formato é _N_pass:attributes[{blank}]xpass:attributes[{blank}]_M_, onde _N_ é a largura da tela e _M_ é a altura da tela (em pixels). A resolução mais baixa suportada é `800x600`.

source: Specifies the name of the `X` driver to be used both during the installation and on the installed system.
pt_br: Especifica o nome do driver `X` a ser usado durante a instalação e no sistema instalado.

source: Tells the installation program to use the frame buffer `X` driver instead of a hardware-specific driver. This option is equivalent to [option]#inst.xdriver=fbdev#.
pt_br: Diz ao programa de instalação para usar o driver `X` do buffer de quadros em vez de um driver específico de hardware. Esta opção é equivalente a [option]#inst.xdriver=fbdev#.

source: Specifies a timeout period (in seconds) the installer will wait before starting the [application]*X* server.
pt_br: Especifica um período de tempo limite (em segundos) que o instalador aguardará antes de iniciar o servidor [application]*X*.

source: Blacklists (completely disables) one or more drivers. Drivers (mods) disabled using this option will be prevented from loading when the installation starts, and after the installation finishes, the installed system will keep these settings. The blacklisted drivers can then be found in the `/etc/modprobe.d/` directory.
pt_br: Coloca em uma lista negra (isto é, desativa completamente) um ou mais drivers. Os drivers (mods) desabilitados com esta opção serão impedidos de carregar quando a instalação começar e, após o término da instalação, o sistema instalado manterá essas configurações. Os drivers da lista negra podem ser encontrados no diretório `/etc/modprobe.d/`.

source: Use a comma-separated list to disable multiple drivers. For example:
pt_br: Use uma lista separada por vírgulas para desativar vários drivers. Por exemplo:

source: Starts the `sshd` service during the installation, which allows you to connect to the system during the installation using `SSH` and monitor its progress. For more information on `SSH`, see the `ssh(1)` man page and the corresponding chapter in the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
pt_br: Inicia o serviço `sshd` durante a instalação, o que permite que você se conecte ao sistema durante a instalação usando `SSH` e monitore seu progresso. Para obter mais informações sobre o `SSH`, consulte a página man `ssh(1)` e o capítulo correspondente no [citetitle]_{PRODUCT} System Administrator's Guide_ (guia do administrador de sistema), disponível em link:++https://docs.fedoraproject.org/++[].

source: During the installation, the `root` account has no password by default. You can set a root password to be used during the installation with the [command]#sshpw# Kickstart command as described in xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-sshpw[sshpw (optional) - Restrict ssh Access During Installation].
pt_br: Durante a instalação, a conta `root` não tem senha por padrão. Você pode definir uma senha root a ser usada durante a instalação com o comando [command]#sshpw# do Kickstart, conforme descrito em xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-sshpw[sshpw (opcional) - Restringir o acesso ssh durante a instalação].

source: Starting with Fedora 27, the graphical installer window has no decorations. Use this option to enable window decorations again.
pt_br: A partir do Fedora 27, a janela do instalador gráfico não tem decorações. Use esta opção para habilitar as decorações das janelas novamente.

source: Network Boot Options
pt_br: Opções de inicialização de rede

source: Initial network initialization is handled by [application]*dracut*. This section only lists some of the more commonly used options; for a complete list, see the `dracut.cmdline(7)` man page. Additional information on networking is also available in the [citetitle]_{PRODUCT} Networking Guide_, available at link:++https://docs.fedoraproject.org/++[].
pt_br: A inicialização inicial da rede é feita pelo [application]*dracut*. Esta seção lista apenas algumas das opções mais comumente usadas; para uma lista completa, consulte a página man `dracut.cmdline(7)`. Informações adicionais sobre rede também estão disponíveis no [citetitle]_{PRODUCT} Networking Guide_ (guia de rede), disponível em link:++https://docs.fedoraproject.org/++[].

source: Configures one or more network interfaces. To configure multiple interfaces, use the `ip` option multiple times - once for each interface. If multiple interfaces are configured, you must specify a primary boot interface using the [option]#bootdev# option described below.
pt_br: Configura uma ou mais interfaces de rede. Para configurar várias interfaces, use a opção `ip` várias vezes – uma para cada interface. Se várias interfaces forem configuradas, você deve especificar uma interface de inicialização primária usando a opção [option]#bootdev# descrita abaixo.

source: The following table lists valid values for this option:
pt_br: A tabela a seguir lista os valores válidos para esta opção:

source: Network Interface Configuration Formats
pt_br: Formatos de configuração de interface de rede

source: |Configuration Method|Option format |Automatic configuration of any interface|[option]#ip=pass:attributes[{blank}]_method_pass:attributes[{blank}]# |Automatic configuration of a specific interface|[option]#ip=pass:attributes[{blank}]_interface_:pass:attributes[{blank}]_method_pass:attributes[{blank}]# |Static configuration|[option]#ip=pass:attributes[{blank}]_ip_::pass:attributes[{blank}]_gateway_:pass:attributes[{blank}]_netmask_:pass:attributes[{blank}]_hostname_:pass:attributes[{blank}]_interface_:none# |Automatic configuration of a specific interface with an override footnote:[Brings up the specified interface using the specified method of automatic configuration, such as `dhcp`, but overrides the automatically obtained IP address, gateway, netmask, hostname or other specified parameter. All parameters are optional; only specify the ones you wish to override and automatically obtained values will be used for the others.]|[option]#ip=pass:attributes[{blank}]_ip_::pass:attributes[{blank}]_gateway_:pass:attributes[{blank}]_netmask_:pass:attributes[{blank}]_hostname_:pass:attributes[{blank}]_interface_:pass:attributes[{blank}]_method_:pass:attributes[{blank}]_mtu_pass:attributes[{blank}]#
pt_br: |Método de configuração|Formato da opção |Configuração automática de alguma interface|[option]#ip=pass:attributes[{blank}]_método_pass:attributes[{blank}]# |Configuração automática de um interface específica|[option]#ip=pass:attributes[{blank}]_interface_:pass:attributes[{blank}]_método_pass:attributes[{blank}]# |Configuração estática|[option]#ip=pass:attributes[{blank}]_ip_::pass:attributes[{blank}]_gateway_:pass:attributes[{blank}]_máscara-de-rede_:pass:attributes[{blank}]_nome-do-host_:pass:attributes[{blank}]_interface_:none# |Configuração automática uma interface específica com uma substituição footnote:[Abre a interface especificada usando o método especificado de configuração automática, como `dhcp`, mas substitui o endereço IP obtido automaticamente, gateway, máscara de rede, nome do host ou outro parâmetro especificado. Todos os parâmetros são opcionais; especifique apenas aqueles que deseja substituir e os valores obtidos automaticamente serão usados para os outros.]|[option]#ip=pass:attributes[{blank}]_ip_::pass:attributes[{blank}]_gateway_:pass:attributes[{blank}]_máscara-d-rede_:pass:attributes[{blank}]_nome-do-host_:pass:attributes[{blank}]_interface_:pass:attributes[{blank}]_método_:pass:attributes[{blank}]_mtu_pass:attributes[{blank}]#

source: The [option]#method# parameter can be any the following:
pt_br: O parâmetro [option]#method# pode ser algum dos seguintes:

source: Automatic Interface Configuration Methods
pt_br: Métodos de configuração automática de interface

source: |Automatic configuration method|Value |DHCP|`dhcp` |IPv6 DHCP|`dhcp6` |IPv6 automatic configuration|`auto6` |iBFT (iSCSI Boot Firmware Table)|`ibft`
pt_br: |Método de configuração automática|Valor |DHCP|`dhcp` |DHCP IPv6|`dhcp6` |Configuração automática IPv6|`auto6` |iBFT (iSCSI Boot Firmware Table)|`ibft`

source: If you use a boot option which requires network access, such as [option]#inst.ks=http://pass:attributes[{blank}]_host_:/pass:attributes[{blank}]_path_pass:attributes[{blank}]#, without specifying the [option]#ip# option, the installation program will use [option]#ip=dhcp#.
pt_br: Se você usar uma opção de inicialização que requer acesso à rede, como [option]#inst.ks=http://pass:attributes[{blank}]_host_:/pass:attributes[{blank}]_caminho_pass:attributes[{blank}]#, sem especificar a opção [option]#ip#, o programa de instalação usará [option]#ip=dhcp#.

source: In the above tables, the _ip_ parameter specifies the client's IP address. `IPv6` addresses can be specified by putting them in square brackets, for example, `[2001:DB8::1]`.
pt_br: Nas tabelas acima, o parâmetro _ip_ especifica o endereço IP do cliente. Endereços `IPv6` podem ser especificados colocando-os entre colchetes, por exemplo, `[2001:DB8::1]`.

source: The _gateway_ parameter is the default gateway. IPv6 addresses are accepted here as well.
pt_br: O parâmetro _gateway_ é o gateway padrão. Os endereços IPv6 também são aceitos aqui.

source: The _netmask_ parameter is the netmask to be used. This can either be a full netmask (for example `255.255.255.0`) or a prefix (for example `64`).
pt_br: O parâmetro _máscara-de-rede_ é a máscara de rede a ser usada. Pode ser uma máscara de rede completa (por exemplo, `255.255.255.0`) ou um prefixo (por exemplo, `64`).

source: The _hostname_ parameter is the host name of the client system. This parameter is optional.
pt_br: O parâmetro _nome-do-host_ é o nome do host do sistema cliente. Este parâmetro é opcional.

source: Specifies the address of the name server. This option can be used multiple times.
pt_br: Especifica o endereço do servidor de nomes. Esta opção pode ser usada várias vezes.

source: Specifies the boot interface. This option is mandatory if you use more than one [option]#ip# option.
pt_br: Especifica a interface de inicialização. Esta opção é obrigatória se você usar mais de uma opção [option]#ip#.

source: Assigns a given interface name to a network device with a given MAC address. Can be used multiple times. The syntax is [option]#ifname=pass:attributes[{blank}]_interface_:pass:attributes[{blank}]_MAC_pass:attributes[{blank}]#. For example:
pt_br: Atribui um determinado nome de interface a um dispositivo de rede com um determinado endereço MAC. Pode ser usado várias vezes. A sintaxe é [option]#ifname=pass:attributes[{blank}]_interface_:pass:attributes[{blank}]_MAC_pass:attributes[{blank}]#. Por exemplo:

source: Specifies the DHCP vendor class identifier. The `dhcpd` service will see this value as `vendor-class-identifier`. The default value is `anaconda-$(uname -srm)`.
pt_br: Especifica o identificador de classe do fornecedor DHCP. O serviço `dhcpd` verá este valor como `vendor-class-identifier`. O valor padrão é `anaconda-$(uname -srm)`.

source: Sets up a Virtual LAN (VLAN) device on a specified interface with a given name. The syntax is [option]#vlan=pass:attributes[{blank}]_name_:pass:attributes[{blank}]_interface_pass:attributes[{blank}]#. For example:
pt_br: Configura um dispositivo de LAN virtual (VLAN) em uma interface especificada com um determinado nome. A sintaxe é [option]#vlan=pass:attributes[{blank}]_nome_:pass:attributes[{blank}]_interface_pass:attributes[{blank}]#. Por exemplo:

source: The above will set up a VLAN device named `vlan5` on the `em1` interface. The _name_ can take the following forms:
pt_br: O acima irá configurar um dispositivo VLAN chamado `vlan5` na interface `em1`. O _nome_ pode assumir as seguintes formas:

source: VLAN Device Naming Conventions
pt_br: Convenções de nomenclatura de dispositivos VLAN

source: |Naming scheme|Example |VLAN_PLUS_VID|`vlan0005` |VLAN_PLUS_VID_NO_PAD|`vlan5` |DEV_PLUS_VID|`em1.0005`. |DEV_PLUS_VID_NO_PAD|`em1.5`.
pt_br: |Esquema de nomenclatura|Exemplo |VLAN_PLUS_VID|`vlan0005` |VLAN_PLUS_VID_NO_PAD|`vlan5` |DEV_PLUS_VID|`em1.0005`. |DEV_PLUS_VID_NO_PAD|`em1.5`.

source: Set up a bonding device with the following syntax: [option]#bond=pass:attributes[{blank}]_name_pass:attributes[{blank}][:pass:attributes[{blank}]_slaves_pass:attributes[{blank}]][:pass:attributes[{blank}]_options_pass:attributes[{blank}]]#. Replace _name_ with the bonding device name, _slaves_ with a comma-separated list of physical (ethernet) interfaces, and _options_ with a comma-separated list of bonding options. For example:
pt_br: Configura um dispositivo de ligação com a seguinte sintaxe: [option]#bond=pass:attributes[{blank}]_nome_pass:attributes[{blank}][:pass:attributes[{blank}]_escravos_pass:attributes[{blank}]][:pass:attributes[{blank}]_opções_pass:attributes[{blank}]]#. Substitua _nome_ pelo nome do dispositivo de bond, _escravos_ por uma lista separada por vírgulas de interfaces físicas (ethernet) e _opções_ por uma lista separada por vírgulas de opções de bond. Por exemplo:

source: For a list of available options, execute the [command]#modinfo bonding# command.
pt_br: Para obter uma lista das opções disponíveis, execute o comando [command]#modinfo bonding#.

source: Using this option without any parameters will assume [option]#bond=bond0:eth0,eth1:mode=balance-rr#.
pt_br: Usar esta opção sem quaisquer parâmetros presumirá [option]#bond=bond0:eth0,eth1:mode=balance-rr#.

source: Set up a team device with the following syntax: [option]#team=pass:attributes[{blank}]_master_:pass:attributes[{blank}]_slaves_pass:attributes[{blank}]#. Replace _master_ with the name of the master team device and _slaves_ with a comma-separated list of physical (ethernet) devices to be used as slaves in the team device. For example:
pt_br: Configura um dispositivo de equipe com a seguinte sintaxe: [option]#team=pass:attributes[{blank}]_mestre_:pass:attributes[{blank}]_escravos_pass:attributes[{blank}]#. Substitua _mestre_ pelo nome do dispositivo mestre da equipe e _escravos_ por uma lista separada por vírgulas de dispositivos físicos (ethernet) a serem usados como escravos no dispositivo da equipe. Por exemplo:

source: Advanced Installation Options
pt_br: Opções avançadas de instalação

source: Configure the system for multilib packages (that is, to allow installing 32-bit packages on a 64-bit x86 system) and install packages specified in this section as such.
pt_br: Configura o sistema para pacotes multilib (ou seja, para permitir a instalação de pacotes de 32 bits em um sistema x86 de 64 bits) e instale os pacotes especificados nesta seção como tal.

source: Normally, on an AMD64 or Intel{nbsp}64 system, only packages for this architecture (marked as `x86_64`) and packages for all architectures (marked as `noarch` would be installed. When you use this option, packages for 32-bit AMD or Intel systems (marked as `i686`) will be automatically installed as well if available.
pt_br: Normalmente, em um sistema AMD64 ou Intel{nbsp}64, apenas pacotes para esta arquitetura (marcados como `x86_64`) e pacotes para todas as arquiteturas (marcados como `noarch`) seriam instalados. Quando você usa esta opção, pacotes para sistemas 32-bits AMD ou Intel (marcados como `i686`) também serão instalados automaticamente, se disponíveis.

source: This only applies to packages directly specified in the `%packages` section. If a package is only installed as a dependency, only the exact specified dependency will be installed. For example, if you are installing package [package]*foo* which depends on package [package]*bar*, the former will be installed in multiple variants, while the latter will only be installed in variants specifically required.
pt_br: Isso se aplica apenas a pacotes especificados diretamente na seção `%packages`. Se um pacote for instalado apenas como uma dependência, apenas a dependência exata especificada será instalada. Por exemplo, se você estiver instalando o pacote [package]*foo* que depende do pacote [package]*bar*, o primeiro será instalado em múltiplas variantes, enquanto o último só será instalado em variantes especificamente necessárias.

source: Force the installation program to install partition information into a GUID Partition Table (GPT) instead of a Master Boot Record (MBR). This option is meaningless on UEFI-based systems, unless they are in BIOS compatibility mode.
pt_br: Força o programa de instalação a instalar informações de partição em uma Tabela de Partição GUID (GPT) em vez de um Master Boot Record (MBR). Esta opção não faz sentido em sistemas baseados em UEFI, a menos que estejam no modo de compatibilidade do BIOS.

source: Normally, BIOS-based systems and UEFI-based systems in BIOS compatibility mode will attempt to use the MBR schema for storing partitioning information, unless the disk is larger than 2 TB. Using this option will change this behavior, allowing a GPT to be written even to disks smaller than 2 TB.
pt_br: Normalmente, os sistemas baseados em BIOS e sistemas baseados em UEFI no modo de compatibilidade do BIOS tentarão usar o esquema MBR para armazenar informações de particionamento, a menos que o disco seja maior que 2 TB. O uso desta opção mudará este comportamento, permitindo que um GPT seja gravado mesmo em discos menores que 2 TB.

source: See xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for more information about GPT and MBR, and xref:appendixes/Disk_Partitions.adoc#sect-disk-partitioning-guid-partition-table[GUID Partition Table (GPT)] for more general information about GPT, MBR and disk partitioning in general.
pt_br: Consulte xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de particionamento recomendado] para obter mais informações sobre GPT e MBR, e xref:appendixes/Disk_Partitions.adoc#sect-disk-partitioning-guid-partition-table[Tabela de Partição GUID (GPT)] para mais informações gerais sobre GPT, MBR e particionamento de disco em geral.
