Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/advanced/Boot_Options.po
Languages: pt_br

source: This option controls which Kickstart files and installation logs are saved to the installed system. It can be especially useful to disable saving such data when performing OEM operating system installations, or when generating images using sensitive resources (such as internal repository URLs), as these resources might otherwise be mentioned in kickstart files and/or logs on the image. Possible values for this option are:
pt_br: Esta opção controla quais arquivos Kickstart e logs de instalação são salvos no sistema instalado. Pode ser especialmente útil desabilitar o salvamento de tais dados ao realizar instalações de sistema operacional OEM ou ao gerar imagens usando recursos confidenciais (como URLs de repositório interno), já que esses recursos podem ser mencionados em arquivos de kickstart e/ou logs na imagem. Os valores possíveis para esta opção são:

source: `input_ks` - disables saving of the input Kickstart file (if any).
pt_br: `input_ks` - desabilita o salvamento do arquivo de Kickstart de entrada (se houver).

source: `output_ks` - disables saving of the output Kickstart file generated by Anaconda.
pt_br: `output_ks` - desabilita o salvamento do arquivo Kickstart de saída gerado pelo Anaconda.

source: `all_ks` - disables saving of both input and output Kickstart files.
pt_br: `all_ks` - desabilita o salvamento de arquivos Kickstart de entrada e saída.

source: `logs` - disables saving of all installation logs.
pt_br: `logs` - desabilita o salvamento de todos os logs de instalação.

source: `all` - disables saving of all Kickstart files and all installation logs.
pt_br: `all` - desabilita o salvamento de todos os arquivos Kickstart e todos os logs de instalação.

source: Multiple values can be combined as a comma separated list, for example: `input_ks,logs`
pt_br: Vários valores podem ser combinados como uma lista separada por vírgulas, por exemplo: `input_ks,logs`

source: Perform a check at the beginning of the installation to determine if there is enough available RAM. If there is not enough memory detected, the installation will stop with an error message. This option is enabled by default; use [option]#inst.memcheck=0# to disable it.
pt_br: Faz uma verificação no início da instalação para determinar se há RAM suficiente disponível. Se não houver memória suficiente detectada, a instalação será interrompida com uma mensagem de erro. Essa opção é ativada por padrão; use [option]#inst.memcheck=0# para desabilitá-lo.

source: Use the older [application]*Yum* backend for package installation and dependency resolution instead of [application]*DNF*. See the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[], for details about [application]*DNF*.
pt_br: Usa o backend antigo do [application]*Yum* para instalação de pacotes e resolução de dependência em vez do [application]*DNF*. Veja o [citetitle]_{PRODUCT} System Administrator's Guide_ (guia do administrador de sistema), disponível em link:++https://docs.fedoraproject.org/++[], para detalhes sobre o [application]*DNF*.

source: Turns the [application]*Kdump* installer add-on `on` or `off` (the add-on is off by default). If you use [option]#inst.kdump_addon=on#, a new screen, which allows you to configure the [application]*Kdump* kernel crash dumping mechanism, will appear in the main menu of the graphical or text interface (see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-kdump[Kdump]). Enabling this add-on is also necessary to use the xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-kdump[%addon com_redhat_kdump (optional) - Configure kdump] Kickstart command.
pt_br: Liga ou desliga o complemento de instalador [application]*Kdump* (o complemento está desativado por padrão). Se você usar [option]#inst.kdump_addon=on#, uma nova tela, que permite configurar o mecanismo [application]*Kdump* de despejo de falha do kernel, aparecerá no menu principal da interface gráfica ou de texto (veja xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-kdump[Kdump]). Habilitar este complemento também é necessário para usar o comando Kickstart xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-kdump[%addon com_redhat_kdump (opcional) - Configurar kdump].

source: Enabling Remote Access Using VNC
pt_br: Habilitando acesso remoto usando VNC

source: The following options are necessary to configure [application]*Anaconda* for remote graphical installation. See xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Installing Using VNC] for more details.
pt_br: As seguintes opções são necessárias para configurar o [application]*Anaconda* para instalação gráfica remota. Consulte xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Instalando usando VNC] para obter mais detalhes.

source: Specifies that the installation program's graphical interface should be run in a `VNC` session. If you specify this option, you will need to connect to the system using a `VNC` client application to be able to interact with the installation program. `VNC` sharing is enabled, so multiple clients can connect to the system at the same time.
pt_br: Especifica que a interface gráfica do programa de instalação deve ser executada em uma sessão `VNC`. Se você especificar esta opção, precisará se conectar ao sistema usando um aplicativo cliente `VNC` para poder interagir com o programa de instalação. O compartilhamento `VNC` está habilitado, então vários clientes podem se conectar ao sistema ao mesmo tempo.

source: A system installed using `VNC` will start in text mode by default.
pt_br: Um sistema instalado usando `VNC` irá iniciar em modo texto por padrão.

source: `VNC` server used by the installation program. Any `VNC` client attempting to connect to the system will have to provide the correct password to gain access. For example, [option]#inst.vncpassword=pass:attributes[{blank}]_testpwd_pass:attributes[{blank}]# will set the password to `testpwd`. The password must be between 6 and 8 characters long.
pt_br: Servidor `VNC` usado pelo programa de instalação. Qualquer cliente `VNC` tentando se conectar ao sistema terá que fornecer a senha correta para obter acesso. Por exemplo, [option]#inst.vncpassword=pass:attributes[{blank}]_senhateste_pass:attributes[{blank}]# definirá a senha para `senhateste`. A senha deve ter entre 6 e 8 caracteres.

source: If you specify an invalid password (one that is too short or too long), you will be prompted to specify a new one by a message from the installation program:
pt_br: Se você especificar uma senha inválida (uma que seja muito curta ou muito longa), será solicitado que você especifique uma nova por uma mensagem do programa de instalação:

source: VNC password must be six to eight characters long. Please enter a new one, or leave blank for no password.
pt_br: A senha VNC deve ter entre 6 e 8 caracteres. Por favor, digite uma nova senha. Deixe em branco no caso de não desejar uma senha.

source: Password:
pt_br: Senha:

source: Connect to a listening `VNC` client at a specified host and port once the installation starts. The correct syntax is [option]#inst.vncconnect=pass:attributes[{blank}]_host_:pass:attributes[{blank}]_port_pass:attributes[{blank}]#. The _port_ parameter is optional - if you do not specify one, the installation program will use `5900`.
pt_br: Conecte-se a um cliente `VNC` de escuta em um host e porta especificados assim que a instalação começar. A sintaxe correta é [option]#inst.vncconnect=pass:attributes[{blank}]_host_:pass:attributes[{blank}]_porta_pass:attributes[{blank}]#. O parâmetro _porta_ é opcional – se você não especificar uma, o programa de instalação usará `5900`.

source: Debugging and Troubleshooting
pt_br: Depuração e solução de problemas

source: Specifies the location of the `updates.img` file to be applied to the installation program runtime. The syntax is the same as in the [option]#inst.repo# option - see xref:tabl-boot-options-sources[Installation Sources] for details. In all formats, if you do not specify a file name but only a directory, the installation program will look for a file named `updates.img`.
pt_br: Especifica a localização do arquivo `updates.img` a ser aplicado ao tempo de execução do programa de instalação. A sintaxe é a mesma da [option]#inst.repo# opção – consulte xref:tabl-boot-options-sources[Fontes de instalação] para obter detalhes. Em todos os formatos, se você não especificar um nome de arquivo, mas apenas um diretório, o programa de instalação irá procurar por um arquivo chamado `updates.img`.

source: Specifies the minimum level for messages to be logged on a terminal. This only concerns real-time logging in a terminal; log files will always contain messages of all levels.
pt_br: Especifica o nível mínimo para que as mensagens sejam registradas em um terminal. Isso só se refere ao registro em tempo real em um terminal; os arquivos de log sempre conterão mensagens de todos os níveis.

source: Possible values for this option from the lowest to highest level are: `debug`, `info`, `warning`, `error` and `critical`. The default value is `info`, which means that by default, the logging terminal will display messages ranging from `info` to `critical`, but not `debug`.
pt_br: Os valores possíveis para esta opção do nível mais baixo ao mais alto são: `debug`, `info`, `warning`, `error` e `critical`. O valor padrão é `info`, o que significa que, por padrão, o terminal de registro exibirá mensagens que variam de `info` a `crítico`, mas não `debug`.

source: Once the installation starts, this option sends log messages to the syslog process on the specified host. The remote syslog process must be configured to accept incoming connections.
pt_br: Assim que a instalação é iniciada, esta opção envia mensagens de log para o processo syslog no host especificado. O processo syslog remoto deve ser configurado para aceitar conexões de entrada.

source: Specifies a `virtio` port (a character device at `/dev/virtio-ports/pass:attributes[{blank}]_name_pass:attributes[{blank}]`) to be used for forwarding logs. The default value is `org.fedoraproject.anaconda.log.0`pass:attributes[{blank}]; if this port is present, it will be used.
pt_br: Especifica uma porta `virtio` (um dispositivo de caractere em `/dev/virtio-ports/pass:attributes[{blank}]_nome_pass:attributes[{blank}]`) a ser usado para encaminhar logs. O valor padrão é `org.fedoraproject.anaconda.log.0`pass:attributes[{blank}]; se esta porta estiver presente, ela será usada.

source: Deprecated Boot Options
pt_br: Opções de inicialização descontinuadas

source: Options in this list are *deprecated*. They will still work, but there are other options which offer the same functionality and should be preferred. Using deprecated options is not recommended and they are expected to be removed in future releases.
pt_br: As opções nesta lista foram *descontinuadas*. Eles ainda funcionarão, mas existem outras opções que oferecem a mesma funcionalidade e devem ser preferidas. O uso de opções descontinuadas não é recomendado e espera-se que sejam removidas em versões futuras.

source: Note that as described in the introduction to this chapter, options specific to the installation program now use the `inst.` prefix. For example, the [option]#vnc=# option is considered deprecated and replaced by the [option]#inst.vnc=# option. However, these changes are not listed here.
pt_br: Observe que, conforme descrito na introdução deste capítulo, as opções específicas do programa de instalação agora usam o prefixo `inst`. Por exemplo, a opção [options]#vnc=# é considerada obsoleta e substituída pela opção [option]#inst.vnc=#. No entanto, essas mudanças não estão listadas aqui.

source: Used to specify that the machine being installed onto does not have any display hardware, and to prevent the installer from trying to detect a display.
pt_br: Usada para especificar que a máquina que está sendo instalada não possui nenhum hardware de exibição e para evitar que o instalador tente detectar uma tela.

source: Configured the installation method. Use the [option]#inst.repo=# option instead.
pt_br: Configurava o método de instalação. Use a opção [option]#inst.repo=# em seu lugar.

source: [option]#repo=nfsiso:pass:attributes[{blank}]_server_:/pass:attributes[{blank}]_path_pass:attributes[{blank}]#
pt_br: [option]#repo=nfsiso:pass:attributes[{blank}]_servidor_:/pass:attributes[{blank}]_caminho_pass:attributes[{blank}]#

source: In NFS installations, specified that the target is an ISO image located on an NFS server instead of an installable tree. The difference is now detected automatically, which means this option is the same as [option]#inst.repo=nfs:pass:attributes[{blank}]_server_:/pass:attributes[{blank}]_path_pass:attributes[{blank}]#.
pt_br: Em instalações NFS, especifica-se que o destino é uma imagem ISO localizada em um servidor NFS em vez de uma árvore instalável. A diferença agora é detectada automaticamente, o que significa que esta opção é a mesma que [option]#inst.repo=nfs:pass:attributes[{blank}]_servidor_:/pass:attributes[{blank}]_caminho_pass:attributes[{blank}]#.

source: Configured the Domain Name Server (DNS). Use the [option]#nameserver=# option instead.
pt_br: Configurava o Servidor de Nomes de Domínio (DNS). Em vez disso, use a opção [option]#nameserver=#.

source: These options have been consolidated under the [option]#ip=# option.
pt_br: Essas opções foram consolidadas sob a opção [option]#ip=#.

source: Select network device to be used at early stage of installation. Different values have been replaced with different options; see the table below.
pt_br: Selecionava o dispositivo de rede a ser usado no estágio inicial da instalação. Valores diferentes foram substituídos por opções diferentes; veja a tabela abaixo.

source: |Value|Current behavior |Not present|All devices are attempted to be activated using `dhcp`, unless desired device and configuration is specified by [option]#ip=# option and/or the [option]#BOOTIF# option. |[option]#ksdevice=link#|Similar to the above, with the difference that network will always be activated in the initramfs, whether it is needed or not. The supported [option]#rd.neednet# option (provided by [application]*dracut*) should be used instead. |[option]#ksdevice=bootif#|Ignored (the BOOTID= option is used by default when specified) |[option]#ksdevice=ibft#|Replaced with the [option]#ip=ibft# option |[option]#ksdevice=pass:attributes[{blank}]_MAC_pass:attributes[{blank}]#|Replaced with [option]#BOOTIF=pass:attributes[{blank}]_MAC_pass:attributes[{blank}]# |[option]#ksdevice=pass:attributes[{blank}]_device_pass:attributes[{blank}]#|Replaced by specifying the device name using the [option]#ip=# option.
pt_br: |Valor|Comportamento atual |Não presente|Tenta ativar todos os dispositivos usando `dhcp`, a menos que o dispositivo e a configuração desejados sejam especificados pela opção [option]#ip=# ou a opção [option]#BOOTIF#. |[option]#ksdevice=link#|Semelhante ao anterior, com a diferença de que a rede estará sempre ativada no initramfs, seja necessário ou não. A opção [option]#rd.neednet# suportada (fornecida pelo [application]*dracut*) deve ser usada em seu lugar. |[option]#ksdevice=bootif#|Ignorada (a opção BOOTID= é usada por padrão quando especificada) |[option]#ksdevice=ibft#|Substituída com a opção [option]#ip=ibft# |[option]#ksdevice=pass:attributes[{blank}]_MAC_pass:attributes[{blank}]#|Substituída com [option]#BOOTIF=pass:attributes[{blank}]_MAC_pass:attributes[{blank}]# |[option]#ksdevice=pass:attributes[{blank}]_dispositivo_pass:attributes[{blank}]#|Substituída com especificar o nome do dispositivo usando a opção [option]#ip=#.

source: When performing a Kickstart installation, booting from local media and having the Kickstart file on local media as well, the network will not be initialized. This means that any other Kickstart options requiring network access, such as pre-installation or post-installation scripts accessing a network location, will cause the installation to fail. This is a known issue; see BZ#link:++https://bugzilla.redhat.com/show_bug.cgi?id=1085310++[1085310] for details.
pt_br: Ao realizar uma instalação com Kickstart, inicializando a partir da mídia local e tendo o arquivo Kickstart na mídia local também, a rede não será inicializada. Isso significa que qualquer outra opção de Kickstart que requeira acesso à rede, como scripts de pré-instalação ou pós-instalação que acessam um local de rede, causará falha na instalação. Este é um problema conhecido; consulte o link BZ#link:++https://bugzilla.redhat.com/show_bug.cgi?id=1085310++[1085310] para obter detalhes.

source: To work around this issue, either use the [option]#ksdevice=link# boot option, or add the [option]#--device=link# option to the [command]#network# command in your Kickstart file.
pt_br: Para contornar esse problema, use a opção de inicialização [option]#ksdevice=link# ou adicione a opção [option]#--device= link# ao comando [command]#network# em seu arquivo Kickstart.

source: Used to disable specified drivers. This is now handled by the [option]#modprobe.blacklist=# option.
pt_br: Usada para desabilitar drivers especificados. Isso agora é tratado pela opção [option]#modprobe.blacklist=#.

source: Disabled support for the FireWire interface. You can disable the FireWire driver (`firewire_ohci`) by using the [option]#modprobe.blacklist=# option instead:
pt_br: Desabilitava suporte para a interface FireWire. Você pode desabilitar o driver FireWire (`firewire_ohci`) usando a opção [option]#modprobe.blacklist=# ao invés:

source: Removed Boot Options
pt_br: Opções de inicialização removidas

source: The following options are removed. They were present in previous releases of {PRODUCT}, but they cannot be used anymore.
pt_br: As seguintes opções foram removidas. Eles estavam presentes em versões anteriores de {PRODUCT}, mas não podem mais ser usados.

source: The installation program's `initramfs` is now completely non-interactive, which means that this option are not available anymore. Use [option]#ip=# to configure network settings.
pt_br: O programa de instalação `initramfs` agora é completamente não interativo, o que significa que esta opção não está mais disponível. Use [option]#ip=# para definir as configurações de rede.

source: This option forced [application]*Anaconda* to use the `/dev/ttyS0` console as the output. Use the [option]#console=/dev/ttyS0# (or similar) instead.
pt_br: Esta opção forçava o [application]*Anaconda* a usar o console `/dev/ttyS0` como a saída. Use [option]#console=/dev/ttyS0# (ou semelhante).

source: Specified the location of updates for the installation program. Use the [option]#inst.updates=# option instead.
pt_br: Especificava o local das atualizações para o programa de instalação. Use a opção [option]#inst.updates=#.

source: Configured wireless network access. Network configuration is now being handled by [application]*dracut*, which does not support wireless networking, rendering these options useless.
pt_br: Acesso de rede sem fio configurado. A configuração da rede agora está sendo feita pelo [aplicativo]*dracut*, que não oferece suporte à rede sem fio, tornando essas opções inúteis.

source: Used in the past to configure additional low-level network settings. All network settings are now handled by the [option]#ip=# option.
pt_br: Usada no passado para definir configurações adicionais de rede de baixo nível. Todas as configurações de rede agora são controladas pela opção [option]#ip=#.

source: Allowed you to debug the loader. Use [option]#rd.debug# instead.
pt_br: Permitia que você depurasse o carregador. Use [option]#rd.debug#.

source: Verified the installation media before starting the installation. Replaced with the [option]#rd.live.check# option.
pt_br: Verificava a mídia de instalação antes de iniciar a instalação. Substituída pela opção [option]#rd.live.check#.

source: Specified a floppy disk as the Kickstart file source. Floppy drives are not supported anymore.
pt_br: Especificava um disquete como a fonte do arquivo Kickstart. As unidades de disquete não são mais suportadas.

source: Configured a remote display. Replaced with the [option]#inst.vnc# option.
pt_br: Configurava um display remoto. Substituída pela opção [option]#inst.vnc#.

source: Added UTF8 support when installing in text mode. UTF8 support now works automatically.
pt_br: Adicionava suporte a UTF8 ao instalar em modo de texto. O suporte a UTF8 agora funciona automaticamente.

source: Used to disable IPv6 support in the installation program. IPv6 is now built into the kernel so the driver cannot be blacklisted; however, it is possible to disable IPv6 using the [option]#ipv6.disable# option.
pt_br: Usada para desabilitar o suporte a IPv6 no programa de instalação. O IPv6 agora está embutido no kernel, portanto, o driver não pode ser colocado na lista negra; entretanto, é possível desabilitar o IPv6 usando a opção [option]#ipv6.disable#.

source: Upgrades are done in a different way in current {PRODUCT} releases. For more information about upgrading your system, see xref:advanced/Upgrading_Your_Current_System.adoc#chap-upgrading[Upgrading Your Current System].
pt_br: As atualizações são feitas de maneira diferente nas versões atuais do {PRODUCT}. Para obter mais informações sobre como atualizar seu sistema, consulte xref:advanced/Upgrading_Your_Current_System.adoc#chap-upgrading[Atualizando seu sistema atual].

source: Used to configure Virtual LAN (802.1q tag) devices. Use the [option]#vlan=# option instead.
pt_br: Usada para configurar dispositivos de LAN Virtual (tag 802.1q). Use a opção [option]#vlan=#.

source: Used to enable [application]*DNF* to handle package installation and dependency resolution in {PRODUCT} 21. [application]*DNF* is now used by default and this option has been replaced with [option]#inst.nodnf#, which reverts back to [application]*Yum*.
pt_br: Usada para permitir que o [application]*DNF* lide com a instalação do pacote e resolução de dependências no {PRODUCT} 21. [application]*DNF* agora é usado por padrão e esta opção foi substituída por [option]#inst.nodnf#, que reverte para [application]*Yum*.

source: Using the Maintenance Boot Modes
pt_br: Usando os modos de inicialização de manutenção

source: Loading the Memory (RAM) Testing Mode
pt_br: Carregando o modo de teste de memória (RAM)

source: Faults in memory (RAM) modules may cause your system to freeze or crash unpredictably. In some cases, memory faults may only cause errors with particular combinations of software. For this reason, you should test the memory of a computer before you install {PRODUCT} for the first time, even if it has previously run other operating systems.
pt_br: Falhas nos módulos de memória (RAM) podem fazer com que o sistema congele ou trave de maneira imprevisível. Em alguns casos, as falhas de memória podem causar erros apenas com combinações específicas de software. Por esse motivo, você deve testar a memória de um computador antes de instalar o {PRODUCT} pela primeira vez, mesmo se ele já tiver executado outros sistemas operacionais.
