Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/advanced/Kickstart_Installations.po
Languages: id

source: Automating the Installation with Kickstart
id: Mengotomasi Instalasi dengan Kickstart

source: Kickstart installations offer a means to automate the installation process, either partially or fully. Kickstart files contain answers to all questions normally asked by the installation program, such as what time zone do you want the system to use, how should the drives be partitioned or which packages should be installed. Providing a prepared Kickstart file when the installation begins therefore allows the you to perform the installation automatically, without need for any intervention from the user. This is especially useful when deploying {PRODUCT} on a large number of systems at once.
id: Instalasi Kickstart menawarkan sarana untuk mengotomatiskan proses instalasi, baik sebagian atau seluruhnya. BerkasKickstart berisi jawaban atas semua pertanyaan yang biasanya diajukan oleh program instalasi, seperti zona waktu apa yang Anda ingin sistem gunakan, bagaimana drive harus dipartisi atau paket mana yang harus diinstal. Oleh karena itu, menyediakan berkas Kickstart yang telah disiapkan saat penginstalan dimulai memungkinkan Anda untuk melakukan penginstalan secara otomatis, tanpa perlu campur tangan pengguna. Ini sangat berguna saat menerapkan {PRODUCT} pada sejumlah besar sistem sekaligus.

source: All Kickstart scripts and the log files of their execution are stored in the `/tmp` directory to assist with debugging installation issues.
id: Semua skrip Kickstart dan berkas log dari pelaksanaannya disimpan di direktori `/tmp` untuk membantu pengawakutuan masalah penginstalan.

source: How to Perform a Kickstart Installation
id: Bagaimana Melakukan Instalasi Kickstart

source: Kickstart installations can be performed using a local DVD, a local hard drive, or via NFS, FTP, HTTP, or HTTPS.
id: Instalasi Kickstart dapat dilakukan memakai DVD lokal, hard disk lokal, atau melalui NFS, FTP, HTTP, atau HTTPS.

source: To use Kickstart, you must:
id: Untuk memakai Kickstart, Anda mesti:

source: Create a Kickstart file.
id: Membuat sebuah berkas Kickstart.

source: Create boot media or configure a network boot (PXE) server which will be used to begin the installation.
id: Membuat media boot atau mengonfigurasi sebuah server boot jaringan (PXE) yang akan dipakai untuk memulai instalasi.

source: Make the Kickstart file available on removable media, a hard drive, or a network location.
id: Membuat berkas Kickstart tersedia pada media lepasan, hard disk, atau suatu lokasi jaringan.

source: Start the Kickstart installation by booting the installer and using a boot option to tell the installer where to find the Kickstart file.
id: Memulai instalasi Kickstart dengan mem-boot penginstall dan memakai suatu opsi boot untuk memberitahu penginstall di mana dapat menemukan berkas Kickstart.

source: This chapter explains these steps in detail.
id: Bab ini menjelaskan langkah-langkah ini secara rinci.

source: Creating a Kickstart File
id: Membuat suatu Berkas Kickstart

source: The Kickstart file itself is a plain text file, containing keywords listed in xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference], which serve as directions for the installation. Any text editor able to save files as ASCII text (such as [application]*Gedit* or [application]*vim* on Linux systems or [application]*Notepad* on Windows systems) can be used to create and edit Kickstart files.
id: Berkas Kickstart itu sendiri adalah berkas teks biasa, berisi kata kunci yang terdaftar di xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Referensi Sintaks Kickstart], yang berfungsi sebagai petunjuk untuk penginstalan. Semua penyunting teks yang dapat menyimpan berkas sebagai teks ASCII (seperti [application]*Gedit* atau [application]*vim* pada sistem Linux atau [application]*Notepad* pada sistem Windows) dapat digunakan untuk membuat dan menyunting berkas Kickstart.

source: The recommended approach to creating Kickstart files is to perform a manual installation on one system first. After the installation completes, all choices made during the installation are saved into a file named `anaconda-ks.cfg`, located in the `/root/` directory on the installed system. You can then copy this file, make any changes you need, and use the resulting configuration file in further installations.
id: Pendekatan yang disarankan untuk membuat berkas Kickstart adalah melakukan instalasi manual pada satu sistem terlebih dahulu. Setelah penginstalan selesai, semua pilihan yang dibuat selama penginstalan disimpan ke dalam berkas bernama `anaconda-ks.cfg`, yang terletak di direktori `/root/` pada sistem yang diinstal. Anda kemudian dapat menyalin berkas ini, membuat perubahan apa pun yang Anda perlukan, dan menggunakan berkas konfigurasi yang dihasilkan untuk penginstalan lebih lanjut.

source: When creating a Kickstart file, keep in mind the following:
id: Ketika membuat sebuah berkas Kickstart, harap diingat yang berikut:

source: Lines starting with a pound sign (`#`) are treated as comments and are ignored.
id: Baris yang diawali dengan tanda pagar (`#`) diperlakukan sebagai komentar dan diabaikan.

source: Sections must be specified *in order*. Items within the sections do not have to be in a specific order unless otherwise specified. The correct section order is:
id: Bagian-bagian mesti dinyatakan *secara urut*. Butir-butir dalam bagian tidak harus dalam urutan tertentu kecuali dinyatakan lain. Urutan bagian yang benar adalah:

source: The command section which contains actual Kickstart commands and options as listed in xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference]. Note that some commands, such as [command]#install#, are mandatory, but most commands are optional.
id: Bagian perintah yang berisi perintah dan opsi Kickstart aktual seperti yang tercantum dalam xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Referensi Sintaks Kickstart]. Perhatikan bahwa beberapa perintah, seperti [command]#install#, bersifat wajib, tetapi sebagian besar perintah bersifat opsional.

source: The [command]#%packages# section which contains a list of packages and package groups to be installed. See xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-packages[%packages (required) - Package Selection] for details.
id: Bagian [command]#%packages# memuat suatu daftar paket dan grup paket yang akan dipasang. Lihat xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-packages[%packages (required) - Pemilihan Paket] untuk rinciannya.

source: The [command]#%pre# and [command]#%post# sections, containing a pre-installation and post-installation scripts. These two sections can be in any order and are not mandatory. See xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-preinstall[%pre (optional) - Pre-installation Script] and xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-postinstall[%post (optional) - Post-installation Script] for details.
id: Bagian [command]#%pre# dan [command]#%post#, memuat skrip pra instalasi dan pasca instalasi. Dua bagian ini bisa dalam urutan sebarang dan tidak wajib. Lihat xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-preinstall[%pre (optional) - Skrip Pra Instalasi] dan xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-postinstall[%post (optional) - Skrip Pasca Instalasi] untuk rinciannya.

source: The [command]#%packages#, [command]#%pre# and [command]#%post# sections must end with [command]#%end#, otherwise the installation program will refuse the Kickstart file. The main command section has no special ending statement.
id: Bagian [command]#%packages#, [command]#%pre# dan [command]#%post# mesti diakhiri dengan [command]#%end#, bila tidak, program instalasi akan menolak berkas Kickstart tersebut. Bagian perintah utama tidak punya pernyataan akhir khusus.

source: Omitting any required item results in the installation program prompting the user for an answer to the related item, just as the user would be prompted during a typical installation. Once the answer is given, the installation will continue. Note that if the system you are installing has no display, you will not be able to see the prompt, and the installation will appear to have failed.
id: Menghilangkan sebarang butir yang diperlukan menyebabkan program penginstalan yang meminta pengguna untuk menjawab butir terkait, sama seperti pengguna akan diminta selama penginstalan biasa. Setelah jawaban diberikan, penginstalan akan dilanjutkan. Perhatikan bahwa jika sistem yang Anda instal tidak memiliki tampilan, Anda tidak akan dapat melihat prompt, dan penginstalan akan tampak gagal.

source: Verifying the Kickstart File
id: Memverifikasi Berkas Kickstart

source: When creating or customizing your kickstart file, it is useful to verify that it is valid before attempting to use it in an installation. {PRODUCT} includes the [application]*ksvalidator* command line utility which can be used to do this. This tool is a part of the [package]*pykickstart* package. To install this package, execute the following command:
id: Saat membuat atau menyesuaikan berkas kickstart Anda, ada gunanya untuk memverifikasi bahwa itu valid sebelum mencoba menggunakannya dalam instalasi. {PRODUCT} menyertakan utilitas baris perintah [application]*ksvalidator* yang dapat digunakan untuk melakukan ini. Alat ini adalah bagian dari paket [package]*pykickstart*. Untuk menginstal paket ini, jalankan perintah berikut:

source: After installing the package, you can validate a Kickstart file using the following command:
id: Setelah memasang paket, Anda dapat memvalidasi suatu berkas Kickstart memakai perintah berikut:

source: $ [command]#ksvalidator _/path/to/kickstart.ks_#
id: $ [command]#ksvalidator _/path/ke/kickstart.ks_#

source: Replace _/path/to/kickstart.ks_ with the path to the Kickstart file you want to verify.
id: Gantikan _/path/ke/kickstart.ks_ dengan path ke berkas Kickstart yang ingin Anda verifikasi.

source: For more information about this tool, see the `ksvalidator(1)` man page.
id: Untuk informasi tentang alat ini, lihat halaman man `ksvalidator(1)`.

source: Keep in mind that the validation tool has its limitations. The Kickstart file can be very complicated; [application]*ksvalidator* can make sure the syntax is correct and that the file does not include removed options, but it cannot guarantee the installation will be successful. It also does not attempt to validate the [command]#%pre#, [command]#%post# and [command]#%packages# sections of the Kickstart file.
id: Perlu diingat bahwa alat validasi memiliki batasannya. Berkas Kickstart bisa sangat rumit; [application]*ksvalidator* dapat memastikan sintaks sudah benar dan bahwa berkas tidak menyertakan opsi yang dihapus, tetapi tidak dapat menjamin penginstalan berhasil. Ini juga tidak mencoba untuk memvalidasi bagian [command]#%pre#, [command]#%post# dan [command]#%packages# dari berkas Kickstart.

source: Making the Kickstart File Available
id: Membuat Berkas Kickstart Tersedia

source: Once you create a Kickstart file, you can place it in one of the following locations:
id: Sekali Anda membuat berkas Kickstart, Anda dapat meletakkannya pada satu dari lokasi-lokasi berikut:

source: On *removable media*, such as a DVD or USB flash drive connected to the installation system
id: Pada *media lepasan*, seperti DVD atau flash disk USB yang disambungkan ke sistem instalasi

source: On a *hard drive* connected to the installation system
id: Pada suatu *hard disk* yang tersambung ke sistem instalasi

source: On a *network share* reachable from the installation system
id: Pada suatu *share jaringan* yang dapat dicapai dari sistem instalasi

source: Normally, a Kickstart file is copied to removable media or a hard drive, or made available on the network. Placing the file in a network location complements the usual approach to Kickstart installations, which is also network-based: the system is booted using a PXE server, the Kickstart file is downloaded from a network share, and software packages specified in the file are downloaded from remote repositories.
id: Biasanya, berkas Kickstart disalin ke media lepasan atau hard disk, atau tersedia di jaringan. Menempatkan berkas di lokasi jaringan melengkapi pendekatan biasa untuk penginstalan Kickstart, yang juga berbasis jaringan: sistem di-boot menggunakan server PXE, berkas Kickstart diunduh dari share jaringan, dan paket perangkat lunak yang ditentukan dalam berkas diunduh dari repositori jarak jauh.

source: xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Setting Up an Installation Server] offers some additional information about preparing for a network-based installation.
id: xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Menyiapkan Server Instalasi] menawarkan beberapa informasi tambahan tentang mempersiapkan penginstalan berbasis jaringan.

source: Starting the Kickstart Installation
id: Memulai Instalasi Kickstart

source: Once you have everything ready - you have created a valid Kickstart file and you have either local boot media or a PXE server available, you can start the Kickstart installation. You need to use the [option]#inst.ks=# boot option either in the boot menu (when booting from local media), or add this option to your PXE server configuration. For information about boot options used in Kickstart installations, see xref:advanced/Boot_Options.adoc#sect-boot-options-kickstart[Kickstart Boot Options].
id: Setelah semuanya siap - Anda telah membuat berkas Kickstart yang valid dan Anda memiliki media boot lokal atau server PXE yang tersedia, Anda dapat memulai penginstalan Kickstart. Anda perlu menggunakan opsi boot [option]#inst.ks=# baik di menu boot (saat boot dari media lokal), atau menambahkan opsi ini ke konfigurasi server PXE Anda. Untuk informasi tentang opsi boot yang digunakan dalam penginstalan Kickstart, lihat xref:advanced/Boot_Options.adoc#sect-boot-options-kickstart[Opsi Boot Kickstart].
