Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/advanced/VNC_Installations.po
Languages: id

source: Installing Using VNC
id: Instalasi Memakai VNC

source: The graphical installation interface is the recommended method of installing {PRODUCT}. However, in some cases, accessing the graphical interface directly is difficult or impossible. Some systems lack the capability to connect a display and a keyboard, making VNC a necessity for manual (non-Kickstart) installations.
id: Antarmuka instalasi grafis adalah metode yang disarankan untuk menginstal {PRODUCT}. Namun, dalam beberapa kasus, mengakses antarmuka grafis secara langsung sulit atau tidak mungkin. Beberapa sistem tidak memiliki kemampuan untuk menghubungkan layar dan keyboard, membuat VNC menjadi kebutuhan untuk instalasi manual (non-Kickstart).

source: To allow manual installations on _headless systems_ (systems without a directly connected display, keyboard and mouse), the [application]*Anaconda* installation program includes a _Virtual Network Computing_ (VNC) mode which allows the graphical mode of the installation program to run locally, but display on another system connected to the network. The VNC installation provides you with the full range of installation options.
id: Untuk mengizinkan penginstalan manual pada _sistem tanpa kepala_ (sistem tanpa layar, keyboard, dan mouse yang terhubung langsung), program penginstalan [aplikasi]*Anaconda* menyertakan mode _Virtual Network Computing_ (VNC) yang memungkinkan mode grafis program penginstalan berjalan secara lokal , tetapi ditampilkan di sistem lain yang terhubung ke jaringan. Instalasi VNC memberi Anda berbagai pilihan instalasi.

source: This chapter provides instructions on activating VNC mode on the installation system and connecting to it using a VNC viewer.
id: Bab ini memberikan instruksi tentang mengaktifkan mode VNC pada sistem instalasi dan menghubungkannya menggunakan penampil VNC.

source: Installing a VNC Viewer
id: Memasang Penampil VNC

source: Performing a VNC installation requires a VNC viewer running on your workstation or another terminal computer. VNC viewers are available in the repositories of most Linux distributions; free VNC viewers are also available for other operating systems such as Windows. On Linux systems, use your package manager to search for a viewer for your distribution.
id: Melakukan instalasi VNC memerlukan penampil VNC yang berjalan di workstation Anda atau komputer terminal lain. Penampil VNC tersedia di repositori sebagian besar distribusi Linux; penampil VNC bebas juga tersedia untuk sistem operasi lain seperti Windows. Pada sistem Linux, gunakan manajer paket Anda untuk mencari penampil untuk distribusi Anda.

source: The following VNC viewers are available in {PRODUCT}:
id: Penampil VNC berikut tersedia dalam {PRODUCT}:

source: [application]*TigerVNC* - A basic viewer independent of your desktop environment. Installed as the [package]*tigervnc* package.
id: [application]*TigerVNC* - Penampil dasar yang independen dari lingkungan desktop Anda. Dipasang sebagai paket [package]*tigervnc*.

source: [application]*Vinagre* - A viewer for the [application]*GNOME* desktop environment. Installed as the [package]*vinagre* package.
id: [application]*Vinagre* - Penampil untuk lingkungan desktop [application]*GNOME*. Diinstal sebagai paket [package]*vinagre*.

source: [application]*KRDC* - A viewer integrated with the [application]*KDE* desktop environment. Installed as the [package]*kdenetwork-krdc* package.
id: [application]*KRDC* - Penampil yang terintegrasi dengan lingkungan desktop [application]*KDE*. Dipasang sebagai paket [package]*kdenetwork-krdc*.

source: To install any of the viewers listed above, execute the following command as `root`:
id: Untuk menginstal salah satu penampil yang tercantum di atas, jalankan perintah berikut sebagai `root`:

source: # dnf install package
id: # dnf install nama_paket

source: Replace _package_ with the package name of the viewer you want to use (for example, [package]*tigervnc*).
id: Ganti _package_ dengan nama paket penampil yang ingin Anda gunakan (misalnya, [package]*tigervnc*).

source: Procedures in this chapter assume you are using [application]*TigerVNC* as your VNC viewer. Specific instructions for other viewers may differ, but the general principles still apply.
id: Prosedur dalam bab ini mengasumsikan Anda menggunakan [application]*TigerVNC* sebagai penampil VNC Anda. Instruksi khusus untuk penampil lain mungkin berbeda, tetapi prinsip-prinsip umum masih berlaku.

source: Performing a VNC Installation
id: Melakukan Instalasi VNC

source: The [application]*Anaconda* installation program offers two modes for VNC installation: _Direct mode_ and _Connect mode_. The modes differ in the way the connection between the server and viewer is established. After you successfully connect, the installation will progress the same way regardless of the mode you used.
id: Program instalasi [application]*Anaconda* menawarkan dua mode untuk instalasi VNC: _Direct mode_ dan _Connect mode_. Kedua mode berbeda dalam cara koneksi antara server dan penampil dibuat. Setelah Anda berhasil terhubung, instalasi akan berjalan dengan cara yang sama terlepas dari mode yang Anda gunakan.

source: Direct Mode
id: Mode Langsung (Direct)

source: In this mode, [application]*Anaconda* is configured to start the installation and wait for an incoming connection from VNC viewer before proceeding. While waiting for an incoming connection, the system's IP address and the port on which the installer expects the connection is displayed on the display or console if available; this implies that you need at least a serial console to connect using this mode, but you can work around this limitation if you know the default VNC port and the system's IP address.
id: Dalam mode ini, [application]*Anaconda* dikonfigurasi untuk memulai instalasi dan menunggu koneksi masuk dari penampil VNC sebelum melanjutkan. Sambil menunggu koneksi masuk, alamat IP sistem dan port tempat penginstal mengharapkan koneksi ditampilkan di layar atau konsol jika tersedia; ini menyiratkan bahwa Anda memerlukan setidaknya konsol serial untuk terhubung menggunakan mode ini, tetapi Anda dapat mengatasi batasan ini jika Anda mengetahui port VNC baku dan alamat IP sistem.

source: Connect Mode
id: Mode Sambung (Connect)

source: In this mode, the VNC viewer is started on the remote system in _listening mode_. The VNC viewer waits for an incoming connection on a specified port. Then, [application]*Anaconda* is started and the host name/IP address and port number of the viewer are provided using a boot option or a Kickstart command. When the installation begins, the installation program establishes a connection with the listening VNC viewer using the specified host name/IP address and port number. Connect mode is therefore easier to use on systems with no local display or console, but it also may require additional preparation, because the viewer system must be able to accept incoming connections on the specified port, which usually requires changing firewall settings.
id: Dalam mode ini, penampil VNC dimulai pada sistem jarak jauh di _listening mode_. Penampil VNC menunggu koneksi masuk pada port tertentu. Kemudian, [application]*Anaconda* dimulai dan nama host/alamat IP dan nomor port penampil disediakan menggunakan opsi boot atau perintah Kickstart. Ketika instalasi dimulai, program instalasi membuat koneksi dengan penampil VNC yang mendengarkan menggunakan nama host/alamat IP dan nomor port yang ditentukan. Oleh karena itu, mode Connect lebih mudah digunakan pada sistem tanpa tampilan atau konsol lokal, tetapi juga mungkin memerlukan persiapan tambahan, karena sistem penampil harus dapat menerima koneksi masuk pada port yang ditentukan, yang biasanya memerlukan perubahan pengaturan firewall.

source: Choosing a VNC Installation Mode
id: Memilih suatu Mode Instalasi VNC

source: Visual and Interactive access to the system
id: Akses Visual dan Interaktif ke sistem

source: If visual and interactive access to the system being installed is not available, then you should use Connect Mode.
id: Jika akses visual dan interaktif ke sistem yang diinstal tidak tersedia, maka Anda harus menggunakan Connect Mode.

source: Network Connection Rules and Firewalls
id: Aturan Koneksi Jaringan dan Firewall

source: If the system being installed is not allowed inbound connections by a firewall, then you must use Connect Mode or disable the firewall. Disabling a firewall may have security implications.
id: Jika sistem yang diinstal tidak mengizinkan koneksi arah masuk oleh firewall, maka Anda harus menggunakan Connect Mode atau menonaktifkan firewall. Menonaktifkan firewall mungkin memiliki implikasi keamanan.

source: If the remote system running the VNC viewer is not allowed incoming connections by a firewall, then you must use Direct Mode, or disable the firewall. Disabling a firewall may have security implications.
id: Jika sistem jarak jauh yang menjalankan penampil VNC tidak diizinkan koneksi masuk oleh firewall, maka Anda harus menggunakan Direct Mode, atau menonaktifkan firewall. Menonaktifkan firewall mungkin memiliki implikasi keamanan.

source: Installing in VNC Direct Mode
id: Memasang dalam Mode Langsung (Direct) VNC

source: VNC Direct Mode is when the VNC viewer initiates a connection to the system being installed. [application]*Anaconda* will tell you when to initiate this connection.
id: VNC Mode Langsung adalah ketika penampil VNC memulai koneksi ke sistem yang sedang dipasang. [application]*Anaconda* akan memberi tahu Anda kapan harus memulai koneksi ini.

source: Starting VNC in Direct Mode
id: Memulai VNC dalam Mode Langsung

source: Open the VNC viewer (for example, [application]*TigerVNC*) on the workstation you will be using to connect to the system being installed. A window similar to xref:figu-vnc-installations-connection-details[TigerVNC Connection Details] will be displayed with an input field allowing you to specify an IP address.
id: Buka penampil VNC (misalnya, [application]*TigerVNC*) di workstation yang akan Anda gunakan untuk menyambung ke sistem yang sedang dipasang. Jendela yang mirip dengan xref:figu-vnc-installations-connection-details[Rincian Koneksi TigerVNC] akan ditampilkan dengan bidang masukan yang memungkinkan Anda menentukan alamat IP.

source: TigerVNC Connection Details
id: Rincian Koneksi TigerVNC

source: TigerVNC after startup
id: TigerVNC setelah awal mula

source: Boot the installation system and wait for the boot menu to appear. In the menu, edit boot options (see xref:install/Booting_the_Installation.adoc#sect-boot-menu[The Boot Menu]) and append the [option]#inst.vnc# option to the end of the command line.
id: Boot sistem instalasi dan tunggu menu boot muncul. Di menu, sunting opsi boot (lihat opsi xref:install/Booting_the_Installation.adoc#sect-boot-menu[Menu Boot]) dan tambahkan opsi [option]#inst.vnc# ke akhir baris perintah.

source: Optionally, if you want to restrict VNC access to the installation system, add the [option]#inst.vncpassword=pass:attributes[{blank}]_PASSWORD_pass:attributes[{blank}]# boot option as well. Replace _PASSWORD_ with the password you want to use for the installation. The VNC password must be between 6 and 8 characters long.
id: Secara opsional, jika Anda ingin membatasi akses VNC ke sistem instalasi, tambahkan opsi boot [option]#inst.vncpassword=pass:attributes[{blank}]_PASSWORD_pass:attributes[{blank}]# juga. Ganti _PASSWORD_ dengan kata sandi yang ingin Anda gunakan untuk instalasi. Kata sandi VNC harus memiliki panjang antara 6 dan 8 karakter.

source: Use a temporary password for the [option]#inst.vncpassword=# option. It should not be a real or root password you use on any system.
id: Gunakan kata sandi sementara untuk opsi [option]#inst.vncpassword=#. Itu tidak boleh berupa kata sandi nyata atau root yang Anda gunakan pada sistem apa pun.

source: Adding VNC Boot Options
id: Menambahkan Opsi Boot VNC

source: Editing boot options to activate VNC
id: Menyunting opsi boot untuk mengaktifkan VNC

source: Start the installation using the edited options. The system will initialize the installation program and start the necessary services. When the system is ready, you will see a message on the screen similar to the following:
id: Mulai instalasi menggunakan opsi yang disunting. Sistem akan menginisialisasi program instalasi dan memulai layanan yang diperlukan. Ketika sistem siap, Anda akan melihat pesan di layar yang mirip dengan yang berikut:

source: Note the IP address and port number (in the above example, `192.168.100.131:5901`).
id: Perhatikan alamat IP dan nomor port (dalam contoh di atas, `192.168.100.131:5901`).

source: On the system running the VNC Viewer, enter the IP address and port number obtained in the previous step into the `Connection Details` dialog in the same format as it was displayed on the screen by the installer. Then, click `Connect`. The VNC viewer will now connect to the installation system. If you set up a VNC password, enter it when prompted and press `OK`.
id: Pada sistem yang menjalankan Penampil VNC, masukkan alamat IP dan nomor port yang diperoleh pada langkah sebelumnya ke dalam dialog `Detail Koneksi` dalam format yang sama seperti yang ditampilkan di layar oleh penginstal. Kemudian, klik `Hubungkan`. Penampil VNC sekarang akan terhubung ke sistem instalasi. Jika Anda menyiapkan kata sandi VNC, masukkan kata sandi saat diminta dan tekan `OK`.

source: When the connection is successfully established, a new window will open on the system running the VNC viewer, displaying the installation menu. This window will provide full remote access to the installer until the installation finishes and the system reboots for the first time.
id: Ketika koneksi berhasil dibuat, jendela baru akan terbuka pada sistem yang menjalankan penampil VNC, menampilkan menu instalasi. Jendela ini akan menyediakan akses jarak jauh penuh ke penginstal sampai instalasi selesai dan sistem reboot untuk pertama kalinya.

source: You can then proceed with xref:install/Installing_Using_Anaconda.adoc#chap-installing-using-anaconda[Installing Using Anaconda].
id: Anda kemudian dapat melanjutkan dengan xref:install/Installing_Using_Anaconda.adoc#chap-installing-using-anaconda[Instalasi Memakai Anaconda].

source: Installing in VNC Connect Mode
id: Memasang dalam Mode VNC Connect

source: VNC connect mode is when the system being installed initiates a connection to the VNC viewer running on a remote system. Before you start, make sure the remote system is configured to accept incoming connection on the port you want to use for VNC. The exact way to make sure the connection will not be blocked depends on your network and on your workstation's configuration. Information about configuring the firewall in {PRODUCT} is available in the [citetitle]_{PRODUCT} Security{nbsp}Guide_, available at link:++https://docs.fedoraproject.org/++[].
id: Mode hubung VNC adalah ketika sistem yang sedang diinstal memulai koneksi ke penampil VNC yang berjalan pada sistem jarak jauh. Sebelum Anda mulai, pastikan sistem jarak jauh dikonfigurasi untuk menerima koneksi masuk pada port yang ingin Anda gunakan untuk VNC. Cara yang tepat untuk memastikan koneksi tidak akan diblokir tergantung pada jaringan Anda dan pada konfigurasi workstation Anda. Informasi tentang konfigurasi firewall di {PRODUCT} tersedia di [citetitle]_{PRODUCT} Panduan{nbsp}Keamanan, tersedia di link:++https://docs.fedoraproject.org/++[].

source: Starting VNC in Connect Mode
id: Memulai VNC dalam Mode Hubung

source: Start the VNC viewer on the client system in listening mode. For example, on {PRODUCT} using [application]*TigerVNC*, execute the following command:
id: Jalankan penampil VNC pada sistem klien dalam mode mendengarkan. Misalnya, pada {PRODUCT} menggunakan [application]*TigerVNC*, jalankan perintah berikut:

source: Replace _PORT_ with the port number you want to use for the connection.
id: Ganti _PORT_ dengan nomor port yang ingin Anda gunakan untuk koneksi.

source: The terminal will display a message similar to the following example:
id: Terminal akan menampilkan pesan yang mirip dengan contoh berikut:

source: TigerVNC Viewer Listening
id: Penampil TigerVNC Mendengarkan

source: When this message is displayed, the VNC viewer is ready and waiting for an incoming connection from the installation system.
id: Ketika pesan ini ditampilkan, penampil VNC siap dan menunggu koneksi masuk dari sistem instalasi.

source: Boot the installation system and wait for the boot menu to appear. In the menu, edit boot options (see xref:install/Booting_the_Installation.adoc#sect-boot-menu[The Boot Menu]) and append the following options to the end of the command line:
id: Boot sistem instalasi dan tunggu menu boot muncul. Di menu, sunting opsi boot (lihat xref:install/Booting_the_Installation.adoc#sect-boot-menu[Menu Boot]) dan tambahkan opsi berikut ke akhir baris perintah:

source: Replace _HOST_ with the IP address of the system running the listening VNC viewer, and _PORT_ with the port number that the VNC viewer is listening on.
id: Ganti _HOST_ dengan alamat IP sistem yang menjalankan penampil VNC yang mendengarkan, dan _PORT_ dengan nomor port tempat penampil VNC mendengarkan.

source: Start the installation. The system will initialize the installation program and start the necessary services. Once the initialization is finished, [application]*Anaconda* will attempt to connect to the IP address and port you provided in the previous step.
id: Mulai instalasi. Sistem akan menginisialisasi program instalasi dan memulai layanan yang diperlukan. Setelah inisialisasi selesai, [application]*Anaconda* akan mencoba terhubung ke alamat IP dan port yang Anda berikan pada langkah sebelumnya.

source: Kickstart Considerations
id: Pertimbangan Kickstart

source: Commands for using a VNC installation are also available in Kickstart installations. Using just the [command]#vnc# command will set up an installation using Direct Mode. Options are available to set up an installation using Connect Mode. For more information about the [command]#vnc# command and options used in Kickstart files, see xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference].
id: Perintah untuk menggunakan instalasi VNC juga tersedia di instalasi Kickstart. Hanya dengan menggunakan perintah [command]#vnc# akan mengatur instalasi menggunakan Direct Mode. Opsi tersedia untuk menyiapkan instalasi menggunakan Connect Mode. Untuk informasi selengkapnya tentang perintah dan opsi [command]#vnc# yang digunakan dalam berka Kickstart, lihat xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Acuan Sintaks Kickstart].

source: Considerations for Headless Systems
id: Pertimbangan untuk Sistem Tanpa Monitor

source: When installing headless systems, the only choices are an automated Kickstart installation or an interactive VNC installation using connect mode. For more information about automated Kickstart installation, see xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference]. The general process for an interactive VNC installation is described below.
id: Saat menginstal sistem tanpa monitor, satu-satunya pilihan adalah instalasi Kickstart otomatis atau instalasi VNC interaktif menggunakan mode hubung. Untuk informasi selengkapnya tentang instalasi Kickstart otomatis, lihat xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Acuan Sintaks Kickstart]. Proses umum untuk instalasi VNC interaktif dijelaskan di bawah ini.

source: Set up a PXE server that will be used to start the installation. Information about installing and performing basic configurating of a PXE server can be found in xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Setting Up an Installation Server].
id: Siapkan server PXE yang akan digunakan untuk memulai instalasi. Informasi tentang memasang dan melakukan konfigurasi dasar server PXE dapat ditemukan di xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Menyiapkan Server Instalasi].

source: Configure the PXE server to use the boot options for a connect mode VNC installation. For information on these boot options, see xref:sect-vnc-installations-connect-mode[Installing in VNC Connect Mode].
id: Konfigurasikan server PXE agar menggunakan opsi boot untuk instalasi VNC mode hubung. Untuk informasi tentang opsi boot ini, lihat xref:sect-vnc-installations-connect-mode[Memasang dalam VNC Mode Hubung].

source: Follow the procedure for a VNC Installation using connect mode as described in the xref:proc-vnc-installations-connect-mode[Starting VNC in Connect Mode]. However, when directed to boot the system, boot it from the PXE server.
id: Ikuti prosedur untuk Instalasi VNC menggunakan mode hubung seperti yang dijelaskan dalam xref:proc-vnc-installations-connect-mode[Memulai VNC dalam Mode Hubung]. Namun, ketika diarahkan untuk mem-boot sistem, boot dari server PXE.
