Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/install/Installing_Using_Anaconda.po
Languages: pt_br

source: Installing Using Anaconda
pt_br: Instalando Usando Anaconda

source: This chapter provides step-by-step instructions for installing {PRODUCT} using the [application]*Anaconda* installer. The bulk of this chapter describes installation using the graphical user interface. A text mode is also available for systems with no graphical display, but this mode is limited in certain aspects (for example, custom partitioning is not possible in text mode).
pt_br: Este capítulo fornece instruções passo a passo para instalar o {PRODUCT} usando o instalador [application]*Anaconda*. A maior parte deste capítulo descreve a instalação usando a interface gráfica do usuário. Um modo de texto também está disponível para sistemas sem exibição gráfica, mas esse modo é limitado em certos aspectos (por exemplo, o particionamento personalizado não é possível no modo de texto).

source: If your system does not have the ability to use the graphical mode, you can:
pt_br: Se o seu sistema não puder usar o modo gráfico, você pode:

source: Introduction to Anaconda
pt_br: Introdução ao Anaconda

source: The {PRODUCT} installer, [application]*Anaconda*, is different from most other operating system installation programs due to its parallel nature. Most installers follow a fixed path: you must choose your language first, then you configure network, then installation type, then partitioning, etc. There is usually only one way to proceed at any given time.
pt_br: O instalador do {PRODUCT}, [application]*Anaconda*, é diferente da maioria dos outros programas de instalação de sistema operacional devido à sua natureza paralela. A maioria dos instaladores segue um caminho fixo: você deve escolher primeiro seu idioma, depois configurar a rede, o tipo de instalação, o particionamento etc. Geralmente, há apenas uma maneira de proceder a qualquer momento.

source: In [application]*Anaconda* you are only required to select your language and locale first, and then you are presented with a central screen, where you can configure most aspects of the installation in any order you like. This does not apply to all parts of the installation process, however - for example, when installing from a network location, you must configure the network before you can select which packages to install.
pt_br: No [application]*Anaconda*, você só precisa selecionar seu idioma e local primeiro e, em seguida, é apresentada uma tela central, onde pode configurar a maioria dos aspectos da instalação na ordem que desejar. No entanto, isso não se aplica a todas as partes do processo de instalação - por exemplo, ao instalar de um local de rede, você deve configurar a rede antes de selecionar quais pacotes instalar.

source: Some screens will be automatically configured depending on your hardware and the type of media you used to start the installation. You can still change the detected settings in any screen. Screens which have not been automatically configured, and therefore require your attention before you begin the installation, are marked by an exclamation mark. You can not start the actual installation process before you finish configuring these settings.
pt_br: Algumas telas serão configuradas automaticamente dependendo do seu hardware e do tipo de mídia que você usou para iniciar a instalação. Você ainda pode alterar as configurações detectadas em qualquer tela. As telas que não foram configuradas automaticamente e, portanto, requerem sua atenção antes de iniciar a instalação, são marcadas por um ponto de exclamação. Você não pode iniciar o processo de instalação real antes de terminar de definir essas configurações.

source: Additional differences appear in certain screens; notably the custom partitioning process is very different from other Linux distributions. These differences are described in each screen's subsection.
pt_br: Diferenças adicionais aparecem em certas telas; notavelmente, o processo de particionamento personalizado é muito diferente de outras distribuições Linux. Essas diferenças são descritas na subseção de cada tela.

source: Consoles and Logging During the Installation
pt_br: Consoles e Registro de Logs Durante a Instalação

source: The following sections describe how to access logs and an interactive shell during the installation. This is useful when troubleshooting problems, but should not be necessary in most cases.
pt_br: As seções a seguir descrevem como acessar os logs e um shell interativo durante a instalação. Isso é útil ao solucionar problemas, mas não deve ser necessário na maioria dos casos.

source: Accessing Consoles
pt_br: Acessando Consoles

source: The {PRODUCT} installer uses the [application]*tmux* terminal multiplexer to display and control several windows you can use in addition to the main interface. Each of these windows serves a different purpose - they display several different logs, which can be used to troubleshoot any issues during the installation, and one of the windows provides an interactive shell prompt with `root` privileges, unless this prompt was specifically disabled using a boot option or a Kickstart command.
pt_br: O instalador do {PRODUCT} usa o multiplexador de terminal [application]*tmux* para exibir e controlar várias janelas que você pode usar além da interface principal. Cada uma dessas janelas tem um propósito diferente - elas exibem vários logs diferentes, que podem ser usados para solucionar quaisquer problemas durante a instalação, e uma das janelas fornece um prompt de shell interativo com privilégios de `root`, a menos que este prompt tenha sido especificamente desabilitado usando uma opção de inicialização ou um comando Kickstart.

source: In general, there is no reason to leave the default graphical installation environment unless you need to diagnose an installation problem.
pt_br: Em geral, não há razão para deixar o ambiente de instalação gráfico padrão, a menos que você precise diagnosticar um problema de instalação.

source: The terminal multiplexer is running in virtual console 1. To switch from the actual installation environment to [application]*tmux*, press kbd:[Ctrl + Alt + F1]. To go back to the main installation interface which runs in virtual console 6, press kbd:[Ctrl + Alt + F6].
pt_br: O multiplexador de terminal esta sendo executado no console virtual 1. Para mudar do ambiente de instalação real para [application]*tmux*, pressione kbd:[Ctrl + Alt + F1]. Para voltar para a interface principal da instalação, que é executada no console virtual 6, pressione kbd:[Ctrl + Alt + F6].

source: If you choose text mode installation, you will start in virtual console 1 ([application]*tmux*), and switching to console 6 will open a shell prompt instead of a graphical interface.
pt_br: Se você escolher a instalação em modo texto, você iniciará no console virtual 1 ([application]*tmux*) e alternar para o console 6 abrirá um prompt de shell em vez de uma interface gráfica.

source: The console running [application]*tmux* has 5 available windows; their contents are described in the table below, along with keyboard shortcuts used to access them. Note that the keyboard shortcuts are two-part: first press kbd:[Ctrl + b], then release both keys, and press the number key for the window you want to use.
pt_br: O console executando o [application]*tmux* possui 5 janelas disponíveis; seu conteúdo é descrito na tabela a seguir, junto com os atalhos de teclado usados para acessá-los. Observe que os atalhos de teclado têm duas partes: primeiro pressione kbd:[Ctrl + b], em seguida, solte as duas teclas e pressione a tecla numérica da janela que deseja usar.

source: You can also use kbd:[Ctrl + b] kbd:[n] and kbd:[Ctrl + b] kbd:[p] to switch to the next or previous [application]*tmux* window, respectively.
pt_br: Você também pode usar kbd:[Ctrl + b] kbd:[n] e kbd:[Ctrl + b] kbd:[p] para alternar para a janela seguinte e a anterior do [application]*tmux*, respectivamente.

source: Available tmux Windows
pt_br: Janelas disponíveis do tmux

source: |Shortcut|Contents |kbd:[Ctrl + b] kbd:[1]|Main installation program window. Contains text-based prompts (during text mode installation or if you use VNC direct mode), and also some debugging information. |kbd:[Ctrl + b] kbd:[2]|Interactive shell prompt with `root` privileges. |kbd:[Ctrl + b] kbd:[3]|Installation log; displays messages stored in `/tmp/anaconda.log`. |kbd:[Ctrl + b] kbd:[4]|Storage log; displays messages related storage devices from kernel and system services, stored in `/tmp/storage.log`. |kbd:[Ctrl + b] kbd:[5]|Program log; displays messages from other system utilities, stored in `/tmp/program.log`.
pt_br: |Atalho|Conteúdo |kbd:[Ctrl + b] kbd:[1]|Janela principal do programa de instalação. Contém prompts baseados em texto (durante a instalação em modo texto ou se você usar o modo direto VNC) e também algumas informações de depuração. |kbd:[Ctrl + b] kbd:[2]|Prompt de shell interativo com privilégios de `root`. |kbd:[Ctrl + b] kbd:[3]|Registro de instalação; exibe mensagens armazenadas em `/tmp/anaconda.log`. |kbd:[Ctrl + b] kbd:[4]|Registro de armazenamento; exibe mensagens relacionadas a dispositivos de armazenamento do kernel e serviços do sistema, armazenados em `/tmp/storage.log`. |kbd:[Ctrl + b] kbd:[5]|Registro do programa; exibe mensagens de outros utilitários do sistema, armazenados em `/tmp/program.log`.

source: Saving Screenshots
pt_br: Salvando capturas de tela

source: You can press kbd:[Shift + Print Screen] at any time during the graphical installation to capture the current screen. These screenshots are saved to `/tmp/anaconda-screenshots`.
pt_br: Você pode pressionar kbd:[Shift + Print Screen] a qualquer momento durante a instalação gráfica para capturar a tela atual. Estas capturas de tela são salvas em `/tmp/anaconda-screenshots`.

source: Installing in Text Mode
pt_br: Instalando no modo texto

source: Text mode installation offers an interactive, non-graphical interface for installing {PRODUCT}. This may be useful on systems with no graphical capabilities; however, you should always consider the available alternatives before starting a text-based installation. Text mode is limited in the amount of choices you can make during the installation.
pt_br: A instalação em modo texto oferece uma interface interativa e não gráfica para a instalação de {PRODUCT}. Isso pode ser útil em sistemas sem recursos gráficos; entretanto, você deve sempre considerar as alternativas disponíveis antes de iniciar uma instalação baseada em texto. O modo de texto é limitado na quantidade de escolhas que você pode fazer durante a instalação.

source: Text Mode Installation
pt_br: Instalação modo texto

source: The main menu in during a text-based installation.
pt_br: O menu principal durante uma instalação baseada em texto.

source: Installation in text mode follows a pattern similar to the graphical installation: There is no single fixed progression; you can configure many settings in any order you want using the main status screen. Screens which have already been configured, either automatically or by you, are marked as `[x]`, and screens which require your attention before the installation can begin are marked with `[!]`. Available commands are displayed below the list of available options.
pt_br: A instalação em modo texto segue um padrão semelhante à instalação gráfica: não há uma única progressão fixa; você pode definir várias configurações em qualquer ordem que desejar usando a tela de status principal. As telas que já foram configuradas, automaticamente ou por você, são marcadas como `[x]`, e as telas que requerem sua atenção antes que a instalação possa começar são marcadas com `[!]`. Os comandos disponíveis são exibidos abaixo da lista de opções disponíveis.

source: Limits of interactive text mode installation include:
pt_br: Os limites da instalação em modo de texto interativo incluem:

source: The installer will always use the English language and the US English keyboard layout. You can configure your language and keyboard settings, but these settings will only apply to the installed system, not to the installation.
pt_br: O instalador sempre usará o idioma inglês e o layout de teclado inglês americano. Você pode definir as configurações de idioma e teclado, mas essas configurações se aplicarão apenas ao sistema instalado, não à instalação.

source: You can not configure any advanced storage methods (LVM, software RAID, FCoE, zFCP and iSCSI).
pt_br: Você não pode configurar nenhum método de armazenamento avançado (LVM, RAID de software, FCoE, zFCP e iSCSI).

source: It is not possible to configure custom partitioning; you must use one of the automatic partitioning settings. You also cannot configure where the boot loader will be installed.
pt_br: Não é possível configurar o particionamento customizado; você deve usar uma das configurações de particionamento automático. Você também não pode configurar onde o carregador de inicialização será instalado.

source: Installing in the Graphical User Interface
pt_br: Instalando na interface gráfica do usuário

source: The graphical installation interface is the preferred method of manually installing {PRODUCT}. It allows you full control over all available settings, including custom partitioning and advanced storage configuration, and it is also localized to many languages other than English, allowing you to perform the entire installation in a different language. The graphical mode is used by default when you boot the system from local media (a CD, DVD or a USB flash drive).
pt_br: A interface gráfica de instalação é o método preferido de instalação manual do {PRODUCT}. Ela permite a você controle total sobre todas as configurações disponíveis, incluindo particionamento personalizado e configuração de armazenamento avançada, e também está localizado em muitos idiomas além do inglês, permitindo que você execute toda a instalação em um idioma diferente. O modo gráfico é usado por padrão quando você inicializa o sistema a partir da mídia local (um CD, DVD ou uma unidade flash USB).

source: The sections below discuss each screen available in the installation process. Note that due to the installer's parallel nature, most of the screens do not have to be completed in the order in which they are described here.
pt_br: As seções a seguir discutem cada tela disponível no processo de instalação. Observe que, devido à natureza paralela do instalador, a maioria das telas não precisa ser concluída na ordem em que são descritas aqui.

source: Each screen in the graphical interface contains a `Help` button. This button opens the [application]*Yelp* help browser displaying the section of the _{PRODUCT} Installation Guide_ relevant to the current screen.
pt_br: Cada tela da interface gráfica contém um botão `Ajuda`. Este botão abre o navegador de ajuda do [application]*Yelp* exibindo a seção do _guia de instalação do {PRODUCT}_ relevante para a tela atual.

source: You can also control the graphical installer with your keyboard. Use kbd:[Tab] and kbd:[Shift + Tab] to cycle through active control elements (buttons, check boxes, etc.) on the current screen, kbd:[Up] and kbd:[Down] arrow keys to scroll through lists, and kbd:[Left] and kbd:[Right] to scroll through horizontal toolbars or table entries. kbd:[Space] or kbd:[Enter] can be used to select or remove a highlighted item from selection and to expand and collapse drop-down menus.
pt_br: Você também pode controlar o instalador gráfico com o teclado. Use kbd:[Tab] e kbd:[Shift + Tab] para percorrer os elementos de controle ativos (botões, caixas de seleção, etc.) na tela atual, kbd:[Up] e kbd:[Down] teclas de seta para rolar através listas e kbd:[Esquerda] e kbd:[Direita] para rolar pelas barras de ferramentas horizontais ou entradas da tabela. kbd:[Espaço] ou kbd:[Enter] pode ser usado para selecionar ou remover um item destacado da seleção e para expandir e recolher os menus suspensos.

source: Additionally, elements in each screen can be toggled using their respective shortcuts. These shortcuts are highlighted (underlined) when you hold down the kbd:[Alt] key; to toggle that element, press kbd:[Alt + _X_pass:attributes[{blank}]], where _X_ is the highlighted letter.
pt_br: Além disso, os elementos em cada tela podem ser alternados usando seus respectivos atalhos. Esses atalhos são destacados (sublinhados) quando você mantém pressionada a tecla kbd:[Alt]; para alternar esse elemento, pressione kbd:[Alt + _X_pass:attributes[{blank}]], onde _X_ é a letra destacada.
