Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/install/Preparing_for_Installation.po
Languages: tr

source: Preparing for Installation
tr: Kurulum için Hazırlama

source: This chapter describes the steps you need take before you begin the installation. Not every step must be strictly followed - for example, if you plan to use the default installation settings, you do not need to gather system information such as disk device labels/UUIDs or network information such as the system's IP address. However, you should still go through this chapter, as it also describes the available types of installation media and how to prepare boot media and installation sources.
tr: Bu bölümde, kuruluma başlamadan önce atmanız gereken adımlar açıklanmaktadır. Her adımın kesinlikle takip edilmesi gerekmemektedir - örneğin, varsayılan kurulum ayarlarını kullanmayı planlıyorsanız, disk aygıtı etiketleri/UUID'leri gibi sistem bilgilerini veya sistemin IP adresi gibi ağ bilgilerini toplamanız gerekmez. Bununla birlikte, kullanılabilir kurulum ortamı türlerini ve önyükleme ortamı ve kurulum kaynaklarının nasıl hazırlanacağını da açıkladığı için bu bölümü gözden geçirmeniz gerekmektedir.

source: Upgrade or Install?
tr: Yükseltme ya da Kurma?

source: If you already have Fedora installed and want to upgrade your installation to the current version, there are two basic ways to do so:
tr: Fedora zaten yüklüyse ve kurulumunuzu şu anki güncel sürüme yükseltmek istiyorsanız, bunu yapmanın iki temel yolu vardır:

source: Automatic upgrade using [application]*dnf system upgrade*
tr: [application]*dnf sistem yükseltme* kullanarak otomatik yükseltme

source: The preferred way to upgrade your system is an automatic upgrade using the [application]*dnf system upgrade* utility. For information on performing an automatic upgrade, see link:++https://fedoraproject.org/wiki/DNF_system_upgrade++[Fedora Wiki dnf system upgrade].
tr: Sisteminizi yükseltmenin tercih edilen yolu, [application]*dnf sistem yükseltme* aracını kullanarak otomatik bir yükseltme yapmaktır. Otomatik yükseltme yapma hakkında bilgi için, link:++https://fedoraproject.org/wiki/DNF_system_upgrade++[Fedora Wiki dnf sistem yükseltme] sayfasına bakın.

source: Manual Reinstallation
tr: Manuel olarak yeniden kurulum

source: You can upgrade to the latest version of Fedora manually instead of relying on [application]*dnf system upgrade*. This involves booting the installer as if you were performing a clean installation, letting it detect your existing Fedora system, and overwriting the root partition while preserving data on other partitions and volumes. The same process can also be used to reinstall the system, if you need to. For detailed information, see xref:../advanced/Upgrading_Your_Current_System.adoc#sect-upgrading-fedora-manual-reinstall[Manual System Upgrade or Reinstallation].
tr: [application]*dnf sistem yükseltme* kullanmak yerine, Fedora'nın en son sürümüne manuel olarak yükseltebilirsiniz. Bu, yükleyiciyi baştan bir kurulum yapıyormuş gibi önyüklemeyi, mevcut Fedora sisteminizi algılamasını sağlamayı ve diğer bölümler ve birimlerdeki verilere dokunmadan kök bölümünün üzerine yazmayı içermektedir. Aynı işlem gerekirse sistemi yeniden kurmak için de kullanılabilir. Ayrıntılı bilgi için xref:../advanced/Upgrading_Your_Current_System.adoc#sect-upgrading-fedora-manual-reinstall[Manuel Sistem Yükseltme veya Yeniden Kurulum] bölümüne bakın.

source: Always back up your data before performing an upgrade or reinstalling your system, no matter which method you choose.
tr: Hangi yöntemi seçerseniz seçin, sisteminizi yükseltmeden veya yeniden kurmadan önce her zaman verilerinizi yedekleyin.

source: Downloading Boot and Installation Images
tr: Önyükleme ve Kurulum Görüntülerini İndirme

source: The Fedora Project offers different Editions tailored for some specific use cases. Choose the Fedora Edition best for you, or you can build your own by customizing after the installation, or by using a kickstart file as described in xref:../advanced/Kickstart_Installations.adoc#sect-kickstart-file-create[Creating a Kickstart File]. Kickstart installation requires the `netinstall` media type, or a direct installation booting method such as PXE; kickstarts are not supported with live images.
tr: Fedora Projesi, bazı özel kullanım durumlarına göre uyarlanmış farklı sürümler sunmaktadır. Sizin için en uygun Fedora sürümünü seçebilir veya kurulum işleminden sonra özelleştirerek veya xref:../advanced/Kickstart_Installations.adoc#sect-kickstart-file-create[Kickstart Dosyası Oluşturma] bölümünde açıklandığı gibi bir kickstart dosyası kullanarak kendinize özel bir tane oluşturabilirsiniz. Kickstart kurulumu için `netinstall` ortam türü veya PXE gibi doğrudan kurulum önyükleme yöntemi gerekmektedir; kickstart canlı görüntülerle desteklenmez.

source: Read more about Fedora Workstation, Fedora Cloud, Fedora Server and the available media types in xref:../Downloading_Fedora.adoc#chap-downloading-fedora[Downloading Fedora].
tr: Fedora Workstation, Fedora Cloud, Fedora Server ve kullanılabilir ortam türleri hakkında xref:../Downloading_Fedora.adoc#chap-downloading-fedora[Fedora'yı İndirme] bölümünde daha fazla bilgi edinin.

source: You can also choose a Fedora _Spin_ featuring favorite alternative desktops or tools for specialized tasks at link:++http://spins.fedoraproject.org++[].
tr: Ayrıca favori alternatif masaüstü ortamınızı veya özel görevler için araçlarınızı içeren bir Fedora _Spinini_ link:++https://spins.fedoraproject.org++[] adresinde seçebilirsiniz.

source: Verifying the Downloaded Image
tr: İndirilen Görüntüyü Doğrulama

source: Because transmission errors or other problems may corrupt the Fedora image you have downloaded, it is important to verify the file's integrity. After the images are created, an operation is performed on the file that produces a value called a `checksum` using a complex mathematical algorithm. The operation is sufficiently complex that *any change* to the original file will produce a different checksum.
tr: Aktarım hataları veya diğer sorunlar indirdiğiniz Fedora görüntüsünü bozabileceğinden, dosyanın bütünlüğünü doğrulamak önemlidir. Görüntüler oluşturulduktan sonra, dosya üzerinde karmaşık bir matematik algoritması kullanarak `checksum` (sağlama toplamı) adı verilen bir değer üreten bir işlem gerçekleştirilmektedir. İşlem, orijinal dosyada yapılan *herhangi bir değişikliğin* farklı bir sağlama toplamı üreteceği kadar karmaşıktır.

source: By calculating the image's `checksum` on your own computer and comparing it to the original `checksum`, you can verify the image has not been tampered with or corrupted. The original checksum values are provided at link:++https://fedoraproject.org/verify++[], and are [command]#gpg# signed to demonstrate their integrity.
tr: Görüntünün `checksum` değerini kendi bilgisayarınızda hesaplayarak ve orijinal `checksum` değeriyle karşılaştırarak görüntünün değiştirilmediğini veya bozulmadığını doğrulayabilirsiniz. Orijinal sağlama toplamı değerleri link:++https://getfedora.org/security/++[] adresinde bulunmaktadır ve bütünlüklerini kanıtlamak için [command]#gpg# ile imzalanmışlardır.

source: Verifying checksums on Windows systems
tr: Windows sistemlerinde sağlama toplamlarını doğrulama

source: Download the Fedora image of your choice from link:++https://fedoraproject.org/get-fedora++[] and the corresponding checksum file from link:++https://fedoraproject.org/verify++[]
tr: Seçtiğiniz Fedora görüntüsünü link:++https://fedoraproject.org/get-fedora++[] adresinden ve karşılık gelen sağlama toplamı dosyasını link:++https://getfedora.org/security/++[] adresinden indirin.

source: Open a [command]#powershell# session.
tr: Bir [command]#powershell# oturumu açın.

source: Change to the directory containing the downloaded files.
tr: İndirilen dosyaları içeren dizine gidin.

source: Load the resources required to calculate the checksum.
tr: Sağlama toplamını hesaplamak için gereken kaynakları yükleyin.

source: Calculate the downloaded image's checksum. This will take a while!
tr: İndirilen görüntünün sağlama toplamını hesaplayın. Bu işlem biraz zaman alacaktır!

source: Compare the calculated checksum to the expected checksum.
tr: Hesaplanan sağlama toplamını beklenen sağlama toplamıyla karşılaştırın.

source: > echo "Download Checksum: $download_checksum" > echo "Expected Checksum: $expected_checksum" > if ( $download_checksum -eq "$expected_checksum" ) { echo "Checksum test passed!" } else { echo "Checksum test failed." }
tr: > echo "İndirilenin Sağlama Toplamı: $download_checksum" > echo "Beklenen Sağlama Toplamı: $expected_checksum" > if ( $download_checksum -eq "$expected_checksum" ) { echo "Sağlama toplamı testi geçti!" } else { echo "Sağlama toplamı testi başarısız oldu." }

source: Verifying checksums on Linux and OSX systems
tr: Linux ve OSX sistemlerinde sağlama toplamlarını doğrulama

source: Open a terminal window, and navigate to the directory with the downloaded files.
tr: Bir terminal penceresi açın ve indirilen dosyaların bulunduğu dizine gidin.

source: $ [command]#cd ~/Downloads#
tr: $ [command]#cd ~/İndirilenler#

source: Use the appropriate utility to verify the image checksum.
tr: Görüntünün sağlama toplamını doğrulamak için uygun aracı kullanın.

source: For Linux:
tr: Linux için:

source: For OSX:
tr: OSX için:

source: Preparing Boot Media
tr: Önyükleme Ortamını Hazırlama

source: Fedora images are `Hybrid ISOs` and can be used to create installation media with both optical and USB disks, for booting on both BIOS and UEFI systems.
tr: Fedora görüntüleri `Hibrit ISO` dosyalarıdır ve hem BIOS hem de UEFI sistemlerinde önyükleme yapmak için, optik ve USB disklerle kurulum ortamı oluşturmakta kullanılabilir.

source: Fedora Media Writer and Universal USB Creators
tr: Fedora Media Writer ve Yaygın USB Oluşturucuları

source: [application]*Fedora Media Writer* has been improved and is now the default way to make bootable media. [application]*Fedora Media Writer* supports Linux, Mac, and Windows. It is an easy way to make bootable USB media to install Fedora (or other operating systems). While use of Fedora Media Writer is strongly encouraged, other USB media creation software can work as well.
tr: [application]*Fedora Media Writer* önemli ölçüde iyileştirildi ve artık varsayılan önyüklenebilir ortam oluşturma yoludur. [application]*Fedora Media Writer* Linux, Mac ve Windows'u desteklemektedir. Fedora'yı (veya diğer işletim sistemlerini) kurmak için önyüklenebilir USB ortamı oluşturmanın kolay bir yoludur. Diğer USB ortam oluşturma programları da düzgün çalışmaktadır, bununla birlikte [application]*Fedora Media Writer* kullanılması şiddetle önerilir.

source: Some of the new additions to [application]*Fedora Media Writer* are that Fedora Workstation and Server are the first choices on the main screen. However more choices are available if you select the button below "Custom OS". Options like Fedora Spins will appear. Fedora Spins such as XFCE and Mate will be selectable.
tr: [application]*Fedora Media Writer* için yeni özelliklerden bazıları, Fedora Workstation ve Server sürümlerinin ana ekrandaki ilk seçenekler olmasıdır. "Özel İşletim Sistemi"nin altındaki düğmeyi seçerseniz başka seçenekler de mevcuttur. Fedora Spinleri gibi seçenekler görünecektir. Xfce veya Mate gibi Fedora Spinleri seçilebilir olacaktır.

source: Universal USB creation tools such as [application]*Unetbootin* are a historically popular way to create USB installers from ISOs intended for optical media. They typically function by creating a filesystem on the USB drive, extracting files from the image, and writing [application]*syslinux* bootloader to the device.
tr: [application]*Unetbootin* gibi yaygın USB oluşturma araçları, optik ortamlar için tasarlanan ISO'lardan USB yükleyicileri oluşturmanın tarihsel olarak popüler bir yoludur. Genellikle USB sürücüde bir dosya sistemi oluşturarak, görüntüdeki dosyaları çıkararak ve [application]*syslinux* önyükleyicisini aygıta yazarak çalışırlar.

source: These methods circumvent the boot-loader configuration built into Fedora images, which are pre-partitioned and designed to boot on UEFI systems with SecureBoot enabled as well as BIOS systems. They do not produce a consistent result with Fedora's images, especially for use with UEFI systems.
tr: Bu yöntemler, SecureBoot etkinleştirilmiş UEFI sistemlerinin yanı sıra BIOS sistemlerinde de önyükleme yapmak üzere bölümlendirilmiş ve tasarlanmış olan Fedora görüntülerindeki önyükleyici ayarlarını atlar. Fedora görüntüleri ile, özellikle UEFI sistemlerinde tutarlı sonuçlar vermezler.

source: Utilities that use a direct write method, and do not modify the Fedora image, will produce the most consistently successful results.
tr: Doğrudan yazma yöntemi kullanan ve Fedora görüntüsünü değiştirmeyen araçlar en tutarlı şekilde başarılı sonuçlar verecektir.

source: Be sure you choose the right device!
tr: Doğru aygıtı seçtiğinizden emin olun!

source: Most media creation methods in this section are destructive. Ensure you do not need any data on the USB stick, and double check you have chosen the correct device before continuing.
tr: Bu bölümdeki ortam oluşturma yöntemlerinin çoğu yıkıcıdır. USB bellekteki herhangi bir veriye ihtiyacınız olmadığından emin olun ve devam etmeden önce doğru aygıtı seçtiğinizi tekrar kontrol edin.

source: Creating USB Media on Windows
tr: USB ortamını Windows'ta oluşturma

source: Download the latest Windows Installer file from Marin Briza's github page: link:++https://github.com/MartinBriza/MediaWriter/releases++[https://github.com/MartinBriza/MediaWriter/releases].
tr: Marin Briza'nın github sayfasından en son Windows Installer dosyasını indirin: link:++https://github.com/MartinBriza/MediaWriter/releases++[https://github.com/MartinBriza/MediaWriter/releases].

source: Run the installation by double clicking it, and then clicking next through the set-up wizard. The Wizard gives you the options to customize the software's installation if you choose to.
tr: Çift tıklayarak kurulumu çalıştırın ve ardından kurulum sihirbazını takip ederek devam edin. Sihirbaz, isterseniz yazılımın kurulumunu özelleştirmenize izin vermektedir.

source: In Windows 8 and 10, the application will be under "all apps" under F for [application]*Fedora Media Writer*. Or in Windows 10, you can just type [application]*Fedora Media Writer* in the search box on the task bar.
tr: Windows 8 ve 10'da uygulama, "tüm uygulamalar" altındaki [application]*Fedora Media Writer* için _F_ harfi altında olacaktır. Windows 10'da, görev çubuğundaki arama kutusuna [application]*Fedora Media Writer* yazmanız yeterlidir.

source: Select the Fedora Edition you wish to make a bootable USB drive for.
tr: Önyüklenebilir bir USB sürücü yapmak istediğiniz Fedora sürümünü seçin.

source: Fedora Media Writer Main Screen: Choose your Edition of Fedora
tr: Fedora Media Writer Ana Ekranı: Fedora Sürümünüzü Seçin

source: Image of Fedora Media Writer Main Screen
tr: Fedora Media Writer Ana Ekranının Görüntüsü

source: If you choose one of the beginning default Fedora editions, such as Fedora workstation or server. [application]*Fedora Media Writer* will give you information and details about it before you proceed with the download and USB creation. For Fedora Workstation, you can choose a different architecture, such as 32bit if you select "other architectures". Otherwise select "Create Live USB" to proceed.
tr: Fedora Workstation veya Server gibi varsayılan Fedora sürümlerinden birini seçerseniz, indirme ve USB oluşturma işlemine devam etmeden önce [application]*Fedora Media Writer* size bu konuda bilgi ve ayrıntılar verecektir. Fedora Workstation için, "diğer mimariler"i seçerseniz 32 bit gibi farklı bir mimari seçebilirsiniz. Aksi takdirde devam etmek için "Canlı USB Oluştur"u seçin.

source: Fedora Media Writer Distro Information
tr: Fedora Media Writer Dağıtım Bilgileri

source: Image of Fedora Media Writer Distro Information Screen
tr: Fedora Media Writer Dağıtım Bilgileri Ekranının Görüntüsü

source: Fedora Media Writer will automatically download the ISO for you, but if you all-ready have it in your Downloads directory it will be immediately available to use.
tr: Fedora Media Writer, ISO dosyasını sizin için otomatik olarak indirecektir, ancak eğer İndirilenler dizininizde zaten varsa indirmek yerine onu kullanacaktır.

source: Fedora Media Writer Automatic Download
tr: Fedora Media Writer Otomatik İndirme

source: Image of Fedora Media Writer Automatic Download
tr: Fedora Media Writer Otomatik İndirme Ekranının Görüntüsü

source: After the download completes, or when [application]*Fedora Media Writer* is ready. Plug in a USB drive you wish to use as a bootable media.
tr: İndirme işlemi tamamlandıktan sonra veya [application]*Fedora Media Writer* hazır olduğunda, önyüklenebilir ortam olarak kullanmak istediğiniz bir USB sürücüsünü takın.

source: Click the red "Write to disk" button.
tr: Kırmızı "Diske yaz" düğmesine tıklayın.

source: Fedora Media Writer Write to USB Device
tr: Fedora Media Writer USB Aygıta Yazma

source: Image of Fedora Media Writer write to device red button
tr: Fedora Media Writer Aygıta Yazma Kırmızı Düğmesinin Görüntüsü

source: Creating USB Media with Fedora Media Writer.
tr: USB ortamını Fedora Media Writer ile oluşturma.

source: On Fedora 25 or later, you can download Fedora Media Writer with the command:
tr: Fedora 25 veya sonrasında, Fedora Media Writer'ı aşağıdaki komutla indirebilirsiniz:

source: You can call [application]*Fedora Media Writer* by issuing the command:
tr: [application]*Fedora Media Writer*'ı aşağıdaki komutla çalıştırabilirsiniz:

source: or in [application]*Gnome 3* by selecting *Activities,* then selecting *Utilities*, and then selecting [application]*Fedora Media Writer*.
tr: veya [application]*Gnome 3*'te *Etkinlikler*'i, ardından *Araçlar*'ı ve ardından [application]*Fedora Media Writer*'ı seçerek.

source: Creating USB Media on Macintosh
tr: USB ortamını Macintosh'ta oluşturma

source: Download the latest Macintosh Disk Image (the package will have a .dmg extension) from Marin Briza's github page: link:++https://github.com/MartinBriza/MediaWriter/releases++[https://github.com/MartinBriza/MediaWriter/releases].
tr: Marin Briza'nın github sayfasından en son Macintosh Disk Image dosyasını indirin (paket, .dmg uzantısına sahip olacaktır): link:++https://github.com/MartinBriza/MediaWriter/releases++[https://github.com/MartinBriza/MediaWriter/releases].

source: Open the .dmg file and copy the mediawriter file into your applications folder.
tr: .dmg dosyasını açın mediawriter dosyasını uygulamalar klasörünüze kopyalayın.

source: Navigate to your applications directory, and then launch the mediawriter app.
tr: Uygulamalar dizininize gidin ve ardından mediawriter uygulamasını başlatın.

source: Mac OS will then ask if you are sure you want to open the file (it is from the internet after all), select "Open" to run the program.
tr: Mac OS daha sonra dosyayı açmak istediğinize emin olup olmadığınızı soracaktır (sonuçta internetten indirildi), programı çalıştırmak için "Aç" seçeneğini seçin.

source: Creating USB media with [application]*GNOME Disks*
tr: USB ortamını [application]*GNOME Diskler* ile oluşturma

source: On a system with [application]*GNOME*, or with the [package]*gnome-disk-utility* package installed, open `Disks` using the system menu.
tr: [application]*GNOME* veya [package]*gnome-disk-utility* kurulu bir sistemde, sistem menüsünü kullanarak `Diskler` uygulamasını açın.

source: Click your USB device in the left column.
tr: Sol sütunda USB aygıtınıza tıklayın.

source: Click the menu icon in the upper right corner of the window, and choose the `Restore Disk Image` option.
tr: Pencerenin sağ üst köşesindeki menü simgesini tıklayın ve `Disk Kalıbını Geri Yükle` seçeneğini seçin.

source: Navigate to your image file and click `Start Restoring`. After a few minutes, it will report the process is complete and your installation media will be ready to use.
tr: Görüntü dosyanıza gidin ve `Geri Yüklemeyi Başlat` düğmesine tıklayın. Birkaç dakika sonra, işlemin tamamlandığını ve kurulum ortamınızın kullanıma hazır olduğunu bildirecektir.

source: Creating USB Media on the Linux command line
tr: USB ortamını Linux komut satırında oluşturma

source: Open a terminal window and insert the usb drive.
tr: Bir terminal penceresi açın ve usb sürücüsünü takın.

source: Find the `device node` assigned to the drive. In the example below, the drive is given `sdd`.
tr: Sürücüye atanan `aygıt düğümünü` bulun. Aşağıdaki örnekte, sürücüye `sdd` verilmiştir.

source: Use the [command]#dd# utility to write the image. *Make sure you have the right drive!*
tr: Görüntüyü yazmak için [command]#dd# komutunu kullanın. *Doğru sürücüyü belirttiğinizden emin olun!*

source: # dd if=/path/to/Fedora-Live-Security-x86_64-21.iso of=/dev/sdd
tr: # dd if=/görüntü-dosyasının-bulunduğu-yol/Fedora-Live-Security-x86_64-21.iso of=/dev/sdd

source: Creating a Boot CD or DVD
tr: Önyükleme CD'si veya DVD'si oluşturma

source: In addition to creating a bootable USB flash drive, you can also use the provided ISO images to create bootable optical media (a CD or DVD). This approach may be necessary when installing {PRODUCT} on an older system which can not boot from USB.
tr: Önyüklenebilir bir USB flash sürücü oluşturmaya ek olarak, sağlanan ISO görüntülerini önyüklenebilir optik ortam (CD veya DVD) oluşturmak için de kullanabilirsiniz. Bu yaklaşım, USB'den önyükleme yapamayan eski bir sisteme {PRODUCT} kurarken gerekli olabilir.

source: The exact steps you need to take to burn a bootable CD or DVD from an ISO image will vary depending on what disc burning software you use. This procedure only offers a general overview.
tr: Bir ISO görüntüsünden önyüklenebilir bir CD veya DVD yazmak için atmanız gereken kesin adımlar, kullandığınız disk yazma programına bağlı olarak değişecektir. Buradaki yöntem sadece genel bir bakış sunar.

source: Insert a blank CD or DVD into your system's CD or DVD burner.
tr: Sisteminizin CD veya DVD yazıcısına boş bir CD veya DVD yerleştirin.

source: Open your system's burning software - for example, [application]*Brasero* on {PRODUCT} systems with [application]*GNOME* desktop environment, or [application]*Nero* on Windows systems. In the software's main menu, find an option which lets you burn an ISO image to a disc. For example, in [application]*Brasero*, this option is `Burn image` in the main menu on the left side of the window.
tr: Sisteminizin yazma programını açın - örneğin, [application]*GNOME* masaüstü ortamına sahip {PRODUCT} sistemlerinde [application]*Brasero* veya Windows sistemlerinde [application]*Nero*. Programın ana menüsünde, diske bir ISO görüntüsü yazmanıza izin veren bir seçenek bulun. Örneğin, [application]*Brasero*'da, bu seçenek pencerenin sol tarafındaki ana menüdeki `Kalıp yazdır` seçeneğidir.

source: When prompted, select the ISO image of {PRODUCT} to be burned, and the CD or DVD burner with a blank disc inside (if you have more than one drive).
tr: İstendiğinde, yazdırılacak {PRODUCT} ürününün ISO görüntüsünü ve içinde boş bir disk bulunan CD veya DVD yazıcıyı (birden fazla sürücünüz varsa) seçin.

source: Confirm your selection, and wait for the disc to be burned.
tr: Seçiminizi doğrulayın ve diskin yazdırılmasını bekleyin.
