Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f34/pages/install/Preparing_for_Installation.po
Languages: uk

source: Preparing for Installation
uk: Підготовка до встановлення

source: This chapter describes the steps you need take before you begin the installation. Not every step must be strictly followed - for example, if you plan to use the default installation settings, you do not need to gather system information such as disk device labels/UUIDs or network information such as the system's IP address. However, you should still go through this chapter, as it also describes the available types of installation media and how to prepare boot media and installation sources.
uk: У цьому розділі описано кроки, які необхідно виконати перед початком встановлення. Не потрібно суворо дотримуватися кожного кроку – наприклад, якщо ви плануєте використовувати параметри інсталяції за замовчуванням, вам не потрібно збирати системну інформацію, таку як мітки дискових пристроїв/UUID, або інформацію про мережу, таку як IP-адреса системи. Однак вам все одно слід ознайомитися з цією главою, оскільки в ній також описуються доступні типи інсталяційних носіїв і те, як підготувати завантажувальний носій і джерела інсталяції.

source: Upgrade or Install?
uk: Оновлення чи Встановлення?

source: If you already have Fedora installed and want to upgrade your installation to the current version, there are two basic ways to do so:
uk: Якщо у вас уже встановлено Fedora і ви хочете оновити інсталяцію до поточної версії, є два основні способи зробити це:

source: Automatic upgrade using [application]*dnf system upgrade*
uk: Автоматичне оновлення за допомогою [application]*dnf system upgrade*

source: The preferred way to upgrade your system is an automatic upgrade using the [application]*dnf system upgrade* utility. For information on performing an automatic upgrade, see link:++https://fedoraproject.org/wiki/DNF_system_upgrade++[Fedora Wiki dnf system upgrade].
uk: Найкращим способом оновлення системи є автоматичне оновлення за допомогою утиліти [application]*dnf system upgrade*. Щоб отримати інформацію щодо виконання автоматичного оновлення, перегляньте посилання:++https://fedoraproject.org/wiki/DNF_system_upgrade++[Fedora Wiki Оновлення системи за допомогою dnf].

source: Manual Reinstallation
uk: Перевстановлення вручну

source: You can upgrade to the latest version of Fedora manually instead of relying on [application]*dnf system upgrade*. This involves booting the installer as if you were performing a clean installation, letting it detect your existing Fedora system, and overwriting the root partition while preserving data on other partitions and volumes. The same process can also be used to reinstall the system, if you need to. For detailed information, see xref:advanced/Upgrading_Your_Current_System.adoc#sect-upgrading-fedora-manual-reinstall[Manual System Upgrade or Reinstallation].
uk: Ви можете оновити Fedora до останньої версії вручну замість того, щоб покладатися на [application]*dnf system upgrade*. Це передбачає завантаження інсталятора так, ніби ви виконуєте чисте встановлення, дозволяючи йому виявити наявну систему Fedora та перезаписуючи кореневий розділ, зберігаючи дані на інших розділах і томах. Цей же процес також можна використати для перевстановлення системи, якщо потрібно. Для додаткової інформації дивіться xref:advanced/Upgrading_Your_Current_System.adoc#sect-upgrading-fedora-manual-reinstall[Оновлення або перевстановлення системи вручну].

source: Always back up your data before performing an upgrade or reinstalling your system, no matter which method you choose.
uk: Завжди створюйте резервну копію даних перед оновленням або перевстановленням системи, незалежно від того, який метод ви виберете.

source: Preparing Boot Media
uk: Підготовка завантажувального носія

source: Fedora images are `Hybrid ISOs` and can be used to create installation media with both optical and USB disks, for booting on both BIOS and UEFI systems.
uk: Образи Fedora є «гібридними ISO», і їх можна використовувати для створення інсталяційних носіїв як з оптичними, так і з USB-дисками, для завантаження систем як з BIOS, так і з UEFI.

source: Some of the new additions to [application]*Fedora Media Writer* are that Fedora Workstation and Server are easily and quickly accessible from the selection on the main screen. Further choices are available if you select the button below _Custom image_. This offers a selection of various Fedora Spins, such as Xfce or Mate.
uk: Деякі з нових доповнень до [application]*Fedora Media Writer* полягають у тому, що робоча станція та сервер Fedora легко та швидко доступні для вибору на головному екрані. Інші варіанти доступні, якщо вибрати кнопку під _Власні образи_. Тут пропонується вибір різноманітних Fedora Spins, наприклад Xfce або Mate.

source: Historically, universal USB creation tools, such as [application]*Unetbootin*, are a popular way to create USB installers from ISOs intended for optical media. They typically create a filesystem on the USB drive by extracting files from the image, and writing [application]*syslinux* bootloader to the device.
uk: Історично склалося так, що універсальні інструменти створення USB, такі як [application]*Unetbootin*, є популярним способом створення програм встановлення USB з ISO, призначених для оптичних носіїв. Зазвичай вони створюють файлову систему на USB-накопичувачі, витягуючи файли з образу та записуючи завантажувач [application]*syslinux* на пристрій.

source: These methods circumvent the boot-loader configuration built into Fedora images, which are pre-partitioned and designed to boot on UEFI systems with SecureBoot enabled as well as BIOS systems, and thus they do not produce consistent results with Fedora images, especially on UEFI systems.
uk: Ці методи обходять конфігурацію завантажувача, вбудовану в образи Fedora, які попередньо розбиті на розділи та призначені для завантаження в системах UEFI з увімкненим SecureBoot, а також у системах BIOS, і тому вони не дають стабільних результатів із образами Fedora, особливо в системах UEFI .

source: The best results are produced by utilities that use a direct write method and do not modify the Fedora image.
uk: Найкращі результати дають утиліти, які використовують метод прямого запису і не змінюють образ Fedora.

source: Always think twice before writing an image to the device. The media creation methods described in this article are destructive. All data on the USB stick are deleted during the process, so make sure you have a back up of the data on the USB stick. Double check that you have selected correct device to write the image to!
uk: Завжди двічі подумайте, перш ніж записувати зображення на пристрій. Методи створення, описані в цій статті, є деструктивними. Усі дані на USB-накопичувачі видаляються під час процесу, тому переконайтеся, що у вас є резервна копія даних на USB-накопичувачі. Ще раз переконайтеся, що ви вибрали правильний пристрій для запису образу!

source: Installing and running Fedora Media Writer
uk: Встановлення та запуск Fedora Media Writer

source: On Fedora
uk: У Fedora

source: On Fedora 25 or later, [application]*Fedora Media Writer* is available in the default repository. You can use `dnf` to install the package.
uk: У Fedora 25 або пізнішої версії [application]*Fedora Media Writer* доступна у сховищі за замовчуванням. Ви можете використовувати `dnf` для встановлення пакета.

source: To install the [application]*Fedora Media Writer* using:
uk: Щоб установити [application]*Fedora Media Writer* використовуйте:

source: Run the [application]*Fedora Media Writer*:
uk: Запустіть [application]*Fedora Media Writer*:

source: or in [application]*Gnome 3* select *Activities* and then click on [application]*Fedora Media Writer*.
uk: або в [application]*Gnome 3* виберіть *Діяльність*, а потім натисніть [application]*Fedora Media Writer*.

source: On other Linux distributions
uk: В інших дистрибутивах Linux

source: The best way to install [application]*Fedora Media Writer* on various Linux distributions is to use the pre-built _Flatpak_ package. The package can be obtained from the official Flatpak repository https://flathub.org/apps/details/org.fedoraproject.MediaWriter[Flathub.org].
uk: Найкращий спосіб інсталювати [application]*Fedora Media Writer* у різних дистрибутивах Linux — використовувати попередньо зібраний пакет _Flatpak_. Пакет можна отримати з офіційного репозиторію Flatpak https://flathub.org/apps/details/org.fedoraproject.MediaWriter[Flathub.org].

source: To setup *Flatpak* on your Linux system, follow the guidelines on the https://flatpak.org/setup/[Flatpak documentation] page.
uk: Щоб налаштувати *Flatpak* у вашій системі Linux, дотримуйтеся вказівок на сторінці https://flatpak.org/setup/[документація Flatpak].

source: Run the application:
uk: Запустіть програму:

source: On Windows
uk: У Windows

source: Download the latest Windows Installer file from link:++https://getfedora.org++[GetFedora.org]. The server automatically detects the running system and offers you the correct installation file for your Windows version.
uk: Завантажте найновіший файл інсталятора для Windows за посиланням:++https://getfedora.org++[GetFedora.org]. Сервер автоматично визначає запущену систему та пропонує вам правильний інсталяційний файл для вашої версії Windows.

source: Run the installation by double clicking the installer, and then continue through the set-up wizard. The Wizard lets you customize the software's installation if you choose to.
uk: Запустіть інсталяцію, двічі клацнувши інсталятор, а потім продовжіть через майстер інсталяції. Майстер дозволяє налаштувати інсталяцію програмного забезпечення, якщо ви захочете.

source: Run the application by clicking on a launcher.
uk: Запустіть програму, натиснувши на лончер.

source: In Windows 8 and 10, the [application]*Fedora Media Writer* launcher will be placed in the _All apps_ menu under _F_. In Windows 10, you can just type [application]*Fedora Media Writer* in the search box on the task bar.
uk: У Windows 8 і 10 засіб запуску [application]*Fedora Media Writer* буде розміщено в меню _Усі програми_ під _F_. У Windows 10 ви можете просто ввести [application]*Fedora Media Writer* у полі пошуку на панелі завдань.

source: Open the `.dmg` file, and press and hold the kbd:[Ctrl] key while clicking on the [application]*Fedora Media Writer* application.
uk: Відкрийте файл `.dmg`, натисніть і утримуйте клавішу kbd:[Ctrl], клацаючи на програмі [application]*Fedora Media Writer*.

source: Writing the ISO image to the USB Media.
uk: Запис ISO-образу на носій USB.

source: Select the Fedora Edition you wish to make a bootable USB drive for.
uk: Виберіть випуск Fedora, для якого ви хочете створити завантажувальний USB-накопичувач.

source: Fedora Media Writer Main Screen: Choose your Edition of Fedora
uk: Головний екран Fedora Media Writer: виберіть свою версію Fedora

source: Image of Fedora Media Writer Main Screen
uk: Зображення головного екрана Fedora Media Writer

source: The main selection lets you choose one of the default Fedora editions, Fedora *Workstation* or *Server*. [application]*Fedora Media Writer* displays more details about the edition before you can proceed with downloading the image and the USB creation. You can choose a different architecture, if you select _Other variants_.
uk: Основний вибір дозволяє вибрати одну з версій Fedora за замовчуванням, Fedora *Workstation* або *Server*. [application]*Fedora Media Writer* покаже більше деталей про видання, перш ніж ви зможете продовжити завантаження образу та створення USB. Ви можете вибрати іншу архітектуру, вибравши _Інші варіанти_.

source: Fedora Media Writer Distro Information
uk: Інформація про дистрибутив у Fedora Media Writer

source: Image of Fedora Media Writer Distro Information Screen
uk: Зображення екрана інформації про дистрибутив у Fedora Media Writer

source: Fedora Media Writer will automatically download the ISO for you. If you have downloaded the ISO before and placed it in the _Downloads_ directory, it will be immediately available to use.
uk: Fedora Media Writer автоматично завантажить ISO для вас. Якщо ви раніше завантажили ISO та розмістили його в каталозі _Downloads_, він одразу стане доступним для використання.

source: Fedora Media Writer Automatic Download
uk: Автоматичне завантаження у Fedora Media Writer

source: Image of Fedora Media Writer Automatic Download
uk: Зображення автоматичного завантаження у Fedora Media Writer

source: Plug in a USB drive on which you want to create the bootable media.
uk: Підключіть USB-накопичувач, на якому ви хочете створити завантажувальний носій.

source: To write the image onto the media, click the red btn:[Write to disk] button.
uk: Щоб записати образ на носій, натисніть червону кнопку btn:[Записати на диск].

source: Fedora Media Writer Write to USB Device
uk: Запис на пристрій USB у Fedora Media Writer

source: Image of Fedora Media Writer write to device red button
uk: Зображення червоної кнопки запису на пристрій у Fedora Media Writer

source: Other methods to create a live USB
uk: Інші методи створення завантажувального USB

source: Using the *Fedora Media Writer* is highly recommended for everybody, because it offers a reliable way to create a live USB stick for Fedora installation.
uk: Використання *Fedora Media Writer* рекомендується всім, оскільки ця програма пропонує надійний спосіб створити живий USB-накопичувач для встановлення Fedora.

source: However, some experienced users may prefer to go through the creation process manually. If you decide to do so, you have to download the installation images and use an application to write them onto the USB stick.
uk: Однак деякі досвідчені користувачі можуть віддати перевагу пройти процес створення вручну. Якщо ви вирішите це зробити, вам потрібно завантажити інсталяційні образи та за допомогою програми записати їх на USB-накопичувач.

source: If you have downloaded and verified the installation images manually, you still can write them onto the USB stick using *Fedora Media Writer*.
uk: Якщо ви завантажили та перевірили інсталяційні образи вручну, ви все ще можете записати їх на USB-накопичувач за допомогою *Fedora Media Writer*.

source: Downloading Boot and Installation Images
uk: Завантаження завантажувальних і інсталяційних образів

source: Read more about Fedora Workstation, Fedora Cloud, Fedora Server and the available media types in xref:Downloading_Fedora.adoc#chap-downloading-fedora[Downloading Fedora].
uk: Дізнайтеся більше про робочу станцію Fedora Workstation, Fedora Cloud, Fedora Server та доступні типи носіїв у xref:Downloading_Fedora.adoc#chap-downloading-fedora[Завантаження Fedora].

source: You can also choose a Fedora _Spin_ featuring favorite alternative desktops or tools for specialized tasks at link:++https://spins.fedoraproject.org++[].
uk: Ви також можете вибрати Fedora _Spin_ із улюбленими альтернативними робочими столами або інструментами для спеціальних завдань за посиланням:++https://spins.fedoraproject.org++[].

source: Verifying the Downloaded Image
uk: Перевірка завантаженого образу

source: Because transmission errors or other problems may corrupt the Fedora image you have downloaded, it is important to verify the file's integrity. After the images are created, an operation is performed on the file that produces a value called a `checksum` using a complex mathematical algorithm. The operation is sufficiently complex that *any change* to the original file will produce a different checksum.
uk: Оскільки помилки передавання чи інші проблеми можуть пошкодити завантажений образ Fedora, важливо перевірити цілісність файлу. Після створення образу над файлом виконується операція, яка створює значення, яке називається «контрольною сумою» за допомогою складного математичного алгоритму. Операція є достатньо складною, тому *будь-яка зміна* вихідного файлу спричинить іншу контрольну суму.

source: By calculating the image's `checksum` on your own computer and comparing it to the original `checksum`, you can verify the image has not been tampered with or corrupted. The original checksum values are provided at link:++https://getfedora.org/security/++[], and are [command]#gpg# signed to demonstrate their integrity.
uk: Обчисливши «контрольну суму» образу на вашому власному комп’ютері та порівнявши її з оригінальною «контрольною сумою», ви можете переконатися, що образ не підроблений чи не пошкоджений. Оригінальні значення контрольної суми надаються за посиланням:++https://getfedora.org/security/++[] і мають підпис [command]#gpg#, щоб продемонструвати їх цілісність.

source: Verifying checksums on Windows systems
uk: Перевірка контрольних сум у системах Windows

source: Download the Fedora image of your choice from link:++https://getfedora.org/++[] and the corresponding checksum file from link:++https://getfedora.org/security/++[]
uk: Завантажте обраний образ Fedora за посиланням:++https://getfedora.org/++[] і відповідний файл контрольної суми за посиланням:++https://getfedora.org/security/++[]

source: Open a [command]#powershell# session.
uk: Відкрийте сеанс [command]#powershell#.

source: Change to the directory containing the downloaded files.
uk: Перейдіть до каталогу, що містить завантажені файли.

source: Directory: C:\Users\Pete\Downloads
uk: Директорія: C:\Users\Pete\Downloads

source: Load the resources required to calculate the checksum.
uk: Завантажте ресурси, необхідні для обчислення контрольної суми.

source: Calculate the downloaded image's checksum. This will take a while!
uk: Обчисліть контрольну суму завантаженого образу. Це займе деякий час!

source: Compare the calculated checksum to the expected checksum.
uk: Порівняйте розраховану контрольну суму з очікуваною контрольною сумою.

source: Download the Fedora image of your choice from link:++https://fedoraproject.org/get-fedora++[] and the corresponding checksum file from link:++https://getfedora.org/security/++[]
uk: Завантажте обраний образ Fedora за посиланням:++https://fedoraproject.org/get-fedora++[] і відповідний файл контрольної суми за посиланням:++https://getfedora.org/security/++[]

source: Open a terminal window, and navigate to the directory with the downloaded files.
uk: Відкрийте вікно терміналу та перейдіть до каталогу із завантаженими файлами.

source: Use the appropriate utility to verify the image checksum.
uk: Використовуйте відповідну утиліту для перевірки контрольної суми образу.

source: For Linux:
uk: Для Linux:

source: Writing the images to USB media
uk: Запис образів на носій USB

source: Creating USB media with [application]*GNOME Disks*
uk: Створення USB-носія за допомогою [application]*GNOME Disks*

source: On a system with [application]*GNOME*, or with the [package]*gnome-disk-utility* package installed, open `Disks` using the system menu.
uk: У системі з [application]*GNOME* або з встановленим пакетом [package]*gnome-disk-utility* відкрийте «Диски» за допомогою системного меню.

source: Click your USB device in the left column.
uk: Натисніть на свій USB-пристрій у лівій колонці.

source: Click the menu icon in the upper right corner of the window, and choose the `Restore Disk Image` option.
uk: Натисніть піктограму меню у верхньому правому куті вікна та виберіть опцію «Відновити образ диска».

source: Navigate to your image file and click `Start Restoring`. After a few minutes, it will report the process is complete and your installation media will be ready to use.
uk: Перейдіть до файлу образу та натисніть «Почати відновлення». Через кілька хвилин він повідомить, що процес завершено, і інсталяційний носій буде готовий до використання.

source: Creating USB Media on the Linux command line
uk: Створення USB-носія в командному рядку Linux

source: Open a terminal window and insert the usb drive.
uk: Відкрийте вікно терміналу та вставте USB-накопичувач.

source: Find the `device node` assigned to the drive. In the example below, the drive is given `sdd`.
uk: Знайдіть «вузол пристрою», призначений диску. У наведеному нижче прикладі диску присвоєно `sdd`.

source: Use the [command]#dd# utility to write the image.
uk: Використовуйте утиліту [command]#dd#, щоб записати образ.

source: Pay extreme attention to the source (`if=`) and target (`of=`) device. The `dd` command destroys all data on the target device. If you made a mistake, you could lose important data.
uk: Зверніть особливу увагу на джерело (`if=`) і цільовий (`of=`) пристрій. Команда dd знищує всі дані на цільовому пристрої. Якщо ви зробили помилку, ви можете втратити важливі дані.

source: Creating a Boot CD or DVD
uk: Створення завантажувального CD або DVD

source: The exact steps you need to take to burn a bootable CD or DVD from an ISO image will vary depending on what disc burning software you use. This procedure only offers a general overview.
uk: Точні кроки, які потрібно виконати, щоб записати завантажувальний компакт-диск або DVD-диск із образу ISO, відрізнятимуться залежно від програмного забезпечення для запису дисків, яке ви використовуєте. Ця процедура пропонує лише загальний огляд.

source: Insert a blank CD or DVD into your system's CD or DVD burner.
uk: Вставте чистий компакт-диск або DVD-диск у системний пристрій для запису компакт- чи DVD-дисків.

source: Open your system's burning software - for example, [application]*Brasero* on {PRODUCT} systems with [application]*GNOME* desktop environment, or [application]*Nero* on Windows systems. In the software's main menu, find an option which lets you burn an ISO image to a disc. For example, in [application]*Brasero*, this option is `Burn image` in the main menu on the left side of the window.
uk: Відкрийте програмне забезпечення для запису вашої системи, наприклад, [application]*Brasero* в системах {PRODUCT} із робочим середовищем [application]*GNOME* або [application]*Nero* у системах Windows. У головному меню програми знайдіть опцію, яка дозволяє записати образ ISO на диск. Наприклад, у [application]*Brasero* ця опція — «Записати образ» в головному меню в лівій частині вікна.

source: When prompted, select the ISO image of {PRODUCT} to be burned, and the CD or DVD burner with a blank disc inside (if you have more than one drive).
uk: Коли з’явиться відповідний запит, виберіть ISO-образ {PRODUCT}, який потрібно записати, і пристрій для запису компакт- чи DVD-дисків із порожнім диском усередині (якщо у вас більше ніж один дисковод).

source: Confirm your selection, and wait for the disc to be burned.
uk: Підтвердьте свій вибір і зачекайте, поки диск буде записаний.
