Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f34/pages/install/Troubleshooting.po
Languages: pt_br

source: When prompted to, enter your new root password and confirm by pressing the kbd:[Enter] key. Enter the password for the second time to make sure you typed it correctly and confirm with kbd:[Enter] again. If both passwords match, a message informing you of a successful root password change will appear.
pt_br: Quando solicitado, insira sua nova senha de root e confirme pressionando a tecla kbd:[Enter]. Digite a senha pela segunda vez para certificar-se de que digitou corretamente e confirme com kbd:[Enter] novamente. Se as duas senhas corresponderem, aparecerá uma mensagem informando sobre a alteração bem-sucedida da senha do root.

source: Remount the root partition again, this time as read-only:
pt_br: Remonte a partição raiz novamente, desta vez como somente leitura:

source: Reboot the system. From now on, you will be able to log in as the root user using the new password set up during this procedure.
pt_br: Reinicialize o sistema. De agora em diante, você poderá fazer login como usuário root usando a nova senha configurada durante este procedimento.

source: Are You Unable to Boot With Your RAID Card?
pt_br: Você não consegue inicializar com a placa RAID?

source: If you have performed an installation and cannot boot your system properly, you may need to reinstall and partition your system's storage differently.
pt_br: Se você executou uma instalação e não consegue inicializar o sistema adequadamente, pode ser necessário reinstalar e particionar o armazenamento do sistema de forma diferente.

source: Some BIOS types do not support booting from RAID cards. After you finish the installation and reboot the system for the first time, a text-based screen showing the boot loader prompt (for example, `grub>`) and a flashing cursor may be all that appears. If this is the case, you must repartition your system and move your `/boot` partition and the boot loader outside the RAID array. The `/boot` partition and the boot loader must be on the same drive.
pt_br: Alguns tipos de BIOS não suportam inicialização a partir de placas RAID. Depois de terminar a instalação e reiniciar o sistema pela primeira vez, uma tela baseada em texto mostrando o prompt do carregador de inicialização (por exemplo, `grub>`) e um cursor piscando pode ser tudo o que aparece. Se este for o caso, você deve reparticionar seu sistema e mover sua partição `/boot` e o carregador de inicialização para fora do arranjo RAID. A partição `/boot` e o carregador de inicialização devem estar no mesmo drive.

source: Once these changes have been made, you should be able to finish your installation and boot the system properly. For more information about partitioning, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination].
pt_br: Assim que essas alterações forem feitas, você poderá terminar a instalação e inicializar o sistema corretamente. Para obter mais informações sobre particionamento, veja xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Destinação da instalação].

source: Trouble With the Graphical Boot Sequence
pt_br: Problemas com a sequência de inicialização gráfica

source: After you finish the installation and reboot your system for the first time, it is possible that the system stops responding during the graphical boot sequence, requiring a reset. In this case, the boot loader is displayed successfully, but selecting any entry and attempting to boot the system results in a halt. This usually means a problem with the graphical boot sequence; to solve this issue, you must disable graphical boot. To do this, temporarily alter the setting at boot time before changing it permanently.
pt_br: Depois de concluir a instalação e reinicializar o sistema pela primeira vez, é possível que o sistema pare de responder durante a sequência de inicialização gráfica, exigindo uma reinicialização. Nesse caso, o carregador de inicialização é exibido com sucesso, mas selecionar qualquer entrada e tentar inicializar o sistema resulta em uma parada. Isso geralmente significa um problema com a sequência de inicialização gráfica; para resolver este problema, você deve desativar a inicialização gráfica. Para fazer isso, altere temporariamente a configuração no momento da inicialização antes de alterá-la permanentemente.

source: Disabling Graphical Boot Temporarily
pt_br: Desabilitando temporariamente a inicialização gráfica

source: Start your computer and wait until the boot loader menu appears. If you set your boot loader timeout period to 0, hold down the kbd:[Esc] key to access it.
pt_br: Inicie o computador e espere até que o menu do carregador de inicialização apareça. Se você definir o tempo limite do carregador de inicialização para 0, mantenha pressionada a tecla kbd:[Esc] para acessá-lo.

source: When the boot loader menu appears, use your cursor keys to highlight the entry you want to boot and press the kbd:[e] key to edit this entry's options.
pt_br: Quando o menu do carregador de inicialização aparecer, use as teclas do cursor para destacar a entrada que deseja inicializar e pressione a tecla kbd:[e] para editar as opções dessa entrada.

source: In the list of options, find the kernel line - that is, the line beginning with the keyword `linux` (or, in some cases, `linux16` or `linuxefi`). On this line, locate the `rhgb` option and delete it. The option may not be immediately visible; use the cursor keys to scroll up and down.
pt_br: Na lista de opções, encontre a linha do kernel - ou seja, a linha que começa com a palavra-chave `linux` (ou, em alguns casos,`linux16` ou `linuxefi`). Nesta linha, localize a opção `rhgb` e exclua-a. A opção pode não estar imediatamente visível; use as teclas do cursor para rolar para cima e para baixo.

source: Press kbd:[F10] or kbd:[Ctrl + X] to boot your system with the edited options.
pt_br: Pressione kbd:[F10] ou kbd:[Ctrl + X] para inicializar seu sistema com as opções editadas.

source: If the system started successfully, you can log in normally. Then you will need to disable the graphical boot permanently - otherwise you will have to perform the previous procedure every time the system boots. To permanently change boot options, do the following.
pt_br: Se o sistema foi iniciado com sucesso, você pode fazer o login normalmente. Em seguida, você precisará desabilitar a inicialização gráfica permanentemente - caso contrário, você terá que realizar o procedimento anterior toda vez que o sistema for inicializado. Para alterar permanentemente as opções de inicialização, faça o seguinte.

source: Disabling Graphical Boot Permanently
pt_br: Desabilitando permanentemente a inicialização gráfica

source: Log in to the `root` account using the [command]#su -# command:
pt_br: Autentique-se na conta `root` usando o comando [command]#su -#:

source: Open the `/etc/default/grub` configuration file using a plain text editor such as [application]*vim*.
pt_br: Abra o arquivo de configuração `/etc/default/grub` usando um editor de texto simples como [application]*vim*.

source: Within the `grub` file, locate the line beginning with `GRUB_CMDLINE_LINUX`. The line should look similar to the following:
pt_br: Dentro do arquivo `grub`, localize a linha que começa com `GRUB_CMDLINE_LINUX`. A linha deve ser semelhante a esta:

source: On this line, delete the `rhgb` option.
pt_br: Nesta linha, exclua a opção `rhgb`.

source: Save the edited configuration file.
pt_br: Salve o arquivo de configuração editado.

source: Refresh the boot loader configuration by executing the following command:
pt_br: Atualize a configuração do carregador de inicialização executando o seguinte comando:

source: After you finish this procedure, you can reboot your computer. {PRODUCT} will not use the graphical boot sequence any more. If you wish to enable graphical boot, follow the same procedure, add the `rhgb` option to the `GRUB_CMDLINE_LINUX` line in the `/etc/default/grub` file and refresh the boot loader configuration again using the [command]#grub2-mkconfig# command.
pt_br: Depois de concluir este procedimento, você pode reinicializar o computador. O {PRODUCT} não usará mais a sequência de inicialização gráfica. Se você deseja habilitar a inicialização gráfica, siga o mesmo procedimento, adicione a opção `rhgb` à linha `GRUB_CMDLINE_LINUX` no arquivo `/etc/default/grub` e atualize a configuração do carregador de inicialização novamente usando o comando [command]#grub2-mkconfig#.

source: See the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[], for more information about working with the [application]*GRUB2* boot loader.
pt_br: Veja o [citetitle]_{PRODUCT} System Administrator's Guide_ (guia de administrador de sistema), disponível em link:++https://docs.fedoraproject.org/++[], para mais informações sobre trabalhar com o carregador de inicialização [application]*GRUB2*.

source: Booting into a Graphical Environment
pt_br: Inicializando em um ambiente gráfico

source: If you have installed the [application]*X Window System* and a desktop environment such as [application]*GNOME*, but are not seeing a graphical desktop environment once you log into your system, you can start it manually using the [command]#startx# command. Note, however, that this is just a one-time fix and does not change the log in process for future log ins.
pt_br: Se você instalou o [application]*X Window System* e um ambiente gráfico como o [application]*GNOME*, mas não está vendo um ambiente gráfico depois de iniciar a sessão em seu sistema, pode iniciá-lo manualmente usando o comando [command]#startx#. Observe, no entanto, que esta é apenas uma correção única e não altera o processo de início de sessão para situações futuras.

source: To set up your system so that you can log in at a graphical login screen, you must change the default [application]*systemd* target to `graphical.target`. When you are finished, reboot the computer. You will presented with a graphical login prompt after the system restarts.
pt_br: Para configurar seu sistema de forma que você possa efetuar login em uma tela de login gráfica, você deve alterar o destino padrão [application]*systemd* para `graphical.target`. Quando terminar, reinicie o computador. Será apresentado um prompt gráfico de login após a reinicialização do sistema.

source: Setting Graphical Login as Default
pt_br: Configurando login gráfico como padrão

source: Open a shell prompt. If you are in your user account, become root by typing the [command]#su -# command.
pt_br: Abra um prompt de shell. Se você estiver em sua conta de usuário, torne-se root digitando o comando [command]#su -#.

source: Change the default target to `graphical.target`. To do this, execute the following command:
pt_br: Mude o destino padrão para `graphical.target`. Para fazer isso, execute o seguinte comando:

source: Graphical login is now enabled by default - you will be presented with a graphical login prompt after the next reboot. If you want to reverse this change and keep using the text-based login prompt, execute the following command as `root`:
pt_br: O login gráfico agora está habilitado por padrão - será apresentado um prompt gráfico de login após a próxima reinicialização. Se você deseja reverter essa mudança e continuar usando o prompt de login baseado em texto, execute o seguinte comando como `root`:

source: For more information about targets in [application]*systemd*, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
pt_br: Para mais informações sobre alvos em [application]*systemd*, veja o [citetitle]_{PRODUCT} System Administrator's Guide_ (guia de administrador de sistema), disponível em link:++https://docs.fedoraproject.org/++[].

source: No Graphical User Interface Present
pt_br: Nenhuma interface gráfica de usuário presente

source: If you are having trouble getting [application]*X* (the [application]*X Window System*) to start, it is possible that it has not been installed. Some of the pre-set base environments you can select during the installation, such as `Minimal install` or `Web Server`, do not include a graphical interface - it has to be installed manually.
pt_br: Se você estiver tendo problemas para iniciar o [applicaion]*X* (o [application]*X Window System*), é possível que ele não tenha sido instalado. Alguns dos ambientes básicos predefinidos que você pode selecionar durante a instalação, como `Instalação mínima` ou `Servidor Web`, não incluem uma interface gráfica - deve ser instalado manualmente.

source: If you want [application]*X*, you can install the necessary packages after the installation using the [application]*DNF* package manager. For example, to install [application]*GNOME*, use [command]#dnf install gnome-shell# as `root`.
pt_br: Se você deseja o [application]*X*, pode instalar os pacotes necessários após a instalação usando o gerenciador de pacotes [application]*DNF*. Por exemplo, para instalar o [application]*GNOME*, use [command]#dnf install gnome-shell# como `root`.

source: X Server Crashing After User Logs In
pt_br: Falha do servidor X após o login do usuário

source: If you are having trouble with the [application]*X* server crashing when a user logs in, one or more of your file systems may be full (or nearly full). To verify that this is the problem you are experiencing, execute the following command:
pt_br: Se você estiver tendo problemas com o travamento do servidor [application]*X* quando um usuário efetuar login, um ou mais de seus sistemas de arquivos podem estar cheios (ou quase cheios). Para verificar se este é o problema que você está enfrentando, execute o seguinte comando:

source: The output will help you diagnose which partition is full - in most cases, the problem will be on the `/home` partition. A sample output of the [command]#df# command may look similar to the following:
pt_br: A saída o ajudará a diagnosticar qual partição está cheia - na maioria dos casos, o problema estará na partição `/home`. Um exemplo de saída do comando [command]#df# pode ser semelhante ao seguinte:

source: Filesystem Size Used Avail Use% Mounted on /dev/mapper/vg_rhel-root 20G 6.0G 13G 32% / devtmpfs 1.8G 0 1.8G 0% /dev tmpfs 1.8G 2.7M 1.8G 1% /dev/shm tmpfs 1.8G 1012K 1.8G 1% /run tmpfs 1.8G 0 1.8G 0% /sys/fs/cgroup tmpfs 1.8G 2.6M 1.8G 1% /tmp /dev/sda1 976M 150M 760M 17% /boot /dev/dm-4 90G 90G 0 100% /home
pt_br: Sist. Arq. Tam Usado Disp. Uso% Montando em /dev/mapper/vg_rhel-root 20G 6.0G 13G 32% / devtmpfs 1.8G 0 1.8G 0% /dev tmpfs 1.8G 2.7M 1.8G 1% /dev/shm tmpfs 1.8G 1012K 1.8G 1% /run tmpfs 1.8G 0 1.8G 0% /sys/fs/cgroup tmpfs 1.8G 2.6M 1.8G 1% /tmp /dev/sda1 976M 150M 760M 17% /boot /dev/dm-4 90G 90G 0 100% /home

source: In the above example, you can see that the `/home` partition is full, which causes the crash. You can make some room on the partition by removing unneeded files. After you free up some disk space, start [application]*X* using the [command]#startx# command.
pt_br: No exemplo acima, você pode ver que a partição `/home` está cheia, o que causa o travamento. Você pode criar espaço na partição removendo arquivos desnecessários. Depois de liberar algum espaço em disco, inicie o [application]*X* usando o comando [command]#startx#.

source: For additional information about [command]#df# and an explanation of the options available (such as the [option]#-h# option used in this example), see the `df(1)` man page.
pt_br: Para obter informações adicionais sobre [command]#df# e uma explicação das opções disponíveis (como a opção [option]#-h# usada neste exemplo), consulte a página do manual `df(1)`.

source: Is Your RAM Not Being Recognized?
pt_br: A sua RAM não está sendo reconhecida?

source: In some cases the kernel does not recognize all of your memory (RAM), which causes the system to use less memory than is installed. You can find out how much RAM is being utilized using the [command]#free -m# command. If the displayed total amount of memory does not match your expectations, it is likely that at least one of your memory modules is faulty. On BIOS-based systems, you can use the [application]*Memtest86+* utility to test your system's memory - see xref:advanced/Boot_Options.adoc#sect-boot-options-memtest[Loading the Memory (RAM) Testing Mode] for details.
pt_br: Em alguns casos, o kernel não reconhece toda a sua memória (RAM), o que faz com que o sistema use menos memória do que a instalada. Você pode descobrir quanta RAM está sendo utilizada usando o comando [command]#free -m#. Se a quantidade total de memória exibida não corresponder às suas expectativas, é provável que pelo menos um dos módulos de memória esteja com defeito. Em sistemas baseados em BIOS, você pode usar o utilitário [application]*Memtest86+* para testar a memória do seu sistema - veja xref:advanced/Boot_Options.adoc#sect-boot-options-memtest[Carregando o modo de teste de memória (RAM)] para detalhes.

source: If you have 4GB or more memory installed, but {PRODUCT} only shows around 3.5GB or 3.7GB, you have probably installed a 32-bit version of {PRODUCT} on a 64bit kernel. For modern systems, use the 64-bit (x86_64) version.
pt_br: Se você tem 4 GB ou mais de memória instalada, mas {PRODUCT} mostra apenas 3,5 GB ou 3,7 GB, você provavelmente instalou uma versão de 32 bits do {PRODUCT} em um kernel de 64 bits. Para sistemas modernos, use a versão de 64 bits (x86_64).

source: Some hardware configurations have a part of the system's RAM reserved and unavailable to the main system. Notably, laptop computers with integrated graphics cards will reserve some memory for the GPU. For example, a laptop with 4{nbsp}GB of RAM and an integrated Intel graphics card will show only roughly 3.7{nbsp}GB of available memory, even with a 64-bit system.
pt_br: Algumas configurações de hardware têm uma parte da RAM do sistema reservada e indisponível para o sistema principal. Notavelmente, os laptops com placas gráficas integradas reservam alguma memória para a GPU. Por exemplo, um laptop com 4{nbsp}GB de RAM e uma placa de vídeo Intel integrada mostrará apenas cerca de 3,7{nbsp}GB de memória disponível, mesmo com um sistema de 64 bits.

source: Additionally, the [application]*kdump* crash kernel dumping mechanism reserves some memory for the secondary kernel used in case of the primary kernel crashing. This reserved memory will also not be displayed as available when using the [command]#free# command. For details about [application]*kdump* and its memory requirements, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
pt_br: Além disso, o mecanismo de despejo do kernel de travamento do [application]*kdump* reserva alguma memória para o kernel secundário usado no caso de travamento do kernel primário. Esta memória reservada também não será exibida como disponível ao usar o comando [command]#free#. Para detalhes sobre o [application]*kdump* e seus requisitos de memória, veja o [citetitle]_{PRODUCT} System Administrator's Guide_ (guia de administrador de sistema_, disponível em link:++https://docs.fedoraproject.org/++[].

source: If you made sure that your memory does not have any issues, you can try and set the amount of memory manually using the [option]#mem=# kernel option.
pt_br: Se você se certificou de que sua memória não tem problemas, você pode tentar definir a quantidade de memória manualmente usando a opção de kernel [option]#mem=#.

source: Configuring the Memory Manually
pt_br: Configurando a memória manualmente

source: In the list of options, find the kernel line - that is, the line beginning with the keyword `linux` (or, in some cases, `linux16`). Append the following option to the end of this line:
pt_br: Na lista de opções, encontre a linha do kernel - ou seja, a linha que começa com a palavra-chave `linux` (ou, em alguns casos, `linux16`). Anexe a seguinte opção ao final desta linha:

source: Replace _xx_ with the amount of RAM you have in megabytes.
pt_br: Substitua _xx_ pela quantidade de RAM que você tem em megabytes.

source: Wait for the system to boot and log in. Then, open a command line and execute the [command]#free -m# command again. If total amount of RAM displayed by the command matches your expectations, append the following to the line beginning with `GRUB_CMDLINE_LINUX` in the `/etc/default/grub` file to make the change permanent:
pt_br: Aguarde até que o sistema inicialize e faça login. Em seguida, abra uma linha de comando e execute o comando [command]#free -m# novamente. Se a quantidade total de RAM exibida pelo comando corresponder às suas expectativas, anexe o seguinte à linha que começa com `GRUB_CMDLINE_LINUX` no arquivo `/etc/default/grub` para tornar a mudança permanente:

source: After you updated the file and saved it, refresh the boot loader configuration so that the change will take effect. Run the following command with root privileges:
pt_br: Depois de atualizar o arquivo e salvá-lo, atualize a configuração do carregador de inicialização para que a alteração tenha efeito. Execute o seguinte comando com privilégios de root:

source: In `/etc/default/grub`, the above example would look similar to the following:
pt_br: No `/etc/default/grub`, o exemplo acima seria semelhante ao seguinte:
