Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f34/pages/install/Troubleshooting.po
Languages: pt_br

source: Troubleshooting
pt_br: Solução de problema

source: This chapter offers some pointers on how to get help when something goes wrong. It also discusses some common installation problems and their solutions.
pt_br: Este capítulo oferece algumas dicas sobre como obter ajuda quando algo dá errado. Ele também discute alguns problemas comuns de instalação e suas soluções.

source: Getting Help
pt_br: Obtendo ajuda

source: There are many places on the internet which can help you when you encounter a problem not described in this chapter: discussion boards, blogs, IRC, and more. Some of the more popular places where you can find help include:
pt_br: Existem muitos lugares na Internet que podem ajudá-lo quando você encontrar um problema não descrito neste capítulo: fóruns de discussão, blogs, IRC e muito mais. Alguns dos lugares mais populares onde você pode encontrar ajuda incluem:

source: link:++https://ask.fedoraproject.org/en/questions/++[Ask Fedora] - Fedora's knowledge base, available in multiple languages
pt_br: link:++https://ask.fedoraproject.org/en/questions/++[Ask Fedora] - Base de conhecimento do Fedora, disponível em vários idiomas

source: The #fedora IRC channel on link:++https://freenode.net//++[FreeNode] - one of the main IRC channels used by Fedora users, English only
pt_br: O canal de IRC #fedora no link:++https://freenode.net//++[FreeNode] - um dos principais canais de IRC usados por usuários do Fedora, apenas em inglês

source: link:++https://fedoraproject.org/wiki/++[Fedora Project Wiki] - the official wiki for Fedora Project
pt_br: link:++https://fedoraproject.org/wiki/++[Wiki do Projeto Fedora] - a wiki oficial do Projeto Fedora

source: link:++https://unix.stackexchange.com/++[Stack Exchange] - an English language Q&A board, not specific to Fedora
pt_br: link:++https://unix.stackexchange.com/++[Stack Exchange] - um quadro de perguntas e respostas em inglês, não específico para o Fedora

source: The above list is by no means complete - you can find help in many other places as well. Additional information about available resources such as IRC channels and mailing lists is available at link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[].
pt_br: A lista acima não está completa - você também pode encontrar ajuda em muitos outros lugares. Informações adicionais sobre os recursos disponíveis, como canais IRC e listas de discussão, estão disponíveis no link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[].

source: Before you open a new discussion or ask anyone for help on IRC, you should always do some research on your own. If you are encountering an issue, there is usually a good chance that someone else ran into the same problem before you and published a solution somewhere. Opening a discussion about something already explained elsewhere, or asking a common question which has been answered many times before, is not likely to result in a friendly, constructive response.
pt_br: Antes de abrir uma nova discussão ou pedir ajuda a alguém no IRC, você deve sempre fazer algumas pesquisas por conta própria. Se você estiver encontrando um problema, geralmente há uma boa chance de que outra pessoa tenha enfrentado o mesmo problema antes de você e publicado uma solução em algum lugar. Abrir uma discussão sobre algo já explicado em outro lugar, ou fazer uma pergunta comum que já foi respondida muitas vezes antes, provavelmente não resultará em uma resposta amigável e construtiva.

source: When you ask for help troubleshooting problems related to the installation, you may be asked to provide log files generated by the installer. The sections below explain which files are generated, what their contents are, and how to transfer them from the installation system.
pt_br: Quando você pede ajuda para solucionar problemas relacionados à instalação, pode ser solicitado que você forneça arquivos de log gerados pelo instalador. As seções abaixo explicam quais arquivos são gerados, qual é seu conteúdo e como transferi-los do sistema de instalação.

source: Log Files Generated During the Installation
pt_br: Arquivos de log gerados durante a instalação

source: For debugging purposes, [application]*Anaconda* logs installation actions into files in the `/tmp` directory. These files are listed in the following table.
pt_br: Para fins de depuração, [application]*Anaconda* registra as ações de instalação em arquivos no diretório `/tmp`. Esses arquivos estão listados na tabela a seguir.

source: Log Files and Their Contents
pt_br: Arquivos de log e seu conteúdo

source: |Log file|Contents |`/tmp/anaconda.log`|general [application]*Anaconda* messages |`/tmp/program.log`|all external programs run during the installation |`/tmp/storage.log`|extensive storage module information |`/tmp/packaging.log`|[application]*dnf* and [application]*rpm* package installation messages |`/tmp/syslog`|hardware-related system messages
pt_br: |Arquivo de log|Conteúdo |`/tmp/anaconda.log`|mensagens gerais do [application]*Anaconda* |`/tmp/program.log`|todos so programas externos executados durante a instalação |`/tmp/storage.log`|informações extensas do módulo de armazenamento |`/tmp/packaging.log`|mensagens de instalação de pacotes do [application]*dnf* e do [application]*rpm* |`/tmp/syslog`|mensagens do sistema relacionadas a hardware

source: If the installation fails, the messages from these files are consolidated into `/tmp/anaconda-tb-_identifier_pass:attributes[{blank}]`, where _identifier_ is a random string.
pt_br: Se a instalação falhar, as mensagens desses arquivos são consolidadas em `/tmp/anaconda-tb-_identificador_pass:attributes[{blank}]`, onde _identificador_ é uma string aleatória.

source: Transferring Log Files from the Installation System
pt_br: Transferindo arquivos de log do sistema de instalação

source: All of the files described in xref:sect-troubleshooting-log-files[Log Files Generated During the Installation] reside in the installation program's RAM disk, which means they are not saved permamently and will be lost once the system is powered down. To store them permanently, copy those files to another system on the network using [command]#scp# on the system running the installation program, or copy them to a mounted storage device (such as an USB flash drive). Details on how to transfer the log files are below. Note that if you use an USB flash drive or other removable media, you should make sure to back up any data on it before starting the procedure.
pt_br: Todos os arquivos descritos em xref:sect-troubleshooting-log-files[Arquivos de log gerados durante a instalação] residem no disco de RAM do programa de instalação, o que significa que eles não são salvos permanentemente e serão perdidos quando o sistema for desligado. Para armazená-los permanentemente, copie esses arquivos para outro sistema na rede usando [command]#scp# no sistema que executa o programa de instalação ou copie-os para um dispositivo de armazenamento montado (como uma unidade flash USB). Detalhes sobre como transferir os arquivos de log estão abaixo. Observe que se você usar uma unidade flash USB ou outra mídia removível, certifique-se de fazer backup de todos os dados contidos nela antes de iniciar o procedimento.

source: Transferring Log Files Onto a USB Drive
pt_br: Transferindo arquivos de log para uma unidade USB

source: On the system you are installing, press kbd:[Ctrl + Alt + F2] to access a shell prompt. You will be logged into a root account and you will have access to the installation program's temporary file system.
pt_br: No sistema que você está instalando, pressione kbd:[Ctrl + Alt + F2] para acessar um prompt de shell. Você será conectado a uma conta root e terá acesso ao sistema de arquivos temporários do programa de instalação.

source: Connect a USB flash drive to the system and execute the [command]#dmesg# command. A log detailing all recent events will be displayed. At the bottom of this log, you will see a set of messages caused by the USB flash drive you just connected. It will look like a set of lines similar to the following:
pt_br: Conecte uma unidade flash USB ao sistema e execute o comando [command]#dmesg#. Um log detalhando todos os eventos recentes será exibido. Na parte inferior deste log, você verá um conjunto de mensagens causadas pela unidade flash USB que acabou de conectar. Será semelhante a um conjunto de linhas semelhante ao seguinte:

source: Note the name of the connected device - in the above example, it is `sdb`.
pt_br: Observe o nome do dispositivo conectado - no exemplo acima, é `sdb`.

source: Go to the `/mnt` directory and once there, create new directory which will serve as the mount target for the USB drive. The name of the directory does not matter; this example uses the name `usb`.
pt_br: Vá para o diretório `/mnt` e, uma vez lá, crie um novo diretório que servirá como alvo de montagem para a unidade USB. O nome do diretório não importa; este exemplo usa o nome `usb`.

source: Mount the USB flash drive onto the newly created directory. Note that in most cases, you do not want to mount the whole drive, but a partition on it. Therefore, do not use the name `sdb` - use the name of the partition you want to write the log files to. In this example, the name `sdb1` is used.
pt_br: Monte a unidade flash USB no diretório recém-criado. Observe que, na maioria dos casos, você não deseja montar a unidade inteira, mas sim uma partição nela. Portanto, não use o nome `sdb` - use o nome da partição na qual deseja gravar os arquivos de log. Neste exemplo, o nome `sdb1` é usado.

source: You can now verify that you mounted the correct device and partition by accessing it and listing its contents - the list should match what you expect to be on the drive.
pt_br: Agora você pode verificar se montou o dispositivo e a partição corretos acessando-os e listando seu conteúdo - a lista deve corresponder ao que você espera que esteja na unidade.

source: Copy the log files to the mounted device.
pt_br: Copie os arquivos de log para o dispositivo montado.

source: Unmount the USB flash drive. If you get an error message saying that the target is busy, change your working directory to outside the mount (for example, `/`).
pt_br: Desmonte a unidade flash USB. Se você receber uma mensagem de erro dizendo que o destino está ocupado, mude seu diretório de trabalho para fora da montagem (por exemplo, `/`).

source: The log files from the installation are now saved on the USB flash drive.
pt_br: Os arquivos de log da instalação agora estão salvos na unidade flash USB.

source: Transferring Log Files Over the Network
pt_br: Transferindo arquivos de log pela rede

source: Switch to the `/tmp` directory where the log files are located:
pt_br: Mude para o diretório `/tmp` onde os arquivos de log estão localizados:

source: Copy the log files onto another system on the network using the [command]#scp# command:
pt_br: Copie os arquivos de log em outro sistema na rede usando o comando [command]#scp#:

source: # scp *log user@address:path
pt_br: # scp *log usuário@endereço:caminho

source: Replace _user_ with a valid user name on the target system, _address_ with the target system's address or host name, and _path_ with the path to the directory you wish to save the log files into. For example, if you want to log in as `john` to a system with an IP address of `192.168.0.122` and place the log files into the `/home/john/logs/` directory on that system, the command will have the following form:
pt_br: Substitua _usuário_ por um nome de usuário válido no sistema de destino, _endereço_ pelo endereço do sistema de destino ou nome do host e _caminho_ pelo caminho para o diretório no qual deseja salvar os arquivos de log. Por exemplo, se você deseja se logar como `john` em um sistema com um endereço IP `192.168.0.122` e colocar os arquivos de log no diretório `/home/john/logs/` nesse sistema, o comando irá tem a seguinte forma:

source: When connecting to the target system for the first time, you may encounter a message similar to the following:
pt_br: Ao conectar-se ao sistema de destino pela primeira vez, você pode encontrar uma mensagem semelhante à seguinte:

source: Type `yes` and press kbd:[Enter] to continue. Then, provide a valid password when prompted. The files will start transferring to the specified directory on the target system.
pt_br: Digite `sim` e pressione kbd:[Enter] para continuar. Em seguida, forneça uma senha válida quando solicitado. Os arquivos começarão a ser transferidos para o diretório especificado no sistema de destino.

source: The log files from the installation are now permanently saved on the target system and available for review.
pt_br: Os arquivos de log da instalação agora são salvos permanentemente no sistema de destino e disponíveis para revisão.

source: Trouble Beginning the Installation
pt_br: Problema em começar a instalação

source: Problems with Booting into the Graphical Installation
pt_br: Problemas em inicializar para a instalação gráfica

source: Systems with some video cards have trouble booting into the graphical installation program. If the installation program does not run using its default settings, it attempts to run in a lower resolution mode. If that still fails, the installation program attempts to run in text mode.
pt_br: Sistemas com algumas placas de vídeo têm problemas para inicializar com o programa de instalação gráfica. Se o programa de instalação não for executado com as configurações padrão, ele tentará ser executado em um modo de resolução inferior. Se isso ainda falhar, o programa de instalação tentará ser executado no modo de texto.

source: There are several possible solutions to display issues, most of which involve specifying custom boot options. For more information, see xref:advanced/Boot_Options.adoc#sect-boot-options-installer[Configuring the Installation System at the Boot Menu].
pt_br: Existem várias soluções possíveis para os problemas de exibição, a maioria das quais envolve a especificação de opções de inicialização personalizadas. Para obter mais informações, consulte xref:advanced/Boot_Options.adoc#sect-boot-options-installer[Configurando o sistema de instalação no menu de inicialização].

source: Use the basic graphics mode
pt_br: Usar o modo gráfico básico

source: You can attempt to perform the installation using the basic graphics driver. To do this, edit the installation program's boot options and append [option]#inst.xdriver=vesa# at the end of the command line.
pt_br: Você pode tentar realizar a instalação usando o driver gráfico básico. Para fazer isso, edite as opções de inicialização do programa de instalação e acrescente [option]#inst.xdriver=vesa# no final da linha de comando.

source: Specify the display resolution manually
pt_br: Especificar a resolução de tela manualmente

source: If the installation program fails to detect your screen resolution, you can override the automatic detection and specify it manually. To do this, append the [option]#inst.resolution=pass:attributes[{blank}]_x_pass:attributes[{blank}]# option at the boot menu, where _x_ is your display's resolution (for example, `1024x768`).
pt_br: Se o programa de instalação falhar em detectar a resolução da tela, você pode ignorar a detecção automática e especificá-la manualmente. Para fazer isso, acrescente a opção [option]#inst.resolution=pass:attributes[{blank}]_x_pass:attributes[{blank}]# no menu de inicialização, onde _x_ é a resolução de sua tela (por exemplo, `1024x768`).

source: Use an alternate video driver
pt_br: Usar um driver de vídeo alternativo

source: You can also attempt to specify a custom video driver, overriding the installation program's automatic detection. To specify a driver, use the [option]#inst.xdriver=pass:attributes[{blank}]_x_pass:attributes[{blank}]# option, where _x_ is the device driver you want to use (for example, `nouveau`).
pt_br: Você também pode tentar especificar um driver de vídeo personalizado, substituindo a detecção automática do programa de instalação. Para especificar um driver, use a opção [option]#inst.xdriver=pass:attributes[{blank}]_x_pass:attributes[{blank}]#, onde _x_ é o driver de dispositivo que você deseja usar (por exemplo, `nouveau`).

source: If specifying a custom video driver solves your problem, you should report it as a bug at link:++https://bugzilla.redhat.com++[] under the `anaconda` component. [application]*Anaconda* should be able to detect your hardware automatically and use the appropriate driver without your intervention.
pt_br: Se especificar um driver de vídeo personalizado resolve seu problema, você deve reportar como um bug em link:++https://bugzilla.redhat.com++[] sob o componente `anaconda`. O [application]*Anaconda* deve ser capaz de detectar seu hardware automaticamente e usar o driver apropriado sem sua intervenção.

source: Perform the installation using VNC
pt_br: Realizar a instalação usando VNC

source: If the above options fail, you can use a separate system to access the graphical installation over the network, using the _Virtual Network Computing_ (VNC) protocol. For details on installing using VNC, see xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Installing Using VNC].
pt_br: Se as opções acima falharem, você pode usar um sistema separado para acessar a instalação gráfica pela rede, usando o protocolo _Virtual Network Computing_ (VNC). Para obter detalhes sobre a instalação usando VNC, veja xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Instalando usando VNC].

source: Serial Console Not Detected
pt_br: Console serial não detectado

source: In some cases, attempting to install in text mode using a serial console will result in no output on the console. This happens on systems which have a graphics card, but no monitor connected. If [application]*Anaconda* detects a graphics card, it will attempt to use it for a display, even if no display is connected.
pt_br: Em alguns casos, tentar instalar em modo de texto usando um console serial não resultará em nenhuma saída no console. Isso acontece em sistemas que possuem uma placa gráfica, mas nenhum monitor conectado. Se o [application]*Anaconda* detectar uma placa gráfica, ele tentará usá-la para um monitor, mesmo se nenhum monitor estiver conectado.

source: If you want to perform a text-based installation on a serial console, use the [option]#inst.text# and [option]#console=# boot options. See xref:advanced/Boot_Options.adoc#chap-anaconda-boot-options[Boot Options] for more details.
pt_br: Se você deseja realizar uma instalação baseada em texto em um console serial, use o opções de inicialização [option]#inst.text# e [option]#console=#. Veja xref:advanced/Boot_Options.adoc#chap-anaconda-boot-options[Opções de inicialização] para obter mais detalhes.

source: Trouble During the Installation
pt_br: Problema durante a instalação

source: No Disks Detected
pt_br: Nenhum disco detectado

source: In the `Installation Destination` screen, the following error message may appear at the bottom: `No disks detected. Please shut down the computer, connect at least one disk, and restart to complete installation`.
pt_br: Na tela `Destino da instalação`, a seguinte mensagem de erro pode aparecer na parte inferior: `Nenhum disco detectado. Desligue o computador, conecte pelo menos um disco e reinicie para completar a instalação`.

source: The message indicates that [application]*Anaconda* did not find any writable storage devices to install to. In that case, first make sure that your system does have at least one storage device attached.
pt_br: A mensagem indica que o [application]*Anaconda* não encontrou nenhum dispositivo de armazenamento gravável para instalar. Nesse caso, primeiro certifique-se de que seu sistema tenha pelo menos um dispositivo de armazenamento conectado.

source: If your system uses a hardware RAID controller, verify that the controller is properly configured and working. See your controller's documentation for instructions.
pt_br: Se o seu sistema usa um controlador RAID de hardware, verifique se o controlador está configurado corretamente e funcionando. Consulte a documentação do seu controlador para obter instruções.

source: If you are installing into one or more iSCSI devices and there is no local storage present on the system, make sure that all required LUNs (_Logical Unit Numbers_) are being presented to the appropriate HBA (_Host Bus Adapter_).
pt_br: Se você estiver instalando em um ou mais dispositivos iSCSI e não houver armazenamento local presente no sistema, certifique-se de que todos os LUNs (_Logical Unit Numbers_) necessários estão sendo apresentados ao HBA (_Host Bus Adapter_) apropriado.

source: If you made sure you have a connected and properly configured storage device and the message still appears after you reboot the system and start the installation again, it means that the installation program failed to detect the storage. In most cases this message appears when you attempt to install on an SCSI device which has not been recognized by the installation program.
pt_br: Se você se certificou de que tem um dispositivo de armazenamento conectado e configurado corretamente e a mensagem ainda aparece após você reinicializar o sistema e iniciar a instalação novamente, isso significa que o programa de instalação falhou ao detectar o armazenamento. Na maioria dos casos, essa mensagem aparece quando você tenta instalar em um dispositivo SCSI que não foi reconhecido pelo programa de instalação.

source: Problems After Installation
pt_br: Problemas após a instalação

source: Resetting the Root Password
pt_br: Redefinindo a senha do root

source: If you lost the root password to the system and you have access to the boot loader, you can reset the password by editing the GRUB2 configuration.
pt_br: Se você perdeu a senha do usuário root para o sistema e tem acesso ao carregador de inicialização, pode redefinir a senha editando a configuração do GRUB2.

source: Boot your system and wait until the GRUB2 menu appears.
pt_br: Inicialize seu sistema e espere até que o menu GRUB2 apareça.

source: In the boot loader menu, highlight any entry and press kbd:[e] to edit it.
pt_br: No menu do carregador de inicialização, destaque qualquer entrada e pressione kbd:[e] para editá-la.

source: Find the line beginning with `linux`. At the end of this line, append the following:
pt_br: Encontre a linha que começa com linux`. No final desta linha, acrescente o seguinte:

source: Press kbd:[F10] or kbd:[Ctrl + X] to boot the system using the options you just edited.
pt_br: Pressione kbd:[F10] ou kbd:[Ctrl + X] para inicializar o sistema usando as opções que você acabou de editar.

source: Once the system boots, you will be presented with a shell prompt without having to enter any user name or password:
pt_br: Assim que o sistema inicializar, será apresentado um prompt de shell sem a necessidade de inserir qualquer nome de usuário ou senha:

source: Load the installed SELinux policy:
pt_br: Carregue a política SELinux instalada:

source: Execute the following command to remount your root partition:
pt_br: Execute o seguinte comando para remontar sua partição raiz:

source: Reset the root password:
pt_br: Redefina a senha de root:
