Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f31/pages/_partials/install/CustomSpoke_RecommendedScheme.po
Languages: id, pt_br

source: If you are not sure how best to configure the partitions for your computer, accept the automatic default partition layout provided by the installation program as described in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination].
id: Jika Anda tidak yakin bagaimana cara terbaik untuk mengkonfigurasi partisi untuk komputer Anda, terima tata letak partisi default otomatis yang disediakan oleh program instalasi seperti yang dijelaskan dalam xref:sect-installation-gui-storage-partitioning[Tujuan Instalasi].
pt_br: Se você não tem certeza da melhor forma de configurar as partições para o seu computador, aceite o layout de partição padrão automático fornecido pelo programa de instalação conforme descrito em xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Destino da instalação] .

source: `/` (root) - 10 GB
pt_br: `/` (raiz) - 10 GB
