Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f31/pages/_partials/install/CustomSpoke_RecommendedScheme.po
Languages: id, pt_br

source: Recommended Partitioning Scheme
id: Skema Pemartisian Yang Direkomendasikan
pt_br: Esquema de particionamento recomendado

source: In most cases, at least the following mount points should always be created:
id: Dalam kebanyakan kasus, setidaknya titik kait berikut harus selalu dibuat:
pt_br: Na maioria dos casos, pelo menos os seguintes pontos de montagem devem sempre ser criados:

source: This partition contains the operating system kernel, which allows {PRODUCT} to boot. It also contains other files used during the bootstrap process. Due to the limitations of most firmware, creating a separate, small standard partition for this directory is recommended. In most scenarios, a 500 MB `/boot` partition is adequate.
id: Partisi ini berisi kernel sistem operasi, yang memungkinkan {PRODUCT} untuk boot. Ini juga berisi berkas lain yang digunakan selama proses bootstrap. Karena keterbatasan kebanyakan firmware, dianjurkan untuk menciptakan partisi standar kecil terpisah untuk direktori ini. Dalam kebanyakan skenario, partisi `/boot` 500 MB cukup.
pt_br: Esta partição contém o kernel do sistema operacional, que permite a inicialização do {PRODUCT}. Ele também contém outros arquivos usados durante o processo de inicialização. Devido às limitações da maioria do firmware, é recomendável criar uma pequena partição padrão separada para este diretório. Na maioria dos cenários, uma partição `/boot` de 500 MB é adequada.

source: If your system has a hardware RAID controller, be aware that some BIOS types do not support booting from it. In that case, the `/boot` partition must be created on a partition outside of the RAID array, such as on a separate hard drive.
id: Jika sistem Anda memiliki pengontrol RAID perangkat keras, berhati-hatilah bahwa beberapa jenis BIOS tidak mendukung boot darinya. Dalam hal ini, partisi `/boot` harus dibuat pada partisi di luar larik RAID, seperti pada hard drive terpisah.
pt_br: Se o seu sistema tiver um controlador RAID de hardware, esteja ciente de que alguns tipos de BIOS não suportam a inicialização a partir dele. Nesse caso, a partição `/boot` deve ser criada em uma partição fora do conjunto RAID, como em um disco rígido separado.

source: Also note that the `/boot` directory can not be placed on a LVM logical volume or a Btrfs subvolume. Use a standard partition.
id: Juga perhatikan bahwa direktori `/boot` tidak dapat ditempatkan pada volume logis LVM atau sub volume Btrfs. Gunakan partisi standar.
pt_br: Observe também que o diretório `/boot` não pode ser colocado em um volume lógico LVM ou um subvolume Btrfs. Use uma partição padrão.

source: This is where the root directory is located. The root directory is the top level of the directory structure. By default, all files are written to this partition unless a different partition is mounted in the path being written to (for example, `/boot` or `/home`). If you follow the recommended scheme described in this section, this will be the partition where most software packages will be installed.
id: Di sinilah direktori root berada. Direktori root adalah tingkat paling atas struktur direktori. Secara default, semua berkas ditulis ke partisi ini kecuali partisi yang berbeda dikait di path yang ditulisi (misalnya, `/boot` atau `/home`). Jika Anda mengikuti skema yang direkomendasikan yang dijelaskan dalam bagian ini, ini akan menjadi partisi di mana sebagian besar paket perangkat lunak akan diinstal.
pt_br: É onde o diretório raiz está localizado. O diretório raiz é o nível superior da estrutura de diretório. Por padrão, todos os arquivos são escritos nesta partição, a menos que uma partição diferente seja montada no caminho que está sendo escrito (por exemplo, `/boot` ou `/home`). Se você seguir o esquema recomendado descrito nesta seção, esta será a partição onde a maioria dos pacotes de software serão instalados.

source: For a minimal installation, a 5 GB root partition will be sufficient. However, for most common installations which include extra packages and a graphical user interface, the root partition should be at least 10 GB; with 20 GB being sufficient for most common use cases.
id: Untuk instalasi minimal, partisi root 5 GB akan cukup. Namun, untuk instalasi yang paling umum yang mencakup paket tambahan dan antarmuka pengguna grafis, partisi root harus minimal 10 GB; dengan 20 GB yang cukup untuk kasus penggunaan yang paling umum.
pt_br: Para uma instalação mínima, uma partição raiz de 5 GB será suficiente. No entanto, para a maioria das instalações comuns que incluem pacotes extras e uma interface gráfica de usuário, a partição raiz deve ter pelo menos 10 GB; com 20 GB sendo suficientes para os casos de uso mais comuns.

source: The `/` mount point is the top of the Linux Filesystem Hierarchy, and is referred to as the _root file system_, or root. The `/root` directory, sometimes pronounced "pass:attributes[{blank}]_slash-root_pass:attributes[{blank}]", is the home directory for the `root` user.
id: Titik kait `/` adalah puncak dari Linux Filesystem Hierarchy, dan disebut sebagai _sistem berkas root_, atau root. Direktori `/root`, terkadang diucapkan "pass:attributes[{blank}]_slash-root_pass:attributes[{blank}]", adalah direktori home untuk pengguna `root`.
pt_br: O ponto de montagem `/` é o topo da hierarquia do sistema de arquivos Linux, e é referido como o _sistema de arquivos raiz_, ou raiz. O diretório `/root`, às vezes pronunciado "pass:attributes[{blank}]_barra rúti_pass:attributes[{blank}]", é o diretório pessoal, "home", do usuário `root`.

source: `/home` - at least 10 GB
id: `/home` - minimal 10 GB
pt_br: `/home` - pelo menos 10 GB

source: To store user data separately from system data, create a dedicated mount point for the `/home` directory. This partition should be sized based on the amount of data that will be stored locally, number of users, and so on. This will allow you to upgrade or reinstall {PRODUCT} without erasing user data files. During the installation, a separate `/home` partition will be created if there are 50 GB or more free space for your {PRODUCT} installation.
id: Untuk menyimpan data pengguna secara terpisah dari data sistem, buat titik kait khusus untuk direktori `/home`. Ukuran partisi ini harus berdasarkan besarnya data yang akan disimpan secara lokal, banyaknya pengguna, dan sebagainya. Ini akan memungkinkan Anda untuk meningkatkan atau menginstal ulang {PRODUCT} tanpa menghapus berkas data pengguna. Selama instalasi, partisi `/home` terpisah akan dibuat jika ada 50 GB atau lebih ruang kosong untuk instalasi {PRODUCT} Anda.
pt_br: Para armazenar dados do usuário separadamente dos dados do sistema, crie um ponto de montagem dedicado para o diretório `/home`. Essa partição deve ser dimensionada com base na quantidade de dados que serão armazenados localmente, no número de usuários e assim por diante. Isso permitirá que você atualize ou reinstale o {PRODUCT} sem apagar os arquivos de dados do usuário. Durante a instalação, uma partição `/home` separada será criada se houver 50 GB ou mais de espaço livre para a instalação do {PRODUCT}.

source: When using {PRODUCT} as a workstation for normal use with a graphical environment, this mount point should have the most disk space assigned to it, as it will likely hold the most data (user settings, images, videos, etc).
id: Saat menggunakan {PRODUCT} sebagai workstation untuk penggunaan normal dengan lingkungan grafis, titik kait ini mesti mendapat jatah ruang disk terbanyak, karena kemungkinan akan memegang sebagian besar data (pengaturan pengguna, gambar, video, dll).
pt_br: Ao usar o {PRODUCT} como uma estação de trabalho para uso normal com um ambiente gráfico, este ponto de montagem deve ter mais espaço em disco atribuído a ele, pois provavelmente conterá a maioria dos dados (configurações do usuário, imagens, vídeos, etc).

source: swap - based on your system parameters
id: swap - berdasarkan parameter sistem Anda
pt_br: swap - baseado em parâmetros do seu sistema

source: Swap partitions support virtual memory; data is written to them when there is not enough RAM to store the data your system is processing. This partition's size is a function of system memory workload, not total system memory, and therefore is not equal to the total system memory size. Therefore, it is important to analyze what applications a system will be running and the load those applications will serve in order to determine the system memory workload. Application providers and developers should be able to provide some guidance.
id: Partisi swap mendukung memori virtual; data ditulis ke sana ketika tidak cukup RAM untuk menyimpan data yang sedang diproses oleh sistem. Ukuran partisi ini adalah fungsi dari beban kerja memori sistem, bukan total memori sistem, dan oleh karena itu tidak sama dengan ukuran memori sistem total. Oleh karena itu, penting untuk menganalisis sistem akan menjalankan aplikasi apa dan seberapa besar beban aplikasi tersebut yang akan dilayani dalam rangka untuk menentukan beban kerja memori sistem. Penyedia aplikasi dan pengembang harus dapat memberikan beberapa panduan.
pt_br: As partições de troca suportam memória virtual; os dados são escritos nelas quando não há RAM suficiente para armazenar os dados que o sistema está processando. O tamanho desta partição é uma função da carga de trabalho da memória do sistema, não da memória total do sistema e, portanto, não é igual ao tamanho total da memória do sistema. Portanto, é importante analisar quais aplicativos um sistema estará executando e a carga que esses aplicativos servirão para determinar a carga de trabalho da memória do sistema. Os provedores e desenvolvedores de aplicativos devem ser capazes de fornecer alguma orientação.

source: When the system runs out of swap space, the kernel terminates processes as the system RAM memory is exhausted. Configuring too much swap space results in storage devices being allocated but idle and is a poor use of resources. Too much swap space can also hide memory leaks. The maximum size for a swap partition and other additional information can be found in the `mkswap(8)` man page.
id: Ketika sistem kehabisan ruang swap, kernel mengakhiri proses karena memori RAM sistem habis. Mengonfigurasi terlalu banyak ruang swap menyebabkan penyimpanan yang dialokasikan pada perangkat tetapi menganggur dan merupakan penggunaan sumber daya yang buruk. Terlalu banyak ruang swap juga dapat menyembunyikan kebocoran memori. Ukuran maksimum untuk partisi swap dan informasi tambahan lainnya dapat ditemukan di halaman manual `mkswap(8)`.
pt_br: Quando o sistema fica sem espaço swap, o kernel encerra os processos à medida que a memória RAM do sistema se esgota. Configurar muito espaço swap resulta na alocação de dispositivos de armazenamento, mas ociosos e em um uso inadequado dos recursos. Muito espaço swap também pode ocultar vazamentos de memória. O tamanho máximo para uma partição swap e outras informações adicionais podem ser encontrados na página do manual `mkswap(8)`.

source: The table below provides the recommended size of a swap partition depending on the amount of RAM in your system and whether you want sufficient memory for your system to hibernate. If you let the installation program partition your system automatically, the swap partition size will be established using these guidelines. Automatic partitioning setup assumes hibernation is not in use, and the maximum size of the swap partition is limited to 10% of the total size of the hard drive. If you want to set up enough swap space to allow for hibernation, or if you want to set the swap partition size to more than 10% of the system's storage space, you must edit the partitioning layout manually.
id: Tabel di bawah ini memberikan ukuran yang direkomendasikan dari partisi swap tergantung pada jumlah RAM di sistem Anda dan apakah Anda ingin memori yang cukup untuk sistem Anda untuk hibernasi. Jika Anda membiarkan program instalasi mempartisi sistem Anda secara otomatis, ukuran partisi swap akan dibuat dengan menggunakan pedoman ini. Pengaturan partisi otomatis mengasumsikan hibernasi tidak digunakan, dan ukuran maksimum partisi swap dibatasi hingga 10% dari total ukuran hard drive. Jika Anda ingin mengatur cukup ruang swap untuk memungkinkan hibernasi, atau jika Anda ingin mengatur ukuran partisi swap lebih dari 10% dari ruang penyimpanan sistem, Anda harus menyunting tata letak partisi secara manual.
pt_br: A tabela abaixo fornece o tamanho recomendado de uma partição swap dependendo da quantidade de RAM em seu sistema e se você deseja memória suficiente para seu sistema hibernar. Se você permitir que o programa de instalação particione seu sistema automaticamente, o tamanho da partição swap será estabelecido usando estas diretrizes. A configuração do particionamento automático pressupõe que a hibernação não está em uso e que o tamanho máximo da partição de troca é limitado a 10% do tamanho total do disco rígido. Se você deseja configurar espaço swap suficiente para permitir a hibernação, ou se deseja definir o tamanho da partição swap para mais de 10% do espaço de armazenamento do sistema, você deve editar o layout de particionamento manualmente.

source: Recommended System Swap Space
id: Ruang Swap Sistem yang Direkomendasikan
pt_br: Espaço swap de sistema recomendado

source: |Amount of RAM in the system|Recommended swap space|Recommended swap space if allowing for hibernation |less than 2 GB|2 times the amount of RAM|3 times the amount of RAM |2 GB - 8 GB|Equal to the amount of RAM|2 times the amount of RAM |8 GB - 64 GB|0.5 times the amount of RAM|1.5 times the amount of RAM |more than 64 GB|workload dependent|hibernation not recommended
id: |Banyaknya RAM dalam sistem|Ruang swap yang direkomendasikan|Ruang swap yang direkomendasikan jika mengizinkan hibernasi |kurang dari 2 GB|2 kali besar RAM|3 kali besar RAM |2 GB-8 GB|Sama dengan besar RAM |2 kali besar RAM |8 GB-64 GB|0,5 kali besar RAM|1,5 kali besar RAM |lebih dari 64 GB|tergantung beban kerja|hibernasi tidak dianjurkan
pt_br: |Quantidade de RAM no sistema|Espaço swap recomendado|Espaço swap recomendado se pretende usar hibernação |menos de 2 GB|2 vezes a quantidade da RAM|3 vezes a quantidade da RAM |2 GB - 8 GB|Igual à quantidade da RAM|2 vezes a quantidade da RAM |8 GB - 64 GB|0,5 vezes a quantidade da RAM|1,5 vezes a quantidade da RAM |mais que 64 GB|dependendo da carga de uso|hibernação não recomendada

source: At the border between each range listed above (for example, a system with 2 GB, 8 GB, or 64 GB of system RAM), discretion can be exercised with regard to chosen swap space and hibernation support. If your system resources allow for it, increasing the swap space may lead to better performance.
id: Di perbatasan antara setiap rentang yang tercantum di atas (misalnya, sebuah sistem dengan RAM 2 GB, 8 GB, atau 64 GB), kebijaksanaan dapat dilakukan atas pilihan ruang swap dan dukungan hibernasi. Jika sumber daya sistem Anda memungkinkan untuk itu, meningkatkan ruang swap dapat menyebabkan kinerja yang lebih baik.
pt_br: Na fronteira entre cada intervalo listado acima (por exemplo, um sistema com 2 GB, 8 GB ou 64 GB de RAM do sistema), o critério pode ser exercido em relação ao espaço swap escolhido e suporte de hibernação. Se os recursos do seu sistema permitirem, aumentar o espaço swap pode levar a um melhor desempenho.

source: Distributing swap space over multiple storage devices - particularly on systems with fast drives, controllers and interfaces - also improves swap space performance.
id: Mendistribusikan ruang swap pada beberapa perangkat penyimpanan - terutama pada sistem dengan drive, controller, dan antarmuka yang cepat - juga meningkatkan kinerja ruang swap.
pt_br: Distribuir espaço swap em vários dispositivos de armazenamento – especialmente em sistemas com unidades rápidas, controladores e interfaces – também melhora o desempenho do espaço swap.

source: BIOS Boot (1 MB) or EFI System Partition (200 MB)
id: Boot BIOS (1 MB) atau Partisi Sistem EFI (200 MB)
pt_br: Inicialização BIOS (1 MB) ou Partição de Sistema EFI (200 MB)

source: The [application]*GRUB2* boot loader can be installed either in the _Master Boot Record_ (MBR) or the _GUID Partition Table_ (GPT) of the boot device. In order to determine which of these methods to use, the installation program considers the following variations:
id: Boot loader [application]*GRUB2* dapat diinstal baik dalam _Master Boot Record_ (MBR) atau _GUID Partition Table_ (GPT) dari perangkat boot. Untuk menentukan metode mana yang digunakan, program penginstalan mempertimbangkan variasi berikut:
pt_br: O carregador de inicialização [application]*GRUB2* pode ser instalado no _Master Boot Record_ (MBR) ou na _Tabela de Partição GUID_ (GPT) do dispositivo de inicialização. Para determinar qual desses métodos usar, o programa de instalação considera as seguintes variações:

source: Systems with BIOS firmware and UEFI systems in BIOS compatibility mode:
id: Sistem dengan firmware BIOS dan sistem UEFI dalam mode kompatibilitas BIOS:

source: If the disk is already formatted, the partitioning scheme is retained. If the disk is not formatted, or you have erased all existing partitions from the disk, the installer will choose the following:
id: Jika disk telah diformat, skema partisi dipertahankan. Jika disk tidak diformat, atau Anda telah menghapus semua partisi yang ada dari disk, installer akan memilih berikut:
pt_br: Se o disco já estiver formatado, o esquema de particionamento será mantido. Se o disco não estiver formatado ou se você apagou todas as partições existentes do disco, o instalador escolherá o seguinte:

source: MBR if the size of the disk is less than 2 TB (terabytes)
id: MBR jika ukuran disk kurang dari 2 TB (terabyte)
pt_br: MBR se o tamanho do disco for inferior a 2 TB (terabytes)

source: GPT if the size of the disk is more than 2 TB
id: GPT jika ukuran disk lebih dari 2 TB
pt_br: GPT se o tamanho do disco for maior que 2 TB

source: You can force the installer to use GPT on disks smaller than 2 TB by using the [option]#inst.gpt# boot option as described in xref:advanced/Boot_Options.adoc#chap-anaconda-boot-options[Boot Options]. However, the opposite is not possible - you can not use MBR on disks larger than 2 TB.
id: Anda dapat memaksa penginstal untuk menggunakan GPT pada disk yang lebih kecil dari 2 TB dengan menggunakan opsi boot [option]#inst.gpt# seperti yang dijelaskan dalam xref:advanced/Boot_Options.adoc#chap-anaconda-boot-options[Opsi Boot]. Namun, yang sebaliknya tidak mungkin - Anda tidak dapat menggunakan MBR pada disk yang lebih besar dari 2 TB.
pt_br: Você pode forçar o instalador a usar GPT em discos menores que 2 TB usando a opção de inicialização [option]#inst.gpt# conforme descrito em xref:advanced/Boot_Options.adoc#chap-anaconda-boot-options[Opções de inicialização]. No entanto, o oposto não é possível – você não pode usar MBR em discos maiores que 2 TB.

source: You need to create a _BIOS Boot_ partition with a size of 1 MB to install on a system with BIOS firmware if the disk containing the boot loader uses GPT. If the disk uses a MBR, no special partition is necessary on a BIOS system.
id: Anda perlu membuat partisi _Boot BIOS_ dengan ukuran 1 MB untuk menginstal pada sistem dengan firmware BIOS jika disk yang berisi boot loader menggunakan GPT. Jika disk menggunakan MBR, partisi khusus tidak diperlukan pada sistem BIOS.
pt_br: Você precisa criar uma partição _Inicialização BIOS_ com um tamanho de 1 MB para instalar em um sistema com firmware BIOS se o disco que contém o carregador de inicialização usa GPT. Se o disco usar um MBR, nenhuma partição especial será necessária em um sistema BIOS.

source: Systems with UEFI firmware:
id: Sistem dengan firmware UEFI:

source: Only GPT is allowed on UEFI systems. In order to install on a formatted disk with a MBR, it must be reformated and relabeled. All data currently on the disk will be lost.
id: Hanya GPT yang diperbolehkan pada sistem UEFI. Untuk menginstal pada disk yang diformat dengan MBR, itu harus diformat ulang dan dan dilabeli ulang. Semua data saat ini pada disk akan hilang.
pt_br: Apenas GPT é permitido em sistemas UEFI. Para instalar em um disco formatado com MBR, ele deve ser reformatado e rotulado novamente. Todos os dados atualmente no disco serão perdidos.

source: UEFI-based systems require an _EFI System Partition_ at least 50 MB in size (recommended size is 200 MB), regardless of the partitioning scheme.
id: Sistem berbasis UEFI memerlukan _Partisi Sistem EFI_ setidaknya 50 MB (ukuran yang disarankan adalah 200 MB), terlepas dari skema partisi.
pt_br: Os sistemas baseados em UEFI requerem uma _Partição de Sistema EFI_ com pelo menos 50 MB de tamanho (o tamanho recomendado é 200 MB), independentemente do esquema de particionamento.

source: If your system requires either a BIOS Boot partition or an EFI System Partition based on the requirements detailed above, this partition must be created as a standard physical partition. It can not reside on an LVM volume or a Btrfs subvolume.
id: Jika sistem Anda membutuhkan baik partisi boot BIOS atau Partisi Sistem EFI berdasarkan persyaratan yang dijelaskan di atas, partisi ini harus dibuat sebagai partisi fisik standar. Itu tidak boleh berada pada volume LVM atau sub volume Btrfs.
pt_br: Se o seu sistema requer uma partição de inicialização BIOS ou uma partição de sistema EFI com base nos requisitos detalhados acima, esta partição deve ser criada como uma partição física padrão. Ele não pode residir em um volume LVM ou em um subvolume Btrfs.

source: Also note that if your system does not require any of these partitions, they will not be shown in the `File System` menu in mount point options.
id: Juga perhatikan bahwa jika sistem Anda tidak memerlukan partisi ini, mereka tidak akan ditampilkan dalam menu `Sistem Berkas` di opsi titik kait.
pt_br: Observe também que se seu sistema não requer nenhuma dessas partições, elas não serão mostradas no menu `Sistema de arquivos` nas opções de ponto de montagem.

source: Many systems have more partitions than the minimum listed above. Choose partitions based on your particular needs. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-advice[Advice on Partitions] for additional information and advice.
id: Banyak sistem memiliki partisi lebih dari minimum yang tercantum di atas. Pilih partisi berdasarkan kebutuhan khusus Anda. Lihat xref:sect-installation-gui-manual-partitioning-advice[Saran tentang Partisi] untuk informasi tambahan dan saran.
pt_br: Muitos sistemas têm mais partições do que o mínimo listado acima. Escolha partições com base em suas necessidades particulares. Veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-advice[Conselhos sobre partições] para informações adicionais e conselhos.

source: Only assign storage capacity to those partitions you require immediately. You may allocate free space at any time, to meet needs as they occur.
id: Hanya tetapkan kapasitas penyimpanan untuk partisi yang Anda butuhkan segera. Anda dapat mengalokasikan ruang bebas setiap saat, untuk memenuhi kebutuhan ketika mereka terjadi.
pt_br: Atribua capacidade de armazenamento apenas às partições de que você precisa imediatamente. Você pode alocar espaço livre a qualquer momento, para atender às necessidades à medida que ocorrem.
