Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f31/pages/_partials/install/NetworkSpoke_EditConnection.po
Languages: es

source: Editing Network Interface Configuration
es: Editando la Configuración del Interfaz de Red

source: This section only details the most important settings for a typical wired connection used during installation. Many of the available options do not have to be changed in most installation scenarios and are not carried over to the installed system. Configuration of other types of networks is broadly similar, although the specific configuration parameters may be different. To learn more about network configuration after installation, see the [citetitle]_{PRODUCT} Networking{nbsp}Guide_, available at link:++https://docs.fedoraproject.org/++[].
es: Esta sección sólo detalla los ajustes más importantes para una conexión cableada típica usada durante la instalación. Muchas de las opciones disponibles no tienen que ser cambiadas en la mayoría de los escenarios de instalación y no se transfieren al sistema instalado. La configuración de otro tipo de redes es en general similar, aunque parámetros específicos de configuración pueden ser diferentes. Para aprender más sobre la configuración de la red después de la instalación vea la [citetitle]_{PRODUCT} Guía{nbsp}de Red_, disponible en link:++https://docs.fedoraproject.org/++[].

source: To configure a network connection manually, select that connection in the list on the left side of the screen, and click the `Configure` button. A dialog will appear that allows you to configure the selected connection. The configuration options presented depends on the connection type - the available options will be slightly different depending on whether it is a physical interface (wired or wireless network interface controller) or a virtual interface (Bond, Team or Vlan) which you previously configured in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration-virtual-interface[Adding a Virtual Network Interface].. A full description of all configuration settings for all connection types is beyond the scope of this document; see the [citetitle]_Networking Guide_ for details.
es: Para configurar una conexión de red manualmente, seleccione esa conexión en la lista del lado izquierdo de la pantalla y pulse el botón `Configurar`. Aparecerá un diálogo que le permite configurar la conexión seleccionada. Las opciones de configuración presentadas dependen del tipo de conexión - las opciones disponibles pueden ser levemente diferentes dependiendo de si es una interfaz física (controlador de interfaz para red cableada o inalámbrica) o una interfaz virtual (Bond, Team o Vlan) que usted ha configurado previamente en xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration-virtual-interface[Añadiendo una Interfaz de Red Virtual].. Una descripción total de todos los ajustes de configuración para todos los tipos de conexión está fuera del alcance de este documento; vea detalles en la [citetitle]_Guía de Red_ .

source: The most common and useful options in the configuration dialog are:
es: Las opciones más comunes y útiles en el diálogo de configuración son:

source: Enable or disable the connection by default
es: Habilitar o deshabilitar la conexión de forma predeterminada

source: In the `General` tab of the configuration dialog, you can select or unselect the `Automatically connect to this network when it is available` check box to allow or disallow this connection to connect by default. When enabled on a wired connection, this means the system will typically connect during startup (unless you unplug the network cable); on a wireless connection, it means that the interface will attempt to connect to any known wireless networks in range.
es: En la pestaña `General` del diálogo de configuración, puede seleccionar o deseleccionar la casilla de verificación `Conectar automáticamente a este red cuando esté disponible` para permitir o no que esta conexión se conecte de forma predeterminada. Cuando está habilitada para una conexión cableada, esto significa que el sistema se conectará normalmente durante el arranque (a no ser que desconecte el cable de red); sobre una conexión inalámbrica, significa que la interfaz intentará conectar a cualquiera de las redes inalámbricas conocidos en el rango.

source: Additionally, you can allow or disallow all users on the system from connecting to this network using the `All users may connect to this network` option. If you disable this option, only `root` will be able to connect to this network.
es: Adicionalmente, usted puede permitir o no que todos los usuarios en el sistema se conecten a esta red usando la opción `Todos los usuarios pueden conectarse a esta red`. Si deshabilita esta opción, sólo `root` será capaz de conectarse a este red.

source: It is not possible to only allow a specific user other than `root` to use this interface, because no other users are created at this point during the installation. If you need a connection for a different user, you must configure it after the installation.
es: No es posible que permita a un usuarios específico distinto de `root` que use esta interfaz, puesto que no hay otros usuarios creados en este punto durante la instalación. Si necesita una conexión para un usuario diferente, debe configurarlo después de la instalación.

source: Set up static IPv4 or IPv6 settings
es: Configurar los ajustes de IPv4 o IPv6 estática

source: By default, both `IPv4` and `IPv6` are set to automatic configuration depending on current network settings. This means that addresses such as the local IP address, DNS address, and other settings will be detected automatically each time the interface connects to a network. In many cases, this is sufficient, but you can also provide static configuration in the `IPv4 Settings` and `IPv6 Settings`, respectively.
es: De modo predeterminado, tanto `IPv4` como `IPv6` están establecidos en configuración automática dependiendo de la configuración de red actual. Esto significa que las direcciones como la dirección IP local, la dirección DNS y otros ajustes serán detectados automáticamente cada ve que la interfaz se conecte a la red. En muchos casos esto es suficiente, pero usted puede suministrar una configuración estática en los `Ajustes IPv4` y `Ajustes IPv6`, respectivamente.

source: To set static network configuration, navigate to one of the settings tabs and select a method other than `Automatic` (for example, `Manual`) from the `Method` drop-down menu. This will enable the `Addresses` field below.
es: Para establecer una configuración de red estática, vaya a uno de las pestañas de ajustes y seleccione un método distinto del `Automático` (por ejemplo, `Manual`) desde el menú desplegable `Método`. Esto habilitará el campo `Dirección` abajo.

source: In the `IPv6 Settings` tab, you can also set the method to `Ignore` to disable `IPv6` on this interface.
es: En la pestaña `Ajustes IPv6` también puede estableces el método a `Ignorar` para deshabilitar `IPv6` en esta interfaz.

source: Then, click `Add` on the right side and add a set of settings: `Address`, `Netmask` (for `IPv4`), `Prefix` (for `IPv6`), and `Gateway`.
es: Después, pulse `Añadir` en el lado derecho y añada un conjunto de ajustes: `Dirección`, `Máscara de Red` (para `IPv4`), `Prefijo` (para `IPv6`) y `Pasarela`.

source: The `DNS servers` field accepts one or more IP addresses of DNS servers - for example, `10.0.0.1,10.0.0.8`.
es: El campo `Servidores DNS` acepta uno o más direcciones IP de servidores DNS - por ejemplo, `10.0.0.1,10.0.0.8`.

source: The final option in both tabs is `Require IPvpass:attributes[{blank}]_X_ addressing for this connection to complete`. Select this option in the `IPv4` tab to only allow this connection if `IPv4` was successful; the same principle applies to this setting in the `IPv6` tab. If this option remains disabled for both `IPv4` and `IPv6`, the interface will be able to connect if configuration succeeds on either IP protocol.
es: La opción final en ambas pestañas es `Requiere direccionamiento IPvpass:attributes[{blank}]_X_ para que se complete esta conexión`. Seleccione esta opción en la pestaña `IPv4` para sólo permitir esta conexión si `IPv4` tiene éxito; el mismo principio se aplica a este ajuste en la pestaña `IPv6`. Si esta opción permanece deshabilitada tanto para `IPv4` como para `IPv6`, la interfaz podrá conectarse si la configuración se realiza correctamente en cualquiera de los protocolos IP.

source: Configure routes
es: Configurar rutas

source: In the `IPv4 Settings` and `IPv4 Settings` tabs, click the `Routes` button in the bottom right corner to configure routing settings for a specific IP protocol on an interface. A new dialog will open, allowing you to `Add` a specific route.
es: En las pestañas `Ajustes IPv4` y `Ajustes IPv6`, pulse el botón `Rutas` en la esquina inferior derecha para configurar los ajustes de enrutamiento para un protocolo IP específico sobre una interfaz. Se abrirá un cuadro de diálogo, permitiéndole `Añadir` una ruta específica.

source: If you confire at least one static route, you can disallow all routes not specifically configured here by enabling the `Ignore automatically obtained routes`.
es: Si usted confía en al menos una ruta estática, puede deshabilitar todas las rutas no configuradas específicamente aquí habilitando `Ignorar automáticamente las rutas obtenidas`.

source: Select `Use this connection only for resources on its network` to prevent this connection from becoming the default route. This option can be selected even if you did not configure any static routes. Enabling this option means that this route will only be used when necessary to access certain resources, such as intranet pages which require a local or VPN connection. Another (default) route will be used for publicly available resources if possible. Note that unlike the additional routes configured in this dialog, this setting will be transferred to the installed system. Also note that this option is only useful when more than one interface is configured.
es: Seleccione `Usar esta conexión sólo para recursos en esta red` para evitar que esta conexión llegue a ser la ruta predeterminada. Esta opción se puede seleccionar incluso si no configuró ninguna ruta estática. Habilitar esta opción significa que esta ruta solo se utilizará cuando sea necesario para acceder a ciertos recursos, como páginas de intranet que requieren una conexión local o VPN. Si es posible, se utilizará otra ruta (predeterminada) para los recursos disponibles públicamente. Tenga en cuenta que, a diferencia de las rutas adicionales configuradas en este cuadro de diálogo, esta configuración se transferirá al sistema instalado. También tenga en cuenta que esta opción solo es útil cuando se configura más de una interfaz.

source: When you finish configuring the interface's routing settings, click `OK` to return to the configuration dialog.
es: Cuando termine de configurar los ajustes de enrutamiento de la interfaz, pulse `OK` para volver al cuadro de diálogo de configuración.

source: Once you finish configuring the interface, click `Save` in the configuration window's bottom right corner to save your settings and return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Network & Hostname].
es: Una vez que termine de configurar la interfaz, pulse `Guardar` en la esquina inferior derecha de la ventana de configuración para guardar sus ajustes y volver a xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Red y Nombre de equipo].
