Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f31/pages/_partials/install/SoftwareSpoke.po
Languages: es

source: Software Selection
es: Selección de Software

source: The `Software Selection` screen allows you to choose a _Base Environment_ and _Add-ons_. These options control which software packages will be installed on your system during the installation process.
es: La pantalla `Selección de Software` le permite elegir un _Entorno Base_ y _Complementos_. Estas opciones controlan qué paquetes software serán instalados en su sistema durante el proceso de instalación.

source: This screen is only available if xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-source[Installation Source] is properly configured and only after the installer has downloaded package metadata from the source.
es: Esta pantalla está sólo disponible si xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-source[Fuente de la Instalación] está configurada apropiadamente y sólo después de que el instalador haya descargado los metadatos de los paquetes de la fuente.

source: It is not possible to select specific packages during a manual installation. You can only select pre-defined environments and add-ons. If you need to control exactly which packages are installed, you must use a Kickstart file and define the packages in the [command]#%packages# section. See xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart] for information about Kickstart installations.
es: No es posible seleccionar paquetes específicos durante una instalación manual. Sólo puede seleccionar entornos predefinidos y complementos. Si necesita controlar exactamente que paquetes son instalados, debe usar un archivo Kickstart y definir los paquetes en la sección [command]#%packages#. Vea en xref:../advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automatizando la Instalación con Kickstart] información sobre las instalaciones Kickstart.

source: The availability of environments and add-ons depends on your installation source. By default, the selection depends on the installation media you used to start the installation; Fedora{nbsp}Server installation image will have different environments and add-ons available for selection than, for example, the Fedora{nbsp}Cloud image. You can change this by configuring a different installation source containing different environments.
es: La disponibilidad de entornos y complementos depende de su fuente de instalación. De forma predeterminada, la selección depende del medio de instalación que haya usado para el inicio de la instalación; la imagen de instalación Fedora{nbsp}Server tendrá disponibles distintos entornos y complementos para seleccionar que, por ejemplo, la imagen Fedora{nbsp}Cloud. Puede cambiar esto configurando una fuente de instalación diferente que tenga entornos distintos.

source: The Software Selection screen. On the left side
es: La pantalla Selección de Software. En el lado izquierdo

source: anaconda/SoftwareSpoke.png
es: anaconda/StorageSpoke.png

source: To configure your software selection, first choose an environment on the left side of the screen. Only one environment can be chosen, even if more are available. Then, on the right side of the screen, select one or more add-ons which you want to install by marking the check boxes next to each add-on.
es: Para configurar su selección de software, elija primero un entorno en el lado izquierdo de la pantalla. Sólo se puede elegir un entorno, aunque haya más disponibles. Después, en el lado derecho de la pantalla, seleccione uno o más complementos que desee instalar marcando la caja de verificación próxima a cada complemento.

source: The list of add-ons is divided into two parts by a horizontal line. Add-ons above this line are defined as part of your chosen environment; if you select a different environment, the add-ons available here will change. The add-ons displayed below the separator are not specific to your chosen environment.
es: La lista de complementos se divide en dos partes por una línea horizontal. Los complementos por encima de esta línea están definidos como parte del entorno que haya elegido; si selecciona un entorno diferente, los complementos disponibles aquí cambiarán. Los complementos por debajo de la separación no son específicos del entorno que haya elegido.

source: Environments and add-ons are defined using a `comps.xml` file in your installation source (for example, in the `repodata/` directory on the full Fedora{nbsp}Server installation DVD). Review this file to see exactly which packages will be installed as part of a certain environment or add-on. For more information about the `comps.xml` file, see xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-packages[%packages (required) - Package Selection].
es: Los entornos y los complementos son definidos usando un archivo `comps.xml` en su fuente de instalación (por ejemplo, en el directorio `repodata/` del DVD completo Fedora{nbsp}Server installation). Revise este archivo para ver exactamente que paquetes serán instalados como parte de cierto entorno o complemento. Para más información sobre el archivo `comps.xml`, vea xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-packages[%packages (requerido) - Selección de paquetes].
