Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f31/pages/_partials/install/SourceSpoke.po
Languages: id

source: Installation Source
id: Sumber Instalasi

source: The `Installation Source` screen allows you to specify a location (local or on the network) from which packages will be downloaded and installed on your system. This screen will be configured automatically in most cases, but you can change your settings or add additional sources.
id: Layar `Sumber Instalasi` memungkinkan Anda untuk menyatakan suatu lokasi (lokal atau pada jaringan) dari mana paket akan diunduh dan dipasang pada sistem Anda. Layar ini akan dikonfigurasi secara otomatis pada kebanyakan kasus, tapi Anda dapat mengubah pengaturan Anda atau menambahkan sumber.

source: Normally, when you first enter the `Installation Summary` screen, the installer will attempt to configure an installation source based on the type of media you used to boot. The full {PRODUCT} Server DVD will configure the source as local media, the netinst ISO image will configure the closest network mirror, etc. This process takes some time, especially if the default source is a network mirror. If you plan to use a custom installation source, use the [option]#inst.askmethod# boot option to skip the initial configuration; this will allow you to enter this screen immediately. See xref:advanced/Boot_Options.adoc#sect-boot-options-sources[Specifying the Installation Source] for information about boot options.
id: Secara normal, ketika pertama Anda memasuki layar `Ringkasan Instalasi`, installer akan mencoba mengonfigurasi suatu sumber instalasi berbasis pada tipe media yang Anda pakai untuk boot. DVD Server {PRODUCT} lengkap akan mengonfigur sumber sebagai media lokal, image ISO netinst akan mengonfigur cermin jaringan terdekat, dsb. Proses ini makan waktu, khususnya bila sumber baku adalah sebuah cermin jaringan. Bila Anda berrencana memakai suatu sumber instalasi ubahan, gunakan opsi boot [option]#inst.askmethod# untuk melewati konfigurasi awal; ini akan mengizinkan Anda seketika masuk ke layar ini. Lihat xref:advanced/Boot_Options.adoc#sect-boot-options-sources[Menyatakan Sumber Instalasi] untuk informasi tentang opsi-opsi boot.

source: The Installation Source screen
id: Layar Sumber Instalasi

source: The following options are available. Note that not all of them may be displayed.
id: Opsi-opsi berikut tersedia. Catat bahwa tidak semua mungkin ditampilkan.

source: Auto-detected installation media
id: Media instalasi yang terdeteksi otomatis

source: This is the option selected by default if you started the installer from media containing an installation source, such as a live DVD. No additional configuration is necessary. You can click the `Verify` button check the media integrity.
id: Opsi ini dipilih secara baku bila Anda memulai installer dari media yang memuat suatu sumber instalasi, seperti misalnya DVD live. Tidak ada konfigurasi tambahan yang diperlukan. Anda dapat mengklik tombol `Verifikasi`untuk memeriksa integritas media.

source: ISO file
id: Berkas ISO

source: This option will appear if the installation program detected a partitioned hard drive with mountable file systems during boot. Select this option, click the btn:[Choose an ISO] button, and browse to the installation ISO file's location on your system. You can click the `Verify` button to check the file's integrity.
id: Opsi ini akan muncul bila program instalasi mendeteksi sebuah hard disk yang terpartisi dengan sistem berkas yang dapat dikait selama boot. Pilih opsi ini, klik tombol btn:[Pilih sebuah ISO], dan ramban ke lokasi berkas ISO instalasi pada sistem Anda. Anda dapat mengklik tombol `Verifikasi` untuk memeriksa integritas berkas.

source: On the network
id: Pada jaringan

source: Use this option to download packages to be installed from a network location instead of local media. This is the default selection on network installation media.
id: Gunakan opsi ini untuk mengunduh paket-paket yang akan dipasang dari lokasi jaringan sebagai pengganti media lokal. Ini adalah pilihan baku pada media instalasi jaringan.

source: In most cases, the `Closest mirror` option available from the protocol selection drop-down menu is preferable. If this option is selected, packages for your system will be downloaded from the most suitable location (mirror).
id: Dalam kebanyakan kasus, opsi `Cermin terdekat` yang tersedia dari menu drop down pemilihan protokol lebih disukai. Bila opsi ini dipilih, paket-paket bagi sistem Anda akan diunduh dari lokasi (cermin) yang paling cocok.

source: To manually configure a network-based installation source, use the drop-down menu to specify the protocol to be used when downloading packages. This setting depends on the server you want to use. Then, type the server address (without the protocol) into the address field. If you choose NFS, a second input field will appear where you can specify custom `NFS mount options`.
id: Untuk mengonfigurasi secara manual suatu sumber instalasi berbasis jaringan, gunakan menu drop down untuk menyatakan protokol yang akan dipakai ketika mengunduh paket. Pengaturan ini bergantung pada server yang ingin Anda pakai. Lalu, ketikkan alamat server (tanpa protokol) ke dalam ruas alamat. Bila Anda memilih NFS, ruas masukan ke dua akan muncul dimana Anda dapat menyatakan `opsi mount NFS` ubahan.

source: When selecting an NFS installation source, you must specify the address with a colon (`:`) character separating the host name from the path. For example:
id: Ketika memilih suatu sumber instalasi NFS, Anda mesti menyatakan alamat dengan karakter titik dua (`:`) yang memisahkan nama host dari path. Sebagai contoh:

source: To configure a proxy for an HTTP or HTTPS source, click the btn:[Proxy setup] button. Check `Enable HTTP proxy` and type the URL into the `Proxy URL` box. If the proxy server requires authentication, check `Use Authentication` and enter your user name and password. Click btn:[OK] to finish the configuration.
id: Untuk mengonfigurasi suatu proksi bagi sumber HTTP atau HTTPS, klik tombol btn:[Penyiapan proksi]. Centang `Fungsikan proksi HTTP` dan ketikkan URL ke dalam kotak `URL Proksi`. Bila server proksi memerlukan autentikasi, centang `Gunakan Autentikasi` dan masukkan nama pengguna dan kata sandi Anda. Klik btn:[OK] untuk menyelesaikan konfigurasi.

source: If your HTTP or HTTPS URL refers to a repository mirror list, mark the check box under the address field.
id: Bila URL HTTP atau HTTPS Anda mengacu ke sebuah daftar cermin, tandai kotak centang di bawah ruas alamat.

source: You can also specify additional repositories in the `Additional repositories` section to gain access to more installation environments and software add-ons. All environments and add-ons will be available for selection in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Software Selection] once you finish configuring the sources.
id: Anda juga dapat menyatakan repositori tambahan dalam bagian `Repositori tambahan` untuk mendapatkan akses ke lebih banyak lingkungan instalasi dan add on perangkat lunak. Semua lingkungan dan add-on akan tersedia untuk dipilih dalam xref:sect-installation-gui-software-selection[Pemilihan Perangkat Lunak] setelah Anda selesai mengonfigurasi sumber.

source: To add a repository, click the btn:[+] button. To delete a repository, select one in the list and click the btn:[-] button. Click the arrow icon to revert to the previous list of repositories, i.e. to replace current entries with those that were present at the time you entered the `Installation Source` screen. To activate or deactivate a repository, click the check box in the `Enabled` column at each entry in the list.
id: Untuk menambahkan repositori, klik tombol btn:[+]. Untuk menghapus sebuah repositori, pilih satu dalam daftar dan klik tombol btn:[-]. Klik ikon panah untuk memulihkan ke daftar repositori sebelumnya, yaitu mengganti entri saat ini dengan yang ada pada saat Anda masuk layar `Sumber Instalasi`. Untuk mengaktifkan atau menonaktifkan sebuah repositori, klik kotak centang dalam kolom `Difungsikan` pada setiap entri dalam daftar.

source: You can name your additional repository and configure it the same way as the primary repository on the network using the input fields on the right side of the section.
id: Anda dapat menamai repositori tambahan Anda dan mengonfigurnya dengan cara yang sama dengan repositori primer pada jaringan memakai ruas masukan pada sisi kanan bagian.

source: Once you have selected your installation source, click `Done` in the top left corner to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
id: Sekali Anda telah membuat pilihan, klik `Selesai` di pojok kiri atas untuk kembali ke xref:sect-installation-gui-installation-summary[Ringkasan Instalasi].
