Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f31/pages/_partials/install/UserSpoke.po
Languages: es, fr

source: Create User
es: Crear usuario|
fr: Créer un utilisateur

source: The `Create User` screen can be used to create and configure one normal (non-`root`) user account during the installation. Only one user account can be configured here; if you require more accounts, wait until the installation completes, reboot your system and then create other accounts using either the [command]#useradd# command in a terminal, or a graphical utility for managing user accounts (for example, the `Users` screen in the Settings menu in [application]*GNOME*).
es: La pantalla `Crear Usuario` puede ser usada para crear y configurar una cuenta de usuario normal (no`root`) durante la instalación. Sólo se puede configurar un usuario aquí; si requiere más cuentas, espere a que la instalación se complete, reinicie su sistema y después cree otras cuentas usando bien el comando [command]#useradd# en un terminal o una utilidad gráfica para administrar cuentas de usuario (por ejemplo, la pantalla `Usuarios` en el menú Ajustes de [application]*GNOME*).
fr: L’écran `Créer un utilisateur` peut être utilisé pour créer et configurer un compte utilisateur normal (non `root`) pendant l’installation. Un seul compte d’utilisateur peut être configuré ici ; si vous avez besoin de plusieurs comptes, attendez que l’installation soit terminée, redémarrez votre système et créez ensuite d’autres comptes en utilisant soit la commande [command]#useradd# dans un terminal, soit un utilitaire graphique pour gérer les comptes d’utilisateurs (par exemple, l’écran `Utilisateurs` dans le menu Paramètres de [application]*GNOME*).

source: Creating a normal user account is not required to finish the installation; however, it is highly recommended. If you do not create one, you will have to log in to the system as `root` directly, which is *not* recommended.
es: No es preciso la creación de una cuenta de usuario para finalizar la instalación; sin embargo, es altamente recomendable. Si usted no crea una, tendrá que registrarse en el sistema como `root` directamente, lo que *no* es recomendable.
fr: Il n’est pas nécessaire de créer un compte d’utilisateur normal pour terminer l’installation ; cependant, cela est fortement recommandé. Si vous n’en créez pas, vous devrez vous connecter directement au système en tant que `root`, ce qui est *non* recommandé.

source: The Create screen. Use the text input fields to create a user account and configure its settings.
es: La pantalla Crear. Use los campos de entrada de texto para crear una cuenta de usuario y configurar sus ajustes.
fr: L’écran Créer. Utilisez les champs de saisie de texte pour créer un compte utilisateur et configurer ses paramètres.

source: To configure a user account, fill out the `Full name` (for example, `John Smith`) and `Username` (for example, `jsmith`). The `username` will used to log in from a command line; if you install a graphical environment, then your graphical login manager will use `Full name`.
es: Para configurar una cuenta de usuario, rellene el `Nombre completo` (por ejemplo, `John Smith`) y el `Nombre de usuario` (por ejemplo, `jsmith`). El `nombre de usuario` se usará para acceder desde la línea de comandos; si usted instala un entorno gráfico, el administrador gráfico de acceso usará el `Nombre completo`.
fr: Pour configurer un compte utilisateur, remplissez le `Nom complet` (par exemple, `Jean Dupont`) et le `Nom d’utilisateur` (par exemple, `jdupont`). Le `nom d’utilisateur` sera utilisé pour se connecter à partir d’une ligne de commande ; si vous installez un environnement graphique, alors votre gestionnaire de connexion graphique utilisera le `nom complet`.

source: Make sure that the `Require a password to use this account` check box is enabled, enter a password you want to use for this account into the `Password` field. The characters you write will be displayed as dots for security. Then, repeat the same password in the `Confirm password` field below to ensure you entered it properly. Both entered passwords must be the same.
es: Asegúrese de que la casilla de verificación `Se requiere contraseña para usar esta cuenta` está habilitada, introduzca una contraseña que desee utilizar para esta cuenta en el campo `Contraseña`. Los caracteres que escriba se mostrarán como puntos por seguridad. Después, repita la misma contraseña en el campo `Confirmar contraseña` mas abajo para asegurar que lo ha introducido apropiadamente. Ambas contraseñas introducidas deben ser la misma.
fr: Veuillez vous assurez que la case `Demander un mot de passe pour utiliser ce compte` est cochée, entrez le mot de passe que vous souhaitez utiliser pour ce compte dans le champ `Mot de passe`. Les caractères que vous entrez seront affichés sous forme de points pour des raisons de sécurité. Ensuite, répétez le même mot de passe dans le champ `Confirmer le mot de passe` en dessous pour vous assurer que vous l’avez entré correctement. Les deux mots de passe saisis doivent être identiques.

source: As you enter the password, it will be evaluated and the installer will determine the password's strength. If the installer considers your password weak, a message will appear at the bottom of the screen, explaining which aspect of your chosen password is considered insuficient. For example:
es: Según introduzca la contraseña será evaluada y el instalador determinará su fortaleza. Si el instalador considera que la contraseña es débil aparecerá un mensaje en la parte inferior de la pantalla, explicando que aspecto de la contraseña que ha elegido es considerado insuficiente. Por ejemplo:
fr: Au fur et à mesure que vous entrez le mot de passe, il sera évalué et l’installateur déterminera la force du mot de passe. Si l’installateur considère que votre mot de passe est faible, un message apparaitra en bas de l’écran, expliquant quel aspect du mot de passe choisi est considéré comme insuffisant. Par exemple :

source: `The password you have provided is weak:` `The password is shorter than 5 characters.`
es: `La contraseña que ha suministrado es débil:` `La contraseña tiene menos de 5 caracteres.`
fr: `Le mot de passe que vous avez fourni est faible :` `Le mot de passe fait moins de 5 caractères.`

source: If a message similar to the above appears, it is highly recommended to choose a different, stronger password.
es: Si aparece un mensaje similar al de arriba, es altamente recomendable que elija una contraseña diferente, más fuerte.
fr: Si un message similaire à celui ci-dessus apparait, il est fortement recommandé de choisir un mot de passe différent et plus fort.

source: The `Make this user administrator` check box gives the user you are creatng administrative rights (by adding this user into the `wheel` group), allowing this user to use the [command]#sudo# command to perform tasks normally only available to `root` using only the user password, instead of the `root` password. This may be more convenient, but can also pose a security risk.
es: La opción `Hacer a este usuario administrador` le da al usuario que estas creando derechos administrativos (añadiéndolo al grupo `wheel`), permitiendo a este usuario usar el [command]#sudo# comando para realizar las tareas normalmente solo disponibles a `root` usando su propia contraseña, en vez de la de `root.` Esto puede ser mas conveniente, pero también puede ser un riesgo de seguridad.
fr: La case à cocher `Faire de cet utilisateur un administrateur` donne à l’utilisateur que vous créez des droits d’administration (en ajoutant cet utilisateur dans le groupe `wheel`), permettant à cet utilisateur d’utiliser la commande [command]#sudo# pour effectuer des tâches normalement réservées à `root` en utilisant uniquement le mot de passe de l’utilisateur, au lieu du mot de passe `root`. Cela peut être plus pratique, mais peut aussi poser un risque de sécurité.

source: If you give administrator privileges to an user, make sure that the account is protected by a strong password. Never give an user administrator privileges without requiring any password for the account.
es: Si le das a un usuario privilegios de administrador asegúrese de que la cuenta esta protegida por una contraseña fuerte. Nunca le des a un usuario privilegios de administrador sin requerir ninguna contraseña para la cuenta.
fr: Si vous donnez des privilèges d’administrateur à un utilisateur, assurez-vous que le compte est protégé par un mot de passe fort. Ne donnez jamais à un utilisateur des privilèges d’administrateur sans exiger un mot de passe pour le compte.

source: See the [citetitle]_{PRODUCT} Security Guide_, available at the link:++https://docs.fedoraproject.org/++[], for detailed information about password security including guidelines for selecting strong passwords.
es: Véase [citetitle]_{PRODUCT} Guia de Seguridad_, disponible en el link:++https://docs.fedoraproject.org/++[], para información detallada sobre seguridad de contraseñas, incluyendo guías para elegir contraseñas fuertes.
fr: Voir le [citetitle]_Guide de sécurité de {PRODUCT}_, disponible sur le lien suivant : ++https://docs.fedoraproject.org/++[], pour des informations détaillées sur la sécurité des mots de passe, ainsi que des directives pour la sélection de mots de passe forts.

source: To additional settings, click the `Advanced` button below the password input fields. A new dialog window titled `Advanced User Configuration` will open. This dialog is described in the following section.
es: Para mas ajustes, haga click en el botón `Avanzado` debajo del campo para la contraseña. Aparecerá un nuevo cuadro de dialogo con el titulo `Configuración Avanzada de Usuario`. Este dialogo se describe en la siguiente sección.
fr: Pour configurer des paramètres supplémentaires, cliquez sur le bouton `Avancé` situé sous les champs de saisie du mot de passe. Une nouvelle fenêtre de dialogue intitulée `Configuration avancée de l’utilisateur` s’ouvrira. Cette fenêtre est décrite dans la section suivante.

source: Advanced User Configuration
es: Configuración Avanzada de Usuario
fr: Configuration avancée de l’utilisateur

source: The `Advanced User Configuration` dialog allows you to change the following settings for the new user account.
es: La ventana `Configuracion Avanzada de Usuario` le permita cambiar los siguientes ajustes para la nueva cuenta de usuario.
fr: La boite de dialogue `Configuration avancée de l’utilisateur` vous permet de modifier les paramètres suivants pour le nouveau compte utilisateur.

source: Advanced settings for the new user account.
es: Ajustes avanzados para la nueva cuenta de usuario.
fr: Paramètres avancés pour le nouveau compte utilisateur.

source: The user's `Home directory` (`/home/pass:attributes[{blank}]_username_pass:attributes[{blank}]` by default).
es: El `directorio Home` del usuario (`/home/pass:attributes[{blank}]_username_pass:attributes[{blank}]`por defecto).
fr: Le dossier `Home` de l'utilisateur (`/home/pass:attributes[{blank}]_username_pass:attributes[{blank}]` par défaut).

source: The user's ID (UID). The default value is 1000. UIDs 0-999 are reserved by the system so they can not be assigned to an user.
fr: L’ID de l’utilisateur (UID). La valeur par défaut est 1000. Les UID de 0 à 999 sont réservés par le système et ne peuvent donc pas être attribués à un utilisateur.

source: The the group ID (GID) of the user's default group. The default group name will be the same as the user name, and its default GID is 1000. GIDs 0-999 are reserved by the system so they can not be assigned to an user's group.
fr: L’ID de groupe (GID) du groupe par défaut de l’utilisateur. Le nom du groupe par défaut sera le même que le nom de l’utilisateur, et son GID par défaut est 1000. Les GID de 0 à 999 sont réservés par le système et ne peuvent donc pas être attribués à un groupe d’utilisateurs.

source: The user's group membership. The user account you are creating will always have one default group membership (the user's default group with an ID set in the `Specify a group ID manually` field). In the `Group Membership` field, you can specify additional groups as a comma-separated list. Groups which do not already exist will be created; you can specify custom GIDs for them in parentheses. If you do not specify a custom GID for a new group, it will be assigned automatically.
fr: L’appartenance à un groupe de l’utilisateur. Le compte utilisateur que vous créez aura toujours une appartenance de groupe par défaut (le groupe par défaut de l’utilisateur avec un ID défini dans le champ `Spécifier un ID de groupe manuellement`). Dans le champ `Membres des groupes`, vous pouvez spécifier des groupes supplémentaires sous la forme d’une liste séparée par des virgules. Les groupes qui n’existent pas encore seront créés ; vous pouvez spécifier des GID personnalisés pour eux entre parenthèses. Si vous ne spécifiez pas de GID personnalisé pour un nouveau groupe, celui-ci sera attribué automatiquement.
