Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/_partials/install/CustomSpoke_AddPhysical.po
Languages: es

source: _Standard partitions_ are the most common type of partition, with the widest support across operating systems. For example, Microsoft Windows uses exclusively physical partitions and can not natively work with LVM or Btrfs. Most {PRODUCT} partitioning setups will also require at least one standard partition for the `/boot` directory, and possibly also another standard partition with the BIOS Boot or EFI System file system to store the boot loader.
es: _Particiones estándar_ son el tipo más común de partición, con el soporte más amplio en todos los sistemas operativos. Por ejemplo, Microsoft Windows usa exclusivamente particiones físicas y no puede trabajar nativamente con LVM o Btrfs. La mayoría de las configuraciones de particionamiento de {PRODUCT} requerirán también al menos una partición estándar para el directorio `/boot` y posiblemente también otra partición estándar con el sistema de archivos BIOS Boot o EFI System para almacenar el cargador de arranque.

source: Create Standard Partition
es: Crear Partición Estándar

source: The Manual Partitioning screen
es: La pantalla de Particionamiento Manual

source: Follow the procedure below to create mount points on standard physical partitions:
es: Siga el procedimiento de abajo para crear puntos de montaje sobre las particiones físicas:

source: Creating Standard Partitions
es: Creando Particiones Estándar

source: Click the `+` button at the bottom of the list showing existing mount points. A new dialog window will open.
es: Pulse el botón `+` en la parte inferior de la lista que muestra los puntos de montaje existentes. Se abrirá una nueva ventana de diálogo.

source: In the new dialog window, specify a mount point for which you want to create a separate mount point - for example, `/`. Optionally, specify a size for the partition using standard units such as MB or GB (for example, `50GB`). Then, click `Add mount point` to add the mount point and return to the main partitioning screen.
es: En la nueva ventana de diálogo, especifique un punto de montaje para el que desea crear un punto de montaje separado - por ejemplo, `/`. Opcionalmente, especifique un tamaño para la partición usando las unidades estándar como MB o GB (por ejemplo, `50GB`). Pulse después `Añadir puntos de montaje` para añadir el punto de montaje y volver a la pantalla principal de particionado.

source: When creating a swap partition, specify the mount point as `swap`. For a BIOS Boot partition, use `biosboot`. For an EFI System Partition, use `/boot/efi`.
es: Cuando cree una partición swap, especifique el punto de montaje como `swap`. Para una partición BIOS Boot, use `biosboot`. Para una Partición Sistema EFI, use `/boot/efi`.

source: For information about these partition types, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
es: Para información sobre estos tipos de particiones, vea xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de Particionamiento Recomendado].

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume. Select the newly created mount point in the left pane to configure it further, and convert it to a physical partition by changing the `Device Type` option to `Standard Partition`. Then, click `Update Settings` in the bottom right corner of the screen.
es: El punto de montaje ha sido creado ahora usando los ajustes predeterminados, lo que significa que ha sido creado como un volumen lógico LVM. Seleccione el punto de montaje recién creado para configurarlo más y convertirlo en una partición física cambiando la opción `Tipo de Dispositivo` a `Partición Estándar`. Después pulse `Actualizar Ajustes` en la esquina inferior derecha de la pantalla.

source: In the `Device(s)` section on the right side of the screen, you can see that the partition has been assigned to one or more hard drives. Click the `Modify` button to configure on which drive this partition will be created.
es: En la sección `Dispositivo(s)` en el lado derecho de la pantalla, puede ver que la partición ha sido asignado a uno o más discos duros. Pulse el botón `Modificar` para configurar en que disco será creada esta partición.

source: In the `Configure Mount Point` dialog, you can specify which physical devices (disks) this volume *may* reside on. You can select one or more disks which will be used to hold this volume by holding down kbd:[Ctrl] and clicking each disk in the list. If you select multiple disks here, [application]*Anaconda* will determine where exactly the partition should be created based on how you configured the rest of the installation. If you want to make sure that this partition is placed on a specific hard drive, select only that drive and unselect all others.
es: En el diálogo `Configurar Punto de Montaje`, puede especificar en que dispositivos físicos *puede* residir este volumen. Puede seleccionar uno o más discos que serán usados para coger este volumen pulsando kbd:[Ctrl] y pulsando cada disco de la lista. Si usted selecciona múltiples discos aquí, [application]*Anaconda* determinará dónde se debe crear exactamente la partición en función de como haya configurado el resto de la instalación. Si desea asegurarse de que esta partición se sitúe en un disco duro específico, seleccione solo ese disco y deseleccione los otros.

source: After you finish configuring the partition's location, click `Save` to return to the main `Manual Partitioning` screen.
es: Después de que termine de configurar la situación de la partición, pulse `Guardar` para volver a la pantalla principal `Particionado Manual`.

source: Configure other settings specific to the partition - its `Mount Point`, `Desired Capacity`, and `File System`. Press `Update Settings` to apply any changes to the configuration.
es: Configure otros ajustes específicos a la partición - su `Punto de Montaje`, `Capacidad Deseada` y `Sistema de Archivos`. Pulse `Actualizar Ajustes` para aplicar cualquier cambio a la configuración.

source: Repeat this procedure for any additional standard partitions you want to create.
es: Repita este procedimiento para cualquier partición estándar adicional que desee crear.
