Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/_partials/install/KeyboardSpoke.po
Languages: tr

source: Keyboard Layout
tr: Klavye Düzeni

source: The `Keyboard Layout` screen allows you to set up one or more keyboard layouts for your system and a way to switch between them. One keyboard layout is configured automatically based on your selection in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Welcome Screen and Language Selection], but you can change this layout and add additional ones before you begin the installation.
tr: `Klavye Düzeni` ekranı, sisteminiz için bir veya daha fazla klavye düzeni ayarlamanıza ve bunlar arasında geçiş yapmanıza olanak tanımaktadır. xref:Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Hoş Geldiniz Ekranı ve Dil Seçimi] bölümündeki seçiminize göre bir klavye düzeni otomatik olarak yapılandırılır, ancak bu düzeni değiştirebilir ve kuruluma başlamadan önce başka düzenler ekleyebilirsiniz.

source: Keyboard layouts are a separate setting from system languages, and these two settings can be mixed as you see fit.
tr: Klavye düzenleri sistem dillerinden ayrı bir ayardır ve bu iki ayarı uygun gördüğünüz şekilde karıştırabilirsiniz.

source: All settings configured in this screen will be available on the installed system, and they will also become immediately available inside the installer. You can use the keyboard icon in the top right corner of any screen, or the keyboard switch you configured in this screen, to cycle between your configured layouts.
tr: Bu ekranda yapılandırılan tüm ayarlar kurulu sistemde kullanılabilir olacak ve kurucunun içinde de hemen kullanılabilecektir. Yapılandırılmış düzenleriniz arasında geçiş yapmak için herhangi bir ekranın sağ üst köşesindeki klavye simgesini veya bu ekranda yapılandırdığınız klavye geçiş anahtarını kullanabilirsiniz.

source: The keyboard layout configuration screen
tr: Klavye düzeni yapılandırma ekranı

source: The left half of the screen contains a window listing all currently configured layouts. The order in which the layouts are displayed is important - the same order will be used when switching between layouts, and the first listed layout will be the default on your system.
tr: Ekranın sol yarısı, yapılandırılmış tüm düzenleri listeleyen bir pencere içerir. Düzenlerin görüntülenme sırası önemlidir - düzenler arasında geçiş yapılırken aynı sıra kullanılacaktır ve listelenen ilk düzen sisteminizde öntanımlı olacaktır.

source: The text field on the right side of the screen can be used to test the currently selected layout.
tr: Ekranın sağ tarafındaki metin alanı seçili olan düzeni test etmek için kullanılabilir.

source: You can click a layout in the list to highlight it. At the bottom of the list, there is a set of buttons:
tr: Listedeki bir düzeni vurgulamak için üzerine tıklayabilirsiniz. Listenin altında bir dizi düğme vardır:

source: The `+` button adds a new layout. When you press this button, a new window opens with a list of all available layouts, grouped by language. You can find a layout by browsing the list, or you can use the search bar at the bottom of this window. When you find the layout you want to add, highlight it and press `Add`.
tr: `+` düğmesi yeni bir düzen ekler. Bu düğmeye bastığınızda, dile göre gruplandırılmış kullanılabilir tüm düzenlerin listesini içeren yeni bir pencere açılır. Listeye göz atarak bir düzen bulabilirsiniz veya bu pencerenin altındaki arama çubuğunu kullanabilirsiniz. Eklemek istediğiniz düzeni bulduğunuzda vurgulayın ve `Ekle` düğmesine basın.

source: The `-` button removes the currently highlighted layout.
tr: `-` düğmesi o anda vurgulanan düzeni kaldırır.

source: The up and down buttons can be used to move the highlighted layout up or down in the list.
tr: Yukarı ve aşağı düğmeleri, vurgulanan düzeni listede yukarı veya aşağı taşımak için kullanılabilir.

source: The keyboard button opens a new window which offers a visual representation of the highlighted layout.
tr: Klavye düğmesi, vurgulanan düzenin görsel bir sunumunu gösteren yeni bir pencere açar.

source: If you use a layout that cannot accept Latin characters, such as `Russian`, you are advised to also add the `English (United States)` layout and configure a keyboard combination to switch between the two layouts. If you only select a layout without Latin characters, you may be unable to enter a valid `root` password and user credentials later in the installation process. This may prevent you from completing the installation.
tr: `Rusça` gibi Latin karakterleri kabul etmeyen bir düzen kullanıyorsanız, `İngilizce (ABD)` düzenini de eklemeniz ve iki düzen arasında geçiş yapmak için bir klavye kısayolu yapılandırmanız önerilir. Sadece Latin karakterleri olmayan bir düzen seçerseniz, kurulum işleminin ileri aşamasında geçerli bir `root` parolası ve kullanıcı kimlik bilgileri giremeyebilirsiniz. Bu, kurulumu tamamlamanızı engelleyebilir.

source: You can also optionally configure a keyboard switch which can be used to cycle between available layouts. To do so, click the `Options` button on the right side of the screen. The `Layout Switching Options` dialog will open, allowing you to configure one or more keys or key combinations for switching. Select one or more key combinations using the check boxes next to them, and click `OK` to confirm your selection.
tr: İsteğe bağlı olarak, kullanılabilir düzenler arasında geçiş yapmak için kullanılabilecek bir klavye geçiş anahtarı da yapılandırabilirsiniz. Bunu yapmak için ekranın sağ tarafındaki `Seçenekler` düğmesine tıklayın. Geçiş için bir veya daha fazla tuş veya tuş dizisi yapılandırmanıza olanak tanıyan `Düzen Geçişi Seçenekleri` iletişim penceresi açılacaktır. Yanlarındaki onay kutularını kullanarak bir veya daha fazla tuş dizisini seçin ve seçiminizi onaylamak için `Tamam` düğmesine tıklayın.

source: After you finish configuring keyboard layouts and switches, click `Done` in the top left corner to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
tr: Klavye düzenlerini ve geçiş anahtarlarını yapılandırmayı tamamladıktan sonra, xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Kurulum Özetine] dönmek için sol üst köşedeki `Bitti` düğmesine tıklayın.
