Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/_partials/install/UserSpoke.po
Languages: id

source: Create User
id: Membuat Pengguna

source: The `Create User` screen can be used to create and configure one normal (non-`root`) user account during the installation. Only one user account can be configured here; if you require more accounts, wait until the installation completes, reboot your system and then create other accounts using either the [command]#useradd# command in a terminal, or a graphical utility for managing user accounts (for example, the `Users` screen in the Settings menu in [application]*GNOME*).
id: Layar `Buat Pengguna` dapat digunakan untuk membuat dan mengonfigurasi satu akun pengguna normal (non-`root`) selama instalasi. Hanya satu akun pengguna yang dapat dikonfigurasi di sini; jika Anda memerlukan lebih banyak akun, tunggu sampai instalasi selesai, reboot sistem Anda dan kemudian buat akun lain menggunakan perintah [command]#useradd# di terminal, atau utilitas grafis untuk mengelola akun pengguna (misalnya, layar `Pengguna` di menu Pengaturan di [application]*GNOME*).

source: Creating a normal user account is not required to finish the installation; however, it is highly recommended. If you do not create one, you will have to log in to the system as `root` directly, which is *not* recommended.
id: Membuat akun pengguna normal tidak diperlukan untuk menyelesaikan instalasi; namun, sangat disarankan. Jika Anda tidak membuatnya, Anda harus masuk ke sistem sebagai `root` secara langsung, yang *tidak* disarankan.

source: The Create screen. Use the text input fields to create a user account and configure its settings.
id: Layar Pembuatan. Gunakan ruas masukan teks untuk membuat suatu akun pengguna dan mengonfigurasi pengaturannya.

source: To configure a user account, fill out the `Full name` (for example, `John Smith`) and `Username` (for example, `jsmith`). The `username` will used to log in from a command line; if you install a graphical environment, then your graphical login manager will use `Full name`.
id: Untuk mengkonfigurasi akun pengguna, isi `Nama lengkap` (misalnya, `John Smith`) dan `Nama pengguna` (misalnya,` jsmith`). `nama pengguna` akan digunakan untuk login dari baris perintah; jika Anda menginstal lingkungan grafis, maka manajer login grafis Anda akan menggunakan `Nama lengkap`.

source: Make sure that the `Require a password to use this account` check box is enabled, enter a password you want to use for this account into the `Password` field. The characters you write will be displayed as dots for security. Then, repeat the same password in the `Confirm password` field below to ensure you entered it properly. Both entered passwords must be the same.
id: Pastikan bahwa kotak centang `Memerlukan kata sandi untuk menggunakan akun ini` diaktifkan, masukkan kata sandi yang ingin Anda gunakan untuk akun ini ke dalam ruas `Kata Sandi`. Karakter yang Anda tulis akan ditampilkan sebagai titik untuk keamanan. Kemudian, ulangi kata sandi yang sama di bidang `Konfirmasi kata sandi` di bawah untuk memastikan Anda memasukkannya dengan benar. Kedua kata sandi yang dimasukkan harus sama.

source: As you enter the password, it will be evaluated and the installer will determine the password's strength. If the installer considers your password weak, a message will appear at the bottom of the screen, explaining which aspect of your chosen password is considered insuficient. For example:
id: Ketika Anda memasukkan kata sandi, itu akan dievaluasi dan penginstal akan menentukan kekuatan kata sandi. Jika pemasang menganggap kata sandi Anda lemah, sebuah pesan akan muncul di bagian bawah layar, menjelaskan aspek kata sandi pilihan Anda yang dianggap tidak cukup. Sebagai contoh:

source: `The password you have provided is weak:` `The password is shorter than 5 characters.`
id: `Kata sandi yang Anda berikan lemah:` `Kata sandi kurang dari 5 karakter.`

source: If a message similar to the above appears, it is highly recommended to choose a different, stronger password.
id: Jika pesan yang mirip dengan di atas muncul, sangat disarankan untuk memilih kata sandi yang berbeda dan lebih kuat.

source: The `Make this user administrator` check box gives the user you are creatng administrative rights (by adding this user into the `wheel` group), allowing this user to use the [command]#sudo# command to perform tasks normally only available to `root` using only the user password, instead of the `root` password. This may be more convenient, but can also pose a security risk.
id: Kotak centang `Jadikan pengguna ini administrator` memberi pengguna yang Anda buat hak administratif (dengan menambahkan pengguna ini ke grup `wheel`), memungkinkan pengguna ini untuk menggunakan perintah [command]#sudo# untuk melakukan tugas yang biasanya hanya tersedia untuk `root` hanya menggunakan kata sandi pengguna, bukan kata sandi `root`. Ini mungkin lebih nyaman, tetapi juga dapat menimbulkan risiko keamanan.

source: If you give administrator privileges to an user, make sure that the account is protected by a strong password. Never give an user administrator privileges without requiring any password for the account.
id: Jika Anda memberikan hak administrator kepada pengguna, pastikan akun dilindungi oleh kata sandi yang kuat. Jangan pernah memberikan hak istimewa administrator pengguna tanpa memerlukan kata sandi apa pun untuk akun tersebut.

source: To additional settings, click the `Advanced` button below the password input fields. A new dialog window titled `Advanced User Configuration` will open. This dialog is described in the following section.
id: Untuk pengaturan tambahan, klik tombol `Tingkat Lanjut` di bawah ruas masukan kata sandi. Jendela dialog baru berjudul `Konfigurasi Pengguna Lanjutan` akan terbuka. Dialog ini dijelaskan di bagian berikut.

source: The `Advanced User Configuration` dialog allows you to change the following settings for the new user account.
id: Dialog `Konfigurasi Pengguna Lanjutan` memungkinkan Anda mengubah pengaturan-pengaturan berikut untuk akun pengguna baru.

source: Advanced User Configuration
id: Konfigurasi Pengguna Lanjutan

source: Advanced settings for the new user account.
id: Pengaturan lanjutan bagi akun pengguna baru.

source: The user's `Home directory` (`/home/pass:attributes[{blank}]_username_pass:attributes[{blank}]` by default).
id: `Directori rumah` pengguna (nilai baku `/home/pass:attributes[{blank}]_username_pass:attributes[{blank}]`).

source: The user's ID (UID). The default value is 1000. UIDs 0-999 are reserved by the system so they can not be assigned to an user.
id: ID pengguna (UID). Nilai baku adalah 1000. UID 0-999 dicadangkan oleh sistem sehingga mereka tidak dapat diberikan ke suatu pengguna.

source: The the group ID (GID) of the user's default group. The default group name will be the same as the user name, and its default GID is 1000. GIDs 0-999 are reserved by the system so they can not be assigned to an user's group.
id: ID grup (GID) dari grup baku pengguna. Nama grup baku akan sama dengan nama pengguna, dan GID bakunya adalah 1000. GID 0-999 dicadangkan oleh sistem sehingga mereka tidak dapat diberikan ke grup pengguna.

source: The user's group membership. The user account you are creating will always have one default group membership (the user's default group with an ID set in the `Specify a group ID manually` field). In the `Group Membership` field, you can specify additional groups as a comma-separated list. Groups which do not already exist will be created; you can specify custom GIDs for them in parentheses. If you do not specify a custom GID for a new group, it will be assigned automatically.
id: Keanggotaan grup pengguna. Akun pengguna yang Anda buat akan selalu memiliki satu keanggotaan grup baku (grup baku pengguna dengan ID yang ditetapkan di ruas `Tentukan ID grup secara manual`). Dalam ruas `Keanggotaan Grup`, Anda dapat menentukan grup tambahan sebagai daftar yang dipisahkan koma. Grup yang belum ada akan dibuat; Anda dapat menentukan GID khusus untuk mereka dalam tanda kurung. Jika Anda tidak menentukan GID khusus untuk grup baru, itu akan ditetapkan secara otomatis.
