Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/Downloading_Fedora.po
Languages: tr

source: Downloading Fedora
tr: Fedora'yı İndirme

source: Fedora Editions
tr: Fedora Sürümleri

source: Fedora provides three primary Editions tailored for some specific use cases. link:++https://getfedora.org++[] offers Fedora Cloud for scalable infrastructure, Fedora Server for organizational infrastructure, and Fedora Workstation for the developer and desktop user.
tr: Fedora, belirli kullanım durumları için uyarlanmış üç ana sürüm sağlamaktadır. link:++https://getfedora.org++[] adresinde ölçeklendirilebilir altyapılar için Fedora Cloud, kurumsal altyapılar için Fedora Server ve geliştiriciler ve masaüstü kullanıcıları için Fedora Workstation sürümleri sunulmaktadır.

source: For alternative desktop environments or media built for more niche purposes, check out link:++https://spins.fedoraproject.org++[Fedora Spins].
tr: Alternatif masaüstü ortamları veya daha özel amaçlar için oluşturulmuş ortamlar için link:++https://spins.fedoraproject.org++[Fedora Spinlerine] göz atın.

source: Each of these downloads provides a different set of default packages, but you can add to your system after the initial installation to customize it for your needs. The installation process is the same for all spins and Editions, so you can use this guide for any choice you make.
tr: Bu indirmelerin her biri farklı bir dizi öntanımlı paket sağlamaktadır, ancak ilk kurulumdan sonra sisteminizi ihtiyaçlarınıza göre özelleştirmek için eklemeler yapabilirsiniz. Kurulum işlemi tüm spinler ve sürümler için aynıdır, bu nedenle bu kılavuzu yaptığınız herhangi bir seçim için kullanabilirsiniz.

source: Which Architecture Is My Computer?
tr: Bilgisayarım Hangi Mimariye Sahip?

source: Most modern systems are 64{nbsp}bit x86 architecture. If your computer was manufactured after 2007, or you aren't sure, you probably have a `x86_64` system.
tr: Modern sistemlerin çoğu 64{nbsp}bit x86 mimarisine sahiptir. Bilgisayarınız 2007'den sonra üretildiyse, veya emin değilseniz, muhtemelen bir `x86_64` sisteminiz vardır.

source: Changing a Fedora installation from one architecture to another is not supported. Use the following table to determine the architecture of your computer according to the type of processor. Consult your manufacturer's documentation for details on your processor, or resources such as link:++http://ark.intel.com/++[] or link:++http://products.amd.com/++[], if necessary.
tr: Fedora kurulumunun bir mimariden diğerine değiştirilmesi desteklenmemektedir. Bilgisayarınızın mimarisini işlemci türüne göre belirlemek için aşağıdaki tabloyu kullanın. Gerekirse, işlemcinizle ilgili ayrıntılar için üreticinizin belgelerine, veya link:++https://ark.intel.com/++[] ya da link:++https://products.amd.com/++[] gibi kaynaklara başvurun.

source: Processor and architecture types
tr: İşlemci ve mimari türleri

source: |Processor manufacturer and model|Architecture type for Fedora |some Intel Atom, Core series, Pentium 4, and recent vintage Xeon; AMD Athlon, Duron, some Semprons; and older; VIA C3, C7|`i386` |some Intel Atom, Core 2 series, Core i series and Xeon; AMD: Athlon 64, Athlon II, Sempron64, Phenom series, Fusion series, Bulldozer series and Opteron; Apple MacBook, MacBook Pro, and MacBook Air|`x86_64`
tr: |İşlemci üreticisi ve modeli|Fedora için mimari türü |bazı Intel Atom, Core serisi, Pentium 4, ve yakın dönem eski Xeon; AMD Athlon, Duron, bazı Sempronlar; ve öncesi; VIA C3, C7|`i386` |bazı Intel Atom, Core 2 serisi, Core i serisi ve Xeon; AMD: Athlon 64, Athlon II, Sempron64, Phenom serisi, Fusion serisi, Bulldozer serisi ve Opteron; Apple MacBook, MacBook Pro, ve MacBook Air|`x86_64`

source: Media Types
tr: Ortam Türleri

source: Several media types are available. Choose the one that best suits your requirements.
tr: Kullanılabilir çeşitli ortam türleri bulunmaktadır. Gereksinimlerinize en uygun olanı seçin.

source: Live Image
tr: Canlı (Live) Kalıp

source: Live images allow you to preview Fedora before installing it. Instead of booting directly into the installer, a live image loads the same environment you'll get after installation. Fedora Workstation and Fedora Spins are live images.
tr: Canlı kalıplar, kurulumdan önce Fedora'yı ön izlemenize olanak tanımaktadır. Canlı bir kalıp, doğrudan kurucuyu önyüklemek yerine kurulumdan sonra alacağınız ortamın aynısını başlatır. Fedora Workstation ve Fedora Spinleri canlı kalıplardır.

source: Use a live image to install your favorite system, test Fedora on new hardware, troubleshoot, or share with friends.
tr: En sevdiğiniz sistemi kurmak, Fedora'yı yeni bir donanımda test etmek, sorun gidermek veya arkadaşlarınızla paylaşmak için canlı bir kalıp kullanın.

source: DVD Image
tr: DVD Kalıbı

source: DVD images boot directly into the installation enviroment, and allow you to choose from a variety of packages that are provided with it. In Fedora 21, the DVD option is only available in the *Fedora Server* Edition.
tr: DVD kalıpları doğrudan kurulum ortamına önyükleme yapar ve içerisinde bulunan çeşitli paketler arasından seçim yapmanızı sağlar. Fedora 21'de DVD seçeneği sadece *Fedora Server* sürümünde bulunmaktadır.

source: Use the Fedora Server DVD image when you want customized Fedora Server installations using an offline installation source.
tr: Çevrim dışı bir kurulum kaynağı kullanarak özelleştirilmiş Fedora Server kurulumları yapmak istediğinizde Fedora Server DVD kalıbını kullanın.

source: netinstall Image
tr: Ağ Üzerinden Kurulum Kalıbı

source: The netinstall image boots directly into the installation environment, and uses the online Fedora package repositories as the installation source. With a netinstall image, you can select a wide variety of packages to create a customized installation of Fedora.
tr: Ağ üzerinden kurulum kalıbı doğrudan kurulum ortamına önyükleme yapar ve kurulum kaynağı olarak çevrim içi Fedora paket depolarını kullanır. Ağ üzerinden kurulum kalıbı ile, özelleştirilmiş bir Fedora kurulumu oluşturmak için çok çeşitli paketler seçebilirsiniz.

source: The Fedora Server netinstall image is a universal one, and can be used to install any Fedora Edition or your own set of favorite packages.
tr: Fedora Server ağ üzerinden kurulum kalıbı genel bir kalıptır ve herhangi bir Fedora sürümünü veya kendi favori paket setinizi kurmak için kullanılabilir.

source: ARM images
tr: ARM Kalıpları

source: For many ARM systems, Fedora provides preconfigured filesystem images. Write the image to removable media and boot directly into a Fedora installation that's ready to use.
tr: Fedora, birçok ARM sistemi için önceden yapılandırılmış dosya sistemi kalıpları sağlamaktadır. Kalıpları çıkarılabilir bir ortama yazın ve doğrudan kullanıma hazır bir Fedora kurulumuna önyükleme yapın.

source: ARM devices often require special setup procedures that aren't covered in this guide. Start learning about Fedora ARM at link:++https://fedoraproject.org/wiki/Architectures/ARM++[]
tr: ARM tabanlı aygıtlar genellikle bu kılavuzda yer almayan özel kurulum prosedürleri gerektirmektedir. link:++https://fedoraproject.org/wiki/Architectures/ARM++[] adresinde Fedora ARM hakkında bilgi edinmeye başlayın.

source: Cloud Images
tr: Bulut Kalıpları

source: Fedora Cloud images are preconfigured filesystem images with very few packages installed by default. They include special tools for interacting with cloud platforms, and are not intended to be used outside of cloud environments.
tr: Fedora Cloud kalıpları, öntanımlı olarak çok az paket kurulu olan, önceden yapılandırılmış dosya sistemi kalıplarıdır. Bulut platformlarıyla etkileşime geçmek için özel araçlar içerirler ve bulut ortamlarının dışında kullanılması amaçlanmamıştır.

source: Fedora Cloud comes in several varieties. The Fedora Cloud Base image is a minimal base for cloud deployments. The Fedora Cloud Atomic image is a Docker container host that uses link:++http://www.projectatomic.io/++[Project Atomic] technology for updates. A Docker base image for Fedora is also available.
tr: Fedora Cloud çeşitli şekillerde gelmektedir. Fedora Cloud Base kalıbı, bulut dağıtımları için küçük bir temel kalıptır. Fedora Cloud Atomic kalıbı, güncellemeler için link:++https://www.projectatomic.io/++[Project Atomic] teknolojisini kullanan bir Docker konteyner ana makinesidir. Fedora için bir Docker temel kalıbı da bulunmaktadır.

source: Cloud images are preconfigured and do not require installation as described in this guide. Get started using Fedora Cloud at link:++http://fedoraproject.org/wiki/Cloud++[]
tr: Bulut kalıpları önceden yapılandırılmıştır ve bu kılavuzda açıklandığı gibi kurulum gerektirmez. link:++https://fedoraproject.org/wiki/Cloud++[] adresinde Fedora Cloud kullanmaya başlayın.

source: Boot Images
tr: Önyükleme Kalıpları

source: The tiny images at link:++https://boot.fedoraproject.org/++[] are written to CDs, USB drives, or even floppy disks. The BFO image loads installation media from Fedora's servers and directly loads an installation environment, like the netinstall ISO.
tr: link:++https://boot.fedoraproject.org/++[] adresindeki küçük kalıplar CD'lere, USB belleklere, hatta disketlere bile yazılırlar. BFO kalıbı kurulum ortamını Fedora'nın sunucularından yükler ve ağ üzerinden kurulum ISO kalıbı gibi doğrudan kurulum ortamını başlatır.

source: BFO images work like PXE deployments, without having to set up a server.
tr: BFO kalıpları, bir sunucu kurmak zorunda kalmadığınız PXE dağıtımları gibi çalışmaktadır.
