Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/Introduction.po
Languages: es

source: Introduction
es: Introducción

source: This guide covers installation of Fedora, a Linux distribution built on free and open source software. This manual helps you install Fedora on desktops, laptops, and servers. The installation system is easy to use even if you lack previous knowledge of Linux or computer networks. If you select default options, Fedora provides a complete desktop operating system, including productivity applications, Internet utilities, and desktop tools.
es: Esta guía cubre la instalación de Fedora, una distribución de Linux basada en software de código abierto y gratuito. Este manual le ayudada a instalar Fedora en sobremesas, portátiles y servidores. El sistema de instalación es fácil de usar aunque usted carezca de conocimientos previos de Linux o de redes de ordenadores. Si selecciona las opciones predeterminadas, Fedora suministra un sistema operativo completo, incluyendo aplicaciones de productividad, utilidades de Internet y herramientas de escritorio.

source: This document details the full range of installation options, including those that apply only in limited or unusual circumstances. Understanding of all topics described in this document is not necessary to successfully perform the installation in most cases.
es: Este documento detalla un amplio rango de opciones de instalación, incluyendo aquellas que aplican en circunstancias limitadas o inusuales. Entender todos los puntos que se describen en este documento no es necesario para llevar a cabo con éxito la instalación en la mayoría de los casos.

source: Background
es: Segundo plano

source: About Fedora
es: Acerca de Fedora

source: Getting Additional Help
es: Obtener Ayuda Adicional

source: If you encounter any problems which are not described in documentation, you might get help from members of the community - developers, users, and others. There are many ways to get help: the Ask Fedora website, mailing lists, forums, or IRC. For a summary of available resources, see the link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Communicating and Getting Help] page on the {PRODUCT} wiki.
es: Si encuentra cualquier problema que no se describe en la documentación, puede obtener ayuda de miembros de la comunidad - desarrolladores, usuarios y otros. Hay muchas maneras de obtener ayuda: el sitio web Ask Fedora, listas de correo, foros o IRC. Para un resumen de los recursos disponibles, vea la página link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Comunicando y Obteniendo Ayuda] en la wiki {PRODUCT}.

source: About This Document
es: Sobre Este Documento

source: Goals
es: Metas

source: This guide helps a reader:
es: Esta guía ayuda a un lector a:

source: Understand how to locate the {PRODUCT} distribution online
es: Entender como localizar la distribución en línea de {PRODUCT}
