Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/_partials/Legal_Notice.po
Languages: tr

source: Copyright {YEAR} {HOLDER}.
tr: Telif Hakkı {YEAR} {HOLDER}.

source: The text of and illustrations in this document are licensed by Red Hat under a Creative Commons Attribution–Share Alike 3.0 Unported license ("CC-BY-SA"). An explanation of CC-BY-SA is available at link:++http://creativecommons.org/licenses/by-sa/3.0/++[]. The original authors of this document, and Red Hat, designate the Fedora Project as the "Attribution Party" for purposes of CC-BY-SA. In accordance with CC-BY-SA, if you distribute this document or an adaptation of it, you must provide the URL for the original version.
tr: Bu belgedeki metin ve resimler Red Hat tarafından Creative Commons Atıf-AynıLisanslaPaylaş 3.0 Unported lisansı ile lisanslanmıştır ("CC-BY-SA"). CC-BY-SA'nın bir açıklaması link:++https://creativecommons.org/licenses/by-sa/3.0/++[] adresinde bulunabilir. Bu belgenin orijinal yazarları ve Red Hat, Fedora Projesini CC-BY-SA amaçları için "Atıfta Bulunulacak Taraf" olarak atamaktadır. CC-BY-SA uyarınca, bu belgenin kendisini veya bir uyarlamasını dağıtırsanız, orijinal sürümün URL'sini sağlamanız gerekmektedir.

source: Red Hat, as the licensor of this document, waives the right to enforce, and agrees not to assert, Section 4d of CC-BY-SA to the fullest extent permitted by applicable law.
tr: Red Hat, bu belgenin lisans sahibi olarak, CC-BY-SA Bölüm 4d'yi yürürlükteki yasaların izin verdiği ölçüde uygulama hakkından feragat eder ve iddia etmemeyi kabul eder.

source: Red Hat, Red Hat Enterprise Linux, the Shadowman logo, JBoss, MetaMatrix, Fedora, the Infinity Logo, and RHCE are trademarks of Red Hat, Inc., registered in the United States and other countries.
tr: Red Hat, Red Hat Enterprise Linux, Shadowman logosu, JBoss, MetaMatrix, Fedora, Infinity Logosu ve RHCE; Red Hat, Inc. şirketinin ABD ve diğer ülkelerdeki tescilli ticari markalarıdır.

source: For guidelines on the permitted uses of the Fedora trademarks, refer to link:++https://fedoraproject.org/wiki/Legal:Trademark_guidelines++[].
tr: Fedora ticari markalarının izin verilen kullanımlarıyla ilgili yönergeler için link:++https://fedoraproject.org/wiki/Legal:Trademark_guidelines++[] adresine bakın.

source: *Linux* (R) is the registered trademark of Linus Torvalds in the United States and other countries.
tr: *Linux* (R), Linus Torvalds'ın ABD ve diğer ülkelerdeki tescilli ticari markasıdır.

source: *Java* (R) is a registered trademark of Oracle and/or its affiliates.
tr: *Java* (R), Oracle ve/veya bağlı şirketlerinin tescilli ticari markasıdır.

source: *XFS* (R) is a trademark of Silicon Graphics International Corp. or its subsidiaries in the United States and/or other countries.
tr: *XFS* (R), Silicon Graphics International Corp. veya yan kuruluşlarının ABD ve/veya diğer ülkelerdeki ticari markasıdır.

source: *MySQL* (R) is a registered trademark of MySQL AB in the United States, the European Union and other countries.
tr: *MySQL* (R), MySQL AB'nin ABD, Avrupa Birliği ve diğer ülkelerdeki tescilli ticari markasıdır.

source: All other trademarks are the property of their respective owners.
tr: Diğer tüm ticari markalar ilgili sahiplerinin mülkiyetindedir.
