Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f29/pages/_partials/Feedback.po
Languages: cs, fi, tr

source: We want feedback
cs: Váš názor nás zajímá
fi: Haluamme palautetta
tr: Geri bildirim istiyoruz

source: indexterm:[feedback,contact information for this manual] If you find errors or have suggestions for improvement, we want your advice. Open an issue at {BZURL}.
cs: indexterm:[zpětná vazba,kontaktní informace pro příručku] Naleznete-li chyby nebo máte-li nápad na vylepšení, vaše rada nás zajímá. Otevřete hlášení o problému v {BZURL}.
fi: indexterm:[palaute, tämän oppaan yhteystiedot] Jos löydät virheitä tai sinulla on parannusehdotuksia, pyydämme neuvojasi. Tee asiasta huomio osoitteessa {BZURL}.
tr: indexterm:[bu kılavuz için geri bildirim, iletişim bilgileri] Herhangi bir hata bulursanız veya iyileştirme önerileriniz varsa, tavsiyelerinizi bekliyoruz. {BZURL} adresinde bir bilet açın.

source: In the issue:
cs: V hlášení:
fi: Huomiossa:
tr: Bilette:

source: Provide a short summary of the error or your suggestion in the `Issue Title` field.
cs: Poskytněte krátké shrnutí chyby nebo vašeho návrhu v poli `Issue Title`.
fi: Anna lyhyt yhteenveto virheestä tai ehdotuksesi "Issue Title" -kenttään.
tr: `Issue Title` alanında hatanın kısa bir özetini veya önerinizi belirtin.

source: Copy the following template into the `Comment` field and give us the details of the error or suggestion as specifically as you can. If possible, include some surrounding text so we know where the error occurs or the suggestion fits.
cs: Zkopírujte následující šablonu do pole `Comment` a poskytněte nám podrobnosti o chybě nebo návrhu co nejkonkrétněji dokážete. Je-li to možné, přidejte i okolní text, abychom poznali, kde se chyba nachází nebo kam umístit váš návrh.
fi: Kopioi seuraava malli `Comment`-kenttään ja anna meille virheen tai ehdotuksen tiedot mahdollisimman tarkasti. Jos mahdollista, sisällytä ympäröivää tekstiä ennen ja jälkeen, jotta ymmärrämme, missä virhe tapahtuu tai mihin ehdotus liittyy.
tr: Aşağıdaki şablonu `Comment` alanına kopyalayın ve hata veya öneri hakkında bize mümkün olduğunca fazla ayrıntı verin. Mümkünse, hatanın nerede olduğunu veya öneriyi nereye ekleyeceğimizi bilmemiz için açıklayıcı metin ekleyin.

source: Document URL:
cs: URL dokumentu:
fi: Asiakirjan URL-osoite:
tr: Belge URL'si (Document URL):

source: Section name:
cs: Název kapitoly:
fi: Kappaleen nimi:
tr: Bölüm adı (Section name):

source: Error or suggestion:
cs: Chyba nebo návrh:
fi: Virhe tai ehdotus:
tr: Hata veya öneri (Error or suggestion):

source: Additional information:
cs: Další informace:
fi: Lisätiedot:
tr: Ek bilgiler (Additional information):

source: Click the btn:[Create Issue] button.
cs: Klepněte na tlačítko btn:[Create Issue].
fi: Napsauta btn:[Create Issue] -painiketta.
tr: btn:[Create Issue] düğmesine tıklayın.
