Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/nav.po
Languages: id

source: xref:index.adoc[Installation Guide]
id: xref:index.adoc[Panduan Instalasi]

source: xref:Preface.adoc[Preface]
id: xref:Preface.adoc[Pengantar]

source: xref:Introduction.adoc[Introduction]
id: xref:Introduction.adoc[Introduksi]

source: xref:Downloading_Fedora.adoc[Downloading Fedora]
id: xref:Downloading_Fedora.adoc[Mengunduh Fedora]

source: Installing Fedora
id: Memasang Fedora

source: xref:install/Preparing_for_Installation.adoc[Preparing for Installation]
id: xref:install/Preparing_for_Installation.adoc[Mempersiapkan Instalasi]

source: xref:install/Booting_the_Installation.adoc[Booting the Installation]
id: xref:install/Booting_the_Installation.adoc[Mem-boot Instalasi]

source: xref:install/Installing_Using_Anaconda.adoc[Installing Using Anaconda]
id: xref:install/Installing_Using_Anaconda.adoc[Instalasi Memakai Anaconda]

source: xref:install/After_Installation.adoc[After the Installation]
id: xref:install/After_Installation.adoc[Setelah Instalasi]

source: xref:install/Troubleshooting.adoc[Troubleshooting]
id: xref:install/Troubleshooting.adoc[Pemecahan Masalah]

source: Advanced Installation Options
id: Opsi Instalasi Tingkat Lanjut

source: xref:advanced/Boot_Options.adoc[Boot Options]
id: xref:advanced/Boot_Options.adoc[Opsi Boot]

source: xref:advanced/Kickstart_Installations.adoc[Automating the Installation with Kickstart]
id: xref:advanced/Kickstart_Installations.adoc[Mengotomatisasi Instalasi dengan Kickstart]

source: xref:advanced/Network_based_Installations.adoc[Setting Up an Installation Server]
id: xref:advanced/Network_based_Installations.adoc[Menyiapkan sebuah Server Instalasi]

source: xref:advanced/VNC_Installations.adoc[Installing Using VNC]
id: xref:advanced/VNC_Installations.adoc[Instalasi Memakai VNC]

source: xref:advanced/Upgrading_Your_Current_System.adoc[Upgrading Your Current System]
id: xref:advanced/Upgrading_Your_Current_System.adoc[Meningkatkan Sistem Anda Saat Ini]

source: Technical Appendixes
id: Lampiran Teknis

source: xref:appendixes/Kickstart_Syntax_Reference.adoc[Kickstart Syntax Reference]
id: xref:appendixes/Kickstart_Syntax_Reference.adoc[Referensi Sintaks Kickstart]

source: xref:appendixes/Disk_Partitions.adoc[An Introduction to Disk Partitions]
id: xref:appendixes/Disk_Partitions.adoc[Pengenalan ke Partisi Disk]

source: xref:appendixes/Understanding_LVM.adoc[Understanding LVM]
id: xref:appendixes/Understanding_LVM.adoc[Memahami LVM]

source: xref:Revision_History.adoc[Revision History]
id: xref:Revision_History.adoc[Riwayat Revisi]
