Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/_partials/install/CustomSpoke_FileSystems.po
Languages: pt_br

source: {PRODUCT} supports multiple types of devices and file systems. The lists below offer a short description of each available device, file system and RAID type and notes on their usage.
pt_br: {PRODUCT} tem suporte a vários tipos de dispositivos e sistemas de arquivos. As listas abaixo oferecem uma breve descrição de cada tipo de dispositivo, sistema de arquivos e RAID disponível e notas sobre seu uso.

source: To select a device type or a file system of a partition or a logical volume, select it in the list in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Manual Partitioning] and select a `Device Type` and a `File System` from their respective drop-down menus on the right side of the screen. Then, click `Update Settings` and repeat this process for all mount points you want to modify.
pt_br: Para selecionar um tipo de dispositivo ou sistema de arquivo de uma partição ou volume lógico, selecione-o na lista em xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Particionamento Manual] e selecione um `Tipo de Dispositivo` e um `Sistema de Arquivos` de seus respectivos menus suspensos no lado direito da tela. Em seguida, clique em `Atualizar Configurações` e repita este processo para todos os pontos de montagem que deseja modificar.

source: To configure software RAID, make sure that you have enough physical hard drives selected as installation targets (the number of separate drives required for each type of RAID is noted in its description). Then, choose a RAID level when creating or modifying a Btrfs volume or LVM volume group, or select `Software RAID` as the device type to create software RAID with standard partitions. For detailed instructions, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Creating a Btrfs Layout], xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Creating a Logical Volume Managament (LVM) Layout], and xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-swraid[Creating Software RAID] as needed.
pt_br: Para configurar o RAID por software, certifique-se de ter unidades de disco rígido físicas suficientes selecionadas como alvos de instalação (o número de unidades separadas necessárias para cada tipo de RAID é anotado em sua descrição). Em seguida, escolha um nível de RAID ao criar ou modificar um volume Btrfs ou grupo de volume LVM, ou selecione `RAID por software` como o tipo de dispositivo para criar RAID por software com partições padrão. Para obter instruções detalhadas, consulte xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Criando um layout Btrfs], xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Criando um layout de Gerenciamento de Volume Lógico (LVM)] e xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-swraid[Criando RAID por Software] conforme necessário.

source: Device Types
pt_br: Tipos de Dispositivo

source: `LVM Thin Provisioning` - Using thin provisioning, you can manage a storage pool of free space, known as a _thin pool_, which can be allocated to an arbitrary number of devices when needed by applications. The thin pool can be expanded dynamically when needed for cost-effective allocation of storage space.
pt_br: `Provisionamento LVM Fino` - Usando o provisionamento dinâmico, você pode gerenciar um pool de armazenamento de espaço livre, conhecido como _conjunto fino_, que pode ser alocado a um número arbitrário de dispositivos quando necessário pelos aplicativos. O pool fino pode ser expandido dinamicamente quando necessário para alocação econômica de espaço de armazenamento.

source: `RAID` - Creating two or more software RAID partitions allows you to create a software RAID device. One RAID partition is assigned to each disk on the system. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-swraid[Creating Software RAID] for instructions on creating software RAID.
pt_br: `RAID` - A criação de duas ou mais partições de RAID de software permite que você crie um dispositivo de RAID por software. Uma partição RAID é atribuída a cada disco do sistema. Veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-swraid[Criando RAID por Software] para obter instruções sobre como criar RAID por software.

source: `BTRFS` - Btrfs is a file system with several device-like features. It is capable of addressing and managing more files, larger files, and larger volumes than the ext2, ext3, and ext4 file systems. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Creating a Btrfs Layout] for more information about creating Btrfs volumes.
pt_br: `BTRFS` - Btrfs é um sistema de arquivos com vários recursos semelhantes a dispositivos. Ele é capaz de endereçar e gerenciar mais arquivos, arquivos maiores e volumes maiores do que os sistemas de arquivos ext2, ext3 e ext4. Veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Criando um Layout Btrfs] para mais informações sobre a criação de volumes Btrfs.

source: File Systems
pt_br: Sistema de Arquivos

source: `ext4` - The ext4 file system is based on the ext3 file system and features a number of improvements. These include support for larger file systems and larger files, faster and more efficient allocation of disk space, no limit on the number of subdirectories within a directory, faster file system checking, and more robust journaling. Ext4 is the default and recommended file system used by {PRODUCT} Workstation and Cloud. The maximum supported size of a single ext4 file system is 50 TB.
pt_br: `ext4` - O sistema de arquivos ext4 é baseado no sistema de arquivos ext3 e apresenta uma série de melhorias. Isso inclui suporte para sistemas de arquivos maiores e arquivos maiores, alocação mais rápida e eficiente de espaço em disco, sem limite no número de subdiretórios em um diretório, verificação mais rápida do sistema de arquivos e registro de diário mais robusto. Ext4 é o sistema de arquivos padrão e recomendado usado pela estação de trabalho e nuvem do {PRODUCT}. O tamanho máximo suportado de um único sistema de arquivo ext4 é 50 TB.

source: `ext3` - The ext3 file system is based on the ext2 file system and has one main advantage - journaling. Using a journaling file system reduces time spent recovering a file system after a crash, as there is no need to check the file system for metadata consistency by running the [command]#fsck# utility every time a crash occurs.
pt_br: `ext3` - O sistema de arquivos ext3 é baseado no sistema de arquivos ext2 e tem uma vantagem principal - journaling. O uso de um sistema de arquivos com journaling reduz o tempo gasto na recuperação de um sistema de arquivos após um travamento, pois não há necessidade de verificar a consistência dos metadados do sistema de arquivos executando o utilitário [command]#fsck# toda vez que ocorre um travamento.

source: `ext2` - An ext2 file system supports standard Unix file types, including regular files, directories, or symbolic links. It provides the ability to assign long file names, up to 255 characters.
pt_br: `ext2` - Um sistema de arquivo ext2 oferece suporte a tipos de arquivo Unix padrão, incluindo arquivos regulares, diretórios ou links simbólicos. Ele fornece a capacidade de atribuir nomes de arquivo longos, de até 255 caracteres.

source: `swap` - Swap partitions are used to support virtual memory. In other words, data is written to a swap partition when there is not enough RAM to store the data your system is processing. A swap partition should always be created; see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for details such as the recommended size.
pt_br: `swap` - As partições de troca são usadas para oferecer suporte à memória virtual. Em outras palavras, os dados são gravados em uma partição swap quando não há RAM suficiente para armazenar os dados que seu sistema está processando. Uma partição swap deve sempre ser criada; veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de Particionamento Recomendado] para detalhes como o tamanho recomendado.

source: `xfs` - XFS is a highly scalable, high-performance file system that supports file systems up to 16 exabytes (approximately 16 million terabytes), files up to 8 exabytes (approximately 8 million terabytes), and directory structures containing tens of millions of entries. XFS also supports metadata journaling, which facilitates quicker crash recovery. The maximum supported size of a single XFS file system is 500 TB. Starting with {PRODUCT}{nbsp}22, XFS is the default and recommended file system on {PRODUCT} Server.
pt_br: `xfs` - O XFS é um sistema de arquivos altamente escalonável e de alto desempenho que oferece suporte a sistemas de arquivos de até 16 exabytes (aproximadamente 16 milhões de terabytes), arquivos de até 8 exabytes (aproximadamente 8 milhões de terabytes) e estruturas de diretório contendo dezenas de milhões de entradas. O XFS também oferece suporte a registro de metadados, o que facilita a recuperação de falhas mais rápida. O tamanho máximo suportado de um único sistema de arquivos XFS é 500 TB. Começando com {PRODUCT}{nbsp}22, XFS é o sistema de arquivos padrão e recomendado no {PRODUCT} Server.

source: Note that the size of an XFS file system can not currently be reduced without destroying and recreating the file system. If you expect that you will need to adjust the sizes of your file systems often, using XFS is not recommended, as it makes administration substantially more time-consuming.
pt_br: Observe que o tamanho de um sistema de arquivos XFS não pode ser reduzido atualmente sem destruir e recriar o sistema de arquivos. Se você espera que precise ajustar os tamanhos de seus sistemas de arquivos com frequência, o uso do XFS não é recomendado, pois torna a administração substancialmente mais demorada.

source: `vfat` - The VFAT file system is a Linux file system that is compatible with Microsoft Windows long file names on the FAT file system.
pt_br: `vfat` - O sistema de arquivos VFAT é um sistema de arquivos Linux compatível com os nomes de arquivo longos do Microsoft Windows no sistema de arquivos FAT.

source: `BIOS Boot` - A very small partition required for booting from a device with a GUID partition table (GPT) on BIOS systems and UEFI systems in BIOS compatibility mode. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for details.
pt_br: `BIOS Boot` - Uma partição muito pequena necessária para inicializar a partir de um dispositivo com uma tabela de partição GUID (GPT) em sistemas BIOS e sistemas UEFI no modo de compatibilidade de BIOS. Veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de Particionamento Recomendado] para detalhes.

source: `EFI System Partition` - A small partition required for booting a device with a GUID partition table (GPT) on a UEFI system. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for details.
pt_br: `Partição de Sistema EFI` - Uma pequena partição necessária para inicializar um dispositivo com uma tabela de partição GUID (GPT) em um sistema UEFI. Veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de Particionamento Recomendado] para detalhes.

source: Software RAID Types
pt_br: Tipos de RAID por Software

source: `RAID0 (Performance)` - Distributes data across multiple disks. Level 0 RAID offers increased performance over standard partitions and can be used to pool the storage of multiple disks into one large virtual device. Note that Level 0 RAIDs offer no redundancy and that the failure of one device in the array destroys data in the entire array. RAID 0 requires at least two disks.
pt_br: `RAID0 (Desempenho)` - Distribui dados em vários discos. O RAID de nível 0 oferece maior desempenho em relação às partições padrão e pode ser usado para agrupar o armazenamento de vários discos em um grande dispositivo virtual. Observe que os RAIDs de nível 0 não oferecem redundância e que a falha de um dispositivo no arranjo destrói os dados em todo o arranjo. O RAID 0 requer pelo menos dois discos.

source: `RAID1 (Redundancy)` - Mirrors all data from one partition onto one or more other disks. Additional devices in the array provide increasing levels of redundancy. RAID 1 requires at least two disks.
pt_br: `RAID1 (Redundância)` - Espelha todos os dados de uma partição em um ou mais discos. Dispositivos adicionais no arranjo fornecem níveis crescentes de redundância. O RAID 1 requer pelo menos dois discos.

source: `RAID4 (Error Checking)` - Distributes data across multiple disks and uses one disk in the array to store parity information which safeguards the array in case any disk within the array fails. Because all parity information is stored on one disk, access to this disk creates a "bottleneck" in the array's performance. Level 4 RAID requires at least three disks.
pt_br: `RAID4` - Distribui dados em vários discos e usa um disco no arranjo para armazenar informações de paridade que protegem o array no caso de falha de algum disco do arranjo. Como todas as informações de paridade são armazenadas em um disco, o acesso a esse disco cria um "gargalo" no desempenho do arranjo. O RAID de nível 4 requer pelo menos três discos.

source: `RAID5 (Distributed Error Checking)` - Distributes data and parity information across multiple disks. Level 5 RAIDs therefore offer the performance advantages of distributing data across multiple disks, but do not share the performance bottleneck of level 4 RAIDs because the parity information is also distributed through the array. RAID 5 requires at least three disks.
pt_br: `RAID5 (Verificação de Erros Distribuídos)` - Distribui dados e informações de paridade em vários discos. Os RAIDs de nível 5, portanto, oferecem as vantagens de desempenho de distribuir dados em vários discos, mas não compartilham o gargalo de desempenho dos RAIDs de nível 4 porque as informações de paridade também são distribuídas por meio do arranjo. O RAID 5 requer pelo menos três discos.

source: `RAID6 (Redundant Error Checking)` - Level 6 RAIDs are similar to level 5 RAIDs, but instead of storing only one set of parity data, they store two sets. RAID 6 requires at least four disks.
pt_br: `RAID6 (Verificação de Erros Redundantes)` - Os RAIDs de nível 6 são semelhantes aos RAIDs de nível 5, mas em vez de armazenar apenas um conjunto de dados de paridade, eles armazenam dois conjuntos. O RAID 6 requer pelo menos quatro discos.

source: `RAID10 (Performance, Redundancy)` - Level 10 RAIDs are nested RAIDs or hybrid RAIDs. They are constructed by distributing data over mirrored sets of disks. For example, a level 10 RAID array constructed from four RAID partitions consists of two mirrored pairs of striped partitions. RAID 10 requires at least four disks.
pt_br: `RAID10 (Desempenho, Redundância)` - Os RAIDs de nível 10 são RAIDs aninhados ou RAIDs híbridos. Eles são construídos com a distribuição de dados em conjuntos de discos espelhados. Por exemplo, uma matriz RAID de nível 10 construída a partir de quatro partições RAID consiste em dois pares espelhados de partições distribuídas. O RAID 10 requer pelo menos quatro discos.
