Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/_partials/install/CustomSpoke_AddBtrfs.po
Languages: id

source: Some partition types - notably the `/boot` and `/usr` directories and the BIOS Boot and EFI partitions - can not be placed on Btrfs subvolumes. Use standard physical volumes for them (or an LVM logical volume for `/usr`). See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for more information.
id: Beberapa jenis partisi - terutama direktori `/boot` dan `/usr` dan partisi boot BIOS dan EFI - tidak dapat ditempatkan pada sub volume Btrfs. Gunakan volume fisik standar untuk mereka (atau volume lojik LVM untuk `/usr`). Lihat xref:sect-installation-gui-manual-partitioning-recommended[Skema Partisi Yang Direkomendasikan] untuk informasi lebih lanjut.

source: The Manual Partitioning screen
id: Layar Pemartisian Manual

source: Click the `+` button at the bottom of the list showing existing mount points. A new dialog window will open.
id: Klik tombol `+` di bagian bawah daftar yang menunjukkan titik kait yang ada. Jendela dialog baru akan terbuka.

source: In the new dialog window, specify a mount point for which you want to create a separate logical volume - for example, `/`. Optionally, specify a size for the volume using standard units such as MB or GB (for example, `50GB`). Then, click `Add mount point` to add the volume and return to the main partitioning screen.
id: Di jendela dialog baru, tentukan titik kait yang ingin Anda buat volume lojik terpisah - misalnya, `/`. Opsional, tentukan ukuran volume menggunakan unit standar seperti MB atau GB (misalnya, `50GB`). Kemudian, klik `Tambahkan titik kait` untuk menambahkan volume dan kembali ke layar partisi utama.

source: When creating a mount point for swap on Btrfs, specify the mount point as `swap`.
id: Saat membuat titik kait untuk swap pada Btrfs, tentukan titik kait sebagai `swap`.

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume. Select the newly created mount point in the left pane to configure it further, and convert it to a Btrfs subvolume by changing the `Device Type` option to `Btrfs`. Then, click `Update Settings` in the bottom right corner of the screen.
id: Titik kait sekarang telah dibuat dengan menggunakan pengaturan default, yang berarti telah dibuat sebagai volume logis LVM. Pilih titik kait yang baru dibuat di panel kiri untuk mengonfigurasinya lebih jauh, dan mengubahnya menjadi sub volume Btrfs dengan mengubah pilihan `Tipe Peranti` menjadi `Btrfs`. Kemudian, klik `Perbarui Pengaturan` di sudut kanan bawah layar.

source: In the `Volume` menu, you can see that the subvolume has been assigned to an automatically created volume, which is named after the {PRODUCT} variant you are installing (for example, `fedora-server00`. Click the `Modify` button under the drop-down menu to access the volume settings.
id: Di menu `Volume`, Anda dapat melihat bahwa sub volume telah ditetapkan ke volume yang dibuat secara otomatis, yang dinamai mengikuti varian {PRODUCT} yang Anda pasang (misalnya, `fedora-server00`. Klik tombol `Ubah` di bawah menu drop-down untuk mengakses pengaturan volume.

source: In the `Configure Volume` dialog, you can change the volume's name, its `RAID level` (see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types] for information about available RAID types), and you can also specify which physical devices (disks) this volume should reside on. You can select one or more disks which will be used to hold this volume by holding down kbd:[Ctrl] and clicking each disk in the list.
id: Dalam dialog `Konfigurasi Grup Volume`, Anda dapat mengubah nama volume, `Level RAID` (Lihat xref:sect-installation-gui-manual-partitioning-filesystems[Peranti, Sistem Berkas, dan Tipe RAID] untuk informasi tentang tipe RAID yang tersedia), dan Anda juga dapat menentukan perangkat fisik mana (disk) tempat volume ini. Anda dapat memilih satu atau lebih disk yang akan digunakan untuk menyimpan volume ini dengan menekan kbd:[Ctrl] dan mengklik setiap disk dalam daftar.

source: If you select a redundant RAID type (such as `RAID1 (Redundancy)`), the volume will take up twice its actual size on your disks. A 5 GB volume with RAID1 will take up 10 GB of space.
id: Jika Anda memilih tipe RAID redundan (seperti `RAID1 (redundansi)`), volume akan mengambil dua kali ukuran sebenarnya pada disk Anda. Sebuah volume 5 GB dengan RAID1 akan memakan ruang 10 GB.

source: You can also make sure that the volume is encrypted by selecting the `Encrypt` option; this will enable LUKS encryption for the entire volume. See the [citetitle]_{PRODUCT} Security Guide_, available at link:++http://docs.fedoraproject.org/++[], for information about LUKS disk encryption.
id: Anda juga dapat memastikan bahwa volume dienkripsi dengan memilih opsi `Enkripsi`; ini akan memungkinkan enkripsi LUKS untuk seluruh volume. Lihat [citetitle]_Panduan Keamanan {PRODUCT}_, tersedia di link:++https://docs.fedoraproject.org/++[], untuk informasi tentang enkripsi disk LUKS.

source: Additionally, you can set a fixed size for the volume by selecting the `Fixed` option from the `Size policy` menu and entering a size for the volume group.
id: Selain itu, Anda dapat menetapkan ukuran tetap untuk volume dengan memilih opsi `Tetap` dari menu `Kebijakan ukuran` dan memasukkan ukuran untuk grup volume.

source: After you finish configuring the Btrfs volume settings, click `Save` to return to the main `Manual Partitioning` screen.
id: Setelah Anda selesai mengkonfigurasi pengaturan volume Btrfs, klik `Simpan` untuk kembali ke layar utama `Pemartisian Manual`.

source: If you need to create more than one Btrfs volume, open the `Volume` drop-down menu and select the `Create a new volume group` option. A new dialog window will open, identical to the one described in the previous step. Again, select a name, storage devices, encryption settings, RAID level and size policy for the new volume, and click `Save`. The new volume will then become available in the `Volume Group` drop-down menu; you can then go through your existing mount points and change this setting to assign them to a different volume.
id: Jika Anda perlu membuat lebih dari satu volume Btrfs, buka menu drop-down `Volume` dan pilih opsi `Buat grup volume baru`. Sebuah jendela dialog baru akan terbuka, identik dengan yang dijelaskan pada langkah sebelumnya. Sekali lagi, pilih nama, perangkat penyimpanan, pengaturan enkripsi, tingkat RAID, dan kebijakan ukuran untuk grup baru, dan klik `Simpan`. Volume baru akan tersedia di menu drop-down `Grup Volume`; Anda kemudian dapat melewati titik kait yang ada dan mengubah setelan ini untuk menetapkannya ke volume yang berbeda.

source: Configure other settings specific to the subvolume - its `Mount Point`, `Desired Capacity`, `File System`, and `Name`. Press `Update Settings` to apply any changes to the configuration.
id: Konfigurasikan pengaturan lain khusus untuk sub volume - `Titik Kait`, `Kapasitas yang Diinginkan`, dan `Sistem Berkas`. Tekan `Perbarui Pengaturan` untuk menerapkan perubahan konfigurasi.

source: Repeat this procedure for any additional Btrfs subvolumes you want to create. Note that when creating additional subvolumes, a new volume is not automatically created each time; instead, any additional subvolumes are assigned to an existing volume.
id: Ulangi prosedur ini untuk setiap sub volume Btrfs tambahan yang ingin Anda buat. Perhatikan bahwa ketika membuat sub volume tambahan, volume baru tidak secara otomatis dibuat setiap saat; sebaliknya, sebarang sub volume tambahan ditetapkan ke grup yang ada.

source: For each mount point you create, review its settings and make sure that it is assigned to the correct volume, that it has sufficient capacity, and that it has a descriptive name so you can identify the subvolume later if you need to.
id: Untuk setiap titik kait yang Anda buat, tinjau setelannya dan pastikan itu ditetapkan ke volume yang benar, bahwa itu memiliki kapasitas yang cukup, dan memiliki nama deskriptif sehingga Anda dapat mengidentifikasi sub volume nanti jika perlu.
