Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/_partials/install/CustomSpoke_AddLVM.po
Languages: id

source: _Logical Volume Management_ (LVM) presents a simple logical view of underlying physical storage space, such as hard drives or LUNs. Partitions on physical storage are represented as _physical volumes_ that can be grouped together into _volume groups_. Each volume group can be divided into multiple _logical volumes_, each of which is analogous to a standard disk partition. Therefore, LVM logical volumes function as partitions which can span multiple physical disks.
id: _Logical Volume Management_ (LVM) menyajikan tampilan logis sederhana dari ruang penyimpanan fisik yang mendasari, seperti hard disk atau LUN. Partisi pada penyimpanan fisik diwakili sebagai _volumes fisik_ yang dapat dikelompokkan bersama ke _grup volume_. Setiap grup volume dapat dibagi menjadi beberapa _volume lojik_, yang masing-masing analog dengan partisi disk standar. Oleh karena itu, volume lojik LVM berfungsi sebagai partisi yang dapat merentang ke beberapa disk fisik.

source: Some partition types - notably the `/boot` directory and the BIOS Boot and EFI partitions - can not be placed on logical volumes. Use standard physical volumes for them. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for more information.
id: Beberapa jenis partisi - terutama direktori `/boot` dan boot BIOS dan partisi EFI - tidak dapat ditempatkan pada volume logis. Gunakan volume fisik standar untuk mereka. Lihat xref:sect-installation-gui-manual-partitioning-recommended[Skema Partisi Yang Direkomendasikan] untuk informasi lebih lanjut.

source: Create LVM Logical Volume
id: Buat Volume Logis LVM

source: The Manual Partitioning screen
id: Layar Pemartisian Manual

source: Follow the procedure below to create LVM logical volumes and volume groups.
id: Ikuti prosedur di bawah ini untuk membuat volume lojik LVM dan grup volume.

source: Creating LVM Logical Volumes and Groups
id: Membuat Grup dan Volume Lojik LVM

source: Click the `+` button at the bottom of the list showing existing mount points. A new dialog window will open.
id: Klik tombol `+` di bagian bawah daftar yang menunjukkan titik kait yang ada. Jendela dialog baru akan terbuka.

source: In the new dialog window, specify a mount point for which you want to create a separate logical volume - for example, `/`. Optionally, specify a size for the volume using standard units such as MB or GB (for example, `50GB`). Then, click `Add mount point` to add the volume and return to the main partitioning screen.
id: Di jendela dialog baru, tentukan titik kait yang ingin Anda buat volume lojik terpisah - misalnya, `/`. Opsional, tentukan ukuran volume menggunakan unit standar seperti MB atau GB (misalnya, `50GB`). Kemudian, klik `Tambahkan titik kait` untuk menambahkan volume dan kembali ke layar partisi utama.

source: When creating a mount point for swap on LVM, specify the mount point as `swap`.
id: Saat membuat titik kait untuk swap pada LVM, tentukan titik kait sebagai `swap`.

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume, and a volume group has been created to contain it. Select the newly created mount point in the left pane to configure it further. If you want to use thin provisioning for this volume, change the `Device Type` option to `LVM Thin Provisioning`.
id: Titik kait sekarang telah dibuat dengan menggunakan pengaturan default, yang berarti telah dibuat sebagai volume lojik LVM, dan grup volume telah dibuat untuk berisi itu. Pilih titik kait yang baru dibuat di panel kiri untuk mengonfigurasinya lebih jauh. Jika Anda ingin menggunakan thin provisioning untuk volume ini, Ubah opsi `Tipe Peranti` menjadi `LVM Thin provisioning`.

source: In the `Volume Group` menu, you can see that the volume has been assigned to an automatically created volume group, which is named after the {PRODUCT} variant you are installing (for example, `fedora-server`. Click the `Modify` button under the drop-down menu to access the volume group settings.
id: Di menu `Grup Volume`, Anda dapat melihat bahwa volume telah ditetapkan ke grup volume yang dibuat secara otomatis, yang dinamai mengikuti varian {PRODUCT} yang Anda pasang (misalnya, `fedora-server`. Klik tombol `Ubah` di bawah menu drop-down untuk mengakses pengaturan grup volume.

source: In the `Configure Volume Group` dialog, you can change the volume group's name, its `RAID level` (see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types] for information about available RAID types), and you can also specify which physical devices (disks) this volume group should reside on. You can select one or more disks which will be used to hold this volume group by holding down kbd:[Ctrl] and clicking each disk in the list.
id: Dalam dialog `Konfigurasi Grup Volume`, Anda dapat mengubah nama grup volume, `Level RAID` (Lihat xref:sect-installation-gui-manual-partitioning-filesystems[Peranti, Sistem Berkas, dan Tipe RAID] untuk informasi tentang tipe RAID yang tersedia), dan Anda juga dapat menentukan perangkat fisik mana (disk) tempat grup volume ini. Anda dapat memilih satu atau lebih disk yang akan digunakan untuk menyimpan grup volume ini dengan menekan kbd:[Ctrl] dan mengklik setiap disk dalam daftar.

source: If you select a redundant RAID type (such as `RAID1 (Redundancy)`), the volume group will take up twice its actual size on your disks. A 5 GB volume group with RAID1 will take up 10 GB of space.
id: Jika Anda memilih tipe RAID redundan (seperti `RAID1 (redundansi)`), grup volume akan mengambil dua kali ukuran sebenarnya pada disk Anda. Sebuah grup volume 5 GB dengan RAID1 akan memakan ruang 10 GB.

source: Additionally, you can set a fixed size for the volume group by selecting the `Fixed` option from the `Size policy` menu and entering a size for the volume group.
id: Selain itu, Anda dapat menetapkan ukuran tetap untuk grup volume dengan memilih opsi `Tetap` dari menu `Kebijakan ukuran` dan memasukkan ukuran untuk grup volume.

source: After you finish configuring the volume group settings, click `Save` to return to the main `Manual Partitioning` screen.
id: Setelah Anda selesai mengkonfigurasi pengaturan grup volume, klik `Simpan` untuk kembali ke layar utama `Pemartisian Manual`.

source: The configuration dialog does not allow you to specify the size of the volume group's _physical extents_. The size will always be set to the default value of 4 MiB. If you want to create a volume group with different physical extents, create it manually by switching to an interactive shell and using the [command]#vgcreate# command, or use a Kickstart file with the [command]#volgroup --pesize=pass:attributes[{blank}]_size_pass:attributes[{blank}]# command.
id: Dialog konfigurasi tidak memperbolehkan Anda untuk menentukan ukuran _physical extent_ grup volume. Ukuran akan selalu ditetapkan ke nilai asali 4 MiB. Jika Anda ingin membuat grup volume dengan berbagai variasi fisik, Buatlah secara manual dengan beralih ke shell interaktif dan menggunakan perintah [command]#vgcreate#, atau gunakan berkas Kickstart dengan perintah [command]#volgroup --pesize=pass:attributes[{blank}]_size_pass:attributes[{blank}]#.

source: If you need to create more than one volume group, open the `Volume Group` drop-down menu and select the `Create a new volume group` option. A new dialog window will open, identical to the one described in the previous step. Again, select a name, storage devices, encryption settings, RAID level and size policy for the new group, and click `Save`. The new volume group will then become available in the `Volume Group` drop-down menu; you can then go through your existing mount points and change this setting to assign them to a different volume group.
id: Jika Anda perlu membuat lebih dari satu grup volume, buka menu drop-down `Grup Volume` dan pilih opsi `Buat grup volume baru`. Sebuah jendela dialog baru akan terbuka, identik dengan yang dijelaskan pada langkah sebelumnya. Sekali lagi, pilih nama, perangkat penyimpanan, pengaturan enkripsi, tingkat RAID, dan kebijakan ukuran untuk grup baru, dan klik `Simpan`. Grup volume baru akan tersedia di menu drop-down `Grup Volume`; Anda kemudian dapat melewati titik kait yang ada dan mengubah setelan ini untuk menetapkannya ke grup volume yang berbeda.

source: Configure other settings specific to the logical volume - its `Mount Point`, `Desired Capacity`, `File System`, and `Name`. Press `Update Settings` to apply any changes to the configuration.
id: Konfigurasikan pengaturan lain khusus untuk volume lojik - `Titik Kait`, `Kapasitas yang Diinginkan`, dan `Sistem Berkas`. Tekan `Perbarui Pengaturan` untuk menerapkan perubahan konfigurasi.

source: Repeat this procedure for any additional logical volumes you want to create. Note that when creating additional LVM logical volumes, a new volume group is not automatically created each time; instead, any additional volumes are assigned to an existing group.
id: Ulangi prosedur ini untuk setiap volume lojik tambahan yang ingin Anda buat. Perhatikan bahwa ketika membuat volume lojik LVM tambahan, grup volume baru tidak secara otomatis dibuat setiap saat; sebaliknya, volume tambahan ditetapkan ke grup yang ada.

source: For each mount point you create, review its settings and make sure that it is assigned to the correct group, that it has sufficient capacity, and that it has a descriptive name so you can identify the volume later if you need to.
id: Untuk setiap titik kait yang Anda buat, tinjau setelannya dan pastikan pengaturannya ditetapkan ke grup yang benar, sehingga memiliki kapasitas yang memadai, dan memiliki nama deskriptif sehingga Anda dapat mengidentifikasi volume nanti jika perlu.
