Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/_partials/install/DateTimeSpoke.po
Languages: tr

source: Date & Time
tr: Tarih ve Saat

source: The `Date & Time` screen allows you to configure time and date-related settings for your system. This screen is automatically configured based on the settings you selected in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Welcome Screen and Language Selection], but you can change your date, time and location settings before you begin the installation.
tr: `Tarih ve Saat` ekranı, sisteminiz için saat ve tarihle ilgili ayarları yapılandırmanıza olanak tanımaktadır. Bu ekran, xref:Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Hoş Geldiniz Ekranı ve Dil Seçimi] bölümünde seçtiğiniz ayarlara göre otomatik olarak yapılandırılır, ancak kuruluma başlamadan önce tarih, saat ve konum ayarlarınızı değiştirebilirsiniz.

source: Screenshot of the Date & Time screen
tr: Tarih ve Saat ekranının görüntüsü

source: First, select your `Region` using the drop-down menu in the top left corner of the screen. Then, select your `City`, or the city closest to your location in the same time zone. Selecting a specific location helps {PRODUCT} ensure that your time is always set correctly including automatic time changes for daylight savings time if applicable.
tr: İlk olarak, ekranın sol üst köşesindeki açılır menüyü kullanarak `Bölge` seçiminizi yapın. Ardından, `Şehir` seçiminizi yapın, veya aynı saat diliminde bulunduğunuz yere en yakın şehri seçin. Belirli bir konumun seçilmesi, {PRODUCT}'nın, gün ışığından yararlanma saati için otomatik saat değişiklikleri de dahil olmak üzere, zamanınızın her zaman doğru ayarlanmasını sağlamasına yardımcı olur.

source: You can also select a time zone relative to Greenwich Mean Time (GMT) without setting your location to a specific region. To do so, select `Etc` as your region.
tr: Konumunuzu belirli bir bölgeye ayarlamadan Greenwich Ortalama Saati'ne (GMT) göre bir saat dilimi de seçebilirsiniz. Bunu yapmak için bölgenizi `Etc` olarak seçin.

source: The list of cities and regions comes from the Time Zone Database ([package]*tzdata*) public domain, which is maintained by the Internet Assigned Numbers Authority (IANA). The Fedora Project can not add cities or regions into this database. You can find more information at the link:++http://www.iana.org/time-zones++[IANA official website].
tr: Şehirlerin ve bölgelerin listesi, Internet Assigned Numbers Authority (IANA) tarafından sağlanan, kamu malı olan Zaman Dilimi Veri Tabanından ([package]*tzdata*) gelmektedir. Fedora Projesi bu veri tabanına şehir veya bölge ekleyemez. Daha fazla bilgiyi link:++https://www.iana.org//time-zones++[IANA resmi web sitesinde] bulabilirsiniz.

source: The switch labeled `Network Time` in the top right corner of the screen can be used to enable or disable network time synchronization using the Network Time Protocol (NTP). Enabling this option will keep your system time correct as long as the system can access the internet. By default, four NTP _pools_ are configured; you can add others and disable or remove the default ones by clicking the gear wheel button next to the switch.
tr: Ekranın sağ üst köşesindeki `Ağ Saati` etiketli anahtar, Ağ Saati Protokolünü (NTP) kullanarak ağ üzerinden saat eşzamanlamasını etkinleştirmek veya devre dışı bırakmak için kullanılabilir. Bu seçeneğin etkinleştirilmesi, sistem internete erişebildiği sürece sistem saatinizi doğru tutacaktır. Öntanımlı olarak, dört NTP _havuzu_ yapılandırılmıştır; anahtarın yanındaki dişli çark düğmesini tıklayarak başkalarını ekleyebilir ve öntanımlıları devre dışı bırakabilir veya kaldırabilirsiniz.

source: The Add and mark for usage NTP servers dialog
tr: Kullanmak için NTP sunucuları ekle ve işaretle iletişim penceresi

source: A dialog window allowing you to add or remove NTP pools from your system configuration
tr: Sistem yapılandırmanıza NTP havuzları eklemenizi veya kaldırmanızı sağlayan bir iletişim penceresi

source: If you disable network time synchronization, the controls at the bottom of the screen will become active, and you will be able to set the current time and date manually.
tr: Ağ üzerinden saat eşzamanlamasını devre dışı bırakırsanız, ekranın altındaki denetimler etkin hale gelecek ve geçerli saati ve tarihi elle ayarlayabileceksiniz.

source: After configuring your time and date settings, press the `Done` button in the top left corner to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
tr: Saat ve tarih ayarlarınızı yapılandırdıktan sonra, xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Kurulum Özetine] dönmek için sol üst köşedeki `Bitti` düğmesine basın.
