Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/_partials/install/FilterSpoke_AddFCoE.po
Languages: tr

source: ====== Add FCoE SAN
tr: ====== FCoE SAN Ekle

source: The following procedure explains how to add _Fibre Channel over Ethernet_ (FCoE) storage devices and make them available during the installation:
tr: Aşağıdaki adımlar, _Ethernet üzerinden Fiber Kanal_ (Fibre Channel over Ethernet - FCoE) depolama aygıtlarının nasıl ekleneceğini ve kurulum sırasında bunların nasıl kullanılabilir hale getirileceğini açıklamaktadır:

source: Add FCoE Target
tr: FCoE Hedefi Ekle

source: Click the `Add FCoE SAN` button in the bottom right corner of xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks]. A new dialog window will open.
tr: xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Kurulum Hedefi - Özelleşmiş Diskler ve Ağ Diskleri] ekranının sağ alt köşesindeki `FCoE SAN Ekle` düğmesine tıklayın. Yeni bir iletişim penceresi açılacaktır.

source: Select the network interface (`NIC`) which is connected to your FCoE switch from the drop-down menu. Note that this network interface must be configured and connected - see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Network & Hostname].
tr: Açılır menüden FCoE anahtarınıza bağlı olan ağ arayüzünü (`NIC`) seçin. Bu ağ arayüzünün yapılandırılması ve bağlanması gerektiğini unutmayın - xref:Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Ağ & Ana Makine Adı] bölümüne bakın.

source: Below the `NIC` drop-down menu are two choices:
tr: `NIC` açılır menüsünün altında iki seçenek vardır:

source: `Use DCB`
tr: `DCB kullan`

source: _Data Center Bridging_ (DCB) is a set of enhancements to the Ethernet protocols designed to increase the efficiency of Ethernet connections in storage networks and clusters. This option should only be enabled for network interfaces that require a host-based DCBX client. Configurations on interfaces that implement a hardware DCBX client should leave this check box empty.
tr: _Veri Merkezi Köprüleme_ (Data Center Bridging - DCB), depolama ağları ve kümelerindeki Ethernet bağlantılarının verimliliğini artırmak için tasarlanan Ethernet protokolleri üzerindeki bir dizi iyileştirmedir. Bu seçenek yalnızca ana makine tabanlı DCBX istemcisi gerektiren ağ arayüzleri için etkinleştirilmelidir. Bir donanım DCBX istemcisini uygulayan arayüzlerdeki yapılandırmalar, bu onay kutusunu boş bırakmalıdır.

source: `Use auto vlan`
tr: `Otomatik VLAN kullan`

source: This option indicates whether VLAN discovery should be performed. If this box is checked, then the _FCoE Initiation Protocol_ (FIP) VLAN discovery protocol will run on the Ethernet interface once the link configuration has been validated. If they are not already configured, network interfaces for any discovered FCoE VLANs will be automatically created and FCoE instances will be created on the VLAN interfaces. This option is enabled by default.
tr: Bu seçenek, VLAN keşfinin gerçekleştirilip gerçekleştirilmeyeceğini belirtir. Bu kutu işaretlenirse, _FCoE Initiation Protocol_ (FIP) VLAN keşif protokolü, bağlantı yapılandırması doğrulandıktan sonra Ethernet arayüzünde çalışacaktır. Önceden yapılandırılmadılarsa, keşfedilen FCoE VLAN'ları için ağ arayüzleri otomatik olarak oluşturulacak ve VLAN arayüzlerinde FCoE örnekleri oluşturulacaktır. Bu seçenek öntanımlı olarak etkindir.

source: After you select which interface and options to use, click `Add FCoE Disk(s)`. Discovered FCoE storage devices will be displayed under the `Other SAN Devices` tab in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks].
tr: Hangi arayüzü ve seçenekleri kullanacağınızı seçtikten sonra, `FCoE Disk(ler)i Ekle` düğmesine tıklayın. Keşfedilen FCoE depolama aygıtları, xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Kurulum Hedefi - Özelleşmiş Diskler ve Ağ Diskleri] bölümündeki `Diğer SAN Aygıtları` sekmesi altında görüntülenecektir.
