Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/_partials/install/InitialSetupHub.po
Languages: fi, ko, tr

source: Initial Setup
fi: Alkumääritys
ko: 초기 설정
tr: İlk Kurulum

source: The `Initial Setup` screen is shown after the installation finishes and the installed system boots for the first time, before the first login, assuming the following conditions have been met:
fi: Alkuasetusnäyttö tulee näkyviin, kun asennus on valmis ja asennettu järjestelmä käynnistyy ensimmäisen kerran, ennen ensimmäistä kirjautumista, mikäli seuraavat ehdot täyttyvät:
ko: `초기 설정` 화면은 다음 상태를 충족했다고 가정하면, 로그인 전에 설치가 완료되고 처음으로 설치된 시스템이 부팅된 후에 표시됩니다:
tr: Aşağıdaki koşulların karşılandığı varsayılarak, kurulum tamamlandıktan sonra ve kurulan sistem ilk defa önyüklendiğinde, ilk oturum açma işleminden önce `İlk Kurulum` ekranı gösterilir:

source: Your software selection contained a graphical environment (for example, you installed the system using a {PRODUCT} Workstation live image).
fi: Ohjelmistovalintasi sisälsi graafisen ympäristön (esimerkiksi asensit järjestelmän käyttämällä {PRODUCT} Workstationin live-levykuvaa).
ko: 당신의 소프트웨어 선택은 그래픽 환경(예를 들면, 당신은 {PRODUCT} 웍스테이션 라이브 이미지를 이용해서 시스템을 설치했습니다)을 포함하고 있습니다.
tr: Yazılım seçiminiz bir grafiksel ortam içeriyordu (örneğin, sistemi bir {PRODUCT} Workstation canlı kalıbı kullanarak kurdunuz).

source: The graphical environment you have installed is *not* [application]*GNOME Desktop Environment* (it provides its own initial setup utility which is described in xref:After_Installation.adoc#sect-gnome-initial-setup[GNOME Initial Setup]).
fi: Asentamasi graafinen ympäristö ei ole [sovellus]*GNOME-työpöytäympäristö* (se tarjoaa oman alkuasetusapuohjelman, joka on kuvattu kohdassa xref:After_Installation.adoc#sect-gnome-initial-setup[GNOME-alkuasennus] ).
ko: 당신이 설치했던 그래픽 환경은 *그놈 데스크탑 환경* [application]이 *아닙니다* (ref:After_Installation.adoc#sect-gnome-initial-setup[그놈 초기 설정])에서 설명되어지는 것과 같은 자신의 초기 설정 유틸리티를 제공합니다).
tr: Kurduğunuz grafiksel ortam [application]*GNOME Masaüstü Ortamı* *değil* (bu, xref:After_Installation.adoc#sect-gnome-initial-setup[GNOME İlk Kurulum] bölümünde açıklanan kendi ilk kurulum aracını sağlar).

source: The [package]*initial-setup* package has been installed.
fi: [Package]*initial-setup*-paketti on asennettu.
ko: [package]*초기-설정* 꾸러미가 설치되었습니다.
tr: [package]*initial-setup* paketi kuruldu.

source: You have not configured every screen available in the graphical installer.
fi: Et ole määrittänyt kaikkia graafisessa asennusohjelmassa käytettävissä olevia näyttöjä.
ko: 그래픽 설치자에서 사용 가능한 모든 화면이 구성되지 않습니다.
tr: Grafiksel kurucuda bulunan her ekranı yapılandırmadınız.

source: Initial Setup
fi: Alkumääritys
ko: 초기 설정

source: The main Initial Setup screen. This example shows all options; not all of them may be shown
fi: Alkuasetusnäyttö. Tämä esimerkki näyttää kaikki vaihtoehdot; kaikkia niitä ei välttämättä näytetä
ko: 주요 초기 설정 화면. 이 예제는 모든 선택을 표시합니다; 보여지는 것이 모두는 아닙니다
tr: Ana İlk Kurulum ekranı. Bu örnek tüm seçenekleri göstermektedir; hepsi gösterilmeyebilir

source: [application]*Initial Setup* allows you to configure several system settings. All of these can also be configured during the installation, but they are not required to finish it. Only the settings which have *not* been configured during the installation will be shown; for example, if you did not create a non-`root` user account during the installation, [application]*Initial Setup* will start after the first reboot, and you will be able to configure one. If you configured all available options during the instalaltion, [application]*Initial Setup* will not be displayed at all.
fi: [sovellus]*Alkuasennuksen* avulla voit määrittää useita järjestelmäasetuksia. Kaikki nämä voidaan myös konfiguroida asennuksen aikana, mutta niitä ei vaadita asennuksen loppuun saattamiseksi. Vain asetukset, joita *ei* ole määritetty asennuksen aikana, näytetään; Jos esimerkiksi et luonut ei-root-käyttäjätiliä asennuksen aikana, [sovellus]*Alkuasetukset* käynnistyy ensimmäisen uudelleenkäynnistyksen jälkeen, ja voit määrittää sellaisen. Jos määritit kaikki käytettävissä olevat asetukset asennuksen aikana, [sovellus]*Alkuasetukset* ei näy ollenkaan.
ko: [application]*초기 설정*은 여러 시스템 설정을 구성 할 수 있도록 합니다. 이들 모두는 또한 설치 중에 구성 될 수도 있으며, 그러나 이를 완료 할 필요는 없습니다. 설치 중에 구성되지 *않은* 설정만이 표시 될 것입니다; 예를 들면, 만약 설치하는 동안 비- 'root'가 사용자 계정을 생성하지 않는다면, [application]*초기 설정*은 첫 번째 재부트 후에 시작 될 것이며,그런 후에 당신은 계정을 구성 할 수 있을 것입니다. 만약 당신이 설치 중에 모든 사용 가능한 선택을 구성한 경우에, [application]*초기 설정*은 조금도 표시되지 않을 것입니다.
tr: [application]*İlk Kurulum*, çeşitli sistem ayarlarını yapılandırmanıza izin verir. Bunların tümü kurulum sırasında da yapılandırılabilir, ancak kurulumu bitirmek için zorunlu değildir. Yalnızca kurulum sırasında *yapılandırılmayan* ayarlar gösterilecektir; örneğin, kurulum sırasında `root` olmayan bir kullanıcı hesabı oluşturmadıysanız, ilk kez yeniden başlatmanın ardından [application]*İlk Kurulum* başlayacak ve bir tane yapılandırabileceksiniz. Kurulum sırasında tüm seçenekleri yapılandırdıysanız, [application]*İlk Kurulum* hiç görüntülenmeyecektir.

source: To configure any aspect of the system available in the utility, click any of the links available in the main window (for example, `Create User`). Each link leads to a separate screen with separate options; these screens are the same ones which were available during the graphical installation. If you need help, press `Help` in the top left corner to open a new window containing directions for that screen.
fi: Jos haluat määrittää jotain apuohjelmassa saatavilla olevaa järjestelmän osaa, napsauta sen pääikkunassa olevaa linkkiä (esimerkiksi "Luo käyttäjä"). Jokainen linkki johtaa erilliseen näyttöön erillisillä vaihtoehdoilla; nämä näytöt ovat samat, jotka olivat käytettävissä graafisen asennuksen aikana. Jos tarvitset apua, paina vasemmassa yläkulmassa "Ohje" avataksesi uuden ikkunan, joka sisältää ohjeita kyseiselle näytölle.
ko: 유틸리티에서 사용 가능한 시스템 측면으로 구성하려면, 주요 창(예를 들면, `사용자 생성`)에서 사용 가능한 연결을 눌러줍니다. 각각의 연결은 분리된 옵션이 있는 화면으로 분리하도록 합니다; 이들 화면은 그래픽 설치 중에 사용 할 수 있는 동일한 것 중에 하나입니다. 만약 도움이 필요하면, 왼쪽 상단 모서리에 있는 '도움말'을 눌러서, 그창 화면에 새로운 창이 포함된 지침을 엽니다.
tr: Programda bulunan sistemin herhangi bir özelliğini yapılandırmak için, ana pencerede bulunan bağlantılardan herhangi birine tıklayın (örneğin, `Kullanıcı Oluştur`). Her bağlantı, ayrı seçeneklere sahip ayrı bir ekrana gider; bu ekranlar, grafiksel kurulum sırasında kullanılanlarla aynıdır. Yardıma ihtiyacınız varsa, o ekrana yönelik talimatları içeren yeni bir pencere açmak için sol üst köşedeki `Yardım` düğmesine basın.

source: After you finish configuring any screen, press the `Done` button in the top left corner to return to the main [application]*Initial Setup* menu. After you finish configuring all settings, click `Finish Configuration` in the bottom right corner to save all configured settings. The configuration utility will close and you will be able to log in to the system.
fi: Kun olet määrittänyt jonkun näytön, palaa [sovellus]*Alkuasetukset*-päävalikkoon painamalla vasemmassa yläkulmassa olevaa Valmis-painiketta. Kun olet määrittänyt kaikki asetukset, napsauta "Lopeta määritys" oikeassa alakulmassa tallentaaksesi kaikki määritetyt asetukset. Määritysapuohjelma sulkeutuu ja voit kirjautua järjestelmään.
ko: 화면 구성을 종료 한 후에, 상단 왼쪽 모서리 부분에 '완료' 누름단추를 눌러주고, [application]*초기 설정* 메뉴로 돌아갑니다. 당신은 모든 설정 구성이 끝나면, 하단 오른쪽 모서리 부분에서 '구성 완료'를 누르고, 모든 구성된 설정을 저장합니다. 구성 유틸리티는 닫힐 것이고 당신은 시스템에 로그인 할 수 있을 것입니다.
tr: Herhangi bir ekranı yapılandırmayı bitirdikten sonra, ana [application]*İlk Kurulum* menüsüne dönmek için sol üst köşedeki `Bitti` düğmesine basın. Tüm ayarları yapılandırmayı bitirdikten sonra, yapılandırılan tüm ayarları kaydetmek için sağ alt köşedeki `Yapılandırmayı Bitir` düğmesine tıklayın. Yapılandırma yardımcı programı kapanacak ve sistemde oturum açabileceksiniz.

source: It is possible to configure [application]*Initial Setup* to display all available options, even if they have been already configured during the installation. To do so, you must use a Kickstart file at the start of the installation, and this file must contain the following command:
fi: On mahdollista määrittää [sovellus]*Alkuasetukset* näyttämään kaikki käytettävissä olevat vaihtoehdot, vaikka ne olisi määritetty jo asennuksen aikana. Tätä varten sinun on käytettävä Kickstart-tiedostoa asennuksen alussa, ja tämän tiedoston on sisällettävä seuraava komento:
ko: 심지어 설치 중에 이미 구성되어져 있어도, 모든 사용 가능한 선택이 표시되며 [application]*초기 설정*을 구성 할 수 있습니다. 이렇게 하려면, 설치 시작 부분에서 킥스타트 파일을 사용해야만 하고, 이 파일은 다음 명령을 포함하여야만 합니다:
tr: [application]*İlk Kurulum*, kurulum sırasında zaten yapılandırılmış olsalar bile kullanılabilir tüm seçenekleri görüntüleyecek şekilde yapılandırılabilir. Bunu yapmak için, kurulumun başlangıcında bir Kickstart dosyası kullanmalısınız ve bu dosya aşağıdaki komutu içermelidir:

source: The [option]#--reconfig# option specifies that all options should be displayed. See xref:../advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart] for information about Kickstart installations.
ko: [option]#--reconfig# 옵션은 모든 선택이 표시되는 것처럼 상세화합니다. 킥스타트 설치에 대한 정보는 xref:../advanced/Kickstart_Installations.adoc#chap-kickstart-installations[킥스타트를 통한 자동화된 설치]를 참고하세요.
tr: [option]#--reconfig# seçeneği, tüm seçeneklerin görüntülenmesi gerektiğini belirtir. Kickstart kurulumları hakkında bilgi için xref:../advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Kickstart ile Kurulumu Otomatikleştirme] bölümüne bakın.

source: Normally, it is not possible to return to [application]*Initial Setup* after you close it and log in to the system. You can make it display again (after the next reboot, before a login prompt is displayed), by executing the following command as `root`:
fi: Normaalisti [sovellus]*Alkuasennukseen* ei voi palata sen jälkeen, kun olet sulkenut sen ja kirjautunut järjestelmään. Voit saada sen näkyviin uudelleen (seuraavan uudelleenkäynnistyksen jälkeen, ennen kuin kirjautumiskehote tulee näkyviin) suorittamalla seuraavan komennon käyttäjänä "root":
ko: 일반적으로, 종료 한 후에 [application]*초기 설정*으로 되돌아 갈 수 없으며 시스템에 로그인합니다. `root`로 다음 명령을 실행에 의하여(다음 재시작 후에, 로그인 입력기가 표시되기 전에) 다시 표시 할 수 있도록 만들 수 있습니다:
tr: Normalde, kapatıp sistemde oturum açtıktan sonra [application]*İlk Kurulum*'a dönmek mümkün değildir. Aşağıdaki komutu `root` olarak çalıştırarak, (bir sonraki yeniden başlatmadan sonra, bir oturum açma istemi görüntülenmeden önce) tekrar gösterilmesini sağlayabilirsiniz:

source: Then, reboot your system.
fi: Käynnistä sitten järjestelmäsi uudelleen.
ko: 그런 후에, 자신의 시스템을 재시작하세요.
tr: Ardından, sisteminizi yeniden başlatın.
