Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/_partials/install/NetworkSpoke_EditConnection.po
Languages: id

source: The most common and useful options in the configuration dialog are:
id: Pilihan yang paling umum dan berguna dalam dialog konfigurasi adalah:

source: Enable or disable the connection by default
id: Memfungsikan atau menonaktifkan koneksi secara default

source: In the `General` tab of the configuration dialog, you can select or unselect the `Automatically connect to this network when it is available` check box to allow or disallow this connection to connect by default. When enabled on a wired connection, this means the system will typically connect during startup (unless you unplug the network cable); on a wireless connection, it means that the interface will attempt to connect to any known wireless networks in range.
id: Di tab `Umum` pada dialog konfigurasi, Anda dapat memilih atau membatalkan pilihan kotak centang `Secara otomatis tersambung ke jaringan ini saat tersedia` untuk membolehkan atau menolak sambungan ini agar tersambung secara default. Ketika diaktifkan pada koneksi kabel, ini berarti sistem biasanya akan menghubungkan selama startup (kecuali jika Anda mencabut kabel jaringan); pada koneksi nirkabel, itu berarti bahwa antarmuka akan mencoba untuk terhubung ke jaringan nirkabel yang dikenal dalam jangkauan.

source: Additionally, you can allow or disallow all users on the system from connecting to this network using the `All users may connect to this network` option. If you disable this option, only `root` will be able to connect to this network.
id: Selain itu, Anda dapat mengizinkan atau melarang semua pengguna pada sistem menyambung ke jaringan ini menggunakan opsi `Semua pengguna dapat menyambung ke jaringan ini`. Jika Anda menonaktifkan opsi ini, hanya `root` yang dapat terhubung ke jaringan ini.

source: It is not possible to only allow a specific user other than `root` to use this interface, because no other users are created at this point during the installation. If you need a connection for a different user, you must configure it after the installation.
id: Tidak mungkin untuk hanya memungkinkan pengguna tertentu selain `root` untuk menggunakan antarmuka ini, karena tidak ada pengguna lain yang dibuat pada saat ini selama instalasi. Jika Anda memerlukan koneksi untuk pengguna yang berbeda, Anda harus mengkonfigurasinya setelah instalasi.

source: Set up static IPv4 or IPv6 settings
id: Menyiapkan pengaturan IPv4 atau IPv6 statis

source: By default, both `IPv4` and `IPv6` are set to automatic configuration depending on current network settings. This means that addresses such as the local IP address, DNS address, and other settings will be detected automatically each time the interface connects to a network. In many cases, this is sufficient, but you can also provide static configuration in the `IPv4 Settings` and `IPv6 Settings`, respectively.
id: Secara default, `IPv4` dan `IPv6` diatur ke konfigurasi otomatis tergantung pada pengaturan jaringan saat ini. Ini berarti bahwa alamat seperti alamat IP lokal, alamat DNS, dan pengaturan lainnya akan dideteksi secara otomatis setiap kali antarmuka terhubung ke jaringan. Dalam banyak kasus, ini cukup, tetapi Anda juga dapat memberikan konfigurasi statis masing-masing di `Pengaturan IPv4` dan `Pengaturan IPv6`.

source: To set static network configuration, navigate to one of the settings tabs and select a method other than `Automatic` (for example, `Manual`) from the `Method` drop-down menu. This will enable the `Addresses` field below.
id: Untuk mengatur konfigurasi jaringan statis, navigasikan ke salah satu tab pengaturan dan pilih metode selain `Otomatis` (misalnya, `Manual`) dari menu drop-down `Metode`. Ini akan memfungsikan ruas `Alamat` di bawah ini.

source: In the `IPv6 Settings` tab, you can also set the method to `Ignore` to disable `IPv6` on this interface.
id: Dalam tab `Pengaturan IPv6`, Anda juga dapat mengatur metode menjadi `Abaikan` untuk menonaktifkan `IPv6` pada antarmuka ini.

source: Then, click `Add` on the right side and add a set of settings: `Address`, `Netmask` (for `IPv4`), `Prefix` (for `IPv6`), and `Gateway`.
id: Kemudian, klik `Tambah` di sisi kanan dan tambahkan satu set pengaturan: `Alamat`, `Netmask` (untuk `IPv4`), `Prefiks` (untuk `IPv6`), dan `Gateway`.

source: The `DNS servers` field accepts one or more IP addresses of DNS servers - for example, `10.0.0.1,10.0.0.8`.
id: Ruas `Server DNS` menerima satu atau beberapa alamat IP server DNS - misalnya, `9.9.9.9,8.8.4.4`.

source: The final option in both tabs is `Require IPvpass:attributes[{blank}]_X_ addressing for this connection to complete`. Select this option in the `IPv4` tab to only allow this connection if `IPv4` was successful; the same principle applies to this setting in the `IPv6` tab. If this option remains disabled for both `IPv4` and `IPv6`, the interface will be able to connect if configuration succeeds on either IP protocol.
id: Opsi terakhir di kedua tab adalah `Memerlukan pengalamatan IPvpass:attributes[{blank}]_X_ untuk sambungan ini agar lengkap`. Pilih opsi ini di tab `IPv4` untuk hanya mengizinkan koneksi ini jika `IPv4` berhasil; prinsip yang sama berlaku untuk pengaturan ini di tab `IPv6`. Jika opsi ini tetap dinonaktifkan untuk `IPv4` dan `IPv6`, antarmuka akan dapat terhubung jika konfigurasi berhasil pada salah satu protokol IP.

source: Configure routes
id: Mengonfigurasi rute

source: In the `IPv4 Settings` and `IPv4 Settings` tabs, click the `Routes` button in the bottom right corner to configure routing settings for a specific IP protocol on an interface. A new dialog will open, allowing you to `Add` a specific route.
id: Pada tab `Pengaturan IPv4` dan `Pengaturan IPv6`, klik tombol `Rute` di pojok kanan bawah untuk mengonfigurasi pengaturan perutean untuk protokol IP tertentu pada sebuah antarmuka. Sebuah dialog baru akan terbuka, memungkinkan Anda untuk `Menambah` rute tertentu.

source: If you confire at least one static route, you can disallow all routes not specifically configured here by enabling the `Ignore automatically obtained routes`.
id: Jika Anda mengonfigurasi setidaknya satu rute statis, Anda dapat menolak semua rute yang tidak dikonfigurasi secara khusus di sini dengan mengaktifkan `Abaikan rute yang diperoleh secara otomatis`.

source: Select `Use this connection only for resources on its network` to prevent this connection from becoming the default route. This option can be selected even if you did not configure any static routes. Enabling this option means that this route will only be used when necessary to access certain resources, such as intranet pages which require a local or VPN connection. Another (default) route will be used for publicly available resources if possible. Note that unlike the additional routes configured in this dialog, this setting will be transferred to the installed system. Also note that this option is only useful when more than one interface is configured.
id: Pilih `Gunakan sambungan ini hanya untuk sumber daya pada jaringan` untuk mencegah sambungan ini menjadi rute default. Pilihan ini dapat dipilih bahkan jika Anda tidak mengkonfigurasi rute statis. Mengaktifkan opsi ini berarti bahwa rute ini hanya akan digunakan bila diperlukan untuk mengakses sumber daya tertentu, seperti halaman intranet yang memerlukan koneksi lokal atau VPN. Rute (default) lain akan digunakan untuk sumber daya yang tersedia untuk umum jika memungkinkan. Perhatikan bahwa tidak seperti rute tambahan yang dikonfigurasi dalam dialog ini, pengaturan ini akan ditransfer ke sistem diinstal. Perhatikan juga bahwa opsi ini hanya berguna bila lebih dari satu antarmuka dikonfigurasi.

source: When you finish configuring the interface's routing settings, click `OK` to return to the configuration dialog.
id: Setelah selesai mengonfigurasi setelan perutean antarmuka, klik `OK` untuk kembali ke dialog konfigurasi.
