Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/_partials/install/StorageSpoke.po
Languages: id, tr

source: First, review the displayed list of available storage devices. The `Reclaimable Space` column shows how much space can be reclaimed from each entry. To reclaim space, select a disk or partition, and press either the `Delete` button to delete that partition (or all partitions on a selected disk), or `Shrink` to use free space on a partition while preserving existing data. Alternatively, you can press `Delete all` in the bottom right corner; this will delete all existing partitions on all disks and make this space available to {PRODUCT}, but all existing data on all disks will be lost.
id: Pertama, tinjau daftar perangkat penyimpanan yang tersedia yang ditampilkan. Kolom `Ruang Yang Dapat Dibebaskan` menunjukkan berapa banyak ruang yang dapat direklamasi dari setiap entri. Untuk mendapatkan kembali ruang, pilih disk atau partisi, dan tekan tombol `Hapus` untuk menghapus partisi itu (atau semua partisi pada disk yang dipilih), atau `Kecilkan` untuk menggunakan ruang kosong pada partisi sambil menjaga data yang ada. Atau, Anda dapat menekan `Hapus semua` di sudut kanan bawah; ini akan menghapus semua partisi yang ada di semua disk dan membuat ruang ini tersedia untuk {PRODUCT}, tetapi seluruh data yang ada di semua disk akan hilang.
tr: İlk olarak, görüntülenen kullanılabilir depolama aygıtları listesini gözden geçirin. `Geri Kazanılabilir Alan` sütunu, her bir ögeden ne kadar alan geri kazanılabileceğini gösterir. Alanı geri kazanmak için bir disk veya bölüm seçin ve bu bölümü (veya seçilen diskteki tüm bölümleri) silmek için `Sil` düğmesine basın, veya mevcut verileri korurken bölüm üzerindeki boş alanı kullanmak için `Küçült` düğmesine basın. Alternatif olarak, sağ alt köşedeki `Tümünü sil`düğmesine basabilirsiniz; bu, tüm disklerdeki tüm bölümleri silecek ve bu alanı {PRODUCT}'nın kullanımına sunacaktır, ancak bütün disklerdeki tüm veriler kaybolacaktır.

source: After you free enough space for your {PRODUCT} installation, press `Reclaim space` to finish.
id: Setelah Anda mengosongkan cukup ruang untuk instalasi {PRODUCT} Anda, tekan `Bebaskan ruang` untuk menyelesaikan.
tr: {PRODUCT} kurulumunuz için yeterli alan boşalttıktan sonra, işlemi bitirmek için `Alanı geri kazan` düğmesine basın.

source: No changes to any disks will be made until you press `Begin Installation` in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary]. The `Reclaim Space` dialog only *marks* partitions for resizing or deletion, but no such action is performed immediately.
id: Tidak ada perubahan pada disk apa pun yang akan dilakukan sampai Anda menekan `Mulai Instalasi` di xref:sect-installation-gui-installation-summary[Ringkasan Instalasi]. Dialog `Bebaskan Ruang` hanya *menandai* partisi untuk mengubah ukuran atau menghapus, tetapi tidak ada tindakan yang dilakukan seketika.
tr: xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Kurulum Özetinde] `Kuruluma Başla` düğmesine basana kadar hiçbir diskte değişiklik yapılmayacaktır. `Disk Alanı Kazan` iletişim penceresi sadece yeniden boyutlandırmak veya silmek için bölümleri *işaretler*, ancak bu tür bir eylem hemen gerçekleştirilmez.

source: If you selected the `I will configure partitioning` option, pressing `Done` will open the `Manual Partitioning` screen. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Manual Partitioning] for further instructions.
id: Jika Anda memilih opsi `Saya akan mengkonfigurasi partisi`, menekan `Selesai` akan membuka layar `Partisi Manual`. Lihat xref:sect-installation-gui-manual-partitioning[Pemartisian Manual] untuk instruksi lebih lanjut.
tr: `Bölümlendirmeyi yapılandıracağım` seçeneğini seçtiyseniz, `Bitti` düğmesine basıldığında `Elle Bölümlendirme` ekranı açılacaktır. Daha fazla yönlendirme için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Elle Bölümlendirme] bölümüne bakın.
