Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/_partials/install/StorageSpoke.po
Languages: id, tr

source: Installation Destination
id: Tujuan Instalasi
tr: Kurulum Hedefi

source: The `Installation Destination` screen allows you to configure storage options - namely, which disks will be used as the installation target for your {PRODUCT} installation. At least one disk must always be selected for the installation to proceed.
id: Layar `Tujuan Instalasi` memungkinkan Anda mengonfigurasi opsi penyimpanan - yaitu, disk mana saja yang akan dipakai sebagai target instalasi untuk instalasi {PRODUCT} Anda. Paling tidak satu disk mesti selalu dipilih agar instalasi dapat berlanjut.
tr: `Kurulum Hedefi` ekranı, depolama seçeneklerini - yani {PRODUCT} kurulumunuz için kurulum hedefi olarak kullanılacak diskleri yapılandırmanıza olanak tanımaktadır. Kurulumun devam edebilmesi için her zaman en az bir disk seçilmelidir.

source: For information about the theory and concepts behind disk partitioning in Linux, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
id: Untuk informasi tentang teori dan konsep di belakang pemartisian disk dalam Linux, lihat xref:sect-installation-gui-manual-partitioning-recommended[Skema Pemartisian yang Direkomendasikan].
tr: Linux'ta disk bölümlendirmenin arkasındaki teori ve kavramlar hakkında bilgi için, xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın.

source: If you plan to use a disk which already contains some data - for example, if you want to shrink an existing Microsoft Windows partition and install {PRODUCT} as a second system or if you are upgrading a previous release of {PRODUCT}, make sure to back up any important data first. Manipulating partitions always carries a risk - if the process is interrupted or fails for any reason (installer error, hardware failure, power outage, etc.), any data already on the disk may become impossible to recover.
id: Jika Anda berencana untuk menggunakan disk yang sudah berisi sebagian data - misalnya, jika Anda ingin mengecilkan partisi Microsoft Windows yang ada dan menginstal {PRODUCT} sebagai sistem kedua atau jika Anda memutakhirkan rilis {PRODUCT} sebelumnya, pastikan untuk membuat cadangan data penting terlebih dahulu. Memanipulasi partisi selalu membawa risiko - jika prosesnya terputus atau gagal karena alasan apa pun (kesalahan penginstal, kegagalan perangkat keras, pemadaman listrik, dll.), data apa pun yang sudah ada di disk bisa menjadi tidak mungkin untuk dipulihkan.
tr: Üzerinde veriler bulunan bir disk kullanmayı planlıyorsanız - örneğin, mevcut bir Microsoft Windows bölümünü küçültmek ve ikinci bir sistem olarak {PRODUCT} kurmak istiyorsanız veya önceki bir {PRODUCT} sürümünü yükseltiyorsanız, ilk olarak önemli verileri yedeklediğinizden emin olun. Bölümleri değiştirmek her zaman bir risk taşır - işlem yarıda kesilir veya herhangi bir nedenle başarısız olursa (kurucu hatası, donanım arızası, elektrik kesintisi vb.), diskte bulunan verilerin kurtarılması imkansız olabilir.

source: The Installation Destination screen. There are two local standard disks available
id: Layar Tujuan Instalasi. Tersedia dua disk standar lokal
tr: Kurulum Hedefi ekranı. Kullanılabilir iki yerel standart disk var

source: In the top part of the screen, all locally available storage devices (SATA, IDE and SCSI hard drives, USB flash drives, etc.) are displayed in the `Local Standard Disks` section. Local disks are detected when the installer starts - any storage devices connected after the installation has started will not be shown.
id: Di bagian atas layar, semua perangkat penyimpanan yang tersedia secara lokal (hard drive SATA, IDE, dan SCSI, USB flash drive, dll.) ditampilkan di bagian `Disk Standar Lokal`. Disk lokal terdeteksi ketika penginstal dimulai - semua perangkat penyimpanan yang terhubung setelah penginstalan dimulai tidak akan ditampilkan.
tr: Ekranın üst kısmında, yerel olarak kullanılabilir tüm depolama aygıtları (SATA, IDE ve SCSI sabit sürücüler, USB flash sürücüler vb.) `Yerel Standart Diskler` bölümünde görüntülenmektedir. Yerel diskler kurucu başlatıldığında algılanmaktadır - kurulum başladıktan sonra bağlanan depolama aygıtları gösterilmeyecektir.

source: If you need to configure additional local storage devices, select `I will configure partitioning` and press `Done` to move to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Manual Partitioning]. Then, connect any new hard drives you want to make available during the installation, and press the button marked by a circular arrow in the set of controls below the list of mount points on the left side of the screen. In the dialog window that opens, press `Rescan Disks` and wait until the scanning process completes. Then, press `OK` to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]; all detected disks including any new ones will be displayed in the `Local Standard Disks` section.
tr: Ek yerel depolama aygıtlarını yapılandırmanız gerekiyorsa, `Bölümlendirmeyi yapılandıracağım` seçeneğini seçin ve xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Elle Bölümlendirme] bölümüne geçmek için `Bitti` düğmesine basın. Ardından, kurulum sırasında kullanılabilir olmasını istediğiniz yeni sabit sürücüleri bağlayın ve ekranın sol tarafındaki bağlama noktaları listesinin altındaki denetimler kümesinde dairesel bir okla işaretlenmiş düğmeye basın. Açılan iletişim penceresinde `Diskleri Yeniden Tara` düğmesine basın ve tarama işlemi tamamlanana kadar bekleyin. Ardından, xref:Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Kurulum Hedefi] bölümüne dönmek için `Tamam` düğmesine basın; yenileri de dahil olmak üzere algılanan tüm diskler `Yerel Standart Diskler` bölümünde görüntülenecektir.

source: The `Specialized & Network Disks` section below shows advanced network storage (such as iSCSI and FCoE disks) currently configured. When you first open this screen, no such devices will be displayed because they can not be automatically detected; to search for network storage devices `Add a disk` button and proceed with xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks]. Any network storage you configure will then show up in the `Specialized & Network Disks` the same way local disks are shown above.
tr: Aşağıdaki `Özelleştirilmiş ve Ağ Diskleri` bölümü, yapılandırılmış olan gelişmiş ağ depolamasını (iSCSI ve FCoE diskleri gibi) göstermektedir. Bu ekranı ilk açtığınızda, otomatik olarak algılanamayacakları için böyle bir aygıt görüntülenmeyecektir; ağ depolama aygıtlarını aramak için `Disk ekle` düğmesine basın ve xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Kurulum Hedefi - Özelleştirilmiş ve Ağ Diskleri] bölümü ile devam edin. Yapılandırdığınız tüm ağ depolama alanları, yerel disklerin yukarıda gösterildiği gibi `Özelleştirilmiş ve Ağ Diskleri` bölümünde görünecektir.

source: All storage devices which will be used to install {PRODUCT} have a black circle icon with a white check mark on them. Disks not marked by this icon will not be used during the installation - they will be ignored if you choose automatic partitioning, and they will not be available in manual partitioning.
id: Semua perangkat penyimpanan yang akan digunakan untuk menginstal {PRODUCT} memiliki ikon lingkaran hitam dengan tanda centang putih. Disk yang tidak ditandai oleh ikon ini tidak akan digunakan selama instalasi - mereka akan diabaikan jika Anda memilih partisi otomatis, dan mereka tidak akan tersedia di partisi manual.
tr: {PRODUCT} kurmak için kullanılacak tüm depolama aygıtları, üzerinde beyaz bir onay işareti bulunan siyah bir daire simgesine sahiptir. Bu simgeyle işaretlenmeyen diskler kurulum sırasında kullanılmayacaktır - otomatik bölümlendirmeyi seçerseniz yok sayılacaktır ve elle bölümlendirmede kullanılamayacaktır.

source: USB storage devices such as flash drives and external disks will be shown in the `Local Standard Disks` as well, and they will be available for selection the same way internal hard drives are. Make sure to *not* select any removable storage as installation targets unless you really want to do so. If you accidentally use a removable drive to install {PRODUCT} and then unplug it, your system will likely become unusable.
id: Perangkat penyimpanan USB seperti flash drive dan disk eksternal akan ditampilkan di `Disk Standar Lokal`, dan mereka akan tersedia untuk pemilihan dengan cara yang sama seperti hard drive internal. Pastikan untuk *tidak* memilih penyimpanan yang dapat dilepas sebagai target instalasi kecuali Anda benar-benar ingin melakukannya. Jika Anda secara tidak sengaja menggunakan drive yang dapat dilepas untuk menginstal {PRODUCT} dan mencabutnya, sistem Anda kemungkinan akan menjadi tidak dapat digunakan.
tr: Flash sürücüler ve harici diskler gibi USB depolama aygıtları da `Yerel Standart Diskler` bölümünde gösterilecek ve dahili sabit disklerle aynı şekilde seçilebileceklerdir. Gerçekten istemediğiniz sürece, kurulum hedefi olarak çıkarılabilir depolama alanı *seçmediğinizden* emin olun. {PRODUCT} kurmak için yanlışlıkla çıkarılabilir bir sürücü kullanır ve sonra onu çıkarırsanız, sisteminiz büyük olasılıkla kullanılamaz hale gelecektir.

source: Unselected and Selected Disk
id: Disk yang Dipilih dan Tidak Dipilih
tr: Seçili Olmayan ve Seçilen Disk

source: Disk selection in the Installation Destination screen. Two disks are displayed; only the one on the right side will be used
id: Pemilihan disk dalam layar Tujuan Instalasi. Dua disk ditampilkan; hanya satu yang di sisi kanan akan dipakai
tr: Kurulum Hedefi ekranındaki disk seçimi. İki disk görüntülenmektedir; sadece sağ taraftaki kullanılacaktır

source: After you select all disks you want to install {PRODUCT}, select one of the two options in the `Other Storage Options` section:
id: Setelah Anda memilih semua disk yang ingin Anda pasangi {PRODUCT}, pilih satu dari dua opsi dalam bagian `Opsi Penyimpanan Lain`:
tr: {PRODUCT} kurmak istediğiniz tüm diskleri seçtikten sonra, `Diğer Depolama Seçenekleri` bölümündeki iki seçenekten birini seçin:

source: `Automatically configure partitioning` - If this option is selected, then after you press `Done` in the top left corner of the screen, the installer will determine the total amount of space on all selected disks, and it will create a _Logical Volume Management_ (LVM) layout suitable for your system. The specifics of this layout depend on whether your system uses BIOS or UEFI firmware, the total amount of free space on your disks, and the amount of RAM on your system (which determines the size of your swap space).
id: `Secara otomatis mengkonfigurasi partisi` - Jika opsi ini dipilih, maka setelah Anda menekan`Selesai` di sudut kiri atas layar, penginstal akan menentukan jumlah total ruang pada semua disk yang dipilih, dan itu akan membuat tata letak _Logical Volume Management_ (LVM) yang cocok untuk sistem Anda. Spesifikasi tata letak ini tergantung pada apakah sistem Anda menggunakan firmware UEFI atau BIOS, jumlah total ruang kosong pada disk Anda, dan jumlah RAM pada sistem Anda (yang menentukan ukuran ruang swap Anda).
tr: `Bölümlendirmeyi otomatik olarak yapılandır` - Bu seçenek seçilirse, ekranın sol üst köşesinde `Bitti` düğmesine bastıktan sonra, kurucu seçilen tüm disklerdeki toplam alan miktarını belirleyecek ve sisteminize uygun bir `Mantıksal Birim Yönetimi_ (LVM) yerleşimi oluşturacaktır. Bu yerleşimin özellikleri, sisteminizin BIOS veya UEFI ürün yazılımı kullanmasına, disklerinizdeki toplam boş alan miktarına ve sisteminizdeki RAM miktarına (takas alanınızın boyutunu belirler) bağlıdır.

source: With automatic partitioning, you can also select the `I would like to make additional space available` option below. Use this option if you want to reclaim space from an existing partitioning layout - for example, if a disk you want to use already contains a different operating system, and you want to make this system's partitions smaller to allow more room for {PRODUCT}. The `Reclaim space` dialog which opens if this option is selected is described later in this section.
id: Dengan pemartisian otomatis, Anda juga dapat memilih opsi `Saya ingin menyediakan ruang tambahan` di bawah. Gunakan opsi ini jika Anda ingin mendapatkan kembali ruang dari tata letak partisi yang ada - misalnya, jika disk yang ingin Anda gunakan sudah berisi sistem operasi yang berbeda, dan Anda ingin membuat partisi sistem ini lebih kecil untuk memberikan lebih banyak ruang untuk {PRODUCT}. Dialog `Bebaskan ruang` yang terbuka jika opsi ini dipilih dijelaskan nanti di bagian ini.
tr: Otomatik bölümlendirme ile birlikte, aşağıdaki `Ek alan sağlamak istiyorum` seçeneğini de seçebilirsiniz. Varolan bir bölümlendirme yerleşiminden alan kazanmak istiyorsanız, örneğin, kullanmak istediğiniz bir diskte zaten farklı bir işletim sistemi varsa ve {PRODUCT} için daha fazla alana yer açmak amacıyla bu sistemin bölümlerini daha küçük hale getirmek istiyorsanız, bu seçeneği kullanın. Bu seçenek belirlenirse açılan `Disk alanı kazan` iletişim penceresi bu bölümün ilerleyen kısımlarında açıklanmaktadır.

source: `I will configure partitioning` - Select this option and press `Done` in the top left corner of the screen to configure your system's partitioning layout manually. This requires some knowledge of the theory behind disk partitions and related concepts, but gives you full control over the way the system will be installed. For instructions for manual partitioning, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Manual Partitioning].
id: `Saya akan mengkonfigurasi partisi` - Pilih opsi ini dan tekan `Selesai` di sudut kiri atas layar untuk mengkonfigurasi tata letak partisi sistem Anda secara manual. Ini membutuhkan pengetahuan tentang teori di balik partisi disk dan konsep terkait, tetapi memberi Anda kontrol penuh atas cara sistem akan diinstal. Untuk instruksi untuk mempartisi manual, lihat xref:sect-installation-gui-manual-partitioning[Pemartisian Manual].
tr: `Bölümlendirmeyi yapılandıracağım` - Sisteminizin bölümlendirme yerleşimini elle yapılandırmak için bu seçeneği seçin ve ekranın sol üst köşesindeki `Bitti` düğmesine basın. Bu, disk bölümlerinin ve ilgili kavramların arkasındaki teori hakkında biraz bilgi gerektirir, ancak sistemin nasıl kurulacağı üzerinde tam denetim sağlamaktadır. Elle bölümlendirme talimatları için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Elle Bölümlendirme] bölümüne bakın.

source: Additionally, you can select `Encrypt my data`pass:attributes[{blank}]; this will encrypt all partitions except the ones needed to boot the system (such as `/boot`) using _Linux Unified Key Setup_ (LUKS). Encrypting your hard drive is recommended. For detailed information about LUKS encryption, see the [citetitle]_{PRODUCT} Security{nbsp}Guide_, available at link:++http://docs.fedoraproject.org/++[].
tr: Ayrıca, `Verilerimi şifrele`pass:attributes[{blank}] seçeneğini de seçebilirsiniz; bu, _Linux Unified Key Setup_ (LUKS) kullanarak sistemi önyüklemek için gerekli olanlar (`/boot` gibi) dışındaki tüm bölümleri şifreleyecektir. Sabit sürücünüzü şifrelemeniz önerilir. LUKS şifrelemesi hakkında ayrıntılı bilgi için, link:++https://docs.fedoraproject.org/++[] adresindeki [citetitle]_{PRODUCT} Güvenlik{nbsp}Kılavuzuna bakın.

source: If you lose the LUKS passphrase, any encrypted partitions and the data on them will become completely inaccessible. There is no way to recover a lost passphrase. However, if you perform a Kickstart installation, you can save encryption passphrases and create backup encryption passphrases during the installation. See xref:../advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart] for information about Kickstart installations.
tr: LUKS parolasını kaybederseniz, şifrelenmiş bölümler ve üzerlerindeki veriler tamamen erişilemez hale gelecektir. Kayıp bir parolayı kurtarmanın bir yolu yoktur. Ancak, bir Kickstart kurulumu gerçekleştirirseniz, kurulum sırasında şifreleme parolalarını kaydedebilir ve yedek şifreleme parolaları oluşturabilirsiniz. Kickstart kurulumları hakkında bilgi için xref:../advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Kickstart ile Kurulumu Otomatikleştirme] bölümüne bakın.

source: To control which one of your selected storage devices will contain the _boot loader_, click the `Full disk summary and bootloader` link in the bottom left corner of the screen, and follow the instructions in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning-bootloader[Boot Loader Installation]. Note that while in most cases it is sufficient to leave the boot loader in the default location, some configurations (for example, systems which require _chain loading_ from another boot loader) will require the boot drive to be specified manually.
tr: Seçili depolama aygıtlarından hangisinin _önyükleyiciyi_ içereceğini belirlemek için, ekranın sol alt köşesindeki `Tam disk özeti ve önyükleyici` bağlantısını tıklayın ve xref:Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning-bootloader[Önyükleyici Kurulumu] bölümündeki talimatları izleyin. Çoğu durumda önyükleyiciyi öntanımlı konumda bırakmak yeterli olsa da, bazı yapılandırmaların (örneğin, başka bir önyükleyiciden _zincirleme yükleme_ gerektiren sistemler) önyükleme sürücüsünün elle belirtilmesini gerektireceğini unutmayın.

source: After you select storage devices, choose between automatic and manual partitioning, configure encryption and boot loader location, press `Done` in the top left corner of the screen. Then, depending on your settings, the following will happen:
id: Setelah Anda memilih perangkat penyimpanan, pilih antara partisi otomatis dan manual, konfigurasikan lokasi enkripsi dan boot loader, tekan `Selesai` di sudut kiri atas layar. Kemudian, tergantung pada pengaturan Anda, hal berikut akan terjadi:
tr: Depolama aygıtlarını seçtikten sonra, otomatik ve elle bölümlendirme arasında tercih yapın, şifrelemeyi ve önyükleyici konumunu yapılandırın, ekranın sol üst köşesindeki `Bitti` düğmesine basın. Ardından, ayarlarınıza bağlı olarak aşağıdakiler gerçekleşecektir:

source: If you chose to encrypt your hard drive, the `Disk Encryption Passphrase` dialog will appear. Enter your chosen passphrase into the `Passphrase` and `Confirm` fields. When you do so, the passphrase will be automatically evaluated and its strength will be displayed, along with suggestions on how to make it stronger if the installer has determined it to be weak. For information about creating strong passwords, see [citetitle]_{PRODUCT} Security{nbsp}Guide_.
id: Jika Anda memilih untuk mengenkripsi hard drive Anda, dialog `Frasa Sandi Enkripsi Disk` akan muncul. Masukkan frasa sandi yang Anda pilih ke dalam bidang `Frasa Sandi` dan` Konfirmasi`. Ketika Anda melakukannya, frasa sandi akan dievaluasi secara otomatis dan kekuatannya akan ditampilkan, bersama dengan saran tentang bagaimana membuatnya lebih kuat jika penginstal telah menilainya lemah. Untuk informasi tentang membuat kata sandi yang kuat, lihat [citetitle]_Panduan{nbsp}Keamanan {PRODUCT}_.
tr: Sabit sürücünüzü şifrelemeyi seçtiyseniz, `Disk Şifreleme Parolası` iletişim penceresi görünecektir. Seçtiğiniz parolayı `Parola` ve `Onayla` alanlarına girin. Bunu yaptığınızda, parola otomatik olarak değerlendirilecek ve kurucu zayıf olduğunu belirlerse, nasıl daha sağlam hale getirileceğine dair önerilerle birlikte sağlamlığı görüntülenecektir. Sağlam parolalar oluşturma hakkında bilgi için, [citetitle]_{PRODUCT} Güvenlik{nbsp}Kılavuzuna_ bakın.

source: If you selected automatic partitioning and the `I would like to make additional space available`, or if there is not enough free space on your selected hard drives to install {PRODUCT}, the `Reclaim Space` dialog will appear. This dialog lists all disk devices you have configured and all partitions on those devices. The bottom right corner of the dialog displays information about how much space the system needs for at least a minimal installation and how much space you have reclaimed.
id: Jika Anda memilih partisi otomatis dan `Saya ingin menyediakan ruang tambahan`, atau jika tidak ada cukup ruang kosong pada hard drive yang Anda pilih untuk menginstal {PRODUCT}, dialog` Bebaskan Ruang` akan muncul. Dialog ini mencantumkan semua perangkat disk yang telah Anda konfigurasi dan semua partisi pada perangkat tersebut. Sudut kanan bawah dialog menampilkan informasi tentang berapa banyak ruang yang dibutuhkan sistem untuk setidaknya instalasi minimal dan berapa banyak ruang yang Anda reklamasi.
tr: Otomatik bölümlendirmeyi ve `Ek alan sağlamak istiyorum` seçeneğini seçtiyseniz, veya seçtiğiniz sabit sürücülerde {PRODUCT} kurmak için yeterli boş alan yoksa, `Disk Alanı Kazan` iletişim penceresi görünecektir. Bu iletişim penceresi, yapılandırdığınız tüm disk aygıtlarını ve bu aygıtlardaki tüm bölümleri listeler. İletişim penceresinin sağ alt köşesinde, sistemin en azından asgari bir kurulum için ne kadar alana ihtiyaç duyduğu ve ne kadar alan geri kazandığınız hakkında bilgiler görüntülenir.

source: If you use the `Reclaim Space` dialog to *delete* a partition, all data on that partition will be lost. If you want to preserve your data, use the `Shrink` option, not the `Delete` option.
id: Bila Anda memakai dialog `Bebaskan Ruang` untuk *menghapus* suatu partisi, semua data pada partisi itu akan hilang. Bila Anda ingin mempertahankan data Anda, gunakan opsi `Perkecil`, bukan opsi `Hapus`.
tr: Bir bölümü *silmek* için `Disk Alanı Kazan` iletişim penceresini kullanırsanız, o bölümdeki tüm veriler kaybolacaktır. Verilerinizi korumak istiyorsanız, `Sil` seçeneğini değil, `Küçült` seçeneğini kullanın.
