Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/CustomSpoke_AddPhysical.po
Languages: id

source: Creating Standard Partitions
id: Membuat Partisi Standar

source: _Standard partitions_ are the most common type of partition, with the widest support across operating systems. For example, Microsoft Windows uses exclusively physical partitions and can not natively work with LVM or Btrfs. Most {PRODUCT} partitioning setups will also require at least one standard partition for the `/boot` directory, and possibly also another standard partition with the BIOS Boot or EFI System file system to store the boot loader.
id: _Partisi standard_ adalah jenis partisi yang paling umum, dengan dukungan terluas di seluruh sistem operasi. Sebagai contoh, Microsoft Windows menggunakan partisi fisik secara eksklusif dan tidak dapat bekerja secara native dengan LVM atau Btrfs. Sebagian besar penyiapan partisi {PRODUCT} juga akan memerlukan setidaknya satu partisi standar untuk direktori `/boot`, dan mungkin juga partisi standar lain dengan sistem berkas boot BIOS atau Sistem EFI untuk menyimpan boot loader.

source: See xref:appendixes/Disk_Partitions.adoc#appe-disk-partitions-overview[An Introduction to Disk Partitions] for additional information about the concepts behind physical partitions.
id: Lihat xref:appendixes/Disk_Partitions.adoc#appe-disk-partitions-overview[Pengenalan ke Partisi Disk] untuk informasi tambahan tentang konsep di balik partisi fisik.

source: Create Standard Partition
id: Membuat Partisi Standar

source: The Manual Partitioning screen
id: Layar Pemartisian Manual

source: Follow the procedure below to create mount points on standard physical partitions:
id: Ikuti prosedur di bawah ini untuk membuat titik kait pada partisi fisik standar:

source: Click the `+` button at the bottom of the list showing existing mount points. A new dialog window will open.
id: Klik tombol `+` di bagian bawah daftar yang menunjukkan titik kait yang ada. Jendela dialog baru akan terbuka.

source: In the new dialog window, specify a mount point for which you want to create a separate mount point - for example, `/`. Optionally, specify a size for the partition using standard units such as MB or GB (for example, `50GB`). Then, click `Add mount point` to add the mount point and return to the main partitioning screen.
id: Di jendela dialog baru, tentukan titik kait yang ingin Anda buat titik kait terpisah - misalnya, `/`. Opsional, tentukan ukuran partisi menggunakan unit standar seperti MB atau GB (misalnya, `50GB`). Kemudian, klik `Tambahkan titik kait` untuk menambahkan titik kait dan kembali ke layar partisi utama.

source: When creating a swap partition, specify the mount point as `swap`. For a BIOS Boot partition, use `biosboot`. For an EFI System Partition, use `/boot/efi`.
id: Saat membuat partisi swap, tentukan titik kait sebagai `swap`. Untuk partisi Boot BIOS, gunakan `biosboot`. Untuk Partisi Sistem EFI, gunakan `/boot/efi`.

source: For information about these partition types, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
id: Untuk informasi tentang tipe-tipe partisi ini, lihat xref:sect-installation-gui-manual-partitioning-recommended[Skema Pemartisian yang Direkomendasikan].

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume. Select the newly created mount point in the left pane to configure it further, and convert it to a physical partition by changing the `Device Type` option to `Standard Partition`. Then, click `Update Settings` in the bottom right corner of the screen.
id: Titik kait sekarang telah dibuat dengan menggunakan pengaturan default, yang berarti telah dibuat sebagai volume logis LVM. Pilih titik kait yang baru dibuat di panel kiri untuk mengonfigurasinya lebih jauh, dan mengubahnya menjadi partisi fisik dengan mengubah pilihan `Tipe Peranti` menjadi `Partisi Standar`. Kemudian, klik `Perbarui Pengaturan` di sudut kanan bawah layar.

source: In the `Device(s)` section on the right side of the screen, you can see that the partition has been assigned to one or more hard drives. Click the `Modify` button to configure on which drive this partition will be created.
id: Di bagian `Peranti` di sisi kanan layar, Anda dapat melihat bahwa partisi telah ditetapkan ke satu atau beberapa hard drive. Klik tombol `Ubah` untuk mengonfigurasi pada drive mana partisi ini akan dibuat.

source: In the `Configure Mount Point` dialog, you can specify which physical devices (disks) this volume *may* reside on. You can select one or more disks which will be used to hold this volume by holding down kbd:[Ctrl] and clicking each disk in the list. If you select multiple disks here, [application]*Anaconda* will determine where exactly the partition should be created based on how you configured the rest of the installation. If you want to make sure that this partition is placed on a specific hard drive, select only that drive and unselect all others.
id: Dalam dialog `Konfigurasi Titik Kait`, Anda dapat menentukan volume ini *boleh* berada di perangkat fisik mana (disk). Anda dapat memilih satu atau lebih disk yang akan digunakan untuk meyimpan volume ini dengan menekan kbd:[Ctrl] dan mengklik setiap disk dalam daftar. Jika Anda memilih beberapa disk di sini, [application]*Anaconda* akan menentukan di mana tepatnya partisi harus dibuat berdasarkan bagaimana Anda mengkonfigurasi sisa instalasi. Jika Anda ingin memastikan bahwa partisi ini ditempatkan pada hard drive tertentu, pilih hanya drive itu dan membatalkan pilihan semua orang lain.

source: After you finish configuring the partition's location, click `Save` to return to the main `Manual Partitioning` screen.
id: Setelah Anda selesai mengkonfigurasi lokasi partisi, klik `Simpan` untuk kembali ke layar utama `Pemartisian Manual`.

source: Configure other settings specific to the partition - its `Mount Point`, `Desired Capacity`, and `File System`. Press `Update Settings` to apply any changes to the configuration.
id: Konfigurasikan pengaturan lain khusus untuk partisi - `Titik Kait`, `Kapasitas yang Diinginkan`, dan `Sistem Berkas`. Tekan `Perbarui Pengaturan` untuk menerapkan perubahan konfigurasi.

source: Repeat this procedure for any additional standard partitions you want to create.
id: Ulangi prosedur ini untuk setiap partisi standar tambahan yang ingin Anda buat.
