Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/CustomSpoke.po
Languages: id, pt_br

source: The exact steps for configuring your storage depend on your specific needs and your system configuration. Procedures for creating specific layouts are described further in this chapter. Before you start, you should also review xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] and xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-advice[Advice on Partitions] for a list of requirements and tips for partitioning your disks for {PRODUCT}.
pt_br: As etapas exatas para configurar seu armazenamento dependem de suas necessidades específicas e da configuração do sistema. Os procedimentos para a criação de layouts específicos são descritos mais adiante neste capítulo. Antes de começar, você também deve revisar o xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de particionamento recomendado] e xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-advice[Conselho sobre partições] para obter uma lista de requisitos e dicas para particionar seus discos para o {PRODUCT}.

source: If no error message is displayed and if you made any changes since the last time you have visited this screen, a summary dialog will appear, displaying a detailed list of the changes you made. Review the list and click `Accept Changes` to proceed with xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary], or click `Cancel & Return to Custom Partitioning` if you want to make any more changes.
pt_br: Se nenhuma mensagem de erro for exibida e se você fez alguma alteração desde a última vez que visitou esta tela, uma caixa de diálogo de resumo aparecerá, exibindo uma lista detalhada das alterações feitas. Revise a lista e clique em `Aceitar mudanças` para prosseguir com xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Resumo da Instalação] ou clique em `Cancelar e retornar para o particionamento personalizado` se quiser fazer mais alterações.
