Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/CustomSpoke_AddLVM.po
Languages: pt_br, tr

source: _Logical Volume Management_ (LVM) presents a simple logical view of underlying physical storage space, such as hard drives or LUNs. Partitions on physical storage are represented as _physical volumes_ that can be grouped together into _volume groups_. Each volume group can be divided into multiple _logical volumes_, each of which is analogous to a standard disk partition. Therefore, LVM logical volumes function as partitions which can span multiple physical disks.
pt_br: Gerenciador de Volume Lógico, ou _Logical Volume Management_ (LVM), apresenta uma visão lógica simples do espaço de armazenamento físico subjacente, como discos rígidos ou LUNs. As partições no armazenamento físico são representadas como _volumes físicos_ que podem ser agrupados em _grupos de volume_. Cada grupo de volume pode ser dividido em vários _volumes lógicos_, cada um dos quais é análogo a uma partição de disco padrão. Portanto, os volumes lógicos LVM funcionam como partições que podem abranger vários discos físicos.
tr: _Mantıksal Birim Yönetimi_ (LVM), sabit diskler veya LUN'lar gibi temelde yatan fiziksel depolama alanının basit bir mantıksal görünümünü sunar. Fiziksel depolama üzerindeki bölümler, _birim grupları_ olarak gruplandırılabilen _fiziksel birimler_ olarak temsil edilir. Her birim grubu, her biri standart bir disk bölümüne benzer olan birden çok _mantıksal birime_ bölünebilir. Bu nedenle LVM mantıksal birimleri, birden çok fiziksel diske yayılabilen bölümler olarak işlev görür.

source: See xref:appendixes/Understanding_LVM.adoc#appe-lvm-overview[Understanding LVM] for additional information about the concepts behind Logical Volume Management.
pt_br: Veja xref:appendixes/Understanding_LVM.adoc#appe-lvm-overview[Entendendo LVM] para obter informações adicionais sobre os conceitos por trás do Gerenciamento de Volume Lógico.
tr: Mantıksal Birim Yönetiminin arkasındaki kavramlar hakkında ek bilgi için xref:appendixes/Understanding_LVM.adoc#appe-lvm-overview[LVM'yi Anlama] bölümüne bakın.

source: Some partition types - notably the `/boot` directory and the BIOS Boot and EFI partitions - can not be placed on logical volumes. Use standard physical volumes for them. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for more information.
pt_br: Alguns tipos de partição - notavelmente o diretório `/boot` e as partições BIOS Boot e EFI – não podem ser colocados em volumes lógicos. Use volumes físicos padrão para eles. Veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de particionamento recomendado] para obter mais informações.

source: Create LVM Logical Volume
pt_br: Criar um volume lógico LVM
tr: LVM Mantıksal Birimi Oluştur

source: The Manual Partitioning screen
pt_br: A tela Particionamento manual
tr: Elle Bölümlendirme ekranı

source: Follow the procedure below to create LVM logical volumes and volume groups.
pt_br: Siga o procedimento abaixo para criar volumes lógicos LVM e grupos de volumes.
tr: LVM mantıksal birimleri ve birim grupları oluşturmak için aşağıdaki adımları izleyin.

source: Creating LVM Logical Volumes and Groups
pt_br: Criando volumes lógicos e grupos LVM
tr: LVM Mantıksal Birimleri ve Grupları Oluşturma

source: Click the `+` button at the bottom of the list showing existing mount points. A new dialog window will open.
pt_br: Clique no botão `+` na parte inferior da lista mostrando os pontos de montagem existentes. Uma nova janela de diálogo será aberta.
tr: Mevcut bağlama noktalarını gösteren listenin altındaki `+` düğmesine tıklayın. Yeni bir iletişim penceresi açılacaktır.

source: In the new dialog window, specify a mount point for which you want to create a separate logical volume - for example, `/`. Optionally, specify a size for the volume using standard units such as MB or GB (for example, `50GB`). Then, click `Add mount point` to add the volume and return to the main partitioning screen.
pt_br: Na nova janela de diálogo, especifique um ponto de montagem para o qual deseja criar um volume lógico separado – por exemplo, `/`. Opcionalmente, especifique um tamanho para o volume usando unidades padrão como MB ou GB (por exemplo, `50 GB`). Em seguida, clique em `Adicionar um ponto de montagem` para adicionar o volume e retornar à tela principal de particionamento.
tr: Yeni iletişim penceresinde, ayrı bir mantıksal birim oluşturmak istediğiniz bir bağlama noktası belirtin - örneğin, `/`. İsteğe bağlı olarak, MB veya GB gibi standart birimler kullanarak birim için bir boyut belirtin (örneğin, `50GB`). Ardından, birimi eklemek ve ana bölümlendirme ekranına geri dönmek için `Bağlama noktası ekle` düğmesine tıklayın.

source: When creating a mount point for swap on LVM, specify the mount point as `swap`.
pt_br: Ao criar um ponto de montagem para swap no LVM, especifique o ponto de montagem como `swap`.
tr: LVM üzerinde takas için bir bağlama noktası oluştururken, bağlama noktasını `swap` olarak belirtin.

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume, and a volume group has been created to contain it. Select the newly created mount point in the left pane to configure it further. If you want to use thin provisioning for this volume, change the `Device Type` option to `LVM Thin Provisioning`.
pt_br: O ponto de montagem agora foi criado usando as configurações padrão, o que significa que foi criado como um volume lógico LVM e um grupo de volume foi criado para contê-lo. Selecione o ponto de montagem recém-criado no painel esquerdo para configurá-lo ainda mais. Se você deseja usar o provisionamento fino para este volume, altere a opção `Tipo de dispositivo` para`Provisionamento LVM fino`.
tr: Bu adımdan sonra bağlama noktası öntanımlı ayarlar kullanılarak, yani bir LVM mantıksal birimi olarak oluşturulur ve onu içermesi için bir birim grubu oluşturulur. Daha fazla yapılandırmak için sol bölmede yeni oluşturulan bağlama noktasını seçin. Bu birim için ince dağıtım (thin provisioning) kullanmak istiyorsanız, `Aygıt Türü` seçeneğini `LVM İnce Dağıtım` olarak değiştirin.

source: In the `Volume Group` menu, you can see that the volume has been assigned to an automatically created volume group, which is named after the {PRODUCT} variant you are installing (for example, `fedora-server`. Click the `Modify` button under the drop-down menu to access the volume group settings.
pt_br: No menu `Grupo de volume`, você pode ver que o volume foi atribuído a um grupo de volume criado automaticamente, que é nomeado após a variante do {PRODUCT} que você está instalando (por exemplo, `fedora-server`. Clique no botão `Modificar` no menu suspenso para acessar as configurações do grupo de volume.
tr: `Birim Grubu` menüsünde, birimin kurduğunuz {PRODUCT} çeşidinin adını taşıyan (örneğin, `fedora-server`) otomatik olarak oluşturulmuş bir birim grubuna atandığını görebilirsiniz. Birim grubu ayarlarına erişmek için açılır menünün altındaki `Değiştir` düğmesine tıklayın.

source: In the `Configure Volume Group` dialog, you can change the volume group's name, its `RAID level` (see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types] for information about available RAID types), and you can also specify which physical devices (disks) this volume group should reside on. You can select one or more disks which will be used to hold this volume group by holding down kbd:[Ctrl] and clicking each disk in the list.
pt_br: Na caixa de diálogo `Configurar grupo de volume`, você pode alterar o nome do grupo de volume, seu `Nível de RAID` (veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Tipos de dispositivos, sistemas de arquivos e RAID] para obter informações sobre os tipos de RAID disponíveis), e você também pode especificar em quais dispositivos físicos (discos) este grupo de volume deve residir. Você pode selecionar um ou mais discos que serão usados para manter este grupo de volume, mantendo pressionado kbd:[Ctrl] e clicando em cada disco na lista.
tr: `Birim Grubunu Yapılandır` iletişim kutusunda birim grubunun adını, `RAID seviyesini` (kullanılabilir RAID türleri hakkında bilgi için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Aygıt, Dosya Sistemi ve RAID Türleri] bölümüne bakın) değiştirebilir ve ayrıca bu birim grubunun hangi fiziksel aygıtların (disklerin) üzerinde bulunması gerektiğini belirtebilirsiniz. Bu birim grubunu tutmak için kullanılacak bir veya daha fazla diski kbd:[Ctrl] tuşuna basılı tutup listedeki her diski tıklayarak seçebilirsiniz.

source: If you select a redundant RAID type (such as `RAID1 (Redundancy)`), the volume group will take up twice its actual size on your disks. A 5 GB volume group with RAID1 will take up 10 GB of space.
pt_br: Se você selecionar um tipo de RAID redundante (como `RAID1 (Redundancy)`), o grupo de volume ocupará o dobro do tamanho real em seus discos. Um grupo de volume de 5 GB com RAID1 ocupará 10 GB de espaço.
tr: Yedekli bir RAID türü seçerseniz (`RAID1 (Yedeklilik)` gibi), disklerinizde birim grubu gerçek boyutunun iki katı kadar yer kaplayacaktır. RAID1 ile 5 GB'lık bir birim grubu 10 GB alan kaplayacaktır.

source: You can also make sure that the volume group is encrypted by selecting the `Encrypt` option; this will enable LUKS encryption for the entire volume group. See the [citetitle]_{PRODUCT} Security Guide_, available at link:++https://docs.fedoraproject.org/++[], for information about LUKS disk encryption.
pt_br: Você também pode ter certeza de que o grupo de volume está criptografado selecionando a opção `Criptografar`; isso habilitará a criptografia LUKS para todo o grupo de volume. Veja o [citetitle]_{PRODUCT} Security Guide_ (guia de segurança), disponível em link:++https://docs.fedoraproject.org/++[], para obter informações sobre criptografia de disco LUKS.
tr: Ayrıca, `Şifrele` seçeneğini seçerek birim grubunun şifrelenmiş olduğundan emin olabilirsiniz; bu, tüm birim grubu için LUKS şifrelemesini etkinleştirecektir. LUKS ile disk şifreleme hakkında bilgi için link:++https://docs.fedoraproject.org/++[] adresindeki [citetitle]_{PRODUCT} Güvenlik Kılavuzuna_ bakın.

source: Additionally, you can set a fixed size for the volume group by selecting the `Fixed` option from the `Size policy` menu and entering a size for the volume group.
pt_br: Além disso, você pode definir um tamanho fixo para o grupo de volume selecionando a opção `Fixo` no menu `Política de tamanho` e inserindo um tamanho para o grupo de volume.
tr: Ek olarak, `Boyut politikası` menüsünden `Sabit` seçeneğini seçerek ve birim grubu için bir boyut girerek birim grubu için sabit bir boyut ayarlayabilirsiniz.

source: After you finish configuring the volume group settings, click `Save` to return to the main `Manual Partitioning` screen.
pt_br: Depois de definir as configurações do grupo de volume, clique em `Salvar` para retornar à tela principal `Particionamento manual`.
tr: Birim grubu ayarlarını yapılandırmayı bitirdikten sonra, ana `Elle Bölümlendirme` ekranına dönmek için `Kaydet` düğmesine tıklayın.

source: The configuration dialog does not allow you to specify the size of the volume group's _physical extents_. The size will always be set to the default value of 4 MiB. If you want to create a volume group with different physical extents, create it manually by switching to an interactive shell and using the [command]#vgcreate# command, or use a Kickstart file with the [command]#volgroup --pesize=pass:attributes[{blank}]_size_pass:attributes[{blank}]# command.
pt_br: A caixa de diálogo de configuração não permite que você especifique o tamanho das _extensões físicas_ do grupo de volume. O tamanho sempre será definido com o valor padrão de 4 MiB. Se você deseja criar um grupo de volume com diferentes extensões físicas, crie-o manualmente alternando para um shell interativo e usando o comando [command]#vgcreate#, ou use um arquivo Kickstart com o comando [command]#volgroup --pesize=pass:attributes[{blank}]_tamanho_pass:attributes[{blank}]#.
tr: Yapılandırma iletişim kutusu, birim grubunun _fiziksel kapsamlarının_ boyutunu belirlemenize izin vermez. Boyut her zaman öntanımlı 4 MiB değerine ayarlanacaktır. Farklı fiziksel kapsamlara sahip bir birim grubu oluşturmak istiyorsanız, etkileşimli bir kabuğa geçerek ve [command]#vgcreate# komutunu kullanarak elle oluşturun veya [command]#volgroup --pesize=pass:attributes[{blank}]_size_pass:attributes[{blank}]# komutuyla bir Kickstart dosyası kullanın.

source: If you need to create more than one volume group, open the `Volume Group` drop-down menu and select the `Create a new volume group` option. A new dialog window will open, identical to the one described in the previous step. Again, select a name, storage devices, encryption settings, RAID level and size policy for the new group, and click `Save`. The new volume group will then become available in the `Volume Group` drop-down menu; you can then go through your existing mount points and change this setting to assign them to a different volume group.
pt_br: Se você precisar criar mais de um grupo de volume, abra o menu suspenso `Grupo de volume` e selecione a opção `Criar um novo grupo de volume`. Uma nova janela de diálogo será aberta, idêntica à descrita na etapa anterior. Novamente, selecione um nome, dispositivos de armazenamento, configurações de criptografia, nível de RAID e política de tamanho para o novo grupo e clique em `Salvar`. O novo grupo de volume ficará disponível no menu suspenso `Grupo de volume`; você pode então percorrer seus pontos de montagem existentes e alterar esta configuração para atribuí-los a um grupo de volume diferente.
tr: Birden fazla birim grubu oluşturmanız gerekiyorsa, `Birim Grubu` açılır menüsünü açın ve `Yeni bir birim grubu oluştur` seçeneğini seçin. Önceki adımda açıklananla aynı olan yeni bir iletişim penceresi açılacaktır. Aynı şekilde, yeni grup için bir ad, depolama aygıtları, şifreleme ayarları, RAID seviyesi ve boyut politikası seçin ve `Kaydet` düğmesine tıklayın. Yeni birim grubu daha sonra `Birim Grubu` açılır menüsünde kullanılabilir hale gelecektir; daha sonra mevcut bağlama noktalarınızın üzerinden geçebilir ve bunları farklı bir birim grubuna atamak için bu ayarı değiştirebilirsiniz.

source: Configure other settings specific to the logical volume - its `Mount Point`, `Desired Capacity`, `File System`, and `Name`. Press `Update Settings` to apply any changes to the configuration.
pt_br: Configure outras configurações específicas para o volume lógico – seu `Ponto de montagem`, `Capacidade desejada`, `Sistemas de arquivos` e `Nome`. Pressione `Atualizar configurações` para aplicar quaisquer alterações às configurações.
tr: Mantıksal birime özgü diğer ayarları yapılandırın - `Bağlama Noktası`, `İstenen Kapasite`, `Dosya Sistemi` ve `Ad`. Değişiklikleri yapılandırmaya uygulamak için `Ayarları Güncelle` düğmesine basın.

source: Repeat this procedure for any additional logical volumes you want to create. Note that when creating additional LVM logical volumes, a new volume group is not automatically created each time; instead, any additional volumes are assigned to an existing group.
pt_br: Repita este procedimento para quaisquer volumes lógicos adicionais que você deseja criar. Observe que, ao criar volumes lógicos LVM adicionais, um novo grupo de volume não é criado automaticamente a cada vez; em vez disso, quaisquer volumes adicionais são atribuídos a um grupo existente.
tr: Oluşturmak istediğiniz ek mantıksal birimler için bu adımları tekrarlayın. Ek LVM mantıksal birimleri oluştururken, her seferinde otomatik olarak yeni bir birim grubu oluşturulmadığını unutmayın; bunun yerine, ek birimler var olan bir gruba atanır.

source: For each mount point you create, review its settings and make sure that it is assigned to the correct group, that it has sufficient capacity, and that it has a descriptive name so you can identify the volume later if you need to.
pt_br: Para cada ponto de montagem que você criar, revise suas configurações e certifique-se de que esteja atribuído ao grupo correto, que tenha capacidade suficiente e que tenha um nome descritivo para que você possa identificar o volume posteriormente, se necessário.
tr: Oluşturduğunuz her bağlama noktası için ayarlarını gözden geçirin ve doğru gruba atandığından, yeterli kapasiteye sahip olduğundan ve gerekirse daha sonra alt birimi tanımlayabilmeniz için açıklayıcı bir ada sahip olduğundan emin olun.

source: Creating a Logical Volume Management (LVM) Layout
tr: Mantıksal Birim Yönetimi (Logical Volume Management - LVM) Düzeni Oluşturma
