Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/CustomSpoke_SoftwareRAID.po
Languages: pt_br

source: Creating Software RAID
pt_br: Criando RAID por software

source: _Redundant arrays of independent disks_ (RAIDs) are constructed from multiple storage devices that are arranged to provide increased performance and, in some configurations, greater fault tolerance. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types] a description of different kinds of RAIDs.
pt_br: _Arranjos redundantes de discos independentes_ (RAIDs) são construídos a partir de vários dispositivos de armazenamento que são organizados para fornecer melhor desempenho e, em algumas configurações, maior tolerância a falhas. Veja em xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Tipos de dispositivos, sistema de arquivos e RAID] uma descrição de diferentes tipos de RAIDs.

source: A RAID device is created in one step, and disks are added or removed as necessary. One RAID partition per physical disk is allowed for each device, so the number of disks available to the installation program determines which levels of RAID device are available to you. For example, if your system has two hard drives, the installation program will not allow you to create a RAID10 device, which requires 4 separate partitions.
pt_br: Um dispositivo RAID é criado em uma etapa e os discos são adicionados ou removidos conforme necessário. Uma partição RAID por disco físico é permitida para cada dispositivo, portanto, o número de discos disponíveis para o programa de instalação determina quais níveis de dispositivo RAID estão disponíveis para você. Por exemplo, se o seu sistema tiver dois discos rígidos, o programa de instalação não permitirá que você crie um dispositivo RAID10, que requer 4 partições separadas.

source: This section only explains how to create software RAID with standard (physical) partitions. However, you can also configure LVM volume groups and Btrfs volumes to use RAID and place their logical volumes or Btrfs subvolumes on top of this RAID array. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Creating a Logical Volume Managament (LVM) Layout] and xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Creating a Btrfs Layout] for instructions on creating RAID in LVM and Btrfs.
pt_br: Esta seção explica apenas como criar RAID por software com partições (físicas) padrão. No entanto, você também pode configurar grupos de volume LVM e volumes Btrfs para usar RAID e colocar seus volumes lógicos ou subvolumes Btrfs no topo desta matriz RAID. Veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Criando um layout de Gerenciamento de Volume Lógico (LVM)] e xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Criando um layout Btrfs] para obter instruções sobre a criação de RAID em LVM e Btrfs.

source: Create Software RAID
pt_br: Criando RAID por software

source: The Manual Partitioning screen
pt_br: A tela Particionamento manual

source: RAID configuration options are only visible if you have selected two or more disks for installation. At least two disks are required to create a RAID device, and some RAID layouts will require more. Requirements for different types of RAID are described in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types].
pt_br: As opções de configuração de RAID só são visíveis se você selecionou dois ou mais discos para instalação. São necessários pelo menos dois discos para criar um dispositivo RAID, e alguns layouts RAID exigirão mais. Requisitos para diferentes tipos de RAID são descritos em xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Tipos de dispositivos, sistemas de arquivos e RAID].

source: Follow the procedure below to create software RAID:
pt_br: Siga o procedimento abaixo para criar RAID por software:

source: Click the `+` button at the bottom of the list showing existing mount points. A new dialog window will open.
pt_br: Clique no botão `+` na parte inferior da lista mostrando os pontos de montagem existentes. Uma nova janela de diálogo será aberta.

source: In the new dialog window, specify a mount point for which you want to create a separate software RAID partition - for example, `/`. Optionally, specify a size for the new partition using standard units such as MB or GB (for example, `50GB`). Then, click `Add mount point` to add the mount point and return to the main partitioning screen.
pt_br: Na nova janela de diálogo, especifique um ponto de montagem para o qual deseja criar uma partição RAID por software separada - por exemplo, `/`. Opcionalmente, especifique um tamanho para a nova partição usando unidades padrão como MB ou GB (por exemplo, `50GB`). Em seguida, clique em `Adicionar um ponto de montagem` para adicionar o ponto de montagem e retornar à tela principal de particionamento.

source: When creating a mount point for swap on software RAID, specify the mount point as `swap`.
pt_br: Ao criar um ponto de montagem para troca em RAID por software, especifique o ponto de montagem como `swap`.

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume. Select the newly created mount point in the left pane to configure it further, and convert it to a software RAID partition by changing the `Device Type` option to `RAID`.
pt_br: O ponto de montagem agora foi criado usando as configurações padrão, o que significa que foi criado como um volume lógico LVM. Selecione o ponto de montagem recém-criado no painel esquerdo para configurá-lo ainda mais e convertê-lo em uma partição RAID de software alterando a opção `Tipo de dispositivo` para `RAID`.

source: Choose a RAID type from the `RAID Level` drop-down menu. Available RAID types and their requirements are described in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types].
pt_br: Escolha um tipo de RAID no menu suspenso `Nível de RAID`. Os tipos de RAID disponíveis e seus requisitos são descritos em xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Tipos de ispositivos, sistemas de arquivos e RAID].

source: In the `Device(s)` section on the right side of the screen, you can see that the partition has been assigned to several physical disks. Click the `Modify` button to configure on which drives this partition will be created.
pt_br: Na seção `Dispositivo(s)` no lado direito da tela, você pode ver que a partição foi atribuída a vários discos físicos. Clique no botão `Modificar` para configurar em quais drives esta partição será criada.

source: In the `Configure Mount Point` dialog, you can specify which physical devices (disks) this partition *may* reside on. You can select one or more disks which will be used to hold this partition by holding down kbd:[Ctrl] and clicking each disk in the list. If you want to make sure that this partition is placed on a specific set of hard drives, select only those drives and unselect all others.
pt_br: Na caixa de diálogo `Configurar ponto de montagem`, você pode especificar em quais dispositivos físicos (discos) esta partição *pode* residir. Você pode selecionar um ou mais discos que serão usados para manter esta partição pressionando kbd:[Ctrl] e clicando em cada disco na lista. Se você deseja ter certeza de que esta partição é colocada em um conjunto específico de discos rígidos, selecione apenas essas unidades e desmarque todas as outras.

source: After you finish configuring the partition's location, click `Save` to return to the main `Manual Partitioning` screen.
pt_br: Após terminar de configurar a localização da partição, clique em `Salvar` para retornar à tela principal `Particionamento manual`.

source: Configure other settings specific to the partition - its `Mount Point`, `Desired Capacity`, and `File System`. Press `Update Settings` to apply any changes to the configuration.
pt_br: Configure outras configurações específicas para a partição – seu `Ponto de montagem`, `Capacidade desejada` e `Sistema de arquivos`. Pressione `Atualizar configurações` para aplicar quaisquer alterações à configuração.

source: Repeat this procedure for any additional standard partitions with software RAID you want to create.
pt_br: Repita este procedimento para quaisquer partições padrão adicionais com RAID por software que deseja criar.
