Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/CustomSpoke.po
Languages: id, pt_br

source: Manual Partitioning
id: Pemartisian Manual
pt_br: Particionamento manual

source: The `Manual Partitioning` screen allows you to create a storage configuration for your {PRODUCT} system manually, giving you a greater control over your system's storage.
id: Layar `Pemartisian Manual` memungkinkan Anda membuat konfigurasi penyimpanan untuk sistem {PRODUCT} secara manual, memberi Anda kontrol lebih besar atas penyimpanan sistem Anda.
pt_br: A tela `Particionamento manual` permite que você crie uma configuração de armazenamento para o seu sistema {PRODUCT} manualmente, dando a você um maior controle sobre o armazenamento do seu sistema.

source: In most other installers for both Linux and other operating systems, disk partitioning usually takes a "bottom-up" approach. In these installers, you first create underlying devices such as LVM physical volumes, then you create a layout such as LVM on top of them, then you create file systems on top of logical volumes, and the last step is usually assigning a mount point to each volume as needed.
id: Dalam kebanyakan installer lain untuk Linux dan sistem operasi lainnya, partisi disk biasanya mengambil pendekatan "bottom-up". Dalam installer ini, Anda pertama kali membuat perangkat yang mendasari seperti volume fisik LVM, lalu Anda membuat tata letak seperti LVM di atas mereka, lalu Anda membuat sistem berkas di atas volume logis, dan langkah terakhir biasanya menetapkan titik kait untuk setiap volume yang diperlukan.

source: [application]*Anaconda* uses an opposite approach. First, you create all separate mount points you need, and everything needed to create them (creating a volume group, logical volumes inside it, and physical volumes where the volume group will reside) is performed automatically. You can then adjust the automatic settings as you require.
id: [application]*Anaconda* menggunakan pendekatan yang berlawanan. Pertama, Anda membuat semua titik kait terpisah yang Anda butuhkan, dan semua yang diperlukan untuk membuatnya (membuat grup volume, volume logis di dalamnya, dan volume fisik di mana grup volume akan berada) dilakukan secara otomatis. Anda kemudian dapat menyesuaikan pengaturan otomatis yang Anda butuhkan.
pt_br: [application]*Anaconda* usa uma abordagem oposta. Primeiro, você cria todos os pontos de montagem separados de que precisa e tudo o que é necessário para criá-los (criando um grupo de volumes, volumes lógicos dentro dele e volumes físicos onde o grupo de volumes residirá) é executado automaticamente. Você pode então ajustar as configurações automáticas conforme necessário.

source: No permanent changes will be made to your disks during the actual partitioning process. The configuration you have selected will only be written to your system after you press the `Begin installation` button in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
id: Tidak ada perubahan permanen akan dibuat untuk disk Anda selama proses partisi yang sebenarnya. Konfigurasi yang telah Anda pilih hanya akan ditulis ke sistem Anda setelah Anda menekan tombol `Mulai instalasi` di xref:sect-installation-gui-installation-summary[Ringkasan Instalasi].

source: The Manual Partitioning screen. At this point
id: Layar Pemartisian Manual. Pada titik ini
pt_br: A tela Particionamento manual. Neste ponto

source: When you first open the `Manual Partitioning` screen, the column on the left side will display all previously existing partitions on all drives which you selected as installation targers in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]. If none of the selected drives contain any existing partitions, then a message informing you that no mount points currently exist will appear.
id: Ketika Anda pertama kali membuka layar `Pemartisian Manual`, kolom di sisi kiri akan menampilkan semua partisi yang sudah ada sebelumnya di semua drive yang Anda pilih sebagai target instalasi di xref:sect-installation-gui-storage-partitioning[Tujuan Instalasi]. Jika tidak ada drive yang dipilih yang berisi partisi yang ada, maka akan muncul pesan yang memberitahukan Anda bahwa tidak ada titik kait yang saat ini ada.

source: Here, you can choose a partitioning scheme such as `LVM` or `BTRFS` and click the `Click here to create them automatically` to prompt the installer to create a basic partitioning layout; this layout follows the guidelines described in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme]. The created layout is a basic layout where partition/volume sizes are determined automatically based on the total amount of available space.
id: Di sini, Anda dapat memilih skema partisi seperti `LVM` atau `BTRFS` dan klik `Klik di sini untuk membuatnya secara otomatis` untuk meminta installer untuk membuat tata letak partisi dasar; tata letak ini mengikuti panduan yang dijelaskan dalam xref:sect-installation-gui-manual-partitioning-recommended[Skema Partisi Yang Direkomendasikan]. Tata letak yang dibuat adalah tata letak dasar di mana ukuran partisi/volume ditentukan secara otomatis berdasarkan jumlah total ruang yang tersedia.

source: Click the `+` button to add a mount point. In the dialog window that opens, choose a mount point such as `/` or `/home`, and the desired capacity for the mount point (such as `10GB` or `500MB`). Note that specifying the mount point is mandatory, but you do not have to specify the capacity at this point; this is useful when adding a mount point which you want to make larger than the current available space permits. Then, click `Add mount point` to add it to the list using the default settings, which means it will be created as a logical volume, and a new volume group will be created for it unless one already exists.
id: Klik tombol `+` untuk menambahkan titik kait. Pada jendela dialog yang terbuka, pilih titik kait seperti `/` atau `/home`, dan kapasitas yang diinginkan untuk titik kait (seperti `10GB` atau `500MB`). Perhatikan bahwa menentukan titik kait wajib, tetapi Anda tidak perlu menentukan kapasitas pada titik ini; ini berguna saat menambahkan titik kait yang ingin Anda buat lebih besar dari izin ruang yang tersedia saat ini. Kemudian, klik `Tambahkan titik kait` untuk menambahkannya ke daftar menggunakan pengaturan default, yang berarti akan dibuat sebagai volume logis, dan grup volume baru akan dibuat untuk itu kecuali bila sudah ada.
pt_br: Clique no botão `+` para adicionar um ponto de montagem. Na janela de diálogo que se abre, escolha um ponto de montagem, como `/` ou `/home`, e a capacidade desejada para o ponto de montagem (como `10 GB` ou `500 MB`). Observe que especificar o ponto de montagem é obrigatório, mas você não precisa especificar a capacidade neste ponto; isso é útil ao adicionar um ponto de montagem que você deseja tornar maior do que o espaço disponível atual permite. Em seguida, clique em `Adicionar um ponto de montagem` para adicioná-lo à lista usando as configurações padrão, o que significa que ele será criado como um volume lógico e um novo grupo de volume será criado para ele, a menos que já exista um.

source: Then, select the newly created mount point in the list on the left side. A set of controls will display on the right side of the screen, allowing you to change its mount point, the device on which it will physically reside, its capacity, file system, etc. When you change any settings, press `Update Settings` on the bottom right. This will save the adjusted configuration; you can now create another mount point, or select a different existing one and adjust its settings as well.
id: Kemudian, pilih titik kait yang baru dibuat dalam daftar di sebelah kiri. Satu set kontrol akan ditampilkan di sisi kanan layar, memungkinkan Anda untuk mengubah titik kait, perangkat yang secara fisik akan ditempati, kapasitas, sistem berkas, dll. Ketika Anda mengubah pengaturan, tekan `Perbarui Pengaturan` di kanan bawah. Ini akan menyimpan konfigurasi yang disesuaikan; Anda sekarang dapat membuat titik kait lain, atau memilih yang ada yang berbeda dan menyesuaikan pengaturannya juga.
pt_br: Em seguida, selecione o ponto de montagem recém-criado na lista do lado esquerdo. Um conjunto de controles será exibido no lado direito da tela, permitindo que você altere seu ponto de montagem, o dispositivo no qual ele residirá fisicamente, sua capacidade, sistema de arquivos, etc. Quando você alterar qualquer configuração, pressione `Atualizar configurações` no canto inferior direito. Isso salvará a configuração ajustada; agora você pode criar outro ponto de montagem ou selecionar um ponto existente diferente e ajustar suas configurações também.

source: For a description of available device and file system types, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types].
id: Untuk keterangan tentang jenis sistem berkas dan perangkat yang tersedia, lihat xref:sect-installation-gui-manual-partitioning-filesystems[Perangkat, Sistem Berkas, dan Tipe RAID].

source: To remove a mount point, select it in the list and press the `-` button below.
id: Untuk menghapus titik kait, pilih dalam daftar dan tekan tombol `-` di bawah.
pt_br: Para remover um ponto de montagem, selecione-o na lista e pressione o botão `-` abaixo.

source: The exact steps for configuring your storage depend on your specific needs and your system configuration. Procedures for creating specific layouts are described further in this chapter. Before you start, you should also review xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] and xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-advice[Advice on Partitions] for a list of requirements and tips for partitioning your disks for {PRODUCT}.
id: Langkah yang tepat untuk mengonfigurasi penyimpanan Anda bergantung pada kebutuhan khusus dan konfigurasi sistem Anda. Prosedur untuk membuat tata letak tertentu dijelaskan lebih lanjut dalam bab ini. Sebelum memulai, Anda juga harus meninjau xref:sect-installation-gui-manual-partitioning-recommended[Skema Partisi Yang Direkomendasikan] dan xref:sect-installation-gui-manual-partitioning-advice[Saran tentang Partisi] untuk daftar kebutuhan dan tips untuk partisi disk Anda bagi {PRODUCT}.

source: Below the list of existing mount points are two fields, showing you how much free space is left on your storage devices and how much total space they have.
id: Di bawah daftar titik kait yang ada adalah dua ruas, menunjukkan berapa banyak ruang kosong yang tersisa di perangkat penyimpanan Anda dan berapa banyak ruang total yang mereka miliki.
pt_br: Embaixo da lista de pontos de montagem existentes, há dois campos, mostrando quanto espaço livre resta em seus dispositivos de armazenamento e quanto espaço total eles possuem.

source: Click the `pass:attributes[{blank}]_X_ storage devices selected` to view a summary of currently selected storage devices; this may help you with orientation in more complicated storage schemas. Devices displayed here are the ones you have selected in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]. If you want to add or remove any storage devices from your configuration, return to that screen and change your selection.
id: Klik `pass:attributes[{blank}]_XX_ perangkat penyimpanan yang dipilih` untuk melihat ringkasan perangkat penyimpanan yang saat ini dipilih; ini dapat membantu Anda dengan orientasi dalam skema penyimpanan yang lebih rumit. Perangkat yang ditampilkan di sini adalah orang yang telah Anda pilih di xref:sect-installation-gui-storage-partitioning[Tujuan Instalasi]. Jika Anda ingin menambahkan atau menghapus perangkat penyimpanan dari konfigurasi, kembali ke layar tersebut dan ubah pilihan Anda.
pt_br: Clique em `pass:attributes[{blank}]_X_ dispositivos de armazenamento selecionados` para ver um resumo dos dispositivos de armazenamento selecionados atualmente; isso pode ajudá-lo com orientação em esquemas de armazenamento mais complicados. Os dispositivos exibidos aqui são aqueles que você selecionou em xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Destino da instalação]. Se você deseja adicionar ou remover qualquer dispositivo de armazenamento de sua configuração, volte para aquela tela e mude sua seleção.

source: You can press the `Reset All` button in the bottom right corner at any time to reset the storage configuration to the state it was in when you last opened the `Manual Partitioning` screen. This means that if you modify the storage configuration, leave the screen, and then come back, the Reset button will reset the configuration back to the already modified state, discarding only the changes you have made recently, not all changes to the storage configuration since you booted the installer.
id: Anda dapat menekan tombol `Reset Semua` di sudut kanan bawah setiap saat untuk me-reset konfigurasi penyimpanan ke keadaan ketika Anda terakhir membuka layar `Pemartisian Manual`. Ini berarti bahwa jika Anda memodifikasi konfigurasi penyimpanan, meninggalkan layar, dan kemudian kembali, tombol reset akan me-reset konfigurasi kembali ke keadaan yang sudah dimodifikasi, membuang hanya perubahan yang telah Anda buat baru-baru ini, bukan semua perubahan konfigurasi penyimpanan sejak Anda mem-boot installer.
pt_br: Você pode pressionar o botão `Redefinir tudo` no canto inferior direito a qualquer momento para redefinir a configuração de armazenamento para o estado em que estava quando você abriu a tela `Particionamento manual` pela última vez. Isso significa que se você modificar a configuração de armazenamento, sair da tela e voltar, o botão Redefinir irá redefinir a configuração de volta ao estado já modificado, descartando apenas as alterações feitas recentemente, nem todas as alterações na configuração de armazenamento desde você inicializou o instalador.

source: To discard all changes, and to also detect any new drives which have not been detected when the installer started (usually when you attached a new drive after you started), press the button marked by a circular arrow in the set of controls below the list of mount points on the left side of the screen. In the dialog window that opens, press `Rescan Disks` and wait until the scanning process completes. Then, press `OK` to return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]; all detected disks including any new ones will be displayed in the `Local Standard Disks` section.
id: Untuk membuang semua perubahan, dan juga mendeteksi setiap drive baru yang belum terdeteksi ketika installer mulai (biasanya ketika Anda melampirkan drive baru setelah Anda mulai), tekan tombol ditandai dengan panah melingkar di set kontrol di bawah daftar titik pasang di sisi kiri layar. Pada jendela dialog yang terbuka, tekan `Pindai Ulang Disk` dan tunggu sampai proses pemindaian selesai. Kemudian, tekan `OK` untuk kembali ke xref:sect-installation-gui-storage-partitioning[Tujuan Instalasi]; Semua disk yang terdeteksi termasuk yang baru akan ditampilkan di bagian `Disk Standar Lokal`.
pt_br: Para descartar todas as alterações e também detectar quaisquer novas unidades que não tenham sido detectadas quando o instalador foi iniciado (geralmente quando você anexou uma nova unidade depois de iniciar), pressione o botão marcado por uma seta circular no conjunto de controles abaixo da lista de pontos de montagem no lado esquerdo da tela. Na janela de diálogo que se abre, pressione `Nova varredura de discos` e aguarde até que o processo de digitalização seja concluído. Então, pressione `OK` para retornar ao xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Destino da instalação]; todos os discos detectados, incluindo os novos, serão exibidos na seção `Discos padrão locais`.

source: Rescan Disks
id: Pindai Ulang Disk
pt_br: Nova varredura de discos

source: The Rescan Disks dialog
id: Dialog Pindai Ulang Disk
pt_br: A caixa de diálogo Nova varredura de discos

source: After you finish configuring your system storage, press `Done` in the top left corner to save the configuration and return to the `Installation Summary` screen. At this point, the installer will check if your storage configuration is valid. If an error was detected, a message will be displayed at the bottom of the screen. Click the message to open a dialog window explaining what kind of error has been detected (for example, you put `/boot` on a Btrfs subvolume, or you did not create a BIOS Boot partition when your system requires one).
id: Setelah Anda selesai mengonfigurasi penyimpanan sistem Anda, tekan `Selesai` di pojok kiri atas untuk menyimpan konfigurasi dan kembali ke layar `Ringkasan Instalasi`. Pada titik ini, penginstal akan memeriksa apakah konfigurasi penyimpanan Anda valid. Jika kesalahan terdeteksi, pesan akan ditampilkan di bagian bawah layar. Klik pesan untuk membuka jendela dialog yang menjelaskan apa jenis kesalahan telah terdeteksi (misalnya, Anda menempatkan `/boot` pada subvolume Btrfs, atau Anda tidak membuat partisi boot BIOS ketika sistem Anda membutuhkannya).
pt_br: Depois de terminar de configurar o armazenamento do sistema, pressione `Pronto` no canto superior esquerdo para salvar a configuração e retornar à tela `Resumo da Instalação`. Neste ponto, o instalador verificará se sua configuração de armazenamento é válida. Se um erro for detectado, uma mensagem será exibida na parte inferior da tela. Clique na mensagem para abrir uma janela de diálogo explicando que tipo de erro foi detectado (por exemplo, você colocou `/boot` em um subvolume Btrfs ou não criou uma partição de inicialização do BIOS quando seu sistema requer uma).

source: If such a message is displayed, go back and fix any issues found by the installer; otherwise you will not be able to proceed with the installation. You can also press `Done` again to return to the `Installation Summary` anyway, but a storage configuration error will prevent you from starting the actual installation process.
id: Jika pesan tersebut ditampilkan, kembali dan perbaiki masalah yang ditemukan oleh penginstal; jika tidak, Anda tidak akan dapat melanjutkan dengan instalasi. Anda juga dapat menekan `Selesai` lagi untuk kembali ke `Ringkasan Instalasi` pula, tetapi kesalahan konfigurasi penyimpanan akan mencegah Anda dari memulai proses instalasi yang sebenarnya.
pt_br: Se tal mensagem for exibida, volte e corrija quaisquer problemas encontrados pelo instalador; caso contrário, você não poderá prosseguir com a instalação. Você também pode pressionar `Pronto` novamente para retornar ao `Resumo da Instalação` de qualquer maneira, mas um erro de configuração de armazenamento o impedirá de iniciar o processo de instalação real.

source: If no error message is displayed and if you made any changes since the last time you have visited this screen, a summary dialog will appear, displaying a detailed list of the changes you made. Review the list and click `Accept Changes` to proceed with xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary], or click `Cancel & Return to Custom Partitioning` if you want to make any more changes.
id: Jika tidak ada pesan kesalahan ditampilkan dan jika Anda membuat perubahan sejak terakhir kali Anda mengunjungi layar ini, dialog ringkasan akan muncul, menampilkan daftar detail perubahan yang Anda buat. Tinjau daftar dan klik `Terima Perubahan` untuk melanjutkan dengan xref:sect-installation-gui-installation-summary[Ringkasan Instalasi], atau klik `Batalkan & Kembali ke Pemartisian Ubahan` jika Anda ingin membuat perubahan lagi.

source: No permanent changes will be made to your disks during the actual partitioning process. The configuration you have selected will only be written to your system after you press the `Begin installation` button in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
pt_br: Nenhuma mudança permanente será feita em seus discos durante o processo de particionamento real. A configuração que você selecionou só será gravada em seu sistema após você pressionar o botão `Iniciar a instalação` em xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Resumo da Instalação].

source: When you first open the `Manual Partitioning` screen, the column on the left side will display all previously existing partitions on all drives which you selected as installation targets in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]. If none of the selected drives contain any existing partitions, then a message informing you that no mount points currently exist will appear.
pt_br: Quando você abre a tela `Particionamento manual` pela primeira vez, a coluna do lado esquerdo exibirá todas as partições existentes anteriormente em todas as unidades que você selecionou como alvos de instalação em xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Destino da instalação]. Se nenhuma das unidades selecionadas contiver partições existentes, será exibida uma mensagem informando que nenhum ponto de montagem existe no momento.

source: Here, you can choose a partitioning scheme such as `LVM` or `BTRFS` and click the `Click here to create them automatically` to prompt the installer to create a basic partitioning layout; this layout follows the guidelines described in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme]. The created layout is a basic layout where partition/volume sizes are determined automatically based on the total amount of available space.
pt_br: Aqui, você pode escolher um esquema de particionamento como `LVM` ou` BTRFS` e clicar em `Clicar aqui para criá-los automaticamente` para solicitar ao instalador que crie um layout de particionamento básico; este layout segue as diretrizes descritas em xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de particionamento recomendado]. O layout criado é um layout básico onde os tamanhos de partição/volume são determinados automaticamente com base na quantidade total de espaço disponível.

source: For a description of available device and file system types, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types].
pt_br: Para obter uma descrição dos tipos de dispositivos e sistemas de arquivos disponíveis, consulte xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Tipos de dispositivos, sistemas de arquivos e RAID].
