Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/CustomSpoke_FileSystems.po
Languages: tr

source: Device, File System and RAID Types
tr: Aygıt, Dosya Sistemi ve RAID Türleri

source: {PRODUCT} supports multiple types of devices and file systems. The lists below offer a short description of each available device, file system and RAID type and notes on their usage.
tr: {PRODUCT}, birden çok aygıt türünü ve dosya sistemini desteklemektedir. Aşağıdaki listeler, kullanılabilir her aygıtın, dosya sisteminin ve RAID türünün kısa bir açıklamasını ve bunların kullanımıyla ilgili notları sunar.

source: To select a device type or a file system of a partition or a logical volume, select it in the list in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Manual Partitioning] and select a `Device Type` and a `File System` from their respective drop-down menus on the right side of the screen. Then, click `Update Settings` and repeat this process for all mount points you want to modify.
tr: Bir bölümün veya mantıksal birimin aygıt türünü veya dosya sistemini seçmek için, onu xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Elle Bölümlendirme] bölümündeki listeden seçin ve ekranın sağ tarafındaki ilgili açılır menülerinden bir `Aygıt Türü` ve bir `Dosya Sistemi` seçin. Ardından, `Ayarları Güncelle` düğmesine tıklayın ve değiştirmek istediğiniz tüm bağlama noktaları için bu işlemi tekrarlayın.

source: To configure software RAID, make sure that you have enough physical hard drives selected as installation targets (the number of separate drives required for each type of RAID is noted in its description). Then, choose a RAID level when creating or modifying a Btrfs volume or LVM volume group, or select `Software RAID` as the device type to create software RAID with standard partitions. For detailed instructions, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Creating a Btrfs Layout], xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Creating a Logical Volume Management (LVM) Layout], and xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-swraid[Creating Software RAID] as needed.
tr: Yazılımsal RAID yapılandırmak için, kurulum hedefleri olarak seçilmiş yeterli fiziksel sabit diskinizin olduğundan emin olun (her RAID türü için gereken ayrı disk sayısı açıklamasında belirtilmiştir). Ardından, bir Btrfs birimi veya LVM birim grubu oluştururken veya değiştirirken bir RAID seviyesi seçin veya standart bölümlere sahip yazılımsal RAID oluşturmak için aygıt türü olarak `Yazılımsal RAID` seçin. Ayrıntılı talimatlar için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Btrfs Düzeni Oluşturma], xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Mantıksal Birim Yönetimi (Logical Volume Management - LVM) Düzeni Oluşturma] ve xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-swraid[Yazılımsal RAID Oluşturma] bölümlerine bakın.

source: Device Types
tr: Aygıt Türleri

source: `Standard Partition` - A standard partition can contain a file system or swap space. Standard partitions are most commonly used for `/boot` and the BIOS Boot and EFI System partitions. LVM logical volumes or Btrfs subvolumes are recommended for most other uses. See xref:appendixes/Disk_Partitions.adoc#appe-disk-partitions-overview[An Introduction to Disk Partitions] for additional information about the concepts behind physical partitions.
tr: `Standart Bölüm` - Standart bir bölüm bir dosya sistemi veya takas alanı içerebilir. Standart bölümler en çok `/boot` ve BIOS Önyükleme ve EFI Sistem bölümleri için kullanılır. Diğer birçok kullanım için LVM mantıksal birimleri veya Btrfs alt birimleri tavsiye edilir. Fiziksel bölümlerin arkasındaki kavramlar hakkında ek bilgi için xref:appendixes/Disk_Partitions.adoc#appe-disk-partitions-overview[Disk Bölümlerine Giriş] bölümüne bakın.

source: `LVM` - Choosing `LVM` as the `Device Type` creates an LVM logical volume and a volume group to contain it (unless one already exists, in which case the new volume is assigned to the existing group). LVM can improve performance when using physical disks and allows you to use multiple disks for a single mount point. For information on how to create a logical volume, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Creating a Logical Volume Management (LVM) Layout]. Also see xref:appendixes/Understanding_LVM.adoc#appe-lvm-overview[Understanding LVM] for some additional information about LVM in general.
tr: `LVM` - `Aygıt Türü` olarak `LVM` seçilmesi, bir LVM mantıksal birimi ve onu içerecek bir birim grubu oluşturur (zaten bir tane varsa birim grubu oluşturulmaz, bu durumda yeni birim mevcut gruba atanır). LVM, fiziksel diskler kullanırken performansı artırabilir ve tek bir bağlama noktası için birden çok disk kullanmanıza izin verir. Mantıksal birim oluşturma hakkında bilgi için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Mantıksal Birim Yönetimi (Logical Volume Management - LVM) Düzeni Oluşturma] bölümüne bakın. Ayrıca genel olarak LVM hakkında bazı ek bilgiler için xref:appendixes/Understanding_LVM.adoc#appe-lvm-overview[LVM'yi Anlama] bölümüne bakın.

source: `LVM Thin Provisioning` - Using thin provisioning, you can manage a storage pool of free space, known as a _thin pool_, which can be allocated to an arbitrary number of devices when needed by applications. The thin pool can be expanded dynamically when needed for cost-effective allocation of storage space.
tr: `LVM İnce Dağıtım` - İnce dağıtım kullanarak, uygulamalar tarafından ihtiyaç duyulduğunda herhangi bir sayıda aygıta tahsis edilebilen, ince havuz olarak bilinen bir boş depolama alanı havuzunu yönetebilirsiniz. İnce havuz, depolama alanının etkili bir şekilde tahsisi için gerektiğinde dinamik olarak genişletilebilir.

source: `RAID` - Creating two or more software RAID partitions allows you to create a software RAID device. One RAID partition is assigned to each disk on the system. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-swraid[Creating Software RAID] for instructions on creating software RAID.
tr: `RAID` - İki veya daha fazla yazılımsal RAID bölümü oluşturmak, bir yazılımsal RAID aygıtı oluşturmanıza olanak sağlar. Sistemdeki her diske bir RAID bölümü atanır. Yazılımsal RAID oluşturmayla ilgili talimatlar için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-swraid[Yazılımsal RAID Oluşturma] bölümüne bakın.

source: `BTRFS` - Btrfs is a file system with several device-like features. It is capable of addressing and managing more files, larger files, and larger volumes than the ext2, ext3, and ext4 file systems. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Creating a Btrfs Layout] for more information about creating Btrfs volumes.
tr: `BTRFS` - Btrfs, çeşitli aygıt benzeri özelliklere sahip bir dosya sistemidir. ext2, ext3 ve ext4 dosya sistemlerinden daha fazla dosyayı, daha büyük dosyaları ve daha büyük birimleri adresleme ve yönetme yeteneğine sahiptir. Btrfs birimleri oluşturma hakkında daha fazla bilgi için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Btrfs Düzeni Oluşturma] bölümüne bakın.

source: File Systems
tr: Dosya Sistemleri

source: `ext4` - The ext4 file system is based on the ext3 file system and features a number of improvements. These include support for larger file systems and larger files, faster and more efficient allocation of disk space, no limit on the number of subdirectories within a directory, faster file system checking, and more robust journaling. Ext4 is the default and recommended file system used by {PRODUCT} Workstation and Cloud. The maximum supported size of a single ext4 file system is 50 TB.
tr: `ext4` - ext4 dosya sistemi ext3 dosya sistemini temel alır ve daha büyük dosya sistemleri ve daha büyük dosyalar için desteği, daha hızlı ve daha verimli disk alanı tahsisini, bir dizin içindeki alt dizinlerin sayısında sınırlama olmamasını, daha hızlı dosya sistemi denetimini ve daha sağlam günlük tutmayı içeren bir dizi iyileştirme getirir. ext4, {PRODUCT} Workstation ve Cloud tarafından kullanılan öntanımlı ve tavsiye edilen dosya sistemidir. Tek bir ext4 dosya sisteminin desteklenen azami boyutu 50 TB'tır.

source: `ext3` - The ext3 file system is based on the ext2 file system and has one main advantage - journaling. Using a journaling file system reduces time spent recovering a file system after a crash, as there is no need to check the file system for metadata consistency by running the [command]#fsck# utility every time a crash occurs.
tr: `ext3` - ext3 dosya sistemi ext2 dosya sistemine dayanır ve bir önemli artısı vardır - günlük tutma. Her çökme oluştuğunda [command]#fsck# programını çalıştırarak dosya sistemini üst veri tutarlılığı açısından denetlemeye gerek olmadığından, günlük tutan bir dosya sistemi kullanmak bir çökme sonrasında dosya sistemini kurtarmak için harcanan zamanı azaltır.

source: `ext2` - An ext2 file system supports standard Unix file types, including regular files, directories, or symbolic links. It provides the ability to assign long file names, up to 255 characters.
tr: `ext2` - Bir ext2 dosya sistemi normal dosyalar, dizinler veya sembolik bağlantılar dahil olmak üzere standart Unix dosya türlerini destekler. 255 karaktere kadar uzun dosya adları atama imkanı sağlar.

source: `swap` - Swap partitions are used to support virtual memory. In other words, data is written to a swap partition when there is not enough RAM to store the data your system is processing. A swap partition should always be created; see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for details such as the recommended size.
tr: `swap` - Takas bölümleri sanal belleği desteklemek için kullanılır. Başka bir deyişle, sisteminizin işlediği verileri depolamak için yeterli RAM olmadığında veriler bir takas bölümüne yazılır. Her zaman bir takas bölümü oluşturulmalıdır; tavsiye edilen boyut gibi ayrıntılar için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın.

source: `xfs` - XFS is a highly scalable, high-performance file system that supports file systems up to 16 exabytes (approximately 16 million terabytes), files up to 8 exabytes (approximately 8 million terabytes), and directory structures containing tens of millions of entries. XFS also supports metadata journaling, which facilitates quicker crash recovery. The maximum supported size of a single XFS file system is 500 TB. Starting with {PRODUCT}{nbsp}22, XFS is the default and recommended file system on {PRODUCT} Server.
tr: `xfs` - XFS, 16 eksabayta (yaklaşık 16 milyon terabayt) kadar olan dosya sistemlerini, 8 eksabayta (yaklaşık 8 milyon terabayt) kadar olan dosyaları ve on milyonlarca girdi içeren dizin yapılarını destekleyen, oldukça iyi ölçeklenebilir, yüksek performanslı bir dosya sistemidir. XFS ayrıca, çökme durumunda daha hızlı kurtarmayı kolaylaştıran üst veri günlük kaydını destekler. Tek bir XFS dosya sisteminin desteklenen azami boyutu 500 TB'tır. {PRODUCT}{nbsp}22 ile başlayarak XFS, {PRODUCT} Server için öntanımlı ve tavsiye edilen dosya sistemidir.

source: Note that the size of an XFS file system cannot currently be reduced without destroying and recreating the file system. If you expect that you will need to adjust the sizes of your file systems often, using XFS is not recommended, as it makes administration substantially more time-consuming.
tr: Bir XFS dosya sisteminin boyutunun şu anda dosya sistemini yok etmeden ve yeniden oluşturmadan azaltılamayacağını unutmayın. Dosya sistemlerinizin boyutlarını sık sık ayarlamanız gerekeceğini düşünüyorsanız, yönetimi önemli ölçüde daha fazla zaman alıcı hale getirdiğinden XFS kullanılması tavsiye edilmez.

source: `vfat` - The VFAT file system is a Linux file system that is compatible with Microsoft Windows long file names on the FAT file system.
tr: `vfat` - VFAT dosya sistemi, FAT dosya sisteminde Microsoft Windows uzun dosya adlarıyla uyumlu bir Linux dosya sistemidir.

source: `BIOS Boot` - A very small partition required for booting from a device with a GUID partition table (GPT) on BIOS systems and UEFI systems in BIOS compatibility mode. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for details.
tr: `BIOS Önyükleme` - BIOS sistemlerinde GUID bölümlendirme tablosu (GUID partition table - GPT) bulunan bir aygıttan ve BIOS uyumluluk modundaki UEFI sistemlerinde önyükleme yapmak için gereken çok küçük bir bölüm. Ayrıntılar için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın.

source: `EFI System Partition` - A small partition required for booting a device with a GUID partition table (GPT) on a UEFI system. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for details.
tr: `EFI Sistem Bölümü` - Bir UEFI sisteminde GUID bölümlendirme tablosu (GPT) olan bir aygıtı önyüklemek için gerekli küçük bir bölüm. Ayrıntılar için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın.

source: Software RAID Types
tr: Yazılımsal RAID Türleri

source: `RAID0 (Performance)` - Distributes data across multiple disks. Level 0 RAID offers increased performance over standard partitions and can be used to pool the storage of multiple disks into one large virtual device. Note that Level 0 RAIDs offer no redundancy and that the failure of one device in the array destroys data in the entire array. RAID 0 requires at least two disks.
tr: `RAID0 (Performans)` - Verileri birden çok diske dağıtır. Seviye 0 RAID, standart bölümlere göre daha yüksek performans sunar ve birden çok diskin depolamasını tek bir büyük sanal aygıtta toplamak için kullanılabilir. Seviye 0 RAID'lerin yedeklilik sağlamadığını ve dizideki bir aygıtın arızalanmasının tüm dizideki verileri yok ettiğini unutmayın. RAID 0, en az iki disk gerektirir.

source: `RAID1 (Redundancy)` - Mirrors all data from one partition onto one or more other disks. Additional devices in the array provide increasing levels of redundancy. RAID 1 requires at least two disks.
tr: `RAID1 (Yedeklilik)` - Bir bölümdeki tüm verileri bir veya daha fazla başka diske yansıtır. Dizideki ek aygıtlar artan düzeylerde yedeklilik sağlar. RAID 1, en az iki disk gerektirir.

source: `RAID4 (Error Checking)` - Distributes data across multiple disks and uses one disk in the array to store parity information which safeguards the array in case any disk within the array fails. Because all parity information is stored on one disk, access to this disk creates a "`bottleneck`" in the array's performance. Level 4 RAID requires at least three disks.
tr: `RAID4 (Hata Denetimi)` - Verileri birden çok diske dağıtır ve eşlik bilgilerini depolamak için dizideki bir diski kullanır; bu, dizideki herhangi bir diskin arızalanması durumunda diziyi korur . Tüm eşlik bilgileri tek bir diskte depolandığından, bu diske erişim dizinin performansında bir "`darboğaz`" oluşturur. Seviye 4 RAID, en az üç disk gerektirir.

source: `RAID5 (Distributed Error Checking)` - Distributes data and parity information across multiple disks. Level 5 RAIDs therefore offer the performance advantages of distributing data across multiple disks, but do not share the performance bottleneck of level 4 RAIDs because the parity information is also distributed through the array. RAID 5 requires at least three disks.
tr: `RAID5 (Dağıtılmış Hata Denetimi)` - Verileri ve eşlik bilgilerini birden çok diske dağıtır. Bu nedenle Seviye 5 RAID'ler, verileri birden çok diske dağıtmanın performans avantajlarını sunar, ancak seviye 4 RAID'lerin performans darboğazını yaşatmaz çünkü eşlik bilgileri de dizi üzerinde dağıtılır. RAID 5, en az üç disk gerektirir.

source: `RAID6 (Redundant Error Checking)` - Level 6 RAIDs are similar to level 5 RAIDs, but instead of storing only one set of parity data, they store two sets. RAID 6 requires at least four disks.
tr: `RAID6 (Yedekli Hata Denetimi)` - Seviye 6 RAID'ler seviye 5 RAID'lere benzer, ancak yalnızca bir eşlik verileri kümesi depolamak yerine iki tane depolar. RAID 6, en az dört disk gerektirir.

source: `RAID10 (Performance, Redundancy)` - Level 10 RAIDs are nested RAIDs or hybrid RAIDs. They are constructed by distributing data over mirrored sets of disks. For example, a level 10 RAID array constructed from four RAID partitions consists of two mirrored pairs of striped partitions. RAID 10 requires at least four disks.
tr: `RAID10 (Performans, Yedeklilik)` - Seviye 10 RAID'ler, iç içe geçmiş RAID'ler veya melez RAID'lerdir. Verilerin yansıtılmış disk kümelerine dağıtılmasıyla oluşturulurlar. Örneğin, dört RAID bölümünden oluşturulan bir seviye 10 RAID dizisi, iki tane yansıtılmış şeritlenen bölüm çiftinden oluşur. RAID 10, en az dört disk gerektirir.
