Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/InitialSetupHub.po
Languages: pt_br

source: Initial Setup
pt_br: Configuração Inicial

source: The `Initial Setup` screen is shown after the installation finishes and the installed system boots for the first time, before the first login, assuming the following conditions have been met:
pt_br: A tela `Configuração inicial` é mostrada após o término da instalação e o sistema instalado inicializar pela primeira vez, antes do primeiro login, assumindo que as seguintes condições foram atendidas:

source: Your software selection contained a graphical environment (for example, you installed the system using a {PRODUCT} Workstation live image).
pt_br: Sua seleção de software continha um ambiente gráfico (por exemplo, você instalou o sistema usando uma imagem live do {PRODUCT} Workstation).

source: The [package]*initial-setup* package has been installed.
pt_br: O pacote [package]*initial-setup* foi instalado.

source: You have not configured every screen available in the graphical installer.
pt_br: Você não configurou todas as telas disponíveis no instalador gráfico.

source: The main Initial Setup screen. This example shows all options; not all of them may be shown
pt_br: A tela principal de Configuração Inicial. Este exemplo mostra todas as opções; nem todas podem ser mostradas

source: [application]*Initial Setup* allows you to configure several system settings. All of these can also be configured during the installation, but they are not required to finish it. Only the settings which have *not* been configured during the installation will be shown; for example, if you did not create a non-`root` user account during the installation, [application]*Initial Setup* will start after the first reboot, and you will be able to configure one. If you configured all available options during the instalaltion, [application]*Initial Setup* will not be displayed at all.
pt_br: [application]*Configuração Inicial* permite definir várias configurações do sistema. Todos elas também podem ser configuradas durante a instalação, mas não são necessárias para concluí-la. Apenas as configurações que *não* foram definidas durante a instalação serão mostradas; por exemplo, se você não criou uma conta de usuário não `root` durante a instalação, [application]*Configuração Inicial* começará após a primeira reinicialização e você poderá configurar uma. Se você configurou todas as opções disponíveis durante a instalação, [application]*Configuração Inicial* não será exibida.

source: To configure any aspect of the system available in the utility, click any of the links available in the main window (for example, `Create User`). Each link leads to a separate screen with separate options; these screens are the same ones which were available during the graphical installation. If you need help, press `Help` in the top left corner to open a new window containing directions for that screen.
pt_br: Para configurar qualquer aspecto do sistema disponível no utilitário, clique em qualquer um dos links disponíveis na janela principal (por exemplo, `Criar Usuário`). Cada link leva a uma tela separada com opções separadas; essas telas são as mesmas que estavam disponíveis durante a instalação gráfica. Se precisar de ajuda, pressione `Ajuda` no canto superior esquerdo para abrir uma nova janela contendo instruções para aquela tela.

source: After you finish configuring any screen, press the `Done` button in the top left corner to return to the main [application]*Initial Setup* menu. After you finish configuring all settings, click `Finish Configuration` in the bottom right corner to save all configured settings. The configuration utility will close and you will be able to log in to the system.
pt_br: Depois de terminar de configurar qualquer tela, pressione o botão `Concluído` no canto superior esquerdo para retornar ao menu principal da [application]*Configuração Inicial*. Depois de definir todas as configurações, clique em `Finalizar Configuração` no canto inferior direito para salvar todas as configurações definidas. O utilitário de configuração será fechado e você poderá fazer login no sistema.

source: It is possible to configure [application]*Initial Setup* to display all available options, even if they have been already configured during the installation. To do so, you must use a Kickstart file at the start of the installation, and this file must contain the following command:
pt_br: É possível configurar o [application]*Configuração Inicial* para exibir todas as opções disponíveis, mesmo que já tenham sido configuradas durante a instalação. Para fazer isso, você deve usar um arquivo Kickstart no início da instalação, e esse arquivo deve conter o seguinte comando:

source: The [option]#--reconfig# option specifies that all options should be displayed. See xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart] for information about Kickstart installations.
pt_br: A opção [option]#--reconfig# especifica que todas as opções devem ser exibidas. Veja xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automatizando a Instalação com o Kickstart] para informações sobre as instalações do Kickstart.

source: Normally, it is not possible to return to [application]*Initial Setup* after you close it and log in to the system. You can make it display again (after the next reboot, before a login prompt is displayed), by executing the following command as `root`:
pt_br: Normalmente, não é possível retornar a [application]*Configuração Inicial* depois de fechá-la e fazer login no sistema. Você pode fazer com que seja exibido novamente (após a próxima reinicialização, antes que um prompt de login seja exibido), executando o seguinte comando como `root` :

source: Then, reboot your system.
pt_br: Então, reinicie seu sistema.
