Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/KeyboardSpoke.po
Languages: fi

source: Keyboard Layout
fi: Näppäimistöasettelu

source: The `Keyboard Layout` screen allows you to set up one or more keyboard layouts for your system and a way to switch between them. One keyboard layout is configured automatically based on your selection in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Welcome Screen and Language Selection], but you can change this layout and add additional ones before you begin the installation.
fi: "Keyboard Layout" -näytössä voit määrittää yhden tai useamman näppäimistöasettelun järjestelmällesi ja tavan vaihtaa niiden välillä. Yksi näppäimistöasettelu määritetään automaattisesti valitsemasi näppäimistöasettelun perusteella kohdassa xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Tervetulonäyttö ja kielivalinta], mutta voit muuttaa tätä asettelua ja lisätä uusia ennen asennuksen aloittamista.

source: Keyboard layouts are a separate setting from system languages, and these two settings can be mixed as you see fit.
fi: Näppäimistöasettelut ovat järjestelmäkielistä erillisiä asetuksia, ja näitä kahta asetusta voidaan sekoittaa haluamallasi tavalla.

source: All settings configured in this screen will be available on the installed system, and they will also become immediately available inside the installer. You can use the keyboard icon in the top right corner of any screen, or the keyboard switch you configured in this screen, to cycle between your configured layouts.
fi: Kaikki tässä näytössä määritetyt asetukset ovat käytettävissä asennetussa järjestelmässä, ja ne tulevat heti saataville myös asennusohjelman sisällä. Voit käyttää minkä tahansa näytön oikeassa yläkulmassa olevaa näppäimistökuvaketta tai tässä näytössä määrittämääsi näppäimistön kytkintä siirtyäksesi määritettyjen asettelujen välillä.

source: The keyboard layout configuration screen
fi: Näppäimistön asettelun määritysnäyttö

source: The left half of the screen contains a window listing all currently configured layouts. The order in which the layouts are displayed is important - the same order will be used when switching between layouts, and the first listed layout will be the default on your system.
fi: Näytön vasen puolisko sisältää ikkunan, jossa luetellaan kaikki tällä hetkellä määritetyt asettelut. Asettelujen näyttöjärjestys on tärkeä - samaa järjestystä käytetään asettelujen välillä vaihdettaessa, ja ensimmäinen listattu asettelu on oletusasettelu järjestelmässäsi.

source: The text field on the right side of the screen can be used to test the currently selected layout.
fi: Näytön oikealla puolella olevaa tekstikenttää voidaan käyttää valitun asettelun testaamiseen.

source: You can click a layout in the list to highlight it. At the bottom of the list, there is a set of buttons:
fi: Voit korostaa asettelua napsauttamalla sitä luettelossa. Luettelon alaosassa on joukko painikkeita:

source: The `+` button adds a new layout. When you press this button, a new window opens with a list of all available layouts, grouped by language. You can find a layout by browsing the list, or you can use the search bar at the bottom of this window. When you find the layout you want to add, highlight it and press `Add`.
fi: `+` -painike lisää uuden asettelun. Kun painat tätä painiketta, avautuu uusi ikkuna, jossa on luettelo kaikista käytettävissä olevista asetteluista kielen mukaan ryhmiteltynä. Löydät asettelun selaamalla luetteloa tai voit käyttää hakupalkkia tämän ikkunan alareunassa. Kun löydät lisättävän asettelun, korosta se ja paina "Lisää".

source: The `-` button removes the currently highlighted layout.
fi: `-`-painike poistaa tällä hetkellä korostetun asettelun.

source: The up and down buttons can be used to move the highlighted layout up or down in the list.
fi: Ylös- ja alaspainikkeilla voidaan siirtää korostettua asettelua ylös tai alas luettelossa.

source: The keyboard button opens a new window which offers a visual representation of the highlighted layout.
fi: Näppäimistöpainike avaa uuden ikkunan, joka tarjoaa visuaalisen esityksen korostetusta asettelusta.

source: If you use a layout that cannot accept Latin characters, such as `Russian`, you are advised to also add the `English (United States)` layout and configure a keyboard combination to switch between the two layouts. If you only select a layout without Latin characters, you may be unable to enter a valid `root` password and user credentials later in the installation process. This may prevent you from completing the installation.
fi: Jos käytät asettelua, joka ei hyväksy latinalaisia merkkejä, kuten "venäläinen", sinun kannattaa lisätä myös "englanninkielinen (Yhdysvallat)" asettelu ja määrittää näppäimistöyhdistelmä vaihtaaksesi näiden kahden asettelun välillä. Jos valitset vain asettelun ilman latinalaisia merkkejä, et ehkä pysty syöttämään kelvollista root-salasanaa ja käyttäjätunnuksia myöhemmin asennusprosessin aikana. Tämä saattaa estää sinua suorittamasta asennusta loppuun.

source: You can also optionally configure a keyboard switch which can be used to cycle between available layouts. To do so, click the `Options` button on the right side of the screen. The `Layout Switching Options` dialog will open, allowing you to configure one or more keys or key combinations for switching. Select one or more key combinations using the check boxes next to them, and click `OK` to confirm your selection.
fi: Voit myös valinnaisesti määrittää näppäimistökytkimen, jonka avulla voit siirtyä käytettävissä olevien asettelujen välillä. Napsauta näytön oikealla puolella olevaa Asetukset-painiketta. "Layout Switching Options" -valintaikkuna avautuu, jolloin voit määrittää yhden tai useamman näppäimen tai näppäinyhdistelmän vaihtamista varten. Valitse yksi tai useampi näppäinyhdistelmä niiden vieressä olevilla valintaruuduilla ja vahvista valinta napsauttamalla OK.

source: After you finish configuring keyboard layouts and switches, click `Done` in the top left corner to return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
fi: Kun olet määrittänyt ohjelmiston valinnan, napsauta "Valmis" vasemmassa yläkulmassa palataksesi kohtaan xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Asennusyhteenveto].
