Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/NetworkSpoke_EditConnection.po
Languages: tr

source: Editing Network Interface Configuration
tr: Ağ Arayüzü Yapılandırmasını Düzenleme

source: This section only details the most important settings for a typical wired connection used during installation. Many of the available options do not have to be changed in most installation scenarios and are not carried over to the installed system. Configuration of other types of networks is broadly similar, although the specific configuration parameters may be different. To learn more about network configuration after installation, see the [citetitle]_{PRODUCT} Networking{nbsp}Guide_, available at link:++https://docs.fedoraproject.org/++[].
tr: Bu bölümde yalnızca kurulum sırasında kullanılan normal bir kablolu bağlantı için en önemli ayarlar ayrıntılarıyla anlatılmaktadır. Kullanılabilir seçeneklerin çoğunun çoğu kurulum senaryosunda değiştirilmesi gerekmez ve kurulu sisteme taşınmaz. Diğer ağ türlerinin yapılandırılması genel olarak benzerdir, ancak belirli yapılandırma parametreleri farklı olabilir. Kurulumdan sonra ağ yapılandırması hakkında daha fazla bilgi edinmek için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Ağ{nbsp}Kılavuzuna_ bakın.

source: To configure a network connection manually, select that connection in the list on the left side of the screen, and click the `Configure` button. A dialog will appear that allows you to configure the selected connection. The configuration options presented depends on the connection type - the available options will be slightly different depending on whether it is a physical interface (wired or wireless network interface controller) or a virtual interface (Bond, Team or Vlan) which you previously configured in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration-virtual-interface[Adding a Virtual Network Interface].. A full description of all configuration settings for all connection types is beyond the scope of this document; see the [citetitle]_Networking Guide_ for details.
tr: Bir ağ bağlantısını elle yapılandırmak için ekranın sol tarafındaki listeden o bağlantıyı seçin ve `Yapılandır` düğmesine tıklayın. Seçili bağlantıyı yapılandırmanıza izin veren bir iletişim kutusu görünecektir. Sunulan yapılandırma seçenekleri bağlantı türüne bağlıdır - kullanılabilir seçenekler, bunun bir fiziksel arayüz (kablolu veya kablosuz ağ arayüzü denetleyicisi) veya daha önce xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration-virtual-interface[Sanal Ağ Arayüzü Ekleme] bölümünde yapılandırdığınız sanal arayüz (Bond, Team veya Vlan) olmasına bağlı olarak biraz farklı olacaktır. Tüm bağlantı türleri için tüm yapılandırma ayarlarının tam açıklaması bu belgenin kapsamı dışındadır; ayrıntılar için [citetitle]_Ağ Kılavuzuna_ bakın.

source: The most common and useful options in the configuration dialog are:
tr: Yapılandırma iletişim kutusundaki en yaygın ve kullanışlı seçenekler şunlardır:

source: Enable or disable the connection by default
tr: Öntanımlı olarak bağlantıyı etkinleştirin veya devre dışı bırakın

source: In the `General` tab of the configuration dialog, you can select or unselect the `Automatically connect to this network when it is available` check box to allow or disallow this connection to connect by default. When enabled on a wired connection, this means the system will typically connect during startup (unless you unplug the network cable); on a wireless connection, it means that the interface will attempt to connect to any known wireless networks in range.
tr: Yapılandırma iletişim kutusunun `Genel` sekmesinde, bu bağlantının öntanımlı olarak bağlanmasına izin vermek veya vermemek için`Kullanılabilir olduğunda bu ağa otomatik olarak bağlan` onay kutusunu seçebilir veya seçimini kaldırabilirsiniz. Kablolu bir bağlantıda etkinleştirildiğinde; bu, sistemin genellikle başlatma sırasında bağlanacağı anlamına gelir (ağ kablosunu çıkarmadığınız sürece); kablosuz bir bağlantıda, arayüzün kapsama alanındaki bilinen kablosuz ağlara bağlanmaya çalışacağı anlamına gelir.

source: Additionally, you can allow or disallow all users on the system from connecting to this network using the `All users may connect to this network` option. If you disable this option, only `root` will be able to connect to this network.
tr: Ayrıca, `Tüm kullanıcılar bu ağa bağlanabilir` seçeneğini kullanarak sistemdeki tüm kullanıcıların bu ağa bağlanmasına izin verebilir veya vermeyebilirsiniz. Bu seçeneği devre dışı bırakırsanız, yalnızca `root` bu ağa bağlanabilir.

source: It is not possible to only allow a specific user other than `root` to use this interface, because no other users are created at this point during the installation. If you need a connection for a different user, you must configure it after the installation.
tr: Kurulum sırasında bu noktada başka bir kullanıcı oluşturulmadığından, `root` dışında yalnızca belirli bir kullanıcının bu arayüzü kullanmasına izin vermek mümkün değildir. Farklı bir kullanıcı için bir bağlantıya ihtiyacınız varsa, kurulumdan sonra yapılandırmanız gerekir.

source: Set up static IPv4 or IPv6 settings
tr: Statik IPv4 veya IPv6 ayarlarını yapın

source: By default, both `IPv4` and `IPv6` are set to automatic configuration depending on current network settings. This means that addresses such as the local IP address, DNS address, and other settings will be detected automatically each time the interface connects to a network. In many cases, this is sufficient, but you can also provide static configuration in the `IPv4 Settings` and `IPv6 Settings`, respectively.
tr: Öntanımlı olarak, hem `IPv4` hem de `IPv6`, geçerli ağ ayarlarına bağlı olarak otomatik yapılandırmaya ayarlanmıştır. Bu, arayüz bir ağa her bağlandığında yerel IP adresi, DNS adresi ve diğer ayarlar gibi adreslerin otomatik olarak algılanacağı anlamına gelir. Çoğu durumda bu yeterlidir, ancak `IPv4 Ayarları` ve `IPv6 Ayarları` bölümlerinde statik yapılandırma da sağlayabilirsiniz.

source: To set static network configuration, navigate to one of the settings tabs and select a method other than `Automatic` (for example, `Manual`) from the `Method` drop-down menu. This will enable the `Addresses` field below.
tr: Statik ağ yapılandırmasını ayarlamak için, ayarlar sekmelerinden birine gidin ve `Yöntem` açılır menüsünden `Otomatik` dışında bir yöntem (örneğin, `Elle`) seçin. Bu, aşağıdaki `Adresler` alanını etkinleştirecektir.

source: In the `IPv6 Settings` tab, you can also set the method to `Ignore` to disable `IPv6` on this interface.
tr: `IPv6 Ayarları` sekmesinde, bu arayüzde `IPv6` özelliğini devre dışı bırakmak için yöntemi `Yok say` olarak da ayarlayabilirsiniz.

source: Then, click `Add` on the right side and add a set of settings: `Address`, `Netmask` (for `IPv4`), `Prefix` (for `IPv6`), and `Gateway`.
tr: Ardından, sağ taraftaki `Ekle` düğmesine tıklayın ve bir dizi ayar ekleyin: `Adres`, `Ağ maskesi` (`IPv4` için), `Ön ek` (`IPv6` için), ve `Ağ geçidi`.

source: The `DNS servers` field accepts one or more IP addresses of DNS servers - for example, `10.0.0.1,10.0.0.8`.
tr: `DNS sunucuları` alanı, bir veya daha fazla DNS sunucusunun IP adresini kabul eder - örneğin, `10.0.0.1,10.0.0.8`.

source: The final option in both tabs is `Require IPvpass:attributes[{blank}]_X_ addressing for this connection to complete`. Select this option in the `IPv4` tab to only allow this connection if `IPv4` was successful; the same principle applies to this setting in the `IPv6` tab. If this option remains disabled for both `IPv4` and `IPv6`, the interface will be able to connect if configuration succeeds on either IP protocol.
tr: Her iki sekmedeki son seçenek, `Bu bağlantının tamamlanması için IPvpass:attributes[{blank}]_X_ adresleme gerektir` seçeneğidir. Yalnızca `IPv4` başarılı olduğunda bu bağlantıya izin vermek için `IPv4` sekmesinde bu seçeneği seçin; aynı ilke `IPv6` sekmesindeki bu ayar için de geçerlidir. Bu seçenek hem `IPv4` hem de `IPv6` için devre dışı bırakılırsa, iki IP protokolünün herhangi birinde yapılandırma başarılı olursa arayüz bağlanabilecektir.

source: Configure routes
tr: Yönlendirmeleri yapılandırın

source: In the `IPv4 Settings` and `IPv4 Settings` tabs, click the `Routes` button in the bottom right corner to configure routing settings for a specific IP protocol on an interface. A new dialog will open, allowing you to `Add` a specific route.
tr: `IPv4 Ayarları` ve `IPv6 Ayarları` sekmelerinde, bir arayüzdeki belirli bir IP protokolü için yönlendirme ayarlarını yapılandırmak için sağ alt köşedeki `Yönlendirmeler` düğmesine tıklayın. Belirli bir yönlendirmeyi `Ekle` 'menize izin verecek yeni bir iletişim kutusu açılacaktır.

source: If you confire at least one static route, you can disallow all routes not specifically configured here by enabling the `Ignore automatically obtained routes`.
tr: En az bir statik yönlendirme yapılandırırsanız, `Otomatik olarak alınan yönlendirmeleri yok say` seçeneğini etkinleştirerek burada özel olarak yapılandırılmayan tüm yönlendirmelere izin vermeyebilirsiniz.

source: Select `Use this connection only for resources on its network` to prevent this connection from becoming the default route. This option can be selected even if you did not configure any static routes. Enabling this option means that this route will only be used when necessary to access certain resources, such as intranet pages which require a local or VPN connection. Another (default) route will be used for publicly available resources if possible. Note that unlike the additional routes configured in this dialog, this setting will be transferred to the installed system. Also note that this option is only useful when more than one interface is configured.
tr: Bu bağlantının öntanımlı yönlendirme olmasını önlemek için `Bu bağlantıyı yalnızca ağındaki kaynaklar için kullan` seçeneğini seçin. Bu seçenek, herhangi bir statik yönlendirme yapılandırmamış olsanız bile seçilebilir. Bu seçeneğin etkinleştirilmesi, bu yönlendirmenin yalnızca yerel veya VPN bağlantısı gerektiren intranet sayfaları gibi belirli kaynaklara erişmek için gerektiğinde kullanılacağı anlamına gelir. Herkese açık kaynaklar için mümkünse başka bir (öntanımlı) yönlendirme kullanılacaktır. Bu iletişim kutusunda yapılandırılan ek yönlendirmelerden farklı olarak, bu ayarın kurulu sisteme aktarılacağını unutmayın. Ayrıca, bu seçeneğin yalnızca birden fazla arayüz yapılandırıldığında faydalı olduğunu unutmayın.

source: When you finish configuring the interface's routing settings, click `OK` to return to the configuration dialog.
tr: Arayüzün yönlendirme ayarlarını yapılandırmayı bitirdiğinizde, yapılandırma iletişim kutusuna dönmek için `Tamam` düğmesine tıklayın.

source: Once you finish configuring the interface, click `Save` in the configuration window's bottom right corner to save your settings and return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Network & Hostname].
tr: Arayüzü yapılandırmayı bitirdikten sonra, ayarlarınızı kaydetmek ve xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Ağ & Ana Makine Adı] bölümüne geri dönmek için yapılandırma penceresinin sağ alt köşesindeki `Kaydet` düğmesine tıklayın.
