Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/StorageSpoke.po
Languages: pt_br, zh_hans

source: Installation Destination
pt_br: Destino da instalação
zh_hans: 安装目标位置

source: The `Installation Destination` screen allows you to configure storage options - namely, which disks will be used as the installation target for your {PRODUCT} installation. At least one disk must always be selected for the installation to proceed.
pt_br: A tela `Destino da instalação` permite que você configure as opções de armazenamento – ou seja, quais discos serão usados como o destino de instalação para sua instalação do {PRODUCT}. Pelo menos um disco deve ser sempre selecionado para que a instalação prossiga.
zh_hans: 安装目标页面将允许你对储存设备进行配置，你可以选择将哪个设备用于 {PRODUCT} 的安装。你需要至少选择一个设备以完成安装。

source: For information about the theory and concepts behind disk partitioning in Linux, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
pt_br: Para obter informações sobre a teoria e os conceitos por trás do particionamento de disco no Linux, consulte xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de particionamento recomendado].
zh_hans: 关于Linux 磁盘分区背后的理论知识详见xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[推荐的安装方案]。

source: If you plan to use a disk which already contains some data - for example, if you want to shrink an existing Microsoft Windows partition and install {PRODUCT} as a second system or if you are upgrading a previous release of {PRODUCT}, make sure to back up any important data first. Manipulating partitions always carries a risk - if the process is interrupted or fails for any reason (installer error, hardware failure, power outage, etc.), any data already on the disk may become impossible to recover.
pt_br: Se você planeja usar um disco que já contém alguns dados – por exemplo, se deseja reduzir uma partição existente do Microsoft Windows e instalar o {PRODUCT} como um segundo sistema ou se estiver atualizando uma versão anterior do {PRODUCT}, certifique-se de para fazer backup de todos os dados importantes primeiro. Manipular partições sempre traz um risco - se o processo for interrompido ou falhar por qualquer motivo (erro do instalador, falha de hardware, falta de energia, etc.), quaisquer dados já no disco podem se tornar impossíveis de serem recuperados.
zh_hans: 如果你需要使用一个已经包含一些数据的磁盘，例如你希望将 Microsoft Windows 的分区压缩并在剩余的空间上安装 {PRODUCT} ，或者你希望升级你的 {PRODUCT} ，那么你必须对所有重要的数据做好备份。手动分区是有风险的：如果手动分区进程被中断或是无法完成（例如安装出错、电源中断等等），那么磁盘上已有的数据将可能无法恢复。

source: The Installation Destination screen. There are two local standard disks available
pt_br: A tela Destino da instalação. Existem dois discos padrão locais disponíveis
zh_hans: 安装目标位置页面。共有两个本地磁盘可用

source: In the top part of the screen, all locally available storage devices (SATA, IDE and SCSI hard drives, USB flash drives, etc.) are displayed in the `Local Standard Disks` section. Local disks are detected when the installer starts - any storage devices connected after the installation has started will not be shown.
pt_br: Na parte superior da tela, todos os dispositivos de armazenamento disponíveis localmente (discos rígidos SATA, IDE e SCSI, unidades flash USB, etc.) são exibidos na seção `Discos padrão locais`. Os discos locais são detectados quando o instalador é iniciado – quaisquer dispositivos de armazenamento conectados após o início da instalação não serão exibidos.
zh_hans: 所有在本地可用的储存设备都会在页面的顶部的`本地标准磁盘`区域被列出来（包括 SATA、IDE 和 SCSI 硬盘、USB 驱动器等等）。在安装程序启动的时候本地储存设备就会被自动探测，在安装开始后才连上的设备不会被显示。

source: If you need to configure additional local storage devices, select `Refresh` on the lower-right corner. Follow the instructions in the dialog that opens. All detected disks, including any new ones, will be displayed in the `Local Standard Disks` section.
pt_br: Se você precisar configurar dispositivos de armazenamento local adicionais, selecione `Atualizar` no canto inferior direito. Siga as instruções na caixa de diálogo que é aberta. Todos os discos detectados, incluindo os novos, serão exibidos na seção `Discos padrão locais`.
zh_hans: 如果你需要添加额外的本地储存设备，那么你可以点击右下角的`刷新`按钮，然后你需要按照出现的对话框的说明来进行操作。所有被检测到的磁盘，包括新探测到的磁盘，都会在`本地标准磁盘`区域当中显示出来。

source: The `Specialized & Network Disks` section below shows advanced network storage (such as iSCSI and FCoE disks) currently configured. When you first open this screen, no such devices will be displayed because they cannot be automatically detected; to search for network storage devices, press `Add a disk` button and proceed with xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks]. Any network storage you configure will then show up in the `Specialized & Network Disks` the same way local disks are shown above.
zh_hans: `特殊磁盘和网络磁盘`区域显示着已经配置的网络储存设备（例如 iSCSI 和 FCoE 磁盘）。当你首次打开这个页面的时候，这个区域会是空的，网络设备也不会被自动探测。要搜索网络储存设备，点击添加磁盘按钮并按照 xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[安装目标 - 特殊磁盘与网络磁盘] 章节进行操作。所有配置好的网络储存设备都会出现在`特殊磁盘和网络磁盘`区域中。

source: All storage devices which will be used to install {PRODUCT} have a black circle icon with a white check mark on them. Disks not marked by this icon will not be used during the installation - they will be ignored if you choose automatic partitioning, and they will not be available in manual partitioning.
pt_br: Todos os dispositivos de armazenamento que serão usados para instalar o {PRODUCT} têm um ícone de círculo preto com uma marca de seleção branca. Os discos não marcados por este ícone não serão usados durante a instalação - eles serão ignorados se você escolher o particionamento automático e não estarão disponíveis no particionamento manual.
zh_hans: 我们使用一个黑色实心圆为底的白色对勾标记将被用于安装{PRODUCT}的储存设备。没有被标记的设备将不会用于安装，自动分区的时候也会忽略这些设备，手动分区的时候这些设备也将会是不可用状态。

source: USB storage devices such as flash drives and external disks will be shown in the `Local Standard Disks` as well, and they will be available for selection the same way internal hard drives are. Make sure to *not* select any removable storage as installation targets unless you really want to do so. If you accidentally use a removable drive to install {PRODUCT} and then unplug it, your system will likely become unusable.
pt_br: Os dispositivos de armazenamento USB, como unidades flash e discos externos, também serão exibidos em `Discos padrão locais` e estarão disponíveis para seleção da mesma forma que os discos rígidos internos. Certifique-se de *não* selecionar nenhum armazenamento removível como destino de instalação, a menos que você realmente queira fazer isso. Se você acidentalmente usar uma unidade removível para instalar o {PRODUCT} e, em seguida, desconectá-lo, o sistema provavelmente ficará inutilizável.
zh_hans: 外接硬盘和闪存盘等 USB 储存设备也会在本地标准磁盘栏目显示，它们跟内部硬盘一样可在安装时供选择。除非你真的想这样做，否则务必 *不要* 将可卸载设备作为安装目标。如果你在可卸载设备上安装了 {PRODUCT} 并移除了设备，那么你的系统可能就不可用了。

source: Unselected and Selected Disk
pt_br: Disco não selecionado e selecionado
zh_hans: 未选择的和已选择的磁盘

source: Disk selection in the Installation Destination screen. Two disks are displayed; only the one on the right side will be used
pt_br: Seleção do disco na tela Destino da instalação. Dois discos são exibidos; apenas o do lado direito será usado
zh_hans: 安装目标页的磁盘选择栏目。这里显示了两块硬盘，右边的硬盘将会被使用

source: After you select all disks you want to install {PRODUCT}, select one of the three options in the `Storage Configuration` section:
pt_br: Depois de selecionar todos os discos que deseja instalar o {PRODUCT}, selecione uma das três opções na seção `Configuração de armazenamento`:
zh_hans: 在选择 {PRODUCT} 使用的硬盘后，从储存设定栏目中选择一项：

source: `Automatic` - If this option is selected, then after you press `Done` in the top left corner of the screen, the installer will determine the total amount of space on all selected disks, and it will create a Btrfs layout suitable for your system. The specifics of this layout depend on whether your system uses BIOS or UEFI firmware, and the total amount of free space on your disks. A disk-based swap partition is not created, ZRAM-based swap is used instead.
pt_br: `Automática` - Se esta opção for selecionada, depois de pressionar `Pronto` no canto superior esquerdo da tela, o instalador determinará a quantidade total de espaço em todos os discos selecionados e criará um layout Btrfs adequado para o seu sistema. As especificações desse layout dependem de seu sistema usar BIOS ou firmware UEFI e da quantidade total de espaço livre em seus discos. Uma partição de troca baseada em disco não é criada, a troca baseada em ZRAM é usada em seu lugar.
zh_hans: 自动 - 如果你选择了这一项，在点击页面左上角的完成按钮后，安装程序就会计算选择磁盘的可用空间，并创建合适的基于 Btrfs 的分区方案。具体的分区方案与你在使用 BIOS 模式还是使用 UEFI 模式有关，也跟磁盘可用的空间相关。我们不会创建基于磁盘的交换分区，而是会创建基于 ZRAM 的交换分区。

source: With automatic partitioning, you can also select the `I would like to make additional space available` option below. Use this option if you want to reclaim space from an existing partitioning layout - for example, if a disk you want to use already contains a different operating system, and you want to make this system's partitions smaller to allow more room for {PRODUCT}. The `Reclaim space` dialog which opens if this option is selected is described later in this section.
pt_br: Com o particionamento automático, você também pode selecionar a opção `Eu gostaria de adicionar espaço disponível no disco.` abaixo. Use esta opção se desejar recuperar espaço de um layout de particionamento existente – por exemplo, se um disco que você deseja usar já contém um sistema operacional diferente e você deseja tornar as partições desse sistema menores para permitir mais espaço para {PRODUCT}. A caixa de diálogo `Recuperar espaço` que abre se esta opção for selecionada é descrita posteriormente nesta seção.
zh_hans: 在选择自动分区方案时，你可以选择下方的`我想令额外的空间可用`选项。选择这个选项后你就可以从已有的分区中回收空间。例如说如果你的磁盘已经包含了一个不同的操作系统，你就可以通过压缩这个操作系统的分区以为 {PRODUCT} 留出更多储存空间。我们会在后面进一步说明回收空间功能。

source: `Custom` - Select this option and press `Done` in the top left corner of the screen to configure your system's partitioning layout semi-manually. This requires some knowledge of the theory behind disk partitions and related concepts, but provides recommendations over the way the system will be installed. For instructions for Custom partitioning, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Manual Partitioning].
pt_br: `Personalizada` - Selecione esta opção e pressione `Pronto` no canto superior esquerdo da tela para configurar o layout de particionamento do seu sistema semimanualmente. Isso requer algum conhecimento da teoria por trás das partições de disco e conceitos relacionados, mas fornece recomendações sobre a maneira como o sistema será instalado. Para obter instruções sobre particionamento personalizado, veja xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Particionamento manual].
zh_hans: `自定义` - 如果你选择了这一项，那么你就可以在点击页面左上角的完成按钮后通过半手动配置的形式完成系统分区。这需要你了解磁盘分区背后的概念和理论知识，但是自定义分区将允许你以其他的方式安装系统。有关自定义分区的说明详见xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[手动分区]。

source: `Advanced-Custom (Blivet-GUI)` - Select this option and press `Done` in the top left corner of the screen to configure your system's partitioning completely manually. This requires advanced knowledge of the theory behind disk partitions and related concepts. There are no guardrails.
pt_br: `Personalização avançada ( Blivet-GUI)` - Selecione esta opção e pressione `Pronto` no canto superior esquerdo da tela para configurar o particionamento do seu sistema completamente manualmente. Isso requer conhecimento avançado da teoria por trás das partições de disco e conceitos relacionados. Não há grades de proteção.
zh_hans: `高级自定义（Blivet图形界面）`——选择此选项后点击页面左上角的`完成`按钮来对系统进行真正意义上的手动分区。这需要熟悉磁盘分区背后的概念和理论知识，且操作不受限。

source: Additionally, you can select `Encrypt my data`pass:attributes[{blank}]; this will encrypt all partitions except the ones needed to boot the system (such as `/boot`) using _Linux Unified Key Setup_ (LUKS). Encrypting your hard drive is recommended. For detailed information about LUKS encryption, see the [citetitle]_{PRODUCT} Security{nbsp}Guide_, available at link:++https://docs.fedoraproject.org/++[].
pt_br: Além disso, você pode selecionar a passagem `Criptografar meus dados`pass:attributes[{blank}]; isso criptografará todas as partições, exceto as necessárias para inicializar o sistema (como `/boot`) usando _Linux Unified Key Setup_ (LUKS). É recomendável criptografar seu disco rígido. Para obter informações detalhadas sobre a criptografia LUKS, consulte o [citetitle]_{PRODUCT} Security{nbsp}Guide_ (Guia de segurança), disponível em link:++https://docs.fedoraproject.org/++[].
zh_hans: 此外你还可以选择`加密我的数据`pass:attributes[{blank}]，此选项将使用 LUKS 加密所有的分区（除了使用_Linux统一密钥设置_ (LUKS)的、用于系统引导的分区，如 `/boot`）。关于LUKS加密方式详见[citetitle]_{PRODUCT} 安全{nbsp}指南_, available at link:++https://docs.fedoraproject.org/++[]。

source: If you lose the LUKS passphrase, any encrypted partitions and the data on them will become completely inaccessible. There is no way to recover a lost passphrase. However, if you perform a Kickstart installation, you can save encryption passphrases and create backup encryption passphrases during the installation. See xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart] for information about Kickstart installations.
pt_br: Se você perder a senha do LUKS, todas as partições criptografadas e os dados nelas contidos ficarão completamente inacessíveis. Não há como recuperar uma senha longa perdida. No entanto, se você executar uma instalação Kickstart, você pode salvar senhas de criptografia e criar senha de criptografia de backup durante a instalação. Veja xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automatizando a instalação com o Kickstart] para obter informações sobre instalações com Kickstart.
zh_hans: 如果你丢失了 LUKS 密钥，那么加密的分区上的数据将彻底无法访问。一般而言无法恢复丢失的密钥，然而，如果你是通过 Kickstart 进行的安装，你可以在安装的时候储存你的密钥并创建一个备用的密钥。Kickstart安装详见 xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[使用 Kickstart 进行无人职守安装]。

source: To control which one of your selected storage devices will contain the _boot loader_, click the `Full disk summary and bootloader` link in the bottom left corner of the screen, and follow the instructions in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning-bootloader[Boot Loader Installation]. Note that while in most cases it is sufficient to leave the boot loader in the default location, some configurations (for example, systems which require _chain loading_ from another boot loader) will require the boot drive to be specified manually.
pt_br: Para controlar qual de seus dispositivos de armazenamento selecionados conterá o _carregador de inicialização_, clique no link `Resumo completo do disco e carregador de inicialização` no canto inferior esquerdo da tela e siga as instruções em xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning-bootloader[Instalação do carregador de inicialização]. Observe que, embora na maioria dos casos seja suficiente deixar o carregador de inicialização no local padrão, algumas configurações (por exemplo, sistemas que requerem _cadeia de carregamento_ de outro carregador de inicialização) exigirão que a unidade de inicialização seja especificada manualmente.
zh_hans: 要指定在哪些储存设备安装 _引导程序_ ，就需要点击页面左下角的磁盘概览和引导器链接，并按照 xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning-bootloader[安装引导程序]小节的说明进行操作。请注意大部分时候只需要使用默认配置就可以了，但有些配置（例如需要链式引导启动的时候）还是需要手动指定引导的设备。

source: After you select storage devices, choose between automatic and manual partitioning, configure encryption and boot loader location, press `Done` in the top left corner of the screen. Then, depending on your settings, the following will happen:
pt_br: Depois de selecionar os dispositivos de armazenamento, escolha entre o particionamento automático e manual, configure a criptografia e o local do carregador de inicialização e pressione `Pronto` no canto superior esquerdo da tela. Então, dependendo de suas configurações, acontecerá o seguinte:
zh_hans: 在选择储存设备、指定自动分区或手动分区、配置磁盘加密和bootloader的位置后，点击左上角的`完成`按钮。然后根据你的选择将发生以下事件：

source: If you chose to encrypt your hard drive, the `Disk Encryption Passphrase` dialog will appear. Enter your chosen passphrase into the `Passphrase` and `Confirm` fields. When you do so, the passphrase will be automatically evaluated and its strength will be displayed, along with suggestions on how to make it stronger if the installer has determined it to be weak. For information about creating strong passwords, see [citetitle]_{PRODUCT} Security{nbsp}Guide_.
pt_br: Se você optar por criptografar seu disco rígido, a caixa de diálogo `Senha de criptografia de disco` aparecerá. Digite sua senha escolhida nos campos `Senha` e` Confirmar`. Ao fazer isso, a senha será avaliada automaticamente e sua força será exibida, junto com sugestões sobre como torná-la mais forte se o instalador a tiver determinado como fraca. Para obter informações sobre como criar senhas fortes, consulte o [citetitle]_{PRODUCT} Security{nbsp}Guide_ (guia de segurança).
zh_hans: 如果你选择加密你的磁盘，那么将会弹出一个`磁盘加密密钥`对话框提示你对密钥进行设置，你只需要在`密钥`和`确定`区域中输入一次密钥，然后再输入一次密钥以确认你的输入无误即可。在输入密钥时会检查密钥的强度，并在密码强度弱时给出如何加强密钥强度的建议。创建强密码详见[citetitle]_{PRODUCT}安全{nbsp}指南_。

source: If you selected automatic partitioning and the `I would like to make additional space available`, or if there is not enough free space on your selected hard drives to install {PRODUCT}, the `Reclaim Disk Space` dialog will appear. This dialog lists all disk devices you have configured and all partitions on those devices. The bottom right corner of the dialog displays information about how much space the system needs for at least a minimal installation and how much space you have reclaimed.
pt_br: Se você selecionou o particionamento automático e `Eu gostaria de adicionar espaço disponível no disco.`, ou se não houver espaço livre suficiente nos discos rígidos selecionados para instalar o {PRODUCT}, a caixa de diálogo `Recuperar espaço do disco` aparecerá. Esta caixa de diálogo lista todos os dispositivos de disco que você configurou e todas as partições nesses dispositivos. O canto inferior direito da caixa de diálogo exibe informações sobre quanto espaço o sistema precisa para pelo menos uma instalação mínima e quanto espaço você recuperou.
zh_hans: 如果你选择了自动分区和`我希望令希望额外空间可用`，或者你的磁盘已经没有足够的空间可供安装{PRODUCT}，那么`回收磁盘空间`对话框将会出现。对话框将列出你配置的磁盘和磁盘上的所有分区。对话框的右下角显示了目前系统的可用空间以及安装系统至少需要回收的空间。

source: If you use the `Reclaim Disk Space` dialog to *delete* a partition, all data on that partition will be lost. If you want to preserve your data, use the `Shrink` option, not the `Delete` option.
pt_br: Se você usar a caixa de diálogo `Recuperar espaço do disco` para *excluir* uma partição, todos os dados dessa partição serão perdidos. Se você quiser preservar seus dados, use a opção `Reduzir`, não a opção `Excluir`.
zh_hans: 如果你使用`回收磁盘空间`对话框来*删除*一个分区，那么这个分区上的所有数据都会丢失。如果你希望保留你的数据，请使用`压缩`选项，而不使用`删除`选项。

source: First, review the displayed list of available storage devices. The `Reclaimable Space` column shows how much space can be reclaimed from each entry. To reclaim space, select a disk or partition, and press either the `Delete` button to delete that partition (or all partitions on a selected disk), or `Shrink` to use free space on a partition while preserving existing data. Alternatively, you can press `Delete all` in the bottom right corner; this will delete all existing partitions on all disks and make this space available to {PRODUCT}, but all existing data on all disks will be lost.
pt_br: Primeiro, revise a lista exibida de dispositivos de armazenamento disponíveis. A coluna `Espaço recuperável` mostra quanto espaço pode ser recuperado de cada entrada. Para recuperar espaço, selecione um disco ou partição e pressione o botão `Excluir` para excluir essa partição (ou todas as partições em um disco selecionado) ou `Reduzir` para usar o espaço livre em uma partição enquanto preserva os dados existentes. Alternativamente, você pode pressionar `Excluir tudo` no canto inferior direito; isso excluirá todas as partições existentes em todos os discos e disponibilizará este espaço para {PRODUCT}, mas todos os dados existentes em todos os discos serão perdidos.
zh_hans: 首先，对可用设备和分区列表进行检查。对于每一项我们都会显示你可以回收多少的空间。`可回收的空间`显示了每个入口可以被回收的空间。要对空间进行回收，选择一个磁盘或分区，你可以点击`删除`按钮删除分区（或磁盘上的所有分区），或者点击`压缩`按钮以在利用分区空闲空间的同时保留原有的数据。你也可以点击右下角的`全部删除`按钮，这将会删除所有磁盘的所有分区并将腾出来的空间全部用于 {PRODUCT} 。但与此同时，所有磁盘上的数据都会被删除。

source: After you free enough space for your {PRODUCT} installation, press `Reclaim space` to finish.
pt_br: Após você liberar espaço suficiente para sua instalação do {PRODUCT}, pressione `Recuperar espaço` para concluir.
zh_hans: 在你为{PRODUCT}释放了足够的空间之后，你就可以点击`回收空间`按钮以完成。

source: No changes to any disks will be made until you press `Begin Installation` in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary]. The `Reclaim Space` dialog only *marks* partitions for resizing or deletion, but no such action is performed immediately.
pt_br: Nenhuma mudança em nenhum disco será feita até que você pressione `Iniciar a instalação` em xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Resumo da Instalação]. A caixa de diálogo `Recuperar espaço do disco` apenas *marca* as partições para redimensionamento ou exclusão, mas nenhuma ação é realizada imediatamente.
zh_hans: 在 xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[安装概览] 页点击开始安装按钮之前，你在回收空间对话框所做的操作都不会被实际地执行。`回收空间`对话框只*标记*了用于调整大小或删除的分区，但这种操作不会被立刻执行。

source: If you selected the `Custom` option, pressing `Done` will open the `Manual Partitioning` screen. See xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Manual Partitioning] for further instructions.
pt_br: Se você selecionou a opção `Personalizada`, pressionar `Pronto` vai abrir a tela `Particionamento manual`. Veja xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[Particionamento manual] para obter mais instruções.
zh_hans: 如果你选择的是`自定义`分区选项，那么在点击`完成`后就会进入`手动分区`页面。详见xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning[手动分区]。
