Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/StorageSpoke_BootLoader.po
Languages: fr

source: Boot Loader Installation
fr: Installation du chargeur d’amorçage

source: {PRODUCT} uses [application]*GRUB2* (GRand Unified Bootloader version 2) as its boot loader. The boot loader is the first program that runs when the computer starts and is responsible for loading and transferring control to an operating system. [application]*GRUB2* can boot any compatible operating system (including Microsoft Windows) and can also use chain loading to transfer control to other boot loaders for unsupported operating systems.
fr: {PRODUCT} utilise [application]*GRUB2* (GRand Unified Bootloader version 2) comme chargeur d’amorçage. Le chargeur d’amorçage est le premier programme qui s’exécute au démarrage de l’ordinateur et qui est responsable du chargement et du transfert du contrôle vers un système d’exploitation. [application]*GRUB2* peut démarrer tout système d’exploitation compatible (y compris Microsoft Windows) et peut également utiliser le chargement en chaine pour transférer le contrôle à d’autres chargeurs d’amorçage pour les systèmes d’exploitation non pris en charge.

source: Installing [application]*GRUB2* may overwrite your existing boot loader.
fr: L’installation de [application]*GRUB2* peut écraser votre chargeur d’amorçage existant.

source: If you have other operating systems already installed, the {PRODUCT} installer will attempt to automatically detect and configure the boot loader to start them. You can manually configure any additional operating systems after you finish the installation, if they are not detected properly. For instructions on editing [application]*GRUB2* configuration, see the [citetitle]_{PRODUCT} System{nbsp}Administrator's{nbsp}Guide_, available at link:++https://docs.fedoraproject.org/++[]
fr: Si vous avez d’autres systèmes d’exploitation déjà installés, le programme d’installation de {PRODUCT} tentera de détecter et de configurer automatiquement le chargeur d’amorçage pour les démarrer. Vous pouvez configurer manuellement tout système d’exploitation supplémentaire après avoir terminé l’installation, s’il n’est pas détecté correctement. Pour des instructions sur l’édition de la configuration de [application]*GRUB2*, voir le [citetitle]_Guide de l’administrateur système de {PRODUCT}_, disponible sur link:++https://docs.fedoraproject.org/++[]

source: If you are installing Fedora system with more than one disk, you may want to manually specify where the bootloader should be installed. Click the `Full disk summary and bootloader` link at the bottom of the `Installation Destination` screen. The `Selected Disks` dialog will appear. The bootloader will be installed on the device of your choice, or on a UEFI system, the `EFI system partition` will be created on that device during guided partitioning.
fr: Si vous installez le système Fedora avec plus d’un disque, vous pouvez spécifier manuellement l’endroit où le chargeur d’amorçage doit être installé. Cliquez sur le lien `Résumé complet du disque et chargeur d’amorçage` en bas de l’écran `Destination de l’installation`. La boite de dialogue `Disques sélectionnés` apparaitra. Le chargeur d’amorçage sera installé sur le périphérique de votre choix, ou sur un système UEFI, la `partition EFI système` sera créée sur ce périphérique lors du partitionnement guidé.

source: Boot Device Selection
fr: Sélection du périphérique d’amorçage

source: The Selected Disks dialog
fr: La boite de dialogue Disques sélectionnés

source: In the `Boot` column, a "tick" icon marks one of the devices as the intended boot device. To change the boot device, select a device from the list and click the `Set as Boot Device` button to install the boot loader there instead. Only one device can be set as the boot device.
fr: Dans la colonne `Amorçage`, une icône `coche` marque l’un des périphériques comme étant le périphérique de démarrage prévu. Pour changer de périphérique d’amorçage, sélectionnez un périphérique dans la liste et cliquez sur le bouton `Définir comme périphérique d’amorçage` pour y installer le chargeur d’amorçage à la place. Un seul périphérique peut être défini comme périphérique d’amorçage.

source: To decline installation of a new boot loader, select the device currently marked for boot and click the `Do not install bootloader` button. This will remove the tick and ensure [application]*GRUB2* is not installed on any device.
fr: Pour refuser l’installation d’un nouveau chargeur d’amorçage, sélectionnez le périphérique actuellement marqué pour l’amorçage et cliquez sur le bouton `Ne pas installer le chargeur d’amorçage`. Ceci enlèvera la coche et assurera que [application]*GRUB2* ne soit installé sur aucun périphérique.

source: If you choose not to install a boot loader for any reason, you will not be able to boot the system directly, and you must use another boot method, such as a stand-alone commercial boot loader application. Use this option only if you are sure you have another way to boot your system.
fr: Si vous choisissez de ne pas installer de chargeur d’amorçage pour une raison quelconque, vous ne pourrez pas démarrer le système directement et vous devrez utiliser une autre méthode d’amorçage, telle qu’un chargeur d’amorçage commercial autonome. N’utilisez cette option que si vous êtes sûr de disposer d’une autre méthode pour amorcer votre système.

source: The boot loader may also require a special partition to be created, depending on whether your system uses BIOS or UEFI firmware and also depending on whether the boot drive has a _GUID Partition Table_ (GPT) or a `Master Boot Record` (MBR, also known as msdos) label. If you use automatic partitioning, the installer will create this partition if needed. For details, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
fr: Le chargeur d’amorçage peut également nécessiter la création d’une partition spéciale, selon que votre système utilise un BIOS ou un micrologiciel UEFI et selon que le disque d’amorçage possède une étiquette _Table de partition GUID_ (GPT) ou `Master Boot Record` (MBR, également connu sous le nom de msdos). Si vous utilisez le partitionnement automatique, l’installateur créera cette partition si nécessaire. Pour plus de détails, référez-vous à xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Schéma de partitionnement recommandé].
