Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/SummaryHub.po
Languages: es

source: Installation Summary
es: Resumen de la Instalación

source: The `Installation Summary` screen is the central location for setting up an installation. Most of the options which can be configured during the installation can be accessed from here.
es: La pantalla `Resumen de la Instalación` es la localización central para configurar una instalación. A la mayoría de las opciones que pueden ser configuradas durante la instalación se accede desde aquí.

source: The Installation Summary screen
es: Pantalla Resumen de la Instalación

source: If you used a Kickstart option or a boot option to specify an installation repository on a network, but no network is available at the start of the installation, the installer will display the `Network Configuration` screen for you to set up a network connection prior to displaying the `Installation Summary` screen.
es: Si usted utiliza una opción Kickstart o una opción de arranque para especificar un repositorio de instalación en una red, pero la red no está disponible al inicio de la instalación, el instalador mostrará la pantalla `Configuración de Red` para que usted configure una conexión de red antes de mostrar la pantalla `Resumen de la Instalación`.

source: The summary screen consists of several links to other screens, separated into categories. These links can be in several different states, which are graphically indicated:
es: La pantalla resumen consta de diversos enlaces a otras pantallas, separadas en categorías. Estos enlaces pueden estar en diversos estados, que se indican gráficamente:

source: A *warning symbol* (yellow triangle with an exclamation mark) next to an icon means that a screen requires your attention before you start the installation. This typically happens with the `Installation Destination` screen, because even though there is a default automatic partitioning variant, you always have to at least confirm this selection, even if you do not want to make any changes.
es: Un *símbolo de advertencia* (triángulo amarillo con una marca de exclamación) cerca de un icono significa que una pantalla requiere su atención antes de iniciar la instalación. Esto normalmente sucede con la pantalla `Destino de la Instalación`, porque aunque hay una variante de partición automática predeterminada, siempre tiene que, al menos, confirmar esta selección, aunque no desee hacer ningún cambio.

source: If a link is *greyed out*, it means that the installer is currently configuring this section, and you must wait for the configuration to finish before accessing that screen. This typically happens when you change the installation source in the `Installation Source` screen and the installer is probing the new source location and gathering a list of available packages.
es: Si un enlace está en *gris*, significa que el instalador está configurando esta sección en este momento y debe esperar a que la configuración termine antes de acceder a esta pantalla. Esto normalmente sucede cuando usted cambia la fuente de instalación en la pantalla `Fuente de la Instalación` y el instalador está probando la nueva localización de la fuente y obteniendo una lista de los paquetes disponibles.

source: Screens with *black text and no warning symbol* mean that this screen does not require your attention. You can still change your settings in these screens, but it is not necessary to do so to complete the installation. This typically happens with localization settings, as these are either detected automatically, or set up on the previous screen where you select your language and locale.
es: Las pantallas con el *texto en negro y sin símbolo de advertencia* indican que esa pantalla no requiere su atención. Usted puede cambiar los ajustes de esas pantallas, pero no es necesario que lo haga para completar la instalación. Esto normalmente sucede con los ajustes de ubicación, ya que o bien se ha detectado automáticamente o se ha configurado en la pantalla anterior cuando usted selecciono el idioma y el lugar.

source: A warning message is displayed at the bottom of the summary screen, and the `Begin Installation` button is greyed out, as long as at least one item has not been configured yet.
es: Se muestra un mensaje de advertencia en la parte inferior de la pantalla resumen y el botón `Empezar la Instalación` está en gris, siempre que al menos un elemento no se haya configurado todavía.

source: Icon States in Installation Summary
es: Icono de Estado en el Resumen de la Instalación

source: A screenshot of several icons in the Installation Summary screen
es: Pantallazo de varios iconos en la pantalla Resumen de la Instalación

source: Each screen also has an explanatory text below its title, showing settings currently configured in that screen. This text may be concatenated; in that case, move your mouse cursor over it and wait until a tooltip with the full text appears.
es: Cada pantalla también tiene un texto explicativo debajo de su título, mostrando los ajustes que están configurados en esa pantalla. Este texto puede esta concatenado; en este caso, mueva el cursor sobre él y espere a que aparezca una herramienta de con el texto completo.

source: Tooltip in the Installation Summary
es: Herramienta de Información en el Resumen de la Instalación

source: An entry in the Installation Summary shows a truncated description and a tooltip with full text.
es: Una entrada en el Resumen de la Instalación muestra una descripción truncada y una herramienta de información con el texto completo.

source: Once you configure everything required for the installation, you can press the `Begin Installation` button to start installing {PRODUCT}. This will take you to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Configuration and Installation Progress]. Note that as the text below this button says, nothing will be written to your hard drive before you press this button. You can press `Quit` at any point; this will discard all changes you made in the installer so far and reboot the system.
es: Una vez que ha configurado todo lo que se requiere para la instalación, puede presionar el botón `Empezar Instalación` para iniciar la instalación de {PRODUCT}. Esto le llevará a xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Configuración y Progreso de la Instalación]. Advierta que como el texto debajo del botón dice, no se escribirá nada en su disco duro antes de que usted presione este botón. Usted puede presionar `Salir` en cualquier punto; esto descartará todos los cambios que haya hecho y reinicia el sistema.
