Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/install/UserSpoke.po
Languages: pt_br, tr

source: Create User
pt_br: Criar usuário
tr: Kullanıcı Oluştur

source: The `Create User` screen can be used to create and configure one normal (non-`root`) user account during the installation. Only one user account can be configured here; if you require more accounts, wait until the installation completes, reboot your system and then create other accounts using either the [command]#useradd# command in a terminal, or a graphical utility for managing user accounts (for example, the `Users` screen in the Settings menu in [application]*GNOME*).
pt_br: A tela `Criar usuário` pode ser usada para criar e configurar uma conta de usuário normal (não `root`) durante a instalação. Apenas uma conta de usuário pode ser configurada aqui; se você precisar de mais contas, espere até que a instalação seja concluída, reinicie seu sistema e crie outras contas usando o comando [command]#useradd# em um terminal ou um utilitário gráfico para gerenciar contas de usuário (por exemplo, a tela `Usuários` no menu Configurações no [application]*GNOME*).
tr: `Kullanıcı Oluştur` ekranı, kurulum sırasında bir normal (`root` olmayan) kullanıcı hesabı oluşturmak ve yapılandırmak için kullanılabilir. Burada yalnızca bir kullanıcı hesabı yapılandırılabilir; daha fazla hesaba ihtiyacınız varsa kurulum tamamlanana kadar bekleyin, sisteminizi yeniden başlatın ve ardından bir terminalde [command]#useradd# komutunu ya da kullanıcı hesaplarını yönetmek için bir grafiksel yardımcı programı (örneğin, [application]*GNOME* Ayarlar menüsündeki `Kullanıcılar` ekranı) kullanarak diğer hesapları oluşturun.

source: Creating a normal user account is not required to finish the installation; however, it is highly recommended. If you do not create one, you will have to log in to the system as `root` directly, which is *not* recommended.
pt_br: A criação de uma conta de usuário normal não é necessária para finalizar a instalação; no entanto, é altamente recomendado. Se você não criar uma, terá que se autenticar no sistema como `root` diretamente, o que *não* é recomendado.
tr: Kurulumu bitirmek için normal bir kullanıcı hesabı oluşturmak gerekli değildir; ancak şiddetle tavsiye edilir. Eğer bir tane oluşturmazsanız, sistemde doğrudan `root` olarak oturum açmanız gerekecektir, bu da tavsiye *edilmez*.

source: The Create User screen. Use the text input fields to create a user account and configure its settings.
pt_br: A tela Criar usuário. Use os campos de entrada de texto para criar uma conta de usuário e definir suas configurações.
tr: Kullanıcı Oluştur ekranı. Bir kullanıcı hesabı oluşturmak ve ayarlarını yapılandırmak için metin giriş alanlarını kullanın.

source: To configure a user account, fill out the `Full name` (for example, `John Smith`) and `Username` (for example, `jsmith`). The `username` will used to log in from a command line; if you install a graphical environment, then your graphical login manager will use `Full name`.
pt_br: Para configurar uma conta de usuário, preencha o `Nome completo` (por exemplo, `John Smith`) e `Nome do usuário` (por exemplo, `jsmith`). O `nome de usuário` será usado para se autenticar a partir de uma linha de comando; se você instalar um ambiente gráfico, seu gerenciador de login gráfico usará `Nome completo`.
tr: Bir kullanıcı hesabı yapılandırmak için, `Tam ad` (örneğin, `John Smith`) ve `Kullanıcı adı` (örneğin, `jsmith`) alanlarını doldurun. `Kullanıcı adı` bir komut satırından oturum açmak için kullanılacaktır; bir grafiksel ortam kurarsanız, grafiksel oturum açma yöneticiniz `Tam ad` alanındaki değeri kullanacaktır.

source: Make sure that the `Require a password to use this account` check box is enabled, enter a password you want to use for this account into the `Password` field. The characters you write will be displayed as dots for security. Then, repeat the same password in the `Confirm password` field below to ensure you entered it properly. Both entered passwords must be the same.
pt_br: Certifique-se de que a caixa de seleção `Necessário uma senha para usar essa conta` está habilitada, digite a senha que deseja usar para esta conta no campo `Senha`. Os caracteres que você escrever serão exibidos como pontos de segurança. Em seguida, repita a mesma senha no campo `Confirmar senha` abaixo para garantir que a inseriu corretamente. As duas senhas inseridas devem ser iguais.
tr: `Bu hesabı kullanmak için parola gerektir` onay kutusunun işaretlendiğinden emin olun, bu hesap için kullanmak istediğiniz parolayı `Parola` alanına girin. Yazdığınız karakterler güvenlik gerekçesiyle nokta olarak görüntülenecektir. Ardından, doğru bir şekilde girdiğinizden emin olmak için aşağıdaki `Parolayı onayla` alanında aynı parolayı tekrarlayın. Girilen her iki parola da aynı olmalıdır.

source: As you enter the password, it will be evaluated and the installer will determine the password's strength. If the installer considers your password weak, a message will appear at the bottom of the screen, explaining which aspect of your chosen password is considered insuficient. For example:
pt_br: Conforme você insere a senha, ela é avaliada e o instalador determina a força da senha. Caso o instalador considere sua senha fraca, aparecerá uma mensagem na parte inferior da tela, explicando qual aspecto da senha escolhida é considerado insuficiente. Por exemplo:
tr: Siz girerken parolanız değerlendirilecek ve kurucu parolanın sağlamlığını belirleyecektir. Kurucu parolanızın zayıf olduğunu düşünürse, ekranın alt kısmında seçtiğiniz parolanın hangi yönünün yetersiz olduğunu açıklayan bir mesaj görünecektir. Örneğin:

source: `The password you have provided is weak:` `The password is shorter than 5 characters.`
pt_br: `A senha inserida é fraca:` `A senha tem menos de 5 caracteres.`
tr: `Sağladığınız parola zayıf:` `Parola 5 karakterden kısa.`

source: If a message similar to the above appears, it is highly recommended to choose a different, stronger password.
pt_br: Se uma mensagem semelhante à acima for exibida, é altamente recomendável escolher uma senha diferente e mais forte.
tr: Yukarıdakine benzer bir mesaj görünürse, farklı ve daha sağlam bir parola seçmeniz şiddetle tavsiye edilir.

source: The `Make this user administrator` check box gives the user you are creatng administrative rights (by adding this user into the `wheel` group), allowing this user to use the [command]#sudo# command to perform tasks normally only available to `root` using only the user password, instead of the `root` password. This may be more convenient, but can also pose a security risk.
pt_br: A caixa de seleção `Tornar esse usuário administrador` dá ao usuário que você está criando direitos administrativos (adicionando este usuário ao grupo `wheel`), permitindo que este usuário use o comando [command]#sudo# para executar tarefas normalmente disponíveis apenas para `root` usando apenas a senha do usuário, ao invés da senha `root`. Isso pode ser mais conveniente, mas também pode representar um risco à segurança.
tr: `Bu kullanıcıyı yönetici yap` onay kutusu, oluşturduğunuz kullanıcıya (bu kullanıcıyı `wheel` grubuna ekleyerek) yönetici hakları verir, bu da bu kullanıcının `root` parolası yerine sadece kendi parolası ile normalde yalnızca `root` kullanıcısının yapabileceği görevleri gerçekleştirmek için [command]#sudo# komutunu kullanmasına izin verir. Bunun kullanımı daha kolay olabilir, ancak aynı zamanda bir güvenlik riski de oluşturabilir.

source: If you give administrator privileges to an user, make sure that the account is protected by a strong password. Never give an user administrator privileges without requiring any password for the account.
pt_br: Se você conceder privilégios de administrador a um usuário, certifique-se de que a conta esteja protegida por uma senha forte. Nunca conceda privilégios de administrador a um usuário sem exigir nenhuma senha para a conta.
tr: Bir kullanıcıya yönetici ayrıcalıkları verirseniz, hesabın güçlü bir parola ile korunduğundan emin olun. Hesap için herhangi bir parola gerektirmeden bir kullanıcıya yönetici ayrıcalıkları vermeyin.

source: See the [citetitle]_{PRODUCT} Security Guide_, available at the link:++https://docs.fedoraproject.org/++[], for detailed information about password security including guidelines for selecting strong passwords.
pt_br: Veja o [citetitle]_{PRODUCT} Security Guide_ (guia de segurança), disponível no link:++https://docs.fedoraproject.org/++[], para obter informações detalhadas sobre segurança de senha, incluindo diretrizes para a seleção de senhas fortes.
tr: Güçlü parolalar seçme yönergeleri dahil parola güvenliği hakkında ayrıntılı bilgi için link:++https://docs.fedoraproject.org/++[] adresindeki [citetitle]_{PRODUCT} Güvenlik Kılavuzuna_ bakın.

source: To additional settings, click the `Advanced` button below the password input fields. A new dialog window titled `Advanced User Configuration` will open. This dialog is described in the following section.
pt_br: Para configurações adicionais, clique no botão `Avançado` abaixo dos campos de entrada de senha. Uma nova janela de diálogo intitulada `Configuração avançada de usuário` será aberta. Esta caixa de diálogo é descrita na seção a seguir.
tr: Ek ayarlar için, parola giriş alanlarının altındaki `Gelişmiş` düğmesine tıklayın. `Gelişmiş Kullanıcı Yapılandırma` başlıklı yeni bir iletişim penceresi açılacaktır. Bu iletişim penceresi aşağıdaki bölümde açıklanmaktadır.

source: Advanced User Configuration
pt_br: Configuração avançada de usuário
tr: Gelişmiş Kullanıcı Yapılandırma

source: The `Advanced User Configuration` dialog allows you to change the following settings for the new user account.
pt_br: A caixa de diálogo `Configuração avançada de usuário` permite que você altere as seguintes configurações para a nova conta de usuário.
tr: `Gelişmiş Kullanıcı Yapılandırma` iletişim penceresi, yeni kullanıcı hesabı için aşağıdaki ayarları değiştirmenize olanak tanır.

source: Advanced settings for the new user account.
pt_br: Configurações avançadas para a nova conta de usuário.
tr: Yeni kullanıcı hesabı için gelişmiş ayarlar.

source: The user's `Home directory` (`/home/pass:attributes[{blank}]_username_pass:attributes[{blank}]` by default).
pt_br: O `Diretório home` do usuário (`/home/pass:attributes[{blank}]_nome de usuário_pass:attributes[{blank}]` por padrão).
tr: Kullanıcının `Ev dizini` (öntanımlı olarak `/home/pass:attributes[{blank}]_kullanıcı-adı_pass:attributes[{blank}]`).

source: The user's ID (UID). The default value is 1000. UIDs 0-999 are reserved by the system so they can not be assigned to an user.
pt_br: O ID do usuário (UID). O valor padrão é 1000. UIDs 0-999 são reservados pelo sistema, portanto, não podem ser atribuídos a um usuário.

source: The the group ID (GID) of the user's default group. The default group name will be the same as the user name, and its default GID is 1000. GIDs 0-999 are reserved by the system so they can not be assigned to an user's group.
pt_br: O ID do grupo (GID) do grupo padrão do usuário. O nome do grupo padrão será o mesmo que o nome do usuário e seu GID padrão é 1000. Os GIDs 0-999 são reservados pelo sistema para que não possam ser atribuídos a um grupo de usuários.

source: The user's group membership. The user account you are creating will always have one default group membership (the user's default group with an ID set in the `Specify a group ID manually` field). In the `Group Membership` field, you can specify additional groups as a comma-separated list. Groups which do not already exist will be created; you can specify custom GIDs for them in parentheses. If you do not specify a custom GID for a new group, it will be assigned automatically.
pt_br: A participação do usuário ao grupo. A conta de usuário que você está criando sempre terá uma associação de grupo padrão (o grupo padrão do usuário com um ID definido no campo `Especifique um ID de usuário manualmente`). No campo `Participação do Grupo`, você pode especificar grupos adicionais como uma lista separada por vírgulas. Grupos que ainda não existem serão criados; você pode especificar GIDs personalizados para eles entre parênteses. Se você não especificar um GID personalizado para um novo grupo, ele será atribuído automaticamente.
tr: Kullanıcının grup üyeliği. Oluşturmakta olduğunuz kullanıcı hesabının her zaman bir öntanımlı grup üyeliği olacaktır (`Elle bir grup kimliği belirtin` alanında kimliği ayarlanmış olan, kullanıcının öntanımlı grubu). `Grup Üyeliği` alanında, virgülle ayrılmış bir liste olarak ek grupları belirtebilirsiniz. Zaten var olmayan gruplar oluşturulacaktır; parantez içinde onlar için özel GID'ler belirtebilirsiniz. Yeni bir grup için özel bir GID belirtmezseniz, bu otomatik olarak atanacaktır.

source: The user's ID (UID). The default value is 1000. UIDs 0-999 are reserved by the system so they cannot be assigned to an user.
tr: Kullanıcının kimliği (UID). Öntanımlı değer 1000'dir. 0-999 arasındaki değerler sistem için ayrıldığından bir kullanıcıya atanamazlar.

source: The the group ID (GID) of the user's default group. The default group name will be the same as the user name, and its default GID is 1000. GIDs 0-999 are reserved by the system so they cannot be assigned to an user's group.
tr: Kullanıcının öntanımlı grubunun grup kimliği (GID). Öntanımlı grup adı, kullanıcı adıyla aynı olacaktır ve öntanımlı GID değeri 1000'dir. 0-999 arasındaki değerler sistem için ayrıldığından bir kullanıcının grubuna atanamazlar.
