Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/_partials/install/CustomSpoke_PartitioningAdvice.po
Languages: pt_br

source: Advice on Partitions
pt_br: Conselhos sobre Partições

source: There is no best way to partition every system; the optimal setup depends on how you plan to use the system being installed. However, the following tips may help you find the optimal layout for your needs:
pt_br: Não existe a melhor maneira de particionar todos os sistemas; a configuração ideal depende de como você planeja usar o sistema que está sendo instalado. No entanto, as dicas a seguir podem ajudá-lo a encontrar o layout ideal para suas necessidades:

source: Consider encrypting any partitions and volumes which might contain sensitive data. Encryption prevents unauthorized people from accessing the data on the partitions, even if they have access to the physical storage device. In most cases, you should at least encrypt the `/home` partition, which contains user data.
pt_br: Considere criptografar quaisquer partições e volumes que possam conter dados confidenciais. A criptografia evita que pessoas não autorizadas acessem os dados nas partições, mesmo que tenham acesso ao dispositivo de armazenamento físico. Na maioria dos casos, você deve pelo menos criptografar a partição `/home`, que contém os dados do usuário.

source: In some cases, creating separate mount points for directories other than `/`, `/boot` and `/home` may be useful; for example, on a server running a [application]*MySQL* database, having a separate mount point for `/var/lib/mysql` will allow you to preserve the database during a reinstallation without having to restore it from backup afterwards. However, having unnecessary separate mount points will make storage administration more difficult.
pt_br: Em alguns casos, criar pontos de montagem separados para diretórios diferentes de `/`, `/boot` e `/home` pode ser útil; por exemplo, em um servidor executando um banco de dados [application]*MySQL*, ter um ponto de montagem separado para `/var/lib/mysql` permitirá que você preserve o banco de dados durante uma reinstalação sem ter que restaurá-lo do backup posteriormente. No entanto, ter pontos de montagem separados desnecessários tornará a administração do armazenamento mais difícil.

source: Some special restrictions apply to certain directories with regards on which partitioning layouts can they be placed. Notably, the `/boot` directory must always be on a physical partition (not on an LVM volume or a Btrfs subvolume), and `/usr` can not be on a Btrfs subvolume.
pt_br: Algumas restrições especiais se aplicam a certos diretórios com relação aos layouts de particionamento que eles podem ser colocados. Notavelmente, o diretório `/boot` deve sempre estar em uma partição física (não em um volume LVM ou um subvolume Btrfs), e `/usr` não pode estar em um subvolume Btrfs.

source: If you are new to Linux, consider reviewing the [citetitle]_Linux Filesystem Hierarchy Standard_ at link:++https://refspecs.linuxfoundation.org/FHS_2.3/fhs-2.3.html++[] for information about various system directories and their contents.
pt_br: Se você é novo no Linux, considere revisar a [citetitle]_Linux Filesystem Hierarchy Standard_ em link:++https://refspecs.linuxfoundation.org/FHS_2.3/fhs-2.3.html++[] para obter informações sobre vários diretórios de sistemas e seus conteúdos.

source: Each kernel installed on your system requires approximately 20 MB on the `/boot` partition. The default partition size of 500 MB for `/boot` should suffice for most common uses; increase the size of this partition if you plan to keep many kernels installed at the same time.
pt_br: Cada kernel instalado em seu sistema requer aproximadamente 20 MB na partição `/boot`. O tamanho da partição padrão de 500 MB para `/boot` deve ser suficiente para os usos mais comuns; aumente o tamanho desta partição se você planeja manter muitos kernels instalados ao mesmo tempo.

source: The `/var` directory holds content for a number of applications, including the [application]*Apache* web server, and is used by the [application]*DNF* package manager to temporarily store downloaded package updates. Make sure that the partition or volume containing `/var` has at least 3 GB.
pt_br: O diretório `/var` contém conteúdo para vários aplicativos, incluindo o servidor da web [application]*Apache*, e é usado pelo gerenciador de pacotes [application]*DNF* para armazenar temporariamente as atualizações dos pacotes baixados. Certifique-se de que a partição ou volume que contém `/var` tenha pelo menos 3 GB.

source: The contents of the `/var` directory usually change very often. This may cause problems with older solid state drives (SSDs), as they can handle a lower number of read/write cycles before becoming unusable. If your system root is on an SSD, consider creating a separate mount point for `/var` on a classic (platter) HDD.
pt_br: O conteúdo do diretório `/var` geralmente muda com muita frequência. Isso pode causar problemas com unidades de estado sólido (SSDs) mais antigas, pois podem lidar com um número menor de ciclos de leitura/gravação antes de se tornarem inutilizáveis. Se a raiz do seu sistema estiver em um SSD, considere a criação de um ponto de montagem separado para `/var` em um HDD clássico.

source: The `/usr` directory holds the majority of software on a typical {PRODUCT} installation. The partition or volume containing this directory should therefore be at least 5 GB for minimal installations, and at least 10 GB for installations with a graphical environment.
pt_br: O diretório `/usr` contém a maioria do software em uma instalação típica do {PRODUCT}. A partição ou volume que contém este diretório deve, portanto, ter pelo menos 5 GB para instalações mínimas e pelo menos 10 GB para instalações com um ambiente gráfico.

source: If `/usr` or `/var` is partitioned separately from the rest of the root volume, the boot process becomes much more complex because these directories contain boot-critical components. In some situations, such as when these directories are placed on an iSCSI drive or an FCoE location, the system may either be unable to boot, or it may hang with a `Device is busy` error when powering off or rebooting.
pt_br: Se `/usr` ou `/var` for particionado separadamente do resto do volume raiz, o processo de inicialização se torna muito mais complexo porque esses diretórios contêm componentes críticos para a inicialização. Em algumas situações, como quando esses diretórios são colocados em um drive iSCSI ou em um local FCoE, o sistema pode não conseguir inicializar ou pode travar com um erro `Device is busy` ao desligar ou reinicializar.

source: This limitation only applies to `/usr` or `/var`, not to directories below them. For example, a separate partition for `/var/www` will work without issues.
pt_br: Esta limitação se aplica apenas a `/usr` ou `/var`, não aos diretórios abaixo deles. Por exemplo, uma partição separada para `/var/www` funcionará sem problemas.

source: Consider leaving a portion of the space in an LVM volume group unallocated. This unallocated space gives you flexibility if your space requirements change but you do not wish to remove data from other volumes. You can also select the `Thin provisioning` device type for the partition to have the unused space handled automatically by the volume.
pt_br: Considere deixar uma parte do espaço em um grupo de volume LVM não alocado. Este espaço não alocado oferece flexibilidade se seus requisitos de espaço mudarem, mas você não deseja remover dados de outros volumes. Você também pode selecionar o tipo de dispositivo de `Provisionamento fino` para a partição para que o espaço não utilizado seja tratado automaticamente pelo volume.

source: The size of an `XFS` file system can not be reduced - if you need to make a partition or volume with this file system smaller, you must back up your data, destroy the file system, and create a new, smaller one in its place. Therefore, if you expect needing to manipulate your partitioning layout later, you should use the `ext4` file system instead.
pt_br: O tamanho de um sistema de arquivos `XFS` não pode ser reduzido – se você precisa diminuir uma partição ou volume com este sistema de arquivos, você deve fazer backup de seus dados, destruir o sistema de arquivos e criar um novo e menor em seu lugar. Portanto, se você espera precisar manipular seu layout de particionamento mais tarde, deve usar o sistema de arquivos `ext4`.

source: Use Logical Volume Management (LVM) if you anticipate expanding your storage by adding more hard drives after the installation. With LVM, you can create physical volumes on the new drives, and then assign them to any volume group and logical volume as you see fit - for example, you can easily expand your system's `/home` (or any other directory residing on a logical volume).
pt_br: Use Gerenciador de Volume Lógico (LVM) se você pretende expandir seu armazenamento adicionando mais discos rígidos após a instalação. Com o LVM, você pode criar volumes físicos nas novas unidades e, em seguida, atribuí-los a qualquer grupo de volume e volume lógico conforme achar necessário – por exemplo, você pode facilmente expandir o `/home` de seu sistema (ou qualquer outro diretório residente em um volume lógico).

source: Creating a BIOS Boot partition or an EFI System Partition may be necessary, depending on your system's firmware, boot drive size, and boot drive disk label. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for information about these partitions. Note that the graphical installer will not let you create a BIOS Boot or EFI System Partition if your system does *not* require one - in that case, they will be hidden from the menu.
pt_br: Pode ser necessário criar uma partição de inicialização do BIOS ou uma partição de sistema EFI, dependendo do firmware do sistema, tamanho da unidade de inicialização e rótulo do disco da unidade de inicialização. Veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de Particionamento Recomendado] para informações sobre essas partições. Observe que o instalador gráfico não permitirá que você crie uma inicialização do BIOS ou partição do sistema EFI se o seu sistema *não* exigir uma – nesse caso, eles serão ocultados do menu.

source: If you need to make any changes to your storage configuration after the installation, {PRODUCT} repositories offer several different tools which can help you do this. If you prefer a command line tool, try [package]*system-storage-manager*.
pt_br: Se você precisar fazer qualquer alteração em sua configuração de armazenamento após a instalação, os repositórios do {PRODUCT} oferecem várias ferramentas diferentes que podem ajudá-lo a fazer isso. Se você preferir uma ferramenta de linha de comando, tente [package]*system-storage-manager*.
