Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/_partials/install/CustomSpoke_AddPhysical.po
Languages: pt_br

source: Creating Standard Partitions
pt_br: Criando Partições Padrão

source: _Standard partitions_ are the most common type of partition, with the widest support across operating systems. For example, Microsoft Windows uses exclusively physical partitions and can not natively work with LVM or Btrfs. Most {PRODUCT} partitioning setups will also require at least one standard partition for the `/boot` directory, and possibly also another standard partition with the BIOS Boot or EFI System file system to store the boot loader.
pt_br: _Partições padrão_ são o tipo mais comum de partição, com o suporte mais amplo entre os sistemas operacionais. Por exemplo, o Microsoft Windows usa partições exclusivamente físicas e não pode funcionar nativamente com LVM ou Btrfs. A maioria das configurações de particionamento do {PRODUCT} também exigirá pelo menos uma partição padrão para o diretório `/boot` e, possivelmente, também outra partição padrão com a BIOS Boot ou sistema de arquivos de sistema EFI para armazenar o carregador de inicialização.

source: See xref:appendixes/Disk_Partitions.adoc#appe-disk-partitions-overview[An Introduction to Disk Partitions] for additional information about the concepts behind physical partitions.
pt_br: Veja xref:appendixes/Disk_Partitions.adoc#appe-disk-partitions-overview[Uma Introdução às Partições de Disco] para informações adicionais sobre os conceitos por trás das partições físicas.

source: Create Standard Partition
pt_br: Criar uma Partição Padrão

source: The Manual Partitioning screen
pt_br: A tela Particionamento Manual

source: Follow the procedure below to create mount points on standard physical partitions:
pt_br: Siga o procedimento abaixo para criar pontos de montagem em partições físicas padrão:

source: Click the `+` button at the bottom of the list showing existing mount points. A new dialog window will open.
pt_br: Clique no botão `+` na parte inferior da lista mostrando os pontos de montagem existentes. Uma nova janela de diálogo será aberta.

source: In the new dialog window, specify a mount point for which you want to create a separate mount point - for example, `/`. Optionally, specify a size for the partition using standard units such as MB or GB (for example, `50GB`). Then, click `Add mount point` to add the mount point and return to the main partitioning screen.
pt_br: Na nova janela de diálogo, especifique um ponto de montagem para o qual deseja criar um ponto de montagem separado – por exemplo, `/`. Opcionalmente, especifique um tamanho para a partição usando unidades padrão como MB ou GB (por exemplo, `50GB`). Em seguida, clique em `Adicionar um ponto de montagem` para adicionar o ponto de montagem e retornar à tela principal de particionamento.

source: When creating a swap partition, specify the mount point as `swap`. For a BIOS Boot partition, use `biosboot`. For an EFI System Partition, use `/boot/efi`.
pt_br: Ao criar uma partição swap, especifique o ponto de montagem como `swap`. Para uma partição de Inicialização do BIOS, use `biosboot`. Para uma partição de Sistema EFI, use `/boot/efi`.

source: For information about these partition types, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme].
pt_br: Para informações sobre esses tipos de partição, veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de Partição Recomendado].

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume. Select the newly created mount point in the left pane to configure it further, and convert it to a physical partition by changing the `Device Type` option to `Standard Partition`. Then, click `Update Settings` in the bottom right corner of the screen.
pt_br: O ponto de montagem agora foi criado usando as configurações padrão, o que significa que foi criado como um volume lógico LVM. Selecione o ponto de montagem recém-criado no painel esquerdo para configurá-lo ainda mais e convertê-lo em uma partição física alterando a opção `Tipo de Dispositivo` para `Partição Padrão`. Em seguida, clique em `Atualizar Configurações` no canto inferior direito da tela.

source: In the `Device(s)` section on the right side of the screen, you can see that the partition has been assigned to one or more hard drives. Click the `Modify` button to configure on which drive this partition will be created.
pt_br: Na seção `Dispositivo(s)` no lado direito da tela, você pode ver que a partição foi atribuída a um ou mais discos rígidos. Clique no botão `Modificar` para configurar em qual drive esta partição será criada.

source: In the `Configure Mount Point` dialog, you can specify which physical devices (disks) this volume *may* reside on. You can select one or more disks which will be used to hold this volume by holding down kbd:[Ctrl] and clicking each disk in the list. If you select multiple disks here, [application]*Anaconda* will determine where exactly the partition should be created based on how you configured the rest of the installation. If you want to make sure that this partition is placed on a specific hard drive, select only that drive and unselect all others.
pt_br: Na caixa de diálogo `Configurar Ponto de Montagem`, você pode especificar em quais dispositivos físicos (discos) este volume *pode* residir. Você pode selecionar um ou mais discos que serão usados para manter este volume, mantendo pressionado kbd:[Ctrl] e clicando em cada disco na lista. Se você selecionar vários discos aqui, o [application]*Anaconda* determinará onde exatamente a partição deve ser criada com base em como você configurou o resto da instalação. Se você quiser ter certeza de que esta partição foi colocada em um disco rígido específico, selecione apenas essa unidade e desmarque todas as outras.

source: After you finish configuring the partition's location, click `Save` to return to the main `Manual Partitioning` screen.
pt_br: Após terminar de configurar a localização da partição, clique em `Salvar` para retornar à tela principal `Particionamento Manual`.

source: Configure other settings specific to the partition - its `Mount Point`, `Desired Capacity`, and `File System`. Press `Update Settings` to apply any changes to the configuration.
pt_br: Defina as outras configurações específicas para a partição – seu `Ponto de Montagem`, `Capacidade Desejada` e `Sistema de Arquivos`. Pressione `Atualizar Configurações` para aplicar quaisquer alterações à configuração.

source: Repeat this procedure for any additional standard partitions you want to create.
pt_br: Repita este procedimento para todas as partições padrão adicionais que deseja criar.
