Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/_partials/install/CustomSpoke_SoftwareRAID.po
Languages: tr

source: Creating Software RAID
tr: Yazılımsal RAID Oluşturma

source: _Redundant arrays of independent disks_ (RAIDs) are constructed from multiple storage devices that are arranged to provide increased performance and, in some configurations, greater fault tolerance. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types] for a description of different kinds of RAIDs.
tr: _Bağımsız disklerin yedekli dizileri_ (Redundant arrays of independent disks - RAID), artırılmış performans ve bazı yapılandırmalarda hatalara karşı daha fazla dayanıklılık sağlayacak şekilde düzenlenen birden çok depolama aygıtından oluşturulur. Farklı RAID türlerinin açıklamaları için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Aygıt, Dosya Sistemi ve RAID Türleri] bölümüne bakın.

source: A RAID device is created in one step, and disks are added or removed as necessary. One RAID partition per physical disk is allowed for each device, so the number of disks available to the installation program determines which levels of RAID device are available to you. For example, if your system has two hard drives, the installation program will not allow you to create a RAID10 device, which requires 4 separate partitions.
tr: Bir RAID aygıtı tek bir adımda oluşturulur ve gerektiğinde diskler eklenir veya çıkarılır. Her aygıt için fiziksel disk başına bir RAID bölümüne izin verilir, bu nedenle kurulum programında bulunan kullanılabilir disk sayısı, sizin için hangi RAID aygıt düzeylerinin kullanılabilir olduğunu belirler. Örneğin, sisteminizde iki sabit disk varsa, kurulum programı 4 ayrı bölüm gerektiren bir RAID10 aygıtı oluşturmanıza izin vermeyecektir.

source: This section only explains how to create software RAID with standard (physical) partitions. However, you can also configure LVM volume groups and Btrfs volumes to use RAID and place their logical volumes or Btrfs subvolumes on top of this RAID array. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Creating a Logical Volume Management (LVM) Layout] and xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Creating a Btrfs Layout] for instructions on creating RAID in LVM and Btrfs.
tr: Bu bölümde yalnızca standart (fiziksel) bölümlerle nasıl yazılımsal RAID oluşturulacağı açıklanmaktadır. Ancak, LVM birim gruplarını ve Btrfs birimlerini RAID kullanacak şekilde yapılandırabilir ve onların mantıksal birimlerini veya Btrfs alt birimlerini bu RAID dizisinin üstüne yerleştirebilirsiniz. LVM ve Btrfs'de RAID oluşturma talimatları için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Mantıksal Birim Yönetimi (Logical Volume Management - LVM) Düzeni Oluşturma] ve xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-btrfs[Btrfs Düzeni Oluşturma] bölümlerine bakın.

source: Create Software RAID
tr: Yazılımsal RAID Oluştur

source: The Manual Partitioning screen
tr: Elle Bölümlendirme ekranı

source: RAID configuration options are only visible if you have selected two or more disks for installation. At least two disks are required to create a RAID device, and some RAID layouts will require more. Requirements for different types of RAID are described in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types].
tr: RAID yapılandırma seçenekleri yalnızca kurulum için iki veya daha fazla disk seçtiyseniz görünür. Bir RAID aygıtı oluşturmak için en az iki disk gereklidir ve bazı RAID düzenleri daha fazlasını gerektirir. Farklı RAID türleri için gereksinimler xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Aygıt, Dosya Sistemi ve RAID Türleri] bölümünde açıklanmaktadır.

source: Follow the procedure below to create software RAID:
tr: Yazılımsal RAID oluşturmak için aşağıdaki adımları izleyin:

source: Click the `+` button at the bottom of the list showing existing mount points. A new dialog window will open.
tr: Mevcut bağlama noktalarını gösteren listenin altındaki `+` düğmesine tıklayın. Yeni bir iletişim penceresi açılacaktır.

source: In the new dialog window, specify a mount point for which you want to create a separate software RAID partition - for example, `/`. Optionally, specify a size for the new partition using standard units such as MB or GB (for example, `50GB`). Then, click `Add mount point` to add the mount point and return to the main partitioning screen.
tr: Yeni iletişim penceresinde, ayrı bir yazılımsal RAID bölümü oluşturmak istediğiniz bir bağlama noktası belirtin - örneğin, `/`. İsteğe bağlı olarak, MB veya GB gibi standart birimler (örneğin, `50GB`) kullanarak yeni bölüm için bir boyut belirtin. Ardından, bağlama noktasını eklemek ve ana bölümlendirme ekranına geri dönmek için `Bağlama noktası ekle` düğmesine tıklayın.

source: When creating a mount point for swap on software RAID, specify the mount point as `swap`.
tr: Yazılımsal RAID üzerinde takas için bir bağlama noktası oluştururken, bağlama noktasını `swap` olarak belirtin.

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume. Select the newly created mount point in the left pane to configure it further, and convert it to a software RAID partition by changing the `Device Type` option to `RAID`.
tr: Bu adımdan sonra bağlama noktası öntanımlı ayarlar kullanılarak, yani bir LVM mantıksal birimi olarak oluşturulur. Daha fazla yapılandırmak için sol bölmede yeni oluşturulan bağlama noktasını seçin ve `Aygıt Türü` seçeneğini `RAID` olarak değiştirerek bir yazılımsal RAID bölümüne dönüştürün.

source: Choose a RAID type from the `RAID Level` drop-down menu. Available RAID types and their requirements are described in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types].
tr: `RAID Seviyesi` açılır menüsünden bir RAID türü seçin. Kullanılabilir RAID türleri ve gereksinimleri xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Aygıt, Dosya Sistemi ve RAID Türleri] bölümünde açıklanmaktadır.

source: In the `Device(s)` section on the right side of the screen, you can see that the partition has been assigned to several physical disks. Click the `Modify` button to configure on which drives this partition will be created.
tr: Ekranın sağ tarafındaki `Aygıt(lar)` bölümünde, bölümün birkaç fiziksel diske atandığını görebilirsiniz. Bu bölümün hangi diskler üzerinde oluşturulacağını yapılandırmak için `Değiştir` düğmesine tıklayın.

source: In the `Configure Mount Point` dialog, you can specify which physical devices (disks) this partition *may* reside on. You can select one or more disks which will be used to hold this partition by holding down kbd:[Ctrl] and clicking each disk in the list. If you want to make sure that this partition is placed on a specific set of hard drives, select only those drives and unselect all others.
tr: `Bağlama Noktası Yapılandır` iletişim kutusunda, bu birimin hangi fiziksel aygıtlarda (diskler) *bulunabileceğini* belirleyebilirsiniz. Bu bölümü tutmak için kullanılacak bir veya daha fazla diski kbd:[Ctrl] tuşuna basılı tutup listedeki her diski tıklayarak seçebilirsiniz. Bu bölümün belirli bir sabit disk kümesinde oluşturulduğundan emin olmak istiyorsanız, yalnızca o diskleri seçin ve diğerlerinin seçimini kaldırın.

source: After you finish configuring the partition's location, click `Save` to return to the main `Manual Partitioning` screen.
tr: Bölümün konumunu yapılandırmayı bitirdikten sonra, ana `Elle Bölümlendirme` ekranına dönmek için `Kaydet` düğmesine tıklayın.

source: Configure other settings specific to the partition - its `Mount Point`, `Desired Capacity`, and `File System`. Press `Update Settings` to apply any changes to the configuration.
tr: Bölüme özgü diğer ayarları yapılandırın - `Bağlama Noktası`, `İstenen Kapasite` ve `Dosya Sistemi`. Değişiklikleri yapılandırmaya uygulamak için `Ayarları Güncelle` düğmesine basın.

source: Repeat this procedure for any additional standard partitions with software RAID you want to create.
tr: Oluşturmak istediğiniz ek yazılımsal RAID ile standart bölümler için bu adımları tekrarlayın.
