Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/_partials/install/FilterSpoke_AddiSCSI.po
Languages: pt_br

source: Add iSCSI Target
pt_br: Adicionar destino iSCSI

source: To use iSCSI storage devices, the installer must be able to discover them as _iSCSI targets_ and be able to create an iSCSI session to access them. Both of these steps may require a user name and password for _Challenge Handshake Authentication Protocol_ (CHAP) authentication.
pt_br: Para usar dispositivos de armazenamento iSCSI, o instalador deve ser capaz de descobri-los como _destinos iSCSI_ e ser capaz de criar uma sessão iSCSI para acessá-los. Ambas as etapas podem exigir um nome de usuário e senha para autenticação _Challenge Handshake Authentication Protocol_ (CHAP).

source: You can also configure an iSCSI target to authenticate the iSCSI initiator on the system to which the target is attached (_reverse CHAP_), both for discovery and for the session. Used together, CHAP and reverse CHAP are called _mutual CHAP_ or _two-way CHAP_. Mutual CHAP provides the greatest level of security for iSCSI connections, particularly if the user name and password are different for CHAP authentication and reverse CHAP authentication.
pt_br: Você também pode configurar um destino iSCSI para autenticar o iniciador iSCSI no sistema ao qual o destino está conectado (_CHAP inverso_), tanto para descoberta quanto para sessão. Usados juntos, o CHAP e o CHAP reverso são chamados de _CAP mútuo_ ou _CAP_ de duas vias. O CHAP mútuo fornece o maior nível de segurança para conexões iSCSI, especialmente se o nome de usuário e a senha forem diferentes para autenticação CHAP e autenticação CHAP reversa.

source: Follow the procedure below to add an iSCSI storage target to your system.
pt_br: Siga o procedimento abaixo para adicionar um destino de armazenamento iSCSI ao seu sistema.

source: Click the `Add iSCSI Target` button in the bottom right corner of the xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks] screen. A new dialog window titled `Add iSCSI Storage Target` will open.
pt_br: Clique no botão `Adicionar iSCSI Target` no canto inferior direito da tela xref:Connecting_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Destino da instalação - Discos especializados e de rede]. Uma nova janela de diálogo intitulada `Adicionar destino de armazenamento iSCSI` será aberta.

source: Enter the IP address of the iSCSI target in the `Target IP Address` field.
pt_br: Insira o endereço IP do destino iSCSI no campo `Endereço IP destino`.

source: Provide a name in the `iSCSI Initiator Name` field for the iSCSI initiator in _iSCSI Qualified Name_ (IQN) format. A valid IQN entry contains:
pt_br: Forneça um nome no campo `Nome do iniciador iSCSI` para o iniciador iSCSI no formato _Nome qualificado iSCSI_ (IQN). Uma entrada IQN válida contém:

source: The string `iqn.` (including the period).
pt_br: A string `iqn.` (incluindo o ponto).

source: A date code specifying the year and month in which your organization's Internet domain or subdomain name was registered, represented as four digits for the year, a dash, and two digits for the month, followed by a period. For example, represent September 2010 as `2010-09.`
pt_br: Um código de data que especifica o ano e mês em que o domínio da Internet da sua organização ou nome de subdomínio foi registrado, representado como quatro dígitos para o ano, um travessão e dois dígitos para o mês, seguidos por um ponto. Por exemplo, represente setembro de 2010 como `2010-09.`

source: Your organization's Internet domain or subdomain name, presented in *reverse* order (with the top-level domain first). For example, represent the subdomain storage.example.com as `com.example.storage`.
pt_br: O domínio da Internet ou nome de subdomínio da sua organização, apresentado na ordem *inversa* (com o domínio de nível superior primeiro). Por exemplo, represente o subdomínio storage.example.com como `com.example.storage`.

source: A colon (`:`) followed by a string which uniquely identifies this particular iSCSI initiator within your domain or subdomain. For example, `:diskarrays-sn-a8675309`
pt_br: Dois pontos (`:`) seguido por uma string que identifica exclusivamente este iniciador iSCSI particular dentro de seu domínio ou subdomínio. Por exemplo, `:diskarrays-sn-a8675309`

source: A complete IQN will therefore look as follows:
pt_br: Um IQN completo via, portanto, se parecer com:

source: An example using the correct format is also displayed below the input field for reference.
pt_br: Um exemplo usando o formato correto também é exibido abaixo do campo de entrada para referência.

source: For more information about IQNs, see [citetitle]_3.2.6. iSCSI Names in RFC 3720 - Internet Small Computer Systems Interface (iSCSI)_, available from link:++https://tools.ietf.org/html/rfc3720#section-3.2.6++[] and [citetitle]_1. iSCSI Names and Addresses in RFC 3721 - Internet Small Computer Systems Interface (iSCSI) Naming and Discovery_, available from link:++https://tools.ietf.org/html/rfc3721#section-1++[].
pt_br: Para mais informações sobre IQNs, veja [citetitle]_3.2.6. iSCSI Names in RFC 3720 - Internet Small Computer Systems Interface (iSCSI)_, disponível em link:++https://tools.ietf.org/html/rfc3720#section-3.2.6++[] e [citetitle]_1. iSCSI Names and Addresses in RFC 3721 - Internet Small Computer Systems Interface (iSCSI) Naming and Discovery_, disponível em link:++https://tools.ietf.org/html/rfc3721#section-1++[].

source: Specify the type of authentication to use for iSCSI discovery using the `Discovery Authentication Type` drop-down menu. Depending on which type of authentication you selected, additional input fields (such as `CHAP Username` and `CHAP Password` may then become visible. Fill in your authentication credentials; these should be provided by your organization.
pt_br: Especifique o tipo de autenticação a ser usado para descoberta iSCSI usando o menu suspenso `Descobrir tipo de autenticação`. Dependendo do tipo de autenticação que você selecionou, campos de entrada adicionais (como `Nome de usuário CHAP` e `Senha CHAP` podem então se tornar visíveis. Preencha suas credenciais de autenticação; elas devem ser fornecidas por sua organização.

source: Click the `Start Discovery` button. The installer will now attempt to discover an iSCSI target based on the information you provided, and if the target requires CHAP or reverse CHAP authentication, it will attempt to use the credentials you provided. This process may take some time (generally less than 30 seconds), depending on your network.
pt_br: Clique no botão `Iniciar descoberta`. O instalador agora tentará descobrir um destino iSCSI com base nas informações fornecidas e, se o destino exigir CHAP ou autenticação CHAP reversa, ele tentará usar as credenciais fornecidas. Este processo pode demorar algum tempo (geralmente menos de 30 segundos), dependendo da sua rede.

source: If the discovery was *not* successful, an error message will be displayed in the dialog window. This message will vary based on which part of the discovery failed. If the installer did not find the target you specified at all, you should check the IP address; if the problem is an authentication error, make sure you entered all CHAP and reverse CHAP credentials correctly and that you have access to the iSCSI target.
pt_br: Se a descoberta *não* foi bem-sucedida, uma mensagem de erro será exibida na janela de diálogo. Esta mensagem irá variar com base em qual parte da descoberta falhou. Se o instalador não encontrou o destino que você especificou, você deve verificar o endereço IP; se o problema for um erro de autenticação, certifique-se de inserir todas as credenciais do CHAP e do CHAP reverso corretamente e de ter acesso ao destino iSCSI.

source: The `No nodes discovered` error message may also mean that all nodes on the address you specified are already configured. During discovery, [application]*Anaconda* ignores nodes which have already been added.
pt_br: A mensagem de erro `No nodes discovered` também pode significar que todos os nós no endereço que você especificou já estão configurados. Durante a descoberta, o [application]*Anaconda* ignora os nós que já foram adicionados.

source: If the discovery was successful, you will see a list of all discovered nodes.
pt_br: Se a descoberta foi bem-sucedida, você verá uma lista de todos os nós descobertos.

source: Select one or more nodes you want to log in to by marking or unmarking the check box next to each node discovered on the target. Below the list, select again the type of authentication you want to use; you can also select the `Use the credentials from discovery` option if the CHAP/reverse CHAP user name and password you used to discover the target are also valid for logging in to it.
pt_br: Selecione um ou mais nós nos quais deseja fazer login marcando ou desmarcando a caixa de seleção ao lado de cada nó descoberto no destino. Abaixo da lista, selecione novamente o tipo de autenticação que deseja usar; você também pode selecionar a opção `Usar as credenciais da descoberta` se o nome de usuário e senha CHAP/CHAP reverso que você usou para descobrir o destino também forem válidos para fazer login nele.

source: You can repeat this procedure to discover additional iSCSI targets, or to add more nodes from a previously configured target. However, note that once you click the `Start Discovery` button for the first time, you will not be able to change the `iSCSI Initiator Name`. If you made an error when configuring the initiator name, you must restart the installation.
pt_br: Você pode repetir este procedimento para descobrir destinos iSCSI adicionais ou para adicionar mais nós de um destino configurado anteriormente. No entanto, observe que depois de clicar no botão `Iniciar descoberta` pela primeira vez, você não poderá alterar o `Nome do iniciador iSCSI`. Se você cometeu um erro ao configurar o nome do iniciador, deve reiniciar a instalação.
