Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/_partials/install/InitialSetupHub.po
Languages: es

source: Initial Setup
es: Configuración inicial

source: The `Initial Setup` screen is shown after the installation finishes and the installed system boots for the first time, before the first login, assuming the following conditions have been met:
es: La pantalla `Configuración Inicial` se muestra después de que finalice la instalación y arranque el sistema instalado por primera vez, después del primer acceso, asumiendo que se han cumplido las siguientes condiciones:

source: Your software selection contained a graphical environment (for example, you installed the system using a {PRODUCT} Workstation live image).
es: Su selección de software contiene un entorno gráfico (por ejemplo, usted instaló sus sistema usando una imagen viva {PRODUCT} Workstation).

source: The graphical environment you have installed is *not* [application]*GNOME Desktop Environment* (it provides its own initial setup utility which is described in xref:After_Installation.adoc#sect-gnome-initial-setup[GNOME Initial Setup]).
es: El entorno gráfico que ha instalado *no* es [application]*Entorno de Escritorio GNOME* (suministra su propia utilidad de configuración inicial que se describe en xref:After_Installation.adoc#sect-gnome-initial-setup[Configuración Inicial de GNOME]).

source: The [package]*initial-setup* package has been installed.
es: Ha sido instalado el paquete [package]*initial-setup*.

source: You have not configured every screen available in the graphical installer.
es: No ha configurado cada pantalla disponible en el instalador gráfico.

source: The main Initial Setup screen. This example shows all options; not all of them may be shown
es: Pantalla principal de Configuración Inicial. Este ejemplo muestra todas las opciones; no todos pueden mostrarse

source: [application]*Initial Setup* allows you to configure several system settings. All of these can also be configured during the installation, but they are not required to finish it. Only the settings which have *not* been configured during the installation will be shown; for example, if you did not create a non-`root` user account during the installation, [application]*Initial Setup* will start after the first reboot, and you will be able to configure one. If you configured all available options during the instalaltion, [application]*Initial Setup* will not be displayed at all.
es: [application]*Configuración Inicial* le permite configurar diversos ajuste del sistema. Todos se pueden configurar también durante la instalación, pero no están obligados a terminarlo. Solo se mostrará lo que *no* ha sido configurado durante la instalación; por ejemplo, si usted no crea una cuenta de usuario no `root` durante la instalación, [application]*Configuración Inicial* arrancará después del primer inicio y usted podrá configurar uno. Si durante la instalación usted ha configurado todas las opciones disponibles [application]*Configuración Inicial* no será mostrado.

source: To configure any aspect of the system available in the utility, click any of the links available in the main window (for example, `Create User`). Each link leads to a separate screen with separate options; these screens are the same ones which were available during the graphical installation. If you need help, press `Help` in the top left corner to open a new window containing directions for that screen.
es: Para configurar aspecto del sistema disponible en la utilidad, pulse cualquiera de los enlaces disponibles en la ventana principal (por ejemplo, `Crear Usuario`). Cada enlace le dirige a una pantalla distinta con opciones separadas; estas pantallas son las mismas que estuvieron disponibles durante la instalación gráfica. Si necesita ayuda, pulse `Ayuda` en a esquina superior izquierda para abrir una nueva ventana que contiene las direcciones para esta pantalla.

source: After you finish configuring any screen, press the `Done` button in the top left corner to return to the main [application]*Initial Setup* menu. After you finish configuring all settings, click `Finish Configuration` in the bottom right corner to save all configured settings. The configuration utility will close and you will be able to log in to the system.
es: Después de terminar de configurar cualquier pantalla, pulse el botón `Hecho` en la esquina superior izquierda para volver al menú principal [application]*Ajuste Inicial*. Después de que termine de configurar todos los ajustes, pulse `Terminar la Configuración` en la esquina inferior derecha para guardar todos los ajustes configurados. La utilidad de configuración se cerrará y usted podrá acceder al sistema.

source: It is possible to configure [application]*Initial Setup* to display all available options, even if they have been already configured during the installation. To do so, you must use a Kickstart file at the start of the installation, and this file must contain the following command:
es: Es posible configurar [application]*Ajuste Inicial* para visualizar todas las opciones disponibles, aunque hayan sido configuradas durante la instalación. Para hacerlo, debe usar un archivo Kickstart al empezar la instalación y este archivo debe contener el siguiente comando:

source: The [option]#--reconfig# option specifies that all options should be displayed. See xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart] for information about Kickstart installations.
es: La opción [option]#--reconfig# especifica que todas las opciones serán mostradas. Vea xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automatizando la Instalación con Kickstart] para información sobre las instalaciones Kickstart.

source: Normally, it is not possible to return to [application]*Initial Setup* after you close it and log in to the system. You can make it display again (after the next reboot, before a login prompt is displayed), by executing the following command as `root`:
es: Normalmente no es posible volver a [application]*Ajuste Inicial* después de que lo haya cerrado y accedido al sistema. PUede hacerlo visible otra vez (después del siguiente reinicio, antes de que se muestra la solicitud de inicio de sesión), ejecutando el siguiente comando como `root`:

source: Then, reboot your system.
es: Después, reinicie su sistema.
