Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/_partials/install/SummaryHub.po
Languages: pt_br

source: Installation Summary
pt_br: Resumo da Instalação

source: The `Installation Summary` screen is the central location for setting up an installation. Most of the options which can be configured during the installation can be accessed from here.
pt_br: A tela `Resumo da Instalação` é o local central para configurar uma instalação. A maioria das opções que podem ser configuradas durante a instalação podem ser acessadas aqui.

source: The Installation Summary screen
pt_br: A tela Resumo da Instalação

source: If you used a Kickstart option or a boot option to specify an installation repository on a network, but no network is available at the start of the installation, the installer will display the `Network Configuration` screen for you to set up a network connection prior to displaying the `Installation Summary` screen.
pt_br: Se você usou uma opção de Kickstart ou uma opção de inicialização para especificar um repositório de instalação em uma rede, mas nenhuma rede está disponível no início da instalação, o instalador exibirá a tela `Configuração de rede` para você configurar uma conexão de rede antes para exibir a tela `Resumo da Instalação`.

source: The summary screen consists of several links to other screens, separated into categories. These links can be in several different states, which are graphically indicated:
pt_br: A tela de resumo consiste em vários links para outras telas, separados em categorias. Esses links podem estar em vários estados diferentes, que são indicados graficamente:

source: A *warning symbol* (yellow triangle with an exclamation mark) next to an icon means that a screen requires your attention before you start the installation. This typically happens with the `Installation Destination` screen, because even though there is a default automatic partitioning variant, you always have to at least confirm this selection, even if you do not want to make any changes.
pt_br: Um *símbolo de advertência * (triângulo amarelo com um ponto de exclamação) próximo a um ícone significa que uma tela requer sua atenção antes de iniciar a instalação. Isso normalmente acontece com a tela `Destino da Instalação`, porque embora haja uma variante de particionamento automático padrão, você sempre deve pelo menos confirmar esta seleção, mesmo se não quiser fazer nenhuma alteração.

source: If a link is *greyed out*, it means that the installer is currently configuring this section, and you must wait for the configuration to finish before accessing that screen. This typically happens when you change the installation source in the `Installation Source` screen and the installer is probing the new source location and gathering a list of available packages.
pt_br: Se um link estiver *acinzentado*, significa que o instalador está atualmente configurando esta seção e você deve aguardar a conclusão da configuração antes de acessar essa tela. Isso normalmente acontece quando você altera a fonte de instalação na tela `Fonte de Instalação` e o instalador está investigando a nova localização da fonte e reunindo uma lista de pacotes disponíveis.

source: Screens with *black text and no warning symbol* mean that this screen does not require your attention. You can still change your settings in these screens, but it is not necessary to do so to complete the installation. This typically happens with localization settings, as these are either detected automatically, or set up on the previous screen where you select your language and locale.
pt_br: Telas com *texto preto e nenhum símbolo de aviso* significam que esta tela não requer sua atenção. Você ainda pode alterar suas configurações nessas telas, mas não é necessário fazer isso para concluir a instalação. Isso normalmente acontece com as configurações de localização, já que elas são detectadas automaticamente ou configuradas na tela anterior, onde você seleciona seu idioma e local.

source: A warning message is displayed at the bottom of the summary screen, and the `Begin Installation` button is greyed out, as long as at least one item has not been configured yet.
pt_br: Uma mensagem de aviso é exibida na parte inferior da tela de resumo e o botão `Iniciar a Instalação` fica acinzentado, desde que pelo menos um item não tenha sido configurado ainda.

source: Icon States in Installation Summary
pt_br: Estados dos Ícones no Resumo da Instalação

source: A screenshot of several icons in the Installation Summary screen
pt_br: Uma captura de tela de vários ícones na tela Resumo da Instalação

source: Each screen also has an explanatory text below its title, showing settings currently configured in that screen. This text may be concatenated; in that case, move your mouse cursor over it and wait until a tooltip with the full text appears.
pt_br: Cada tela também possui um texto explicativo abaixo de seu título, mostrando as configurações atualmente configuradas naquela tela. Este texto pode ser concatenado; nesse caso, mova o cursor do mouse sobre ele e espere até que uma dica de ferramenta com o texto completo apareça.

source: Tooltip in the Installation Summary
pt_br: Dica de ferramenta no Resumo da Instalação

source: An entry in the Installation Summary shows a truncated description and a tooltip with full text.
pt_br: Uma entrada no Resumo da Instalação mostra uma descrição truncada e uma dica de ferramenta com texto completo.

source: Once you configure everything required for the installation, you can press the `Begin Installation` button to start installing {PRODUCT}. This will take you to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Configuration and Installation Progress]. Note that as the text below this button says, nothing will be written to your hard drive before you press this button. You can press `Quit` at any point; this will discard all changes you made in the installer so far and reboot the system.
pt_br: Depois de configurar tudo o que é necessário para a instalação, você pode pressionar o botão `Iniciar a Instalação` para iniciar a instalação do {PRODUCT}. Isso o levará a xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Configuração e Progresso da Instalação]. Observe que, como diz o texto abaixo deste botão, nada será gravado em seu disco rígido antes de você pressioná-lo. Você pode pressionar `Sair` a qualquer momento; isso descartará todas as alterações feitas no instalador até agora e reinicializará o sistema.
