Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/advanced/VNC_Installations.po
Languages: tr

source: Installing Using VNC
tr: VNC Kullanarak Kurma

source: The graphical installation interface is the recommended method of installing {PRODUCT}. However, in some cases, accessing the graphical interface directly is difficult or impossible. Some systems lack the capability to connect a display and a keyboard, making VNC a necessity for manual (non-Kickstart) installations.
tr: {PRODUCT} kurmak için tavsiye edilen yöntem grafiksel kurulum arayüzüdür. Ancak bazı durumlarda grafiksel arayüze doğrudan erişim zor veya imkansızdır. Bazı sistemlerde ekran ve klavye bağlama özelliği yoktur, bu da VNC'yi elle (Kickstart olmayan) kurulumlar için bir zorunluluk haline getirmektedir.

source: To allow manual installations on _headless systems_ (systems without a directly connected display, keyboard and mouse), the [application]*Anaconda* installation program includes a _Virtual Network Computing_ (VNC) mode which allows the graphical mode of the installation program to run locally, but display on another system connected to the network. The VNC installation provides you with the full range of installation options.
tr: _Başsız sistemlerde_ (doğrudan bağlı ekran, klavye ve fare olmayan sistemler) elle kurulumlara izin vermek için [application]*Anaconda* kurulum programı, kurulum programının grafiksel modunun yerel olarak çalışmasına ancak ağa bağlı başka bir sistemde görüntülenmesine izin veren bir _Virtual Network Computing_ (VNC) modu içerir. VNC kurulumu size kurulum seçeneklerinin tamamını sunar.

source: This chapter provides instructions on activating VNC mode on the installation system and connecting to it using a VNC viewer.
tr: Bu bölümde, kurulum sisteminde VNC modunu etkinleştirme ve bir VNC görüntüleyici kullanarak sisteme bağlanma hakkında talimatlar bulunmaktadır.

source: Installing a VNC Viewer
tr: VNC Görüntüleyici Kurma

source: Performing a VNC installation requires a VNC viewer running on your workstation or another terminal computer. VNC viewers are available in the repositories of most Linux distributions; free VNC viewers are also available for other operating systems such as Windows. On Linux systems, use your package manager to search for a viewer for your distribution.
tr: Bir VNC kurulumu gerçekleştirmek, iş istasyonunuzda veya başka bir uç bilgisayarda çalışan bir VNC görüntüleyici gerektirir. VNC görüntüleyicileri çoğu Linux dağıtımının depolarında bulunur; Windows gibi diğer işletim sistemleri için de ücretsiz VNC görüntüleyiciler vardır. Linux sistemlerinde, dağıtımınız için bir görüntüleyici aramak için paket yöneticinizi kullanın.

source: The following VNC viewers are available in {PRODUCT}:
tr: {PRODUCT}'da aşağıdaki VNC görüntüleyicileri kullanılabilir:

source: [application]*TigerVNC* - A basic viewer independent of your desktop environment. Installed as the [package]*tigervnc* package.
tr: [application]*TigerVNC* - Masaüstü ortamınızdan bağımsız basit bir görüntüleyici. [package]*tigervnc* paketi olarak kurulur.

source: [application]*Vinagre* - A viewer for the [application]*GNOME* desktop environment. Installed as the [package]*vinagre* package.
tr: [application]*Vinagre* - [application]*GNOME* masaüstü ortamı için bir görüntüleyici. [package]*vinagre* paketi olarak kurulur.

source: [application]*KRDC* - A viewer integrated with the [application]*KDE* desktop environment. Installed as the [package]*kdenetwork-krdc* package.
tr: [application]*KRDC* - [application]*KDE* masaüstü ortamıyla tümleşik bir görüntüleyici. [package]*kdenetwork-krdc* paketi olarak kurulur.

source: To install any of the viewers listed above, execute the following command as `root`:
tr: Yukarıda listelenen görüntüleyicilerden herhangi birini kurmak için `root` olarak şu komutu çalıştırın:

source: # dnf install package
tr: # dnf install paket

source: Replace _package_ with the package name of the viewer you want to use (for example, [package]*tigervnc*).
tr: _paket_ kısmını kullanmak istediğiniz görüntüleyicinin paket adıyla değiştirin (örneğin, [package]*tigervnc*).

source: Procedures in this chapter assume you are using [application]*TigerVNC* as your VNC viewer. Specific instructions for other viewers may differ, but the general principles still apply.
tr: Bu bölümdeki işlemler, VNC görüntüleyiciniz olarak [application]*TigerVNC* kullandığınızı varsaymaktadır. Diğer görüntüleyiciler için belirli talimatlar farklılık gösterebilir, ancak genel kurallar yine de geçerlidir.

source: Performing a VNC Installation
tr: VNC Kurulumu Gerçekleştirme

source: The [application]*Anaconda* installation program offers two modes for VNC installation: _Direct mode_ and _Connect mode_. The modes differ in the way the connection between the server and viewer is established. After you successfully connect, the installation will progress the same way regardless of the mode you used.
tr: [application]*Anaconda* kurulum programı, VNC kurulumu için iki mod sunmaktadır: _Doğrudan mod_ ve _Bağlanma modu_. Modlar, sunucu ile görüntüleyici arasındaki bağlantının kurulma biçiminde farklılık gösterir. Başarılı bir şekilde bağlandıktan sonra kurulum, kullandığınız moddan bağımsız olarak aynı şekilde ilerleyecektir.

source: Direct Mode
tr: Doğrudan Mod

source: In this mode, [application]*Anaconda* is configured to start the installation and wait for an incoming connection from VNC viewer before proceeding. While waiting for an incoming connection, the system's IP address and the port on which the installer expects the connection is displayed on the display or console if available; this implies that you need at least a serial console to connect using this mode, but you can work around this limitation if you know the default VNC port and the system's IP address.
tr: Bu modda [application]*Anaconda*, kurulumu başlatacak ve devam etmeden önce VNC görüntüleyiciden gelecek bir bağlantı bekleyecek şekilde yapılandırılmıştır. Gelen bir bağlantı beklerken, sistemin IP adresi ve kurucunun bağlantı beklediği bağlantı noktası, varsa ekranda veya konsolda görüntülenir; bu, bu modu kullanarak bağlanmak için en azından bir seri konsola ihtiyacınız olduğu anlamına gelir, ancak öntanımlı VNC bağlantı noktasını ve sistemin IP adresini biliyorsanız bu sınırlamanın üstesinden gelebilirsiniz.

source: Connect Mode
tr: Bağlanma Modu

source: In this mode, the VNC viewer is started on the remote system in _listening mode_. The VNC viewer waits for an incoming connection on a specified port. Then, [application]*Anaconda* is started and the host name/IP address and port number of the viewer are provided using a boot option or a Kickstart command. When the installation begins, the installation program establishes a connection with the listening VNC viewer using the specified host name/IP address and port number. Connect mode is therefore easier to use on systems with no local display or console, but it also may require additional preparation, because the viewer system must be able to accept incoming connections on the specified port, which usually requires changing firewall settings.
tr: Bu modda, VNC görüntüleyici uzak sistemde _dinleme modunda_ başlatılır. VNC görüntüleyici, belirli bir bağlantı noktasında gelen bağlantı için bekler. Ardından, [application]*Anaconda* başlatılır ve bir önyükleme seçeneği veya bir Kickstart komutu kullanılarak görüntüleyicinin ana makine adı/IP adresi ve bağlantı noktası numarası belirtilir. Kurulum başladığında, kurulum programı belirtilen ana makine adını/IP adresini ve bağlantı noktası numarasını kullanarak dinleyen VNC görüntüleyici ile bir bağlantı kurar. Bu nedenle, bağlanma modunun yerel ekranı veya konsolu olmayan sistemlerde kullanımı daha kolaydır, ancak ek hazırlık gerektirebilir, çünkü görüntüleyicinin olduğu sistem belirtilen bağlantı noktasında gelen bağlantıları kabul edebilmelidir, bu da genellikle güvenlik duvarı ayarlarının değiştirilmesini gerektirir.

source: Choosing a VNC Installation Mode
tr: Bir VNC Kurulum Modu Seçme

source: Visual and Interactive access to the system
tr: Sisteme görsel ve etkileşimli erişim

source: If visual and interactive access to the system being installed is not available, then you should use Connect Mode.
tr: Kurulmakta olan sisteme görsel ve etkileşimli erişim yoksa, Bağlanma Modunu kullanmalısınız.

source: Network Connection Rules and Firewalls
tr: Ağ bağlantı kuralları ve güvenlik duvarları

source: If the system being installed is not allowed inbound connections by a firewall, then you must use Connect Mode or disable the firewall. Disabling a firewall may have security implications.
tr: Kurulmakta olan sistemden giden bağlantılara bir güvenlik duvarı tarafından izin verilmiyorsa, Bağlanma Modunu kullanmanız veya güvenlik duvarını devre dışı bırakmanız gerekir. Güvenlik duvarını devre dışı bırakmanın güvenlikle ilgili sonuçları olabilir.

source: If the remote system running the VNC viewer is not allowed incoming connections by a firewall, then you must use Direct Mode, or disable the firewall. Disabling a firewall may have security implications.
tr: VNC görüntüleyiciyi çalıştıran uzak sisteme gelen bağlantılara bir güvenlik duvarı tarafından izin verilmiyorsa, Doğrudan Modu kullanmanız veya güvenlik duvarını devre dışı bırakmanız gerekir. Güvenlik duvarını devre dışı bırakmanın güvenlikle ilgili sonuçları olabilir.

source: Installing in VNC Direct Mode
tr: VNC Doğrudan Modunda Kurma

source: VNC Direct Mode is when the VNC viewer initiates a connection to the system being installed. [application]*Anaconda* will tell you when to initiate this connection.
tr: VNC Doğrudan Modunda, VNC görüntüleyici kurulmakta olan sisteme bir bağlantı başlatır. [application]*Anaconda* bu bağlantıyı ne zaman başlatmanız gerektiğini size söyleyecektir.

source: Starting VNC in Direct Mode
tr: VNC'yi Doğrudan Modda Başlatma

source: Open the VNC viewer (for example, [application]*TigerVNC*) on the workstation you will be using to connect to the system being installed. A window similar to xref:VNC_Installations.adoc#figu-vnc-installations-connection-details[TigerVNC Connection Details] will be displayed with an input field allowing you to specify an IP address.
tr: Kurulmakta olan sisteme bağlanmak için kullanacağınız iş istasyonunda VNC görüntüleyiciyi (örneğin, [application]*TigerVNC*) açın. Bir IP adresi belirtmenizi sağlayan bir giriş alanı ile xref:VNC_Installations.adoc#figu-vnc-installations-connection-details[TigerVNC Bağlantı Ayrıntıları] bölümündekine benzer bir pencere görüntülenecektir.

source: TigerVNC Connection Details
tr: TigerVNC Bağlantı Ayrıntıları

source: TigerVNC after startup
tr: Başlattıktan sonra TigerVNC

source: Boot the installation system and wait for the boot menu to appear. In the menu, edit boot options (see xref:../install/Booting_the_Installation.adoc#sect-boot-menu[The Boot Menu]) and append the [option]#inst.vnc# option to the end of the command line.
tr: Kurulum sistemini önyükleyin ve önyükleme menüsünün görünmesini bekleyin. Menüde, önyükleme seçeneklerini düzenleyin (xref:../install/Booting_the_Installation.adoc#sect-boot-menu[Önyükleme Menüsü] bölümüne bakın) ve [option]#inst.vnc# seçeneğini komut satırının sonuna ekleyin.

source: Optionally, if you want to restrict VNC access to the installation system, add the [option]#inst.vncpassword=pass:attributes[{blank}]_PASSWORD_pass:attributes[{blank}]# boot option as well. Replace _PASSWORD_ with the password you want to use for the installation. The VNC password must be between 6 and 8 characters long.
tr: İsteğe bağlı olarak, kurulum sistemine VNC erişimini kısıtlamak istiyorsanız [option]#inst.vncpassword=pass:attributes[{blank}]_PAROLA_pass:attributes[{blank}]# önyükleme seçeneğini de ekleyin. _PAROLA_ kısmını kurulum için kullanmak istediğiniz parola ile değiştirin. VNC parolası 6 ila 8 karakter uzunluğunda olmalıdır.

source: Use a temporary password for the [option]#inst.vncpassword=# option. It should not be a real or root password you use on any system.
tr: [option]#inst.vncpassword=# seçeneği için geçici bir parola kullanın. Herhangi bir sistemde kullandığınız gerçek bir parola veya root parolası olmamalıdır.

source: Adding VNC Boot Options
tr: VNC Önyükleme Seçenekleri Ekleme

source: Editing boot options to activate VNC
tr: VNC'yi etkinleştirmek için önyükleme seçeneklerini düzenleme

source: Start the installation using the edited options. The system will initialize the installation program and start the necessary services. When the system is ready, you will see a message on the screen similar to the following:
tr: Düzenlenen seçenekleri kullanarak kurulumu başlatın. Sistem kurulum programını ve gerekli hizmetleri başlatacaktır. Sistem hazır olduğunda, ekranda şuna benzer bir mesaj göreceksiniz:

source: Note the IP address and port number (in the above example, `192.168.100.131:5901`).
tr: IP adresini ve bağlantı noktası numarasını not edin (yukarıdaki örnekte, `192.168.100.131:5901`).

source: On the system running the VNC Viewer, enter the IP address and port number obtained in the previous step into the `Connection Details` dialog in the same format as it was displayed on the screen by the installer. Then, click `Connect`. The VNC viewer will now connect to the installation system. If you set up a VNC password, enter it when prompted and press `OK`.
tr: VNC görüntüleyiciyi çalıştıran sistemde, önceki adımda elde edilen IP adresini ve bağlantı noktası numarasını, kurucu tarafından ekranda görüntülenenle aynı biçimde `Bağlantı Ayrıntıları` iletişim kutusuna girin. Ardından `Bağlan` düğmesine tıklayın. VNC görüntüleyici kurulum sistemine bağlanacaktır. Bir VNC parolası ayarladıysanız, istendiğinde bunu girin ve `Tamam` düğmesine basın.

source: When the connection is successfully established, a new window will open on the system running the VNC viewer, displaying the installation menu. This window will provide full remote access to the installer until the installation finishes and the system reboots for the first time.
tr: Bağlantı başarıyla kurulduğunda, VNC görüntüleyiciyi çalıştıran sistemde kurulum menüsünü görüntüleyen yeni bir pencere açılacaktır. Bu pencere, kurulum tamamlanana ve sistem ilk kez yeniden başlatılana kadar kurucuya tam uzaktan erişim sağlayacaktır.

source: You can then proceed with xref:../install/Installing_Using_Anaconda.adoc#chap-installing-using-anaconda[Installing Using Anaconda].
tr: Bundan sonra xref:../install/Installing_Using_Anaconda.adoc#chap-installing-using-anaconda[Anaconda Kullanarak Kurma] bölümüyle devam edebilirsiniz.

source: Installing in VNC Connect Mode
tr: VNC Bağlanma Modunda Kurma

source: VNC connect mode is when the system being installed initiates a connection to the VNC viewer running on a remote system. Before you start, make sure the remote system is configured to accept incoming connection on the port you want to use for VNC. The exact way to make sure the connection will not be blocked depends on your network and on your workstation's configuration. Information about configuring the firewall in {PRODUCT} is available in the [citetitle]_{PRODUCT} Security{nbsp}Guide_, available at link:++http://docs.fedoraproject.org/++[].
tr: VNC bağlanma modunda, kurulmakta olan sistem uzak bir sistemde çalışan VNC görüntüleyiciyle bir bağlantı başlatır. Başlamadan önce, uzak sistemin VNC için kullanmak istediğiniz bağlantı noktasında gelen bağlantıyı kabul edecek şekilde yapılandırıldığından emin olun. Bağlantının engellenmeyeceğinden emin olmanın tam yolu, ağınıza ve iş istasyonunuzun yapılandırmasına bağlıdır. Güvenlik duvarını {PRODUCT}'da yapılandırma hakkında bilgi, link:++https://docs.fedoraproject.org/++[] adresindeki [citetitle]_{PRODUCT} Güvenlik{nbsp}Kılavuzunda_ bulunabilir.

source: Starting VNC in Connect Mode
tr: VNC'yi Bağlanma Modunda Başlatma

source: Start the VNC viewer on the client system in listening mode. For example, on {PRODUCT} using [application]*TigerVNC*, execute the following command:
tr: İstemci sisteminde VNC görüntüleyiciyi dinleme modunda başlatın. Örneğin, [application]*TigerVNC* kullanan bir {PRODUCT} sisteminde şu komutu çalıştırın:

source: $ [command]#vncviewer -listen _PORT_#
tr: $ [command]#vncviewer -listen _BAĞLANTI-NOKTASI_#

source: Replace _PORT_ with the port number you want to use for the connection.
tr: _BAĞLANTI-NOKTASI_ kısmını bağlantı için kullanmak istediğiniz bağlantı noktası numarası ile değiştirin.

source: The terminal will display a message similar to the following example:
tr: Terminalde, aşağıdaki örneğe benzer bir mesaj görüntülenecektir:

source: TigerVNC Viewer Listening
tr: TigerVNC Görüntüleyici Dinliyor

source: TigerVNC Viewer 64-bit v1.3.0 (20130924) Built on Sep 24 2013 at 16:32:56 Copyright (C) 1999-2011 TigerVNC Team and many others (see README.txt) See http://www.tigervnc.org for information on TigerVNC.
tr: TigerVNC Viewer 64-bit v1.3.0 (20130924) Built on Sep 24 2013 at 16:32:56 Copyright (C) 1999-2011 TigerVNC Team and many others (see README.txt) See https://www.tigervnc.org for information on TigerVNC.

source: When this message is displayed, the VNC viewer is ready and waiting for an incoming connection from the installation system.
tr: Bu mesaj görüntülendiğinde, VNC görüntüleyici hazırdır ve kurulum sisteminden gelecek bir bağlantı beklemektedir.

source: Boot the installation system and wait for the boot menu to appear. In the menu, edit boot options (see xref:../install/Booting_the_Installation.adoc#sect-boot-menu[The Boot Menu]) and append the following options to the end of the command line:
tr: Kurulum sistemini önyükleyin ve önyükleme menüsünün görünmesini bekleyin. Menüde, önyükleme seçeneklerini düzenleyin (xref:../install/Booting_the_Installation.adoc#sect-boot-menu[Önyükleme Menüsü] bölümüne bakın) ve aşağıdaki seçenekleri komut satırının sonuna ekleyin:

source: [option]#inst.vnc inst.vncconnect=pass:attributes[{blank}]_HOST_:pass:attributes[{blank}]_PORT_#
tr: [option]#inst.vnc inst.vncconnect=pass:attributes[{blank}]_ANA-MAKİNE_:pass:attributes[{blank}]_BAĞLANTI-NOKTASI_#

source: Replace _HOST_ with the IP address of the system running the listening VNC viewer, and _PORT_ with the port number that the VNC viewer is listening on.
tr: _ANA-MAKİNE_ kısmını dinleyen VNC görüntüleyicisini çalıştıran sistemin IP adresiyle, _BAĞLANTI-NOKTASI_ kısmını VNC görüntüleyicisinin dinlediği bağlantı noktası numarasıyla değiştirin.

source: Start the installation. The system will initialize the installation program and start the necessary services. Once the initialization is finished, [application]*Anaconda* will attempt to connect to the IP address and port you provided in the previous step.
tr: Kurulumu başlatın. Sistem kurulum programını ve gerekli hizmetleri başlatacaktır. Başlatma tamamlandığında [application]*Anaconda*, önceki adımda belirttiğiniz IP adresine ve bağlantı noktasına bağlanmaya çalışacaktır.

source: Kickstart Considerations
tr: Kickstart İçin Dikkate Alınacaklar

source: Commands for using a VNC installation are also available in Kickstart installations. Using just the [command]#vnc# command will set up an installation using Direct Mode. Options are available to set up an installation using Connect Mode. For more information about the [command]#vnc# command and options used in Kickstart files, see xref:../appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference].
tr: Kickstart kurulumlarında da VNC kurulumunu kullanma komutları vardır. Yalnızca [command]#vnc# komutunun kullanılması, Doğrudan Modu kullanan bir kurulum ayarlayacaktır. Bağlanma Modunu kullanan bir kurulum ayarlamak için de seçenekler bulunmaktadır. Kickstart dosyalarında kullanılan [command]#vnc# komutu ve seçenekleri hakkında daha fazla bilgi için xref:../appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Söz Dizimi Referansı] bölümüne bakın.

source: Considerations for Headless Systems
tr: Başsız Sistemler İçin Dikkate Alınacaklar

source: When installing headless systems, the only choices are an automated Kickstart installation or an interactive VNC installation using connect mode. For more information about automated Kickstart installation, see xref:../appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference]. The general process for an interactive VNC installation is described below.
tr: Başsız sistemler kurarken, tek seçenek otomatik bir Kickstart kurulumu veya bağlanma modunu kullanan etkileşimli bir VNC kurulumudur. Otomatik Kickstart kurulumu hakkında daha fazla bilgi için xref:../appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Söz Dizimi Referansı] bölümüne bakın. Etkileşimli bir VNC kurulumu için genel süreç aşağıda açıklanmaktadır.

source: Set up a PXE server that will be used to start the installation. Information about installing and performing basic configurating of a PXE server can be found in xref:Network_based_Installations.adoc#chap-pxe-server-setup[Setting Up an Installation Server].
tr: Kurulumu başlatmak için kullanılacak bir PXE sunucusu ayarlayın. Bir PXE sunucusunun kurulumu ve temel yapılandırmasının gerçekleştirilmesiyle ilgili bilgiler xref:Network_based_Installations.adoc#chap-pxe-server-setup[Kurulum Sunucusu Ayarlama] bölümünde bulunabilir.

source: Configure the PXE server to use the boot options for a connect mode VNC installation. For information on these boot options, see xref:VNC_Installations.adoc#sect-vnc-installations-connect-mode[Installing in VNC Connect Mode].
tr: Bağlanma modu VNC kurulumu için önyükleme seçeneklerini kullanacak şekilde PXE sunucusunu yapılandırın. Bu önyükleme seçenekleri hakkında bilgi için xref:VNC_Installations.adoc#sect-vnc-installations-connect-mode[VNC Bağlanma Modunda Kurma] bölümüne bakın.

source: Follow the procedure for a VNC Installation using connect mode as described in the xref:VNC_Installations.adoc#proc-vnc-installations-connect-mode[Starting VNC in Connect Mode]. However, when directed to boot the system, boot it from the PXE server.
tr: Bağlanma modunu kullanan bir VNC kurulumu için xref:VNC_Installations.adoc#proc-vnc-installations-connect-mode[VNC'yi Bağlanma Modunda Başlatma] bölümünde açıklanan adımları izleyin. Ancak, sistemin önyüklenmesi istendiğinde, onu PXE sunucusundan önyükleyin.
