Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/advanced/Boot_Options.po
Languages: tr

source: Allows you to run the installation in single language mode - in other words, this option disables language selection for the installer and the installed system. If you also use the [option]#inst.lang=# option at the same time, the language you specify will be used. If you do not set the language, [application]*Anaconda* and the installed system will default to `en-US.UTF-8`.
tr: Kurulumu tek dil modunda çalıştırmanıza izin verir - başka bir deyişle, bu seçenek kurucu ve kurulu sistem için dil seçimini devre dışı bırakır. Aynı anda [option]#inst.lang=# seçeneğini de kullanırsanız, belirttiğiniz dil kullanılacaktır. Dili ayarlamazsanız, [application]*Anaconda* ve kurulu sistem öntanımlı olarak `en-US.UTF-8` kullanacaktır.

source: Configures geolocation usage in the installation program. Geolocation is used to pre-set the language and time zone, and uses the following syntax: [option]#inst.geoloc=pass:attributes[{blank}]_value_pass:attributes[{blank}]#
tr: Kurulum programında coğrafi konum kullanımını yapılandırır. Coğrafi konum, dili ve saat dilimini önceden ayarlamak için kullanılır ve aşağıdaki söz dizimini kullanır:: [option]#inst.geoloc=pass:attributes[{blank}]_değer_pass:attributes[{blank}]#

source: The _value_ parameter can be any of the following:
tr: _değer_ parametresi aşağıdakilerden herhangi biri olabilir:

source: Valid Values for the inst.geoloc Option
tr: inst.geoloc Seçeneği İçin Geçerli Değerler

source: |Disable geolocation|[option]#inst.geoloc=0# |Use the Fedora GeoIP API|[option]#inst.geoloc=provider_fedora_geoip# |Use the Hostip.info GeoIP API|[option]#inst.geoloc=provider_hostip#
tr: |Coğrafi konumu devre dışı bırak|[option]#inst.geoloc=0# |Fedora GeoIP API'sini kullan|[option]#inst.geoloc=provider_fedora_geoip# |Hostip.info GeoIP API'sini kullan|[option]#inst.geoloc=provider_hostip#

source: If this option is not specified, [application]*Anaconda* will use `provider_fedora_geoip`.
tr: Bu seçenek belirtilmezse, [application]*Anaconda* `provider_fedora_geoip` değerini kullanacaktır.

source: Specifies the keyboard layout to be used by the installation program. Layout codes are the same as the ones used in the [command]#keyboard# Kickstart command as described in xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference].
tr: Kurulum programı tarafından kullanılacak klavye düzenini belirtir. Düzen kodları, xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Söz Dizimi Referansı] bölümünde açıklandığı gibi [command]#keyboard# Kickstart komutunda kullanılanlarla aynıdır.

source: Forces the installation program to run in text mode instead of graphical mode. The text user interface is limited, for example, it does not allow you to modify the partition layout or set up LVM. When installing a system on a machine with a limited graphical capabilities, it is recommended to use VNC as described in xref:Boot_Options.adoc#sect-boot-options-vnc[Enabling Remote Access Using VNC].
tr: Kurulum programını grafiksel mod yerine metin modunda çalışmaya zorlar. Metin kullanıcı arayüzü sınırlıdır; örneğin, bölüm düzenini değiştirmenize veya LVM kurmanıza izin vermez. Sınırlı grafiksel özellikleri olan bir makineye bir sistem kurarken, xref:Boot_Options.adoc#sect-boot-options-vnc[VNC Kullanarak Uzaktan Erişimi Etkinleştirme] bölümünde açıklandığı gibi VNC kullanılması tavsiye edilmektedir.

source: Forces the installation program to run in command line mode. This mode does not allow any interaction, all options must be specified in a Kickstart file or on the command line.
tr: Kurulum programını komut satırı modunda çalışmaya zorlar. Bu mod herhangi bir etkileşime izin vermez, tüm seçenekler bir Kickstart dosyasında veya komut satırında belirtilmelidir.

source: Forces the installation program to run in graphical mode. This mode is the default.
tr: Kurulum programını grafiksel modda çalışmaya zorlar. Bu mod öntanımlı olandır.

source: Specifies the screen resolution in graphical mode. The format is _N_pass:attributes[{blank}]xpass:attributes[{blank}]_M_, where _N_ is the screen width and _M_ is the screen height (in pixels). The lowest supported resolution is `800x600`.
tr: Grafiksel modda ekran çözünürlüğünü belirtir. Biçim _N_pass:attributes[{blank}]xpass:attributes[{blank}]_M_ şeklindedir; burada _N_ ekran genişliği ve _M_ ekran yüksekliğidir (piksel olarak). `800x600` desteklenen en düşük çözünürlük değeridir.

source: Specifies the name of the `X` driver to be used both during the installation and on the installed system.
tr: Hem kurulum sırasında hem de kurulu sistemde kullanılacak `X` sürücüsünün adını belirtir.

source: Tells the installation program to use the frame buffer `X` driver instead of a hardware-specific driver. This option is equivalent to [option]#inst.xdriver=fbdev#.
tr: Kurulum programına, donanıma özgü bir sürücü yerine çerçeve arabelleği (frame buffer) `X` sürücüsünü kullanmasını söyler. Bu seçenek, [option]#inst.xdriver=fbdev# ile eş değerdir.

source: Specifies a timeout period (in seconds) the installer will wait before starting the [application]*X* server.
tr: Kurucunun [application]*X* sunucusunu başlatmadan önce bekleyeceği zaman aşımı süresini (saniye cinsinden) belirtir.

source: Blacklists (completely disables) one or more drivers. Drivers (mods) disabled using this option will be prevented from loading when the installation starts, and after the installation finishes, the installed system will keep these settings. The blacklisted drivers can then be found in the `/etc/modprobe.d/` directory.
tr: Bir veya daha fazla sürücüyü kara listeye alır (tamamen devre dışı bırakır). Bu seçeneği kullanarak devre dışı bırakılan sürücülerin (modlar) kurulum başladığında yüklenmesi engellenecek ve kurulum tamamlandıktan sonra kurulu sistem bu ayarları koruyacaktır. Kara listeye alınan sürücüler daha sonra `/etc/modprobe.d/` dizininde bulunabilir.

source: Use a comma-separated list to disable multiple drivers. For example:
tr: Birden çok sürücüyü devre dışı bırakmak için virgülle ayrılmış bir liste kullanın. Örneğin:

source: Starts the `sshd` service during the installation, which allows you to connect to the system during the installation using `SSH` and monitor its progress. For more information on `SSH`, see the `ssh(1)` man page and the corresponding chapter in the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++http://docs.fedoraproject.org/++[].
tr: Kurulum sırasında sisteme `SSH` kullanarak bağlanmanızı ve ilerlemesini izlemenizi sağlayan `sshd` hizmetini kurulum sırasında başlatır. `SSH` hakkında daha fazla bilgi için, `ssh(1)` kılavuz sayfasına ve link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Sistem Yöneticisi Kılavuzu_ içindeki ilgili bölüme bakın.

source: During the installation, the `root` account has no password by default. You can set a root password to be used during the installation with the [command]#sshpw# Kickstart command as described in xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-sshpw[sshpw (optional) - Restrict ssh Access During Installation].
tr: Kurulum sırasında, `root` hesabının öntanımlı olarak bir parolası yoktur. xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-sshpw[sshpw (isteğe bağlı) - Kurulum Sırasında ssh Erişimini Kısıtla] bölümünde açıklandığı gibi, [command]#sshpw# Kickstart komutu ile kurulum sırasında kullanılacak bir root parolası belirleyebilirsiniz.

source: Starting with Fedora 27, the graphical installer window has no decorations. Use this option to enable window decorations again.
tr: Fedora 27'den başlayarak, grafiksel kurucu penceresinin süslemeleri yoktur. Pencere süslemelerini yeniden etkinleştirmek için bu seçeneği kullanın.

source: Network Boot Options
tr: Ağ Üzerinden Önyükleme Seçenekleri

source: Initial network initialization is handled by [application]*dracut*. This section only lists some of the more commonly used options; for a complete list, see the `dracut.cmdline(7)` man page. Additional information on networking is also available in the [citetitle]_{PRODUCT} Networking Guide_, available at link:++http://docs.fedoraproject.org/++[].
tr: Ağın ilk başlatılması [application]*dracut* tarafından gerçekleştirilir. Bu bölüm yalnızca daha yaygın olarak kullanılan bazı seçenekleri listeler; tam bir liste için `dracut.cmdline(7)` kılavuz sayfasına bakın. Ağ oluşturma hakkında ek bilgiler, link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Ağ Kılavuzunda_ da bulunabilir.

source: Configures one or more network interfaces. To configure multiple interfaces, use the `ip` option multiple times - once for each interface. If multiple interfaces are configured, you must specify a primary boot interface using the [option]#bootdev# option described below.
tr: Bir veya daha fazla ağ arayüzünü yapılandırır. Birden çok arayüzü yapılandırmak için `ip` seçeneğini birden çok kez kullanın - her arayüz için bir defa. Birden çok arayüz yapılandırılırsa, aşağıda açıklanan [option]#bootdev# seçeneğini kullanarak bir birincil önyükleme arayüzü belirtmelisiniz.

source: The following table lists valid values for this option:
tr: Aşağıdaki tabloda bu seçenek için geçerli değerler listelenmektedir:

source: Network Interface Configuration Formats
tr: Ağ Arayüzü Yapılandırma Biçimleri

source: |Configuration Method|Option format |Automatic configuration of any interface|[option]#ip=pass:attributes[{blank}]_method_pass:attributes[{blank}]# |Automatic configuration of a specific interface|[option]#ip=pass:attributes[{blank}]_interface_:pass:attributes[{blank}]_method_pass:attributes[{blank}]# |Static configuration|[option]#ip=pass:attributes[{blank}]_ip_::pass:attributes[{blank}]_gateway_:pass:attributes[{blank}]_netmask_:pass:attributes[{blank}]_hostname_:pass:attributes[{blank}]_interface_:none# |Automatic configuration of a specific interface with an override footnote:[Brings up the specified interface using the specified method of automatic configuration, such as `dhcp`, but overrides the automatically obtained IP address, gateway, netmask, hostname or other specified parameter. All parameters are optional; only specify the ones you wish to override and automatically obtained values will be used for the others.]|[option]#ip=pass:attributes[{blank}]_ip_::pass:attributes[{blank}]_gateway_:pass:attributes[{blank}]_netmask_:pass:attributes[{blank}]_hostname_:pass:attributes[{blank}]_interface_:pass:attributes[{blank}]_method_:pass:attributes[{blank}]_mtu_pass:attributes[{blank}]#
tr: |Yapılandırma Yöntemi|Seçenek biçimi |Herhangi bir arayüzün otomatik yapılandırması|[option]#ip=pass:attributes[{blank}]_yöntem_pass:attributes[{blank}]# |Belirli bir arayüzün otomatik yapılandırması|[option]#ip=pass:attributes[{blank}]_arayüz_:pass:attributes[{blank}]_yöntem_pass:attributes[{blank}]# |Statik yapılandırma|[option]#ip=pass:attributes[{blank}]_ip_::pass:attributes[{blank}]_ağgeçidi_:pass:attributes[{blank}]_ağmaskesi_:pass:attributes[{blank}]_anamakineadı_:pass:attributes[{blank}]_arayüz_:none# |Belirli bir arayüzün üzerine yazılarak otomatik yapılandırması footnote:[`dhcp` gibi belirtilen otomatik yapılandırma yöntemini kullanarak belirtilen arayüzü etkinleştirir, ancak otomatik olarak alınan IP adresini, ağ geçidini, ağ maskesini, ana makine adını veya diğer belirtilen parametrenin üzerine yazar. Tüm parametreler isteğe bağlıdır; yalnızca üzerine yazmak istediklerinizi belirtin ve diğerleri için otomatik olarak alınan değerler kullanılacaktır.]|[option]#ip=pass:attributes[{blank}]_ip_::pass:attributes[{blank}]_ağgeçidi_:pass:attributes[{blank}]_ağmaskesi_:pass:attributes[{blank}]_anamakineadı_:pass:attributes[{blank}]_arayüz_:pass:attributes[{blank}]_yöntem_:pass:attributes[{blank}]_mtu_pass:attributes[{blank}]#

source: The [option]#method# parameter can be any the following:
tr: [option]#yöntem# parametresi aşağıdakilerden herhangi biri olabilir:

source: Automatic Interface Configuration Methods
tr: Otomatik Arayüz Yapılandırma Yöntemleri

source: |Automatic configuration method|Value |DHCP|`dhcp` |IPv6 DHCP|`dhcp6` |IPv6 automatic configuration|`auto6` |iBFT (iSCSI Boot Firmware Table)|`ibft`
tr: |Otomatik yapılandırma yöntemi|Değer |DHCP|`dhcp` |IPv6 DHCP|`dhcp6` |IPv6 otomatik yapılandırma|`auto6` |iBFT (iSCSI Boot Firmware Table)|`ibft`

source: If you use a boot option which requires network access, such as [option]#inst.ks=http://pass:attributes[{blank}]_host_:/pass:attributes[{blank}]_path_pass:attributes[{blank}]#, without specifying the [option]#ip# option, the installation program will use [option]#ip=dhcp#.
tr: [option]#ip# seçeneğini belirtmeden [option]#inst.ks=http://pass:attributes[{blank}]_anamakine_:/pass:attributes[{blank}]_yol_pass:attributes[{blank}]# gibi ağ erişimi gerektiren bir önyükleme seçeneği kullanırsanız, kurulum programı [option]#ip=dhcp# seçeneğini kullanacaktır.

source: In the above tables, the _ip_ parameter specifies the client's IP address. `IPv6` addresses can be specified by putting them in square brackets, for example, `[2001:DB8::1]`.
tr: Yukarıdaki tablolarda, _ip_ parametresi istemcinin IP adresini belirtir. `IPv6` adresleri köşeli parantez içine alınarak belirtilebilir, örneğin `[2001:DB8::1]`.

source: The _gateway_ parameter is the default gateway. IPv6 addresses are accepted here as well.
tr: _ağgeçidi_ parametresi öntanımlı ağ geçididir. Burada da IPv6 adresleri kabul edilmektedir.

source: The _netmask_ parameter is the netmask to be used. This can either be a full netmask (for example `255.255.255.0`) or a prefix (for example `64`).
tr: _ağmaskesi_ parametresi, kullanılacak ağ maskesidir. Bu, tam bir ağ maskesi (örneğin `255.255.255.0`) veya bir ön ek (örneğin `64`) olabilir.

source: The _hostname_ parameter is the host name of the client system. This parameter is optional.
tr: _anamakineadı_ parametresi, istemci sisteminin ana makine adıdır. Bu parametre isteğe bağlıdır.

source: Specifies the address of the name server. This option can be used multiple times.
tr: Ad sunucusunun adresini belirtir. Bu seçenek birden çok kez kullanılabilir.

source: Specifies the boot interface. This option is mandatory if you use more than one [option]#ip# option.
tr: Önyükleme arayüzünü belirtir. Birden fazla [option]#ip# seçeneği kullanıyorsanız bu seçenek zorunludur.

source: Assigns a given interface name to a network device with a given MAC address. Can be used multiple times. The syntax is [option]#ifname=pass:attributes[{blank}]_interface_:pass:attributes[{blank}]_MAC_pass:attributes[{blank}]#. For example:
tr: Belirli bir MAC adresine sahip bir ağ aygıtına belirli bir arayüz adı atar. Birden çok kez kullanılabilir. Söz dizimi [option]#ifname=pass:attributes[{blank}]_arayüz_:pass:attributes[{blank}]_MAC_pass:attributes[{blank}]# şeklindedir. Örneğin:

source: Specifies the DHCP vendor class identifier. The `dhcpd` service will see this value as `vendor-class-identifier`. The default value is `anaconda-$(uname -srm)`.
tr: DHCP sağlayıcısı sınıfı tanımlayıcısını belirtir. `dhcpd` hizmeti bu değeri `vendor-class-identifier` olarak görecektir. Öntanımlı değer `anaconda-$(uname -srm)` şeklindedir.

source: Sets up a Virtual LAN (VLAN) device on a specified interface with a given name. The syntax is [option]#vlan=pass:attributes[{blank}]_name_:pass:attributes[{blank}]_interface_pass:attributes[{blank}]#. For example:
tr: Belirli bir ada sahip belirli bir arayüzde bir Sanal (Virtual) LAN (VLAN) aygıtı ayarlar. Söz dizimi [option]#vlan=pass:attributes[{blank}]_ad_:pass:attributes[{blank}]_arayüz_pass:attributes[{blank}]# şeklindedir. Örneğin:

source: The above will set up a VLAN device named `vlan5` on the `em1` interface. The _name_ can take the following forms:
tr: Yukarıdakine göre, `em1` arayüzünde `vlan5` adlı bir VLAN aygıtı ayarlanacaktır. _ad_ aşağıdaki biçimleri alabilir:

source: VLAN Device Naming Conventions
tr: VLAN Aygıtı Adlandırma Kuralları

source: |Naming scheme|Example |VLAN_PLUS_VID|`vlan0005` |VLAN_PLUS_VID_NO_PAD|`vlan5` |DEV_PLUS_VID|`em1.0005`. |DEV_PLUS_VID_NO_PAD|`em1.5`.
tr: |Adlandırma düzeni|Örnek |VLAN_ARTI_KİMLİK|`vlan0005` |VLAN_ARTI_KİMLİK_DOLGU_YOK|`vlan5` |AYGIT_ARTI_KİMLİK|`em1.0005`. |AYGIT_ARTI_KİMLİK_DOLGU_YOK|`em1.5`.

source: Set up a bonding device with the following syntax: [option]#bond=pass:attributes[{blank}]_name_pass:attributes[{blank}][:pass:attributes[{blank}]_slaves_pass:attributes[{blank}]][:pass:attributes[{blank}]_options_pass:attributes[{blank}]]#. Replace _name_ with the bonding device name, _slaves_ with a comma-separated list of physical (ethernet) interfaces, and _options_ with a comma-separated list of bonding options. For example:
tr: Şu söz dizimiyle bir birleştirme (bond) aygıtı ayarla: [option]#bond=pass:attributes[{blank}]_ad_pass:attributes[{blank}][:pass:attributes[{blank}]_ikinciller_pass:attributes[{blank}]][:pass:attributes[{blank}]_seçenekler_pass:attributes[{blank}]]#. _ad_ parametresini birleştirme aygıtı adıyla, _ikinciller_ parametresini virgülle ayrılmış fiziksel (ethernet) arayüzler listesiyle ve _seçenekler_ parametresini virgülle ayrılmış birleştirme seçenekleri listesiyle değiştirin. Örneğin:

source: For a list of available options, execute the [command]#modinfo bonding# command.
tr: Kullanılabilir seçeneklerin listesi için [command]#modinfo bonding# komutunu çalıştırın.

source: Using this option without any parameters will assume [option]#bond=bond0:eth0,eth1:mode=balance-rr#.
tr: Bu seçeneği herhangi bir parametre olmadan kullanmak şunu varsayacaktır: [option]#bond=bond0:eth0,eth1:mode=balance-rr#.

source: Set up a team device with the following syntax: [option]#team=pass:attributes[{blank}]_master_:pass:attributes[{blank}]_slaves_pass:attributes[{blank}]#. Replace _master_ with the name of the master team device and _slaves_ with a comma-separated list of physical (ethernet) devices to be used as slaves in the team device. For example:
tr: Şu söz dizimiyle bir takım (team) aygıtı ayarla: [option]#team=pass:attributes[{blank}]_birincil_:pass:attributes[{blank}]_ikinciller_pass:attributes[{blank}]#. _birincil_ parametresini ana takım aygıtının adıyla ve _ikinciller_ parametresini, takım aygıtında ikincil olarak kullanılacak fiziksel (ethernet) aygıtların virgülle ayrılmış listesiyle değiştirin. Örneğin:

source: Advanced Installation Options
tr: Gelişmiş Kurulum Seçenekleri

source: Configure the system for multilib packages (that is, to allow installing 32-bit packages on a 64-bit x86 system) and install packages specified in this section as such.
tr: Sistemi çoklu kütüphane (multilib) paketleri için yapılandır (yani, 64-bit x86 sistemine 32-bit paketlerin kurulmasına izin vermek için) ve bu bölümde belirtilen paketleri bu şekilde kur.

source: Normally, on an AMD64 or Intel{nbsp}64 system, only packages for this architecture (marked as `x86_64`) and packages for all architectures (marked as `noarch` would be installed. When you use this option, packages for 32-bit AMD or Intel systems (marked as `i686`) will be automatically installed as well if available.
tr: Normalde bir AMD64 veya Intel{nbsp}64 sisteminde, yalnızca bu mimari için olan paketler (`x86_64` olarak işaretlenir) ve tüm mimariler için olan paketler (`noarch` olarak işaretlenir) kurulur. Bu seçeneği kullandığınızda, varsa 32 bit AMD veya Intel sistemleri için olan paketler de (`i686` olarak işaretlenir) otomatik olarak kurulacaktır.

source: This only applies to packages directly specified in the `%packages` section. If a package is only installed as a dependency, only the exact specified dependency will be installed. For example, if you are installing package [package]*foo* which depends on package [package]*bar*, the former will be installed in multiple variants, while the latter will only be installed in variants specifically required.
tr: Bu yalnızca `%packages` bölümünde doğrudan belirtilen paketler için geçerlidir. Bir paket yalnızca bağımlılık olarak kurulursa, yalnızca tam olarak belirtilen bağımlılık kurulacaktır. Örneğin [package]*bar* paketine bağımlı olan [package]*foo* paketini kuruyorsanız, asıl paket birden çok çeşitte, bağımlılık olan paket yalnızca özel olarak gereken çeşitlerde kurulacaktır.

source: Force the installation program to install partition information into a GUID Partition Table (GPT) instead of a Master Boot Record (MBR). This option is meaningless on UEFI-based systems, unless they are in BIOS compatibility mode.
tr: Kurulum programını, bölüm bilgilerini Ana Önyükleme Kaydı (MBR) yerine bir GUID Bölümlendirme Tablosuna (GPT) kurmaya zorla. Bu seçenek, BIOS uyumluluk modunda olmadıkça UEFI tabanlı sistemlerde anlamsızdır.

source: Normally, BIOS-based systems and UEFI-based systems in BIOS compatibility mode will attempt to use the MBR schema for storing partitioning information, unless the disk is larger than 2 TB. Using this option will change this behavior, allowing a GPT to be written even to disks smaller than 2 TB.
tr: Normalde, BIOS tabanlı sistemler ve BIOS uyumluluk modundaki UEFI tabanlı sistemler, disk 2 TB'tan büyük olmadığı sürece bölümlendirme bilgilerini depolamak için MBR düzenini kullanmayı deneyecektir. Bu seçeneğin kullanılması bu davranışı değiştirecek ve 2 TB'tan küçük disklerde bile GPT kullanılmasına izin verecektir.

source: See xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for more information about GPT and MBR, and xref:appendixes/Disk_Partitions.adoc#sect-disk-partitioning-guid-partition-table[GUID Partition Table (GPT)] for more general information about GPT, MBR and disk partitioning in general.
tr: GPT ve MBR hakkında daha fazla bilgi için xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne ve GPT, MBR ve genel olarak disk bölümlendirme hakkında daha genel bilgi için xref:appendixes/Disk_Partitions.adoc#sect-disk-partitioning-guid-partition-table[GUID Bölümlendirme Tablosu (GPT)] bölümüne bakın.

source: This option controls which Kickstart files and installation logs are saved to the installed system. It can be especially useful to disable saving such data when performing OEM operating system installations, or when generating images using sensitive resources (such as internal repository URLs), as these resources might otherwise be mentioned in kickstart files and/or logs on the image. Possible values for this option are:
tr: Bu seçenek, hangi Kickstart dosyalarının ve kurulum günlüklerinin kurulu sisteme kaydedileceğini denetler. OEM işletim sistemi kurulumlarını gerçekleştirirken veya hassas kaynakları (dahili depo URL'leri gibi) kullanarak kalıplar oluştururken bu tür verilerin kaydedilmesini devre dışı bırakmak özellikle yararlı olabilir, çünkü bu kaynaklardan aksi takdirde kickstart dosyalarında ve/veya kalıptaki günlüklerde bahsedilebilir. Bu seçenek için olası değerler şunlardır:

source: `input_ks` - disables saving of the input Kickstart file (if any).
tr: `input_ks` - (varsa) girdi Kickstart dosyasının kaydedilmesini devre dışı bırakır.

source: `output_ks` - disables saving of the output Kickstart file generated by Anaconda.
tr: `output_ks` - Anaconda tarafından oluşturulan çıktı Kickstart dosyasının kaydedilmesini devre dışı bırakır.

source: `all_ks` - disables saving of both input and output Kickstart files.
tr: `all_ks` - hem girdi hem de çıktı Kickstart dosyalarının kaydedilmesini devre dışı bırakır.

source: `logs` - disables saving of all installation logs.
tr: `logs` - tüm kurulum günlüklerinin kaydedilmesini devre dışı bırakır.
