Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/advanced/Boot_Options.po
Languages: tr

source: {PRODUCT} includes the [application]*Memtest86+* memory testing application. To start memory testing mode, choose Troubleshooting > `Memory test` at the boot menu. Testing will begin immediately. By default, [application]*Memtest86+* carries out ten tests in every pass; a different configuration can be specified by accessing the configuration screen using the kbd:[c] key. After the first pass completes, a message will appear at the bottom informing you of the current status, and another pass will start automatically.
tr: {PRODUCT}, [application]*Memtest86+* bellek test uygulamasını içermektedir. Bellek testi modunu başlatmak için, önyükleme menüsünde Sorun Giderme > `Bellek testi` seçeneğini seçin. Test hemen başlayacaktır. Öntanımlı olarak, [application]*Memtest86+* her geçişte on test gerçekleştirir; kbd:[c] tuşu ile yapılandırma ekranına erişilerek farklı bir yapılandırma belirtilebilir. İlk geçiş tamamlandıktan sonra, altta geçerli durumu bildiren bir mesaj görünecek ve otomatik olarak başka bir geçiş başlayacaktır.

source: [application]*Memtest86+* only works on systems with BIOS firmware. Support for UEFI systems is currently unavailable.
tr: [application]*Memtest86+* yalnızca BIOS ürün yazılımına sahip sistemlerde çalışır. UEFI sistemleri için henüz destek yoktur.

source: Memory Check Using Memtest86+
tr: Memtest86+ Kullanarak Bellek Denetimi

source: Memtest86+ testing the system memory
tr: Memtest86+ sistem belleğini test ediyor

source: The main screen displayed while testing is in progress is divided into three main areas:
tr: Test devam ederken görüntülenen ana ekran üç temel alana bölünmüştür:

source: The upper left corner shows information about your system's memory configuration - the amount of detected memory and processor cache and their throughputs and processor and chipset information. This information is detected when [application]*Memtest86+* starts.
tr: Sol üst köşe, sisteminizin bellek yapılandırmasıyla ilgili bilgileri gösterir - algılanan bellek ve işlemci önbelleği miktarı ve bunların çıktıları ve işlemci ve yonga seti bilgileri. Bu bilgiler [application]*Memtest86+* başladığında algılanır.

source: The upper right corner displays information about the tests - progress of the current pass and the currently running test in that pass as well as a description of the test.
tr: Sağ üst köşe testler hakkında bilgileri görüntüler - geçerli geçişin ilerlemesi ve o geçişte o anda çalıştırılan testin yanı sıra testin bir açıklaması.

source: The central part of the screen is used to display information about the entire set of tests from the moment when the tool has started, such as the total time, the number of completed passes, number of detected errors and your test selection. On some systems, detailed information about the installed memory (such as the number of installed modules, their manufacturer, frequency and latency) will be also displayed here. After the each pass completes, a short summary will appear in this location. For example:
tr: Ekranın orta kısmı toplam süre, tamamlanan geçiş sayısı, tespit edilen hata sayısı ve test seçiminiz gibi, programın başlatıldığı andan itibaren tüm test kümesi hakkında bilgileri görüntülemek için kullanılır. Bazı sistemlerde, kurulu bellekle ilgili ayrıntılı bilgiler de (kurulu modüllerin sayısı, üreticisi, frekansı ve gecikmesi gibi) burada görüntülenecektir. Her geçiş tamamlandıktan sonra, bu konumda kısa bir özet görünecektir. Örneğin:

source: If [application]*Memtest86+* detects an error, it will also be displayed in this area and highlighted red. The message will include detailed information such as which test detected a problem, the memory location which is failing, and others.
tr: [application]*Memtest86+* bir hata algılarsa, o da bu alanda görüntülenecek ve kırmızı renkle vurgulanacaktır. Mesaj, hangi testin bir sorun tespit ettiği, başarısız olan bellek konumu ve diğerleri gibi ayrıntılı bilgileri içerecektir.

source: In most cases, a single successful pass (that is, a single run of all 10 tests) is sufficient to verify that your RAM is in good condition. In some rare circumstances, however, errors that went undetected on the first pass might appear on subsequent passes. To perform a thorough test on an important system, leave the tests running overnight or even for a few days in order to complete multiple passes.
tr: Çoğu durumda, RAM'inizin iyi durumda olduğunu doğrulamak için tek bir başarılı geçiş (yani, tüm 10 testin bir defa çalıştırması) yeterlidir. Ancak bazı nadir durumlarda, ilk geçişte tespit edilmeyen hatalar sonraki geçişlerde görünebilir. Önemli bir sistemde kapsamlı bir test yapmak için, birden fazla geçişi tamamlamak için testleri gece boyunca veya hatta birkaç gün boyunca çalıştırın.

source: The amount of time it takes to complete a single full pass of [application]*Memtest86+* varies depending on your system's configuration (notably the RAM size and speed). For example, on a system with 2{nbsp}GB of DDR2 memory at 667{nbsp}MHz, a single pass will take roughly 20{nbsp}minutes to complete.
tr: Tek bir tam [application]*Memtest86+* geçişini tamamlamak için gereken süre, sisteminizin yapılandırmasına (özellikle RAM boyutu ve hızına) bağlı olarak değişir. Örneğin, 667{nbsp}MHz 2{nbsp}GB DDR2 belleğe sahip bir sistemde, tek geçişin tamamlanması yaklaşık 20{nbsp}dakika sürecektir.

source: To halt the tests and reboot your computer, press the kbd:[Esc] key at any time.
tr: Testleri durdurmak ve bilgisayarınızı yeniden başlatmak için istediğiniz zaman kbd:[Esc] tuşuna basın.

source: For more information about using [application]*Memtest86+*, see the official website at link:++http://www.memtest.org/++[]. A `README` file is also located in `/usr/share/doc/memtest86+-_version_pass:attributes[{blank}]/` on {PRODUCT} systems with the [package]*memtest86+* package installed.
tr: [application]*Memtest86+* kullanma hakkında daha fazla bilgi için link:++https://www.memtest.org/++[] adresindeki resmi web sitesine bakın. Ayrıca [package]*memtest86+* paketinin kurulu olduğu {PRODUCT} sistemlerinde `/usr/share/doc/memtest86+-_sürüm_pass:attributes[{blank}]/` konumunda bir `README` dosyası bulunmaktadır.

source: Verifying Boot Media
tr: Önyükleme Ortamını Doğrulama

source: You can test the integrity of an ISO-based installation source before using it to install {PRODUCT}. These sources include DVDs and ISO images stored on a local hard drive or NFS server. Verifying that the ISO images are intact before you attempt an installation helps to avoid problems that are often encountered during installation.
tr: {PRODUCT} kurmak için kullanmadan önce ISO tabanlı bir kurulum kaynağının bütünlüğünü test edebilirsiniz. Bu kaynaklar, yerel bir sabit diskte veya NFS sunucusunda depolanan DVD'leri ve ISO kalıplarını içerir. Kuruluma başlamadan önce ISO kalıplarının bozuk olmadığını doğrulamak, kurulum sırasında sıklıkla karşılaşılan sorunların önlenmesine yardımcı olur.

source: To test the integrity of an ISO image, append the [option]#rd.live.check# to the boot loader command line. Note that this option is used automatically if you select the default installation option from the boot menu (`Test this media & install Fedora`).
tr: Bir ISO kalıbının bütünlüğünü test etmek için, önyükleyici komut satırına [option]#rd.live.check# seçeneğini ekleyin. Önyükleme menüsünden öntanımlı kurulum seçeneğini (`Bu ortamı test et ve Fedora'yı kur`) seçerseniz bu seçeneğin otomatik olarak kullanıldığını unutmayın.

source: Booting Your Computer in Rescue Mode
tr: Bilgisayarınızı Kurtarma Modunda Önyükleme

source: You may boot a command-line Linux system from an installation disc without actually installing {PRODUCT} on the computer. This enables you to use the utilities and functions of a running Linux system to modify or repair already installed operating systems.
tr: Bir komut satırı Linux sistemini, bilgisayara gerçekten {PRODUCT} kurmadan kurulum diskinden önyükleyebilirsiniz. Bu, halihazırda kurulu işletim sistemlerini değiştirmek veya onarmak için çalışan bir Linux sisteminin araçlarını ve işlevlerini kullanmanızı sağlar.

source: To load the rescue system with the installation disk or USB drive, choose `Rescue a {PRODUCT} system` from the Troubleshooting submenu in the boot menu, or use the [option]#inst.rescue# boot option.
tr: Kurtarma sistemini kurulum diski veya USB sürücüsü ile yüklemek için, önyükleme menüsündeki Sorun Giderme alt menüsünden `Bir {PRODUCT} sistemini kurtar` seçeneğini seçin veya [option]#inst.rescue# önyükleme seçeneğini kullanın.

source: Specify the language, keyboard layout and network settings for the rescue system with the screens that follow. The final setup screen configures access to the existing system on your computer.
tr: Takip eden ekranlarda kurtarma sistemi için dil, klavye düzeni ve ağ ayarlarını belirtin. Son kurulum ekranı, bilgisayarınızdaki mevcut sisteme erişimi yapılandırır.

source: By default, rescue mode attaches an existing operating system to the rescue system under the directory `/mnt/sysimage/`.
tr: Kurtarma modu öntanımlı olarak, mevcut bir işletim sistemini kurtarma sistemine `/mnt/sysimage/` dizini altında bağlar.
