Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/advanced/Boot_Options.po
Languages: tr

source: Boot Options
tr: Önyükleme Seçenekleri

source: The [application]*Anaconda* installer includes a range of boot options for administrators, which modify the default behavior of the installation program by enabling or disabling certain functions. To use one or more boot options, you either have to boot from installation media and append these options at the boot menu (see xref:install/Booting_the_Installation.adoc#sect-boot-menu[The Boot Menu]), or you must add them into your PXE server configuration file if you are booting from a network (see xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Setting Up an Installation Server]).
tr: [application]*Anaconda* kurucusu, yöneticiler için belirli işlevleri etkinleştirerek veya devre dışı bırakarak kurulum programının öntanımlı davranışını değiştiren bir dizi önyükleme seçeneği içermektedir. Bir veya daha fazla önyükleme seçeneğini kullanmak için, kurulum ortamından önyükleme yapmanız ve önyükleme menüsüne bu seçenekleri eklemeniz (xref:install/Booting_the_Installation.adoc#sect-boot-menu[Önyükleme Menüsü] bölümüne bakın), veya ağ üzerinden önyükleme yapıyorsanız bunları PXE sunucusu yapılandırma dosyanıza eklemeniz gerekmektedir (xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Kurulum Sunucusu Ayarlama] bölümüne bakın).

source: You can use multiple options at the same time; in that case, separate them by a single space.
tr: Aynı anda birden fazla seçenek kullanabilirsiniz; ama buna bağlı olarak onları bir boşluk ile ayırmanız gerekir.

source: There are two basic types of options described in this chapter:
tr: Bu bölümde açıklanan iki temel seçenek türü vardır:

source: Options presented as ending with an "equals" sign (`=`) require a value to be specified - they cannot be used on their own. For example, the [option]#inst.vncpassword=# option must also contain a value (in this case, a password). The correct form is therefore [option]#inst.vncpassword=pass:attributes[{blank}]_password_pass:attributes[{blank}]#. On its own, without a password specified, the option is invalid.
tr: "Eşittir" işaretiyle (`=`) biten seçenekler bir değerin belirtilmesini gerektirir - tek başlarına kullanılamazlar. Örneğin, [option]#inst.vncpassword=# seçeneği ayrıca bir değer (bir parola) içermelidir. Bu nedenle doğru biçim [option]#inst.vncpassword=pass:attributes[{blank}]_password_pass:attributes[{blank}]# şeklindedir. Tek başına, yani bir parola belirtilmeden seçenek geçersizdir.

source: Options presented without the "pass:attributes[{blank}]`=`pass:attributes[{blank}]" sign do not accept any values or parameters. For example, the [option]#rd.live.check# option forces [application]*Anaconda* to verify the installation media before starting the installation; if this option is present, the check will be performed, and if it is not present, the check will be skipped.
tr: "pass:attributes[{blank}]`=`pass:attributes[{blank}]" işareti olmadan belirtilen seçenekler herhangi bir değer veya parametreyi kabul etmez. Örneğin, [option]#rd.live.check# seçeneği, [application]*Anaconda*'yı kuruluma başlamadan önce kurulum ortamını doğrulamaya zorlar; bu seçenek varsa denetim yapılacak, yoksa atlanacaktır.

source: In addition to the options described in this chapter, the boot prompt also accepts [application]*dracut* kernel options. A list of these options is available as the `dracut.cmdline(7)` man page.
tr: Bu bölümde açıklanan seçeneklere ek olarak, önyükleme istemi [application]*dracut* çekirdek seçeneklerini de kabul eder. Bu seçeneklerin bir listesi `dracut.cmdline(7)` kılavuz sayfasında bulunabilir.

source: Boot options specific to the installation program always start with `inst.` in this guide. Currently, this prefix is optional - for example, [option]#resolution=1024x768# will work exactly the same as [option]#inst.resolution=1024x768#. However, it is expected that the `inst.` prefix will be mandatory in future releases.
tr: Kurulum programına özel önyükleme seçenekleri bu kılavuzda her zaman `inst.` ile başlamaktadır. Şu anda bu ön ek isteğe bağlıdır - örneğin, [option]#resolution=1024x768# ile [option]#inst.resolution=1024x768# tam olarak aynı şekilde çalışmaktadır. Ancak, `inst.` ön ekinin gelecekteki sürümlerde zorunlu olması beklenmektedir.

source: Configuring the Installation System at the Boot Menu
tr: Önyükleme Menüsünde Kurulum Sistemini Yapılandırma

source: The exact way to specify custom boot options is differs based on your system's architecture, firmware and the method you use to boot the installation. If you are booting from local media, you can specify options in the boot menu, before you begin the installation; if you are booting from a network using a PXE server, you must add boot options into the boot loader configuration file before you boot the installation system. For specific instructions, see xref:install/Booting_the_Installation.adoc#sect-boot-menu[The Boot Menu] if you are booting from local media, and xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Setting Up an Installation Server] if you are booting from a server.
tr: Özel önyükleme seçeneklerini belirtmenin tam yolu sisteminizin mimarisine, ürün yazılımına ve kurulumu önyüklemek için kullandığınız yönteme göre farklılık gösterir. Yerel ortamdan önyükleme yapıyorsanız, kuruluma başlamadan önce önyükleme menüsünde seçenekleri belirtebilirsiniz; PXE sunucusu kullanan bir ağdan önyükleme yapıyorsanız, kurulum sistemini önyüklemeden önce önyükleyici yapılandırma dosyasına önyükleme seçeneklerini eklemelisiniz. Özel talimatlar için yerel ortamdan önyükleme yapıyorsanız xref:install/Booting_the_Installation.adoc#sect-boot-menu[Önyükleme Menüsü], ve bir sunucudan önyükleme yapıyorsanız xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Kurulum Sunucusu Ayarlama] bölümlerine bakın.

source: Available Boot Options
tr: Kullanılabilir Önyükleme Seçenekleri

source: The following options are available in {PRODUCT}:
tr: {PRODUCT}'da aşağıdaki seçenekler kullanılabilir:

source: Specifying the Installation Source
tr: Kurulum Kaynağını Belirtme

source: Specifies the installation source - that is, a location where the installation program can find the images and packages it requires. For example:
tr: Kurulum kaynağını, yani kurulum programının ihtiyaç duyduğu kalıpları ve paketleri bulabileceği bir konumu belirtir. Örneğin:

source: The source must be either:
tr: Kaynak şunlardan biri olmalıdır:

source: an installable tree, which is a directory structure containing the installation program's images, packages and repodata as well as a valid `.treeinfo` file
tr: geçerli bir `.treeinfo` dosyasının yanı sıra kurulum programının kalıplarını, paketlerini ve depo verilerini içeren bir dizin yapısı olan kurulabilir bir ağaç

source: a DVD (a physical disk present in the system's DVD drive)
tr: DVD (sistemin DVD sürücüsünde bulunan fiziksel disk)

source: an ISO image of the full {PRODUCT} installation DVD, placed on a hard drive or a network location accessible from the installation system
tr: tam bir {PRODUCT} kurulum DVD'sinin bir sabit diske veya kurulum sisteminden erişilebilen bir ağ konumuna yerleştirilmiş bir ISO kalıbı

source: This option allows for the configuration of different installation methods using different formats. The syntax is described in the table below.
tr: Bu seçenek, farklı biçimler kullanarak farklı kurulum yöntemlerinin yapılandırılmasına izin verir. Söz dizimi aşağıdaki tabloda açıklanmıştır.

source: Installation Sources
tr: Kurulum Kaynakları

source: |Installation source|Option format |Any CD/DVD drive|[option]#inst.repo=cdrom# |Specific CD/DVD drive|[option]#inst.repo=cdrom:pass:attributes[{blank}]_device_pass:attributes[{blank}]# |Hard Drive|[option]#inst.repo=hd:pass:attributes[{blank}]_device_:/pass:attributes[{blank}]_path_pass:attributes[{blank}]# |HTTP Server|[option]#inst.repo=http://pass:attributes[{blank}]_host_pass:attributes[{blank}]/pass:attributes[{blank}]_path_pass:attributes[{blank}]# |HTTPS Server|[option]#inst.repo=https://pass:attributes[{blank}]_host_pass:attributes[{blank}]/pass:attributes[{blank}]_path_pass:attributes[{blank}]# |FTP Server|[option]#inst.repo=ftp://pass:attributes[{blank}]_username_:pass:attributes[{blank}]_password_pass:attributes[{blank}]@pass:attributes[{blank}]_host_pass:attributes[{blank}]/pass:attributes[{blank}]_path_pass:attributes[{blank}]# |NFS Server|[option]#inst.repo=nfs:[pass:attributes[{blank}]_options_:]pass:attributes[{blank}]_server_:/pass:attributes[{blank}]_path_pass:attributes[{blank}]# footnote:[This option uses NFS protocol version 3 by default. To use a different version, add [option]#+nfsvers=pass:attributes[{blank}]_X_pass:attributes[{blank}]# to _options_.]
tr: |Kurulum kaynağı|Seçenek biçimi |Herhangi bir CD/DVD sürücüsü|[option]#inst.repo=cdrom# |Belirli bir CD/DVD sürücüsü|[option]#inst.repo=cdrom:pass:attributes[{blank}]_aygıt_pass:attributes[{blank}]# |Sabit Disk|[option]#inst.repo=hd:pass:attributes[{blank}]_aygıt_:/pass:attributes[{blank}]_yol_pass:attributes[{blank}]# |HTTP Sunucusu|[option]#inst.repo=http://pass:attributes[{blank}]_anamakine_pass:attributes[{blank}]/pass:attributes[{blank}]_yol_pass:attributes[{blank}]# |HTTPS Sunucusu|[option]#inst.repo=https://pass:attributes[{blank}]_anamakine_pass:attributes[{blank}]/pass:attributes[{blank}]_yol_pass:attributes[{blank}]# |FTP Sunucusu|[option]#inst.repo=ftp://pass:attributes[{blank}]_kullanıcıadı_:pass:attributes[{blank}]_parola_pass:attributes[{blank}]@pass:attributes[{blank}]_anamakine_pass:attributes[{blank}]/pass:attributes[{blank}]_yol_pass:attributes[{blank}]# |NFS Sunucusu|[option]#inst.repo=nfs:[pass:attributes[{blank}]_options_:]pass:attributes[{blank}]_server_:/pass:attributes[{blank}]_path_pass:attributes[{blank}]# dipnot:[Bu seçenek, öntanımlı olarak NFS protokolü sürüm 3'ü kullanır. Farklı bir sürüm kullanmak için _seçeneklere_ [option]#+nfsvers=pass:attributes[{blank}]_X_pass:attributes[{blank}]# ekleyin.]

source: Disk device names may be specified using the following formats:
tr: Disk aygıt adları aşağıdaki biçimler kullanılarak belirtilebilir:

source: Kernel device name, for example `/dev/sda1` or `sdb2`
tr: Çekirdek aygıt adı, örneğin `/dev/sda1` veya `sdb2`

source: File system label, for example `LABEL=Flash` or `LABEL=RHEL7`
tr: Dosya sistemi etiketi, örneğin `LABEL=Flash` veya `LABEL=RHEL7`

source: File system UUID, for example `UUID=8176c7bf-04ff-403a-a832-9557f94e61db`
tr: Dosya sistemi UUID'si, örneğin `UUID=8176c7bf-04ff-403a-a832-9557f94e61db`

source: Non-alphanumeric characters must be represented as `\xpass:attributes[{blank}]_NN_pass:attributes[{blank}]`, where _NN_ is the hexadecimal representation of the character. For example, `\x20` is a white space ("").
tr: Alfasayısal olmayan karakterler `\xpass:attributes[{blank}]_NN_pass:attributes[{blank}]` olarak temsil edilmelidir; burada _NN_, karakterin onaltılık gösterimidir. Örneğin, `\x20` bir boşluk karakteridir ("").

source: Specifies the location of the installation program runtime image to be loaded. The syntax is the same as in xref:Boot_Options.adoc#tabl-boot-options-sources[Installation Sources]. This option expects a path to a directory containing a valid `.treeinfo` file; the location of the runtime image will be read from this file if found. If a `.treeinfo` file is not available, [application]*Anaconda* will try to load the image from `LiveOS/squashfs.img`.
tr: Yüklenecek kurulum programı çalışma zamanı kalıbının konumunu belirtir. Söz dizimi, xref:Boot_Options.adoc#tabl-boot-options-sources[Kurulum Kaynaklarındaki] ile aynıdır. Bu seçenek, geçerli bir `.treeinfo` dosyası içeren bir dizinin yolunu bekler; bulunursa, çalışma zamanı kalıbının konumu bu dosyadan okunacaktır. Bir `.treeinfo` dosyası yoksa, [application]*Anaconda* kalıbı `LiveOS/squashfs.img` dosyasından yüklemeye çalışacaktır.

source: By default, this boot option is used on the installation media and set to a specific label (for example, [option]#inst.stage2=hd:LABEL=F21\x20Server.x86_64#). If you modify the default label of the file system containing the runtime image, you must also edit this option to match the new label.
tr: Öntanımlı olarak, bu önyükleme seçeneği kurulum ortamında kullanılır ve belirli bir etikete ayarlanır (örneğin, [option]#inst.stage2=hd:LABEL=F21\x20Server.x86_64#). Çalışma zamanı kalıbını içeren dosya sisteminin öntanımlı etiketini değiştirirseniz, bu seçeneği de yeni etiketle eşleşecek şekilde düzenlemeniz gerekmektedir.

source: With this boot option, the stage 2 image will be fetched from HTTP, HTTPS and FTP locations which are specified using the [option]#inst.stage2=# option sequentially in the order they are specified, until the image is successfully fetched. All other locations will be ignored.
tr: Bu önyükleme seçeneğiyle 2. aşama kalıbı, kalıp başarıyla alınana kadar, [option]#inst.stage2=# seçeneği kullanılarak belirtilen HTTP, HTTPS ve FTP konumlarından sırayla, belirtilen sırayla alınacaktır. Diğer tüm konumlar yok sayılacaktır.

source: If you need to perform a driver update during the installation, use the [option]#inst.dd=# option. It can be used multiple times. The location of a driver RPM package can be specified using any of the formats described in xref:Boot_Options.adoc#tabl-boot-options-sources[Installation Sources]. With the exception of the [option]#inst.dd=cdrom# option, the device name must always be specified. For example:
tr: Kurulum sırasında bir sürücü güncellemesi yapmanız gerekirse [option]#inst.dd=# seçeneğini kullanın. Birden çok kez kullanılabilir. Bir sürücü RPM paketinin konumu, xref:Boot_Options.adoc#tabl-boot-options-sources[Kurulum Kaynakları] bölümünde açıklanan biçimlerden herhangi biri kullanılarak belirtilebilir. [option]#inst.dd=cdrom# seçeneği dışında, aygıt adı her zaman belirtilmelidir. Örneğin:

source: Using this option without any parameters (only as [option]#inst.dd#) will prompt the installation program to ask you for a driver update disk with an interactive menu.
tr: Bu seçeneği herhangi bir parametre olmadan kullanmak (yalnızca [option]#inst.dd# olarak), kurulum programından etkileşimli bir menü içeren bir sürücü güncelleme diski istemesini isteyecektir.

source: You should never attempt to perform a driver update during the installation unless a missing our faulty driver is preventing you from completing the installation. Updating drivers which are not essential during the installation should always be performed after the system is installed.
tr: Eksik bir sürücü kurulumu tamamlamanızı engellemediği sürece, kurulum sırasında asla sürücü güncellemesi yapmaya çalışmamalısınız. Kurulum sırasında gerekli olmayan sürücülerin güncellenmesi her zaman sistem kurulduktan sonra yapılmalıdır.

source: Prevents the installer from trying to automatically configure an installation source.
tr: Kurucunun bir kurulum kaynağını otomatik olarak yapılandırmaya çalışmasını engeller.

source: Normally, when you first enter the `Installation Summary` screen, the installer will attempt to configure an installation source based on the type of media you used to boot. The full {PRODUCT} Server DVD will configure the source as local media, the netinst ISO image will configure the closest network mirror, etc. This process takes time; therefore, if you plan to use a different source than the default, this option will allow you to enter the `Installation Source` screen immediately without having to wait for the initial configuration to finish.
tr: Normalde, `Kurulum Özeti` ekranına ilk girdiğinizde kurucu, önyükleme yapmak için kullandığınız ortam türüne göre bir kurulum kaynağı yapılandırmaya çalışacaktır. Tam {PRODUCT} Server DVD'si, kaynağı yerel ortam olarak yapılandıracaktır; ağ üzerinden kurulum ISO kalıbı en yakın ağ yansısını yapılandıracaktır, vs. Bu işlem zaman alır; bu nedenle öntanımlı olandan farklı bir kaynak kullanmayı planlıyorsanız, bu seçenek sayesinde ilk yapılandırmanın bitmesini beklemek zorunda kalmadan hemen `Kurulum Kaynağı` ekranına girebileceksiniz.

source: Using this option will leave the installation source configuration in an error state - you must manually specify a source in the `Installation Source` screen to proceed with the installation. Alternatively, you can use the [option]#inst.repo=# option described above to configure a specific source directly in the boot menu.
tr: Bu seçeneği kullanmak, kurulum kaynağı yapılandırmasını bir hata durumunda bırakacaktır - kuruluma devam etmek için `Kurulum Kaynağı` ekranında elle bir kaynak belirtmelisiniz. Alternatif olarak, doğrudan önyükleme menüsünde belirli bir kaynağı yapılandırmak için yukarıda açıklanan [option]#inst.repo=# seçeneğini kullanabilirsiniz.

source: Kickstart Boot Options
tr: Kickstart Önyükleme Seçenekleri

source: Gives the location of a Kickstart file to be used to automate the installation. Locations can be specified using any of the formats valid for [option]#inst.repo=#. See xref:Boot_Options.adoc#tabl-boot-options-sources[Installation Sources] for valid formats.
tr: Kurulumu otomatikleştirmek için kullanılacak bir Kickstart dosyasının konumunu belirtir. Konumlar, [option]#inst.repo=# için geçerli biçimlerden herhangi biri kullanılarak belirtilebilir. Geçerli biçimler için xref:Boot_Options.adoc#tabl-boot-options-sources[Kurulum Kaynakları] bölümüne bakın.

source: If you only specify a device and not a path, the installation program will look for the Kickstart file in `/ks.cfg` on the specified device. If you use this option without specifying a device, the installation program will use the following:
tr: Bir yol değil de yalnızca bir aygıt belirtirseniz, kurulum programı belirtilen aygıtta `/ks.cfg` konumunda Kickstart dosyasını arayacaktır. Bu seçeneği bir aygıt belirtmeden kullanırsanız, kurulum programı aşağıdakileri kullanacaktır:

source: In the above example, _next-server_ is the DHCP `next-server` option or the IP address of the DHCP server itself, and _filename_ is the DHCP `filename` option, or `/kickstart/`. If the given file name ends with the `/` character, `pass:attributes[{blank}]_ip_-kickstart` is appended. For example:
tr: Yukarıdaki örnekte _next-server_, DHCP `next-server` seçeneği veya DHCP sunucusunun kendisinin IP adresidir; ve _filename_, DHCP `filename` seçeneği veya `/kickstart/` 'dır. Verilen dosya adı `/` karakteriyle bitiyorsa, sonuna `pass:attributes[{blank}]_ip_-kickstart` eklenir. Örneğin:

source: Default Kickstart File Location
tr: Öntanımlı Kickstart Dosyası Konumu

source: |DHCP server address|Client address|Kickstart file location |`192.168.122.1`|`192.168.122.100`|`192.168.122.1`:pass:attributes[{blank}]`/kickstart/192.168.122.100-kickstart`
tr: |DHCP sunucusu adresi|İstemci adresi|Kickstart dosyası konumu |`192.168.122.1`|`192.168.122.100`|`192.168.122.1`:pass:attributes[{blank}]`/kickstart/192.168.122.100-kickstart`

source: With this boot option, the Kickstart file will be fetched from HTTP, HTTPS and FTP locations which are specified using the [option]#inst.ks=# option sequentially in the order they are specified, until the file is successfully fetched. All other locations will be ignored.
tr: Bu önyükleme seçeneğiyle Kickstart dosyası, dosya başarıyla alınana kadar [option]#inst.ks=# seçeneği kullanılarak belirtilen sırayla HTTP, HTTPS ve FTP konumlarından alınacaktır. Diğer tüm konumlar yok sayılacaktır.

source: Adds headers to outgoing `HTTP` requests with the MAC addresses of all network interfaces. For example:
tr: Tüm ağ arayüzlerinin MAC adresleriyle giden `HTTP` isteklerine başlıklar ekler. Örneğin:

source: This can be useful when using [option]#inst.ks=http# to provision systems.
tr: Bu, sistemleri yönetmek için [option]#inst.ks=http# kullanılırken faydalı olabilir.

source: Adds a header to outgoing `HTTP` requests. This header will contain the system's serial number, read from `/sys/class/dmi/id/product_serial`. The header has the following syntax:
tr: Giden `HTTP` isteklerine bir başlık ekler. Bu başlık, `/sys/class/dmi/id/product_serial` adresinden okunan sistemin seri numarasını içerecektir. Başlık aşağıdaki söz dizimine sahiptir:

source: Console, Environment and Display Options
tr: Konsol, Ortam ve Ekran Seçenekleri

source: This kernel option specifies a device to be used as the primary console. For example, to use a console on the first serial port, use [option]#console=ttyS0#. This option should be used along with the [option]#inst.text# option.
tr: Bu çekirdek seçeneği, birincil konsol olarak kullanılacak bir aygıtı belirtir. Örneğin, ilk seri bağlantı noktasında bir konsol kullanmak için [option]#console=ttyS0# kullanın. Bu seçenek, [option]#inst.text# ile birlikte kullanılmalıdır.

source: You can use this option multiple times. In that case, the boot message will be displayed on all specified consoles, but only the last one will be used by the installation program afterwards. For example, if you specify [option]#console=ttyS0 console=ttyS1#, the installation program will only use `ttyS1`.
tr: Bu seçeneği birden çok kez kullanabilirsiniz. Bu durumda, belirtilen tüm konsollarda önyükleme mesajı görüntülenecektir, ancak daha sonra kurulum programı tarafından yalnızca sonuncusu kullanılacaktır. Örneğin, [option]#console=ttyS0 console=ttyS1# belirtirseniz, kurulum programı yalnızca `ttyS1` kullanacaktır.

source: Disables access to the root shell during the installation. This is useful with automated (Kickstart) installations - if you use this option, a user can watch the installation progress, but they cannot interfere with it by accessing the root shell by pressing kbd:[Ctrl + Alt + F2].
tr: Kurulum sırasında root kabuğuna erişimi devre dışı bırakır. Bu, otomatik (Kickstart) kurulumlarda kullanışlıdır - bu seçeneği kullanırsanız, bir kullanıcı kurulum ilerlemesini izleyebilir, ancak kbd:[Ctrl + Alt + F2] tuşlarına basıp root kabuğuna erişerek ona müdahale edemez.

source: Sets the language to be used during the installation. Language codes are the same as the ones used in the [command]#lang# Kickstart command as described in xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-lang[lang (optional) - Configure Language During Installation]. On systems where the [package]*system-config-language* package is installed, a list of valid values can also be find in `/usr/share/system-config-language/locale-list`.
tr: Kurulum sırasında kullanılacak dili ayarlar. Dil kodları, xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-lang[lang (isteğe bağlı) - Kurulum Sırasındaki Dili Yapılandır] bölümünde açıklandığı gibi [command]#lang# Kickstart komutunda kullanılanlarla aynıdır. [package]*system-config-language* paketinin kurulu olduğu sistemlerde, geçerli değerlerin bir listesi `/usr/share/system-config-language/locale-list` içinde de bulunabilir.

source: If you perform the installation interactively, the language you specified using this option will be selected by default, but you will still be able to change it at the beginning of the graphical installation.
tr: Kurulumu etkileşimli olarak gerçekleştirirseniz, bu seçeneği kullanarak belirttiğiniz dil öntanımlı olarak seçilecektir, ancak yine de grafiksel kurulumunun başında bunu değiştirebileceksiniz.
