Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f28/pages/advanced/Boot_Options.po
Languages: tr

source: `all` - disables saving of all Kickstart files and all installation logs.
tr: `all` - tüm Kickstart dosyalarının ve tüm kurulum günlüklerinin kaydedilmesini devre dışı bırakır.

source: Multiple values can be combined as a comma separated list, for example: `input_ks,logs`
tr: Birden çok değer virgülle ayrılmış bir liste olarak birleştirilebilir, örneğin: `input_ks,logs`

source: This option controls the usage of _zRAM_ swap during the installation. It creates a compressed block device inside the system RAM and uses it for swap space instead of the hard drive. This allows the installer to essentially increase the amount of memory available, which makes the installation faster on systems with low memory.
tr: Bu seçenek, kurulum sırasında _zRAM_ takas kullanımını denetler. Sistem RAM'i üzerinde sıkıştırılmış bir blok aygıtı oluşturur ve takas alanı için sabit disk yerine bunu kullanır. Bu, kurucunun kullanılabilir bellek miktarını önemli ölçüde artırmasına ve bunun sonucunda düşük belleğe sahip sistemlerde kurulumu daha hızlı hale getirmesine olanak tanır.

source: By default, swap on zRAM is enabled on systems with 2 GB or less RAM, and disabled on systems with more than 2 GB of memory. You can use this option to change this behavior - on a system with more than 2 GB RAM, use [option]#inst.zram=1# to enable it, and on systems with 2 GB or less memory, use [option]#inst.zram=0# to disable this feature.
tr: Öntanımlı olarak, 2 GB veya daha az RAM'e sahip sistemlerde zRAM üzerinde takas etkinleştirilir ve 2 GB'tan fazla belleğe sahip sistemlerde devre dışı bırakılır. Bu davranışı değiştirmek için bu seçeneği kullanabilirsiniz - 2 GB'tan fazla RAM'e sahip bir sistemde bu özelliği etkinleştirmek için [option]#inst.zram=1# seçeneğini, ve 2 GB veya daha az belleğe sahip sistemlerde devre dışı bırakmak için [option]#inst.zram=0# seçeneğini kullanın.

source: Perform a check at the beginning of the installation to determine if there is enough available RAM. If there is not enough memory detected, the installation will stop with an error message. This option is enabled by default; use [option]#inst.memcheck=0# to disable it.
tr: Yeterli kullanılabilir RAM olup olmadığını belirlemek için kurulumun başında bir denetim gerçekleştir. Yeterli bellek algılanmadıysa, kurulum bir hata mesajıyla duracaktır. Bu seçenek öntanımlı olarak etkindir; devre dışı bırakmak için [option]#inst.memcheck=0# seçeneğini kullanın.

source: Use the older [application]*Yum* backend for package installation and dependency resolution instead of [application]*DNF*. See the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[], for details about [application]*DNF*.
tr: Paket kurulumu ve bağımlılık çözümlemesi için [application]*DNF* yerine eski [application]*Yum* arka ucunu kullan. [application]*DNF* hakkında ayrıntılar için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Sistem Yöneticisi Kılavuzuna_ bakın.

source: Turns the [application]*Kdump* installer add-on `on` or `off` (the add-on is off by default). If you use [option]#inst.kdump_addon=on#, a new screen, which allows you to configure the [application]*Kdump* kernel crash dumping mechanism, will appear in the main menu of the graphical or text interface (see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-kdump[Kdump]). Enabling this add-on is also necessary to use the xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-kdump[%addon com_redhat_kdump (optional) - Configure kdump] Kickstart command.
tr: [application]*Kdump* kurucu eklentisini `açar` veya `kapatır` (öntanımlı olarak eklenti kapalıdır). [option]#inst.kdump_addon=on# seçeneğini kullanırsanız, grafiksel veya metin arayüzünün ana menüsünde [application]*Kdump* çekirdek çökme döküm mekanizmasını yapılandırmanıza izin veren yeni bir ekran görünecektir (xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-kdump[Kdump] bölümüne bakın). Bu eklentiyi etkinleştirmek, xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-kdump[%addon com_redhat_kdump (isteğe bağlı) - kdump'ı Yapılandır] Kickstart komutunu kullanmak için de gereklidir.

source: Enabling Remote Access Using VNC
tr: VNC Kullanarak Uzaktan Erişimi Etkinleştirme

source: The following options are necessary to configure [application]*Anaconda* for remote graphical installation. See xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Installing Using VNC] for more details.
tr: [application]*Anaconda*'yı uzaktan grafiksel kurulum için yapılandırmak için aşağıdaki seçenekler gereklidir. Daha fazla ayrıntı için xref:advanced/VNC_Installations.adoc#chap-vnc-installations[VNC Kullanarak Kurma] bölümüne bakın.

source: Specifies that the installation program's graphical interface should be run in a `VNC` session. If you specify this option, you will need to connect to the system using a `VNC` client application to be able to interact with the installation program. `VNC` sharing is enabled, so multiple clients can connect to the system at the same time.
tr: Kurulum programının grafiksel arayüzünün bir `VNC` oturumunda çalıştırılması gerektiğini belirtir. Bu seçeneği belirtirseniz, kurulum programıyla etkileşime girebilmek için bir `VNC` istemci uygulaması kullanarak sisteme bağlanmanız gerekecektir. `VNC` paylaşımı etkinleştirildiğinde birden fazla istemci aynı anda sisteme bağlanabilir.

source: A system installed using `VNC` will start in text mode by default.
tr: `VNC` kullanılarak kurulan bir sistem, öntanımlı olarak metin modunda başlayacaktır.

source: `VNC` server used by the installation program. Any `VNC` client attempting to connect to the system will have to provide the correct password to gain access. For example, [option]#inst.vncpassword=pass:attributes[{blank}]_testpwd_pass:attributes[{blank}]# will set the password to `testpwd`. The password must be between 6 and 8 characters long.
tr: Kurulum programı tarafından kullanılan `VNC` parolası. Sisteme bağlanmaya çalışan herhangi bir `VNC` istemcisi, erişim kazanmak için doğru parolayı sağlamalıdır. Örneğin, [option]#inst.vncpassword=pass:attributes[{blank}]_prltest_pass:attributes[{blank}]# seçeneği parolayı `prltest` olarak ayarlayacaktır. Parola 6 ila 8 karakter uzunluğunda olmalıdır.

source: If you specify an invalid password (one that is too short or too long), you will be prompted to specify a new one by a message from the installation program:
tr: Geçersiz bir parola belirtirseniz (çok kısa veya çok uzun), kurulum programından gelecek bir mesajla yeni bir parola belirlemeniz istenecektir:

source: VNC password must be six to eight characters long. Please enter a new one, or leave blank for no password.
tr: VNC parolası altı ila sekiz karakter uzunluğunda olmalıdır. Lütfen yeni bir tane girin, veya parola olmaması için boş bırakın.

source: Password:
tr: Parola:

source: Connect to a listening `VNC` client at a specified host and port once the installation starts. The correct syntax is [option]#inst.vncconnect=pass:attributes[{blank}]_host_:pass:attributes[{blank}]_port_pass:attributes[{blank}]#. The _port_ parameter is optional - if you do not specify one, the installation program will use `5900`.
tr: Kurulum başladığında, belirtilen bir ana makine ve bağlantı noktasında dinleyen bir `VNC` istemcisine bağlan. Doğru söz dizimi [option]#inst.vncconnect=pass:attributes[{blank}]_anamakine_:pass:attributes[{blank}]_bağlantınoktası_pass:attributes[{blank}]# şeklindedir. _bağlantınoktası_ parametresi isteğe bağlıdır - belirtmezseniz kurulum programı `5900` değerini kullanacaktır.

source: Debugging and Troubleshooting
tr: Hata Ayıklama ve Sorun Giderme

source: Specifies the location of the `updates.img` file to be applied to the installation program runtime. The syntax is the same as in the [option]#inst.repo# option - see xref:Boot_Options.adoc#tabl-boot-options-sources[Installation Sources] for details. In all formats, if you do not specify a file name but only a directory, the installation program will look for a file named `updates.img`.
tr: Kurulum programı çalışma zamanına uygulanacak `updates.img` dosyasının konumunu belirtir. Söz dizimi, [option]#inst.repo# seçeneğindekiyle aynıdır - ayrıntılar için xref:Boot_Options.adoc#tabl-boot-options-sources[Kurulum Kaynakları] bölümüne bakın. Tüm biçimlerde, bir dosya adı değil de yalnızca bir dizin belirtirseniz, kurulum programı `updates.img` adlı bir dosya arayacaktır.

source: Specifies the minimum level for messages to be logged on a terminal. This only concerns real-time logging in a terminal; log files will always contain messages of all levels.
tr: Terminalde yazdırılacak mesajlar için en düşük seviyeyi belirtir. Bu yalnızca bir terminalde gerçek zamanlı gösterilecek mesajlarla ilgilidir; günlük dosyaları her zaman tüm seviyelerden mesajları içerecektir.

source: Possible values for this option from the lowest to highest level are: `debug`, `info`, `warning`, `error` and `critical`. The default value is `info`, which means that by default, the logging terminal will display messages ranging from `info` to `critical`, but not `debug`.
tr: Bu seçenek için en düşükten en yükseğe olası değerler şunlardır: `debug`, `info`, `warning`, `error` ve `critical`. `info` öntanımlı değerdir; yani öntanımlı olarak terminalde `info` ile `critical` arasındaki mesajlar görüntülenecek, ancak `debug` mesajları görüntülenmeyecektir.

source: Once the installation starts, this option sends log messages to the syslog process on the specified host. The remote syslog process must be configured to accept incoming connections.
tr: Kurulum başladığında bu seçenek, günlük mesajlarını belirtilen ana makinedeki syslog işlemine gönderir. Uzak syslog işlemi, gelen bağlantıları kabul edecek şekilde yapılandırılmalıdır.

source: Specifies a `virtio` port (a character device at `/dev/virtio-ports/pass:attributes[{blank}]_name_pass:attributes[{blank}]`) to be used for forwarding logs. The default value is `org.fedoraproject.anaconda.log.0`pass:attributes[{blank}]; if this port is present, it will be used.
tr: Günlükleri iletmek için kullanılacak bir `virtio` bağlantı noktası (`/dev/virtio-ports/pass:attributes[{blank}]_ad_pass:attributes[{blank}]` konumunda bir karakter aygıtı) belirtir. `org.fedoraproject.anaconda.log.0`pass:attributes[{blank}] öntanımlı değerdir; bu bağlantı noktası varsa kullanılacaktır.

source: Deprecated Boot Options
tr: Kullanımdan Kaldırılan Önyükleme Seçenekleri

source: Options in this list are *deprecated*. They will still work, but there are other options which offer the same functionality and should be preferred. Using deprecated options is not recommended and they are expected to be removed in future releases.
tr: Bu listedeki seçenekler *kullanımdan kaldırıldı*. Hala çalışacaklar, ancak aynı işlevselliği sunan ve tercih edilmesi gereken başka seçenekler vardır. Kullanımdan kaldırılan seçeneklerin kullanılması tavsiye edilmez ve bunların gelecek sürümlerde kaldırılması beklenmektedir.

source: Note that as described in the introduction to this chapter, options specific to the installation program now use the `inst.` prefix. For example, the [option]#vnc=# option is considered deprecated and replaced by the [option]#inst.vnc=# option. However, these changes are not listed here.
tr: Bu bölümün girişinde açıklandığı gibi, kurulum programına özgü seçeneklerin artık `inst.` ön ekini kullandığını unutmayın. Örneğin, [option]#vnc=# seçeneği kullanımdan kaldırıldı olarak kabul edilir ve [option]#inst.vnc=# seçeneği ile değiştirilmiştir. Ancak bu değişiklikler burada listelenmemiştir.

source: Used to specify that the machine being installed onto does not have any display hardware, and to prevent the installer from trying to detect a display.
tr: Üzerine kurulmakta olan makinenin herhangi bir ekran donanımına sahip olmadığını belirtmek ve kurucunun bir ekranı algılamaya çalışmasını önlemek için kullanılıyordu.

source: Configured the installation method. Use the [option]#inst.repo=# option instead.
tr: Kurulum yöntemini yapılandırıyordu. Bunun yerine [option]#inst.repo=# seçeneğini kullanın.

source: [option]#repo=nfsiso:pass:attributes[{blank}]_server_:/pass:attributes[{blank}]_path_pass:attributes[{blank}]#
tr: [option]#repo=nfsiso:pass:attributes[{blank}]_sunucu_:/pass:attributes[{blank}]_yol_pass:attributes[{blank}]#

source: In NFS installations, specified that the target is an ISO image located on an NFS server instead of an installable tree. The difference is now detected automatically, which means this option is the same as [option]#inst.repo=nfs:pass:attributes[{blank}]_server_:/pass:attributes[{blank}]_path_pass:attributes[{blank}]#.
tr: NFS kurulumlarında, hedefin kurulabilir bir ağaç yerine NFS sunucusunda bulunan bir ISO kalıbı olduğunu belirtiyordu. Fark artık otomatik olarak algılanıyor, yani bu seçenek [option]#inst.repo=nfs:pass:attributes[{blank}]_sunucu_:/pass:attributes[{blank}]_yol_pass:attributes[{blank}]# ile aynıdır.

source: Configured the Domain Name Server (DNS). Use the [option]#nameserver=# option instead.
tr: Etki Alanı Adı Sunucusunu (DNS) yapılandırıyordu. Bunun yerine [option]#nameserver=# seçeneğini kullanın.

source: These options have been consolidated under the [option]#ip=# option.
tr: Bu seçenekler [option]#ip=# seçeneği altında birleştirildi.

source: Select network device to be used at early stage of installation. Different values have been replaced with different options; see the table below.
tr: Kurulumun erken aşamasında kullanılacak ağ aygıtını seç. Farklı değerler farklı seçeneklerle değiştirildi; aşağıdaki tabloya bakın.

source: |Value|Current behavior |Not present|All devices are attempted to be activated using `dhcp`, unless desired device and configuration is specified by [option]#ip=# option and/or the [option]#BOOTIF# option. |[option]#ksdevice=link#|Similar to the above, with the difference that network will always be activated in the initramfs, whether it is needed or not. The supported [option]#rd.neednet# option (provided by [application]*dracut*) should be used instead. |[option]#ksdevice=bootif#|Ignored (the BOOTID= option is used by default when specified) |[option]#ksdevice=ibft#|Replaced with the [option]#ip=ibft# option |[option]#ksdevice=pass:attributes[{blank}]_MAC_pass:attributes[{blank}]#|Replaced with [option]#BOOTIF=pass:attributes[{blank}]_MAC_pass:attributes[{blank}]# |[option]#ksdevice=pass:attributes[{blank}]_device_pass:attributes[{blank}]#|Replaced by specifying the device name using the [option]#ip=# option.
tr: |Değer|Şu anki davranış |Yok|İstenen aygıt ve yapılandırma [option]#ip=# seçeneği ve/veya [option]#BOOTIF# seçeneği ile belirtilmediği sürece tüm aygıtlar `dhcp` kullanılarak etkinleştirilmeye çalışılır. |[option]#ksdevice=link#|Yukarıdakine benzerdir, farklı olarak, gerekli olsun ya da olmasın, ağ initramfs aşamasında her zaman etkinleştirilecektir. Bunun yerine desteklenen [option]#rd.neednet# seçeneği ([application]*dracut* tarafından sağlanır) kullanılmalıdır. |[option]#ksdevice=bootif#|Yok sayılır (BOOTID= seçeneği belirtildiğinde öntanımlı olarak kullanılır) |[option]#ksdevice=ibft#|[option]#ip=ibft# seçeneği ile değiştirildi |[option]#ksdevice=pass:attributes[{blank}]_MAC_pass:attributes[{blank}]#|[option]#BOOTIF=pass:attributes[{blank}]_MAC_pass:attributes[{blank}]# seçeneğiyle değiştirildi |[option]#ksdevice=pass:attributes[{blank}]_aygıt_pass:attributes[{blank}]#|[option]#ip=# seçeneğini kullanarak aygıt adının belirtilmesiyle değiştirildi.

source: When performing a Kickstart installation, booting from local media and having the Kickstart file on local media as well, the network will not be initialized. This means that any other Kickstart options requiring network access, such as pre-installation or post-installation scripts accessing a network location, will cause the installation to fail. This is a known issue; see BZ#link:++https://bugzilla.redhat.com/show_bug.cgi?id=1085310++[1085310] for details.
tr: Bir Kickstart kurulumu gerçekleştirirken, yerel ortamdan önyükleme yapılıyorsa ve Kickstart dosyası da yerel ortamda bulunuyorsa ağ başlatılmayacaktır. Bu, bir ağ konumuna erişen kurulum öncesi veya kurulum sonrası betikleri gibi ağ erişimi gerektiren diğer Kickstart seçeneklerinin kurulumun başarısız olmasına neden olacağı anlamına gelir. Bu bilinen bir sorundur; ayrıntılar için BZ#link:++https://bugzilla.redhat.com/show_bug.cgi?id=1085310++[1085310] sayfasına bakın.

source: To work around this issue, either use the [option]#ksdevice=link# boot option, or add the [option]#--device=link# option to the [command]#network# command in your Kickstart file.
tr: Bu sorunu çözmek için [option]#ksdevice=link# önyükleme seçeneğini kullanın veya Kickstart dosyanızdaki [command]#network# komutuna [option]#--device=link# seçeneğini ekleyin.

source: Used to disable specified drivers. This is now handled by the [option]#modprobe.blacklist=# option.
tr: Belirtilen sürücüleri devre dışı bırakmak için kullanılıyordu. Bu artık [option]#modprobe.blacklist=# seçeneği tarafından gerçekleştiriliyor.

source: Disabled support for the FireWire interface. You can disable the FireWire driver (`firewire_ohci`) by using the [option]#modprobe.blacklist=# option instead:
tr: FireWire arayüzü desteğini devre dışı bırakıyordu. Bunun yerine [option]#modprobe.blacklist=# seçeneğini kullanarak FireWire sürücüsünü (`firewire_ohci`) devre dışı bırakabilirsiniz:

source: Removed Boot Options
tr: Kaldırılan Önyükleme Seçenekleri

source: The following options are removed. They were present in previous releases of {PRODUCT}, but they cannot be used anymore.
tr: Aşağıdaki seçenekler kaldırılmıştır. Önceki {PRODUCT} sürümlerinde bulunuyorlardı, ancak artık kullanılamazlar.

source: The installation program's `initramfs` is now completely non-interactive, which means that this option are not available anymore. Use [option]#ip=# to configure network settings.
tr: Kurulum programının `initramfs` 'i artık tamamen etkileşimsizdir, yani bu seçenek artık kullanılamaz. Ağ ayarlarını yapılandırmak için [option]#ip=# seçeneğini kullanın.

source: This option forced [application]*Anaconda* to use the `/dev/ttyS0` console as the output. Use the [option]#console=/dev/ttyS0# (or similar) instead.
tr: Bu seçenek, [application]*Anaconda*'yı çıktı için `/dev/ttyS0` konsolunu kullanmaya zorluyordu. Bunun yerine [option]#console=/dev/ttyS0# (veya benzeri) seçeneğini kullanın.

source: Specified the location of updates for the installation program. Use the [option]#inst.updates=# option instead.
tr: Kurulum programı için güncellemelerin konumunu belirtiyordu. Bunun yerine [option]#inst.updates=# seçeneğini kullanın.

source: Configured wireless network access. Network configuration is now being handled by [application]*dracut*, which does not support wireless networking, rendering these options useless.
tr: Kablosuz ağ erişimini yapılandırıyordu. Ağ yapılandırması artık [application]*dracut* tarafından gerçekleştiriliyor ve kablosuz ağı desteklemiyor, bu da bu seçenekleri kullanışsız hale getiriyor.

source: Used in the past to configure additional low-level network settings. All network settings are now handled by the [option]#ip=# option.
tr: Geçmişte alt düzeydeki ek ağ ayarlarını yapılandırmak için kullanılıyordu. Tüm ağ ayarları artık [option]#ip=# seçeneği tarafından yapılıyor.

source: Allowed you to debug the loader. Use [option]#rd.debug# instead.
tr: Yükleyicide hata ayıklamanıza izin veriyordu. Bunun yerine [option]#rd.debug# seçeneğini kullanın.

source: Verified the installation media before starting the installation. Replaced with the [option]#rd.live.check# option.
tr: Kuruluma başlamadan önce kurulum ortamını doğruluyordu. [option]#rd.live.check# seçeneğiyle değiştirildi.

source: Specified a floppy disk as the Kickstart file source. Floppy drives are not supported anymore.
tr: Kickstart dosya kaynağı olarak bir disket belirtiyordu. Disket sürücüler artık desteklenmiyor.

source: Configured a remote display. Replaced with the [option]#inst.vnc# option.
tr: Bir uzak ekran yapılandırıyordu. [option]#inst.vnc# seçeneğiyle değiştirildi.

source: Added UTF8 support when installing in text mode. UTF8 support now works automatically.
tr: Metin modunda kurulum yaparken UTF8 desteği ekliyordu. UTF8 desteği artık otomatik olarak çalışıyor.

source: Used to disable IPv6 support in the installation program. IPv6 is now built into the kernel so the driver cannot be blacklisted; however, it is possible to disable IPv6 using the [option]#ipv6.disable# option.
tr: Kurulum programında IPv6 desteğini devre dışı bırakmak için kullanılıyordu. IPv6 artık çekirdeğe yerleşiktir, yani sürücü kara listeye alınamaz; ancak [option]#ipv6.disable# seçeneğini kullanarak IPv6'yı devre dışı bırakmak mümkündür.

source: Upgrades are done in a different way in current {PRODUCT} releases. For more information about upgrading your system, see xref:advanced/Upgrading_Your_Current_System.adoc#chap-upgrading[Upgrading Your Current System].
tr: Güncel {PRODUCT} sürümlerinde yükseltmeler farklı bir şekilde yapılıyor. Sisteminizi yükseltme hakkında daha fazla bilgi için xref:advanced/Upgrading_Your_Current_System.adoc#chap-upgrading[Geçerli Sisteminizi Yükseltme] bölümüne bakın.

source: Used to configure Virtual LAN (802.1q tag) devices. Use the [option]#vlan=# option instead.
tr: Sanal LAN (802.1q tag) aygıtlarını yapılandırmak için kullanılıyordu. Bunun yerine [option]#vlan=# seçeneğini kullanın.

source: Used to enable [application]*DNF* to handle package installation and dependency resolution in {PRODUCT} 21. [application]*DNF* is now used by default and this option has been replaced with [option]#inst.nodnf#, which reverts back to [application]*Yum*.
tr: {PRODUCT} 21'de paket kurulumunu ve bağımlılık çözümlemesini işlemek üzere [application]*DNF*'i etkinleştirmek için kullanılıyordu. [application]*DNF* artık öntanımlı olarak kullanılıyor ve bu seçenek [application]*Yum*'a geri dönmeyi sağlayan [option]#inst.nodnf# seçeneğiyle değiştirildi.

source: Using the Maintenance Boot Modes
tr: Bakım Önyükleme Modlarını Kullanma

source: Loading the Memory (RAM) Testing Mode
tr: Bellek (RAM) Test Modunu Yükleme

source: Faults in memory (RAM) modules may cause your system to freeze or crash unpredictably. In some cases, memory faults may only cause errors with particular combinations of software. For this reason, you should test the memory of a computer before you install {PRODUCT} for the first time, even if it has previously run other operating systems.
tr: Bellek (RAM) modüllerindeki hatalar, sisteminizin beklenmedik şekilde donmasına veya çökmesine neden olabilir. Bazı durumlarda, bellek hataları yalnızca belirli yazılımlar bir arada olduğunda hatalara neden olabilir. Bu nedenle, daha önce başka işletim sistemleri çalıştırmış olsa bile {PRODUCT}'yı ilk kez kurmadan önce bilgisayarın belleğini test etmelisiniz.
