Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f31/pages/install/Preparing_for_Installation.po
Languages: id

source: Preparing for Installation
id: Mempersiapkan Instalasi

source: This chapter describes the steps you need take before you begin the installation. Not every step must be strictly followed - for example, if you plan to use the default installation settings, you do not need to gather system information such as disk device labels/UUIDs or network information such as the system's IP address. However, you should still go through this chapter, as it also describes the available types of installation media and how to prepare boot media and installation sources.
id: Bab ini menjelaskan langkah yang perlu diambil sebelum Anda memulai instalasi. Tidak setiap langkah harus diikuti secara ketat - misalnya, jika Anda berencana untuk menggunakan pengaturan instalasi default, Anda tidak perlu mengumpulkan informasi sistem seperti label perangkat disk/UUID atau informasi jaringan seperti alamat IP sistem. Namun, Anda masih harus melewati bab ini, karena ini juga menjelaskan jenis media instalasi yang tersedia dan bagaimana mempersiapkan media boot dan sumber instalasi.

source: Upgrade or Install?
id: Tingkatkan atau Pasang Baru?

source: If you already have Fedora installed and want to upgrade your installation to the current version, there are two basic ways to do so:
id: Jika Anda sudah menginstal Fedora dan ingin meningkatkan instalasi Anda ke versi saat ini, ada dua cara dasar untuk melakukannya:

source: Automatic upgrade using [application]*dnf system upgrade*
id: Upgrade otomatis menggunakan [application]*dnf system upgrade*

source: The preferred way to upgrade your system is an automatic upgrade using the [application]*dnf system upgrade* utility. For information on performing an automatic upgrade, see link:++https://fedoraproject.org/wiki/DNF_system_upgrade++[Fedora Wiki dnf system upgrade].
id: Cara yang lebih disukai untuk meningkatkan sistem Anda adalah upgrade otomatis menggunakan utilitas [application]*dnf system upgrade*. Untuk informasi tentang melakukan upgrade otomatis, lihat link:++https://fedoraproject.org/wiki/DNF_system_upgrade++[dnf system upgrade Wiki Fedora].

source: Manual Reinstallation
id: Instalasi Ulang Manual

source: You can upgrade to the latest version of Fedora manually instead of relying on [application]*dnf system upgrade*. This involves booting the installer as if you were performing a clean installation, letting it detect your existing Fedora system, and overwriting the root partition while preserving data on other partitions and volumes. The same process can also be used to reinstall the system, if you need to. For detailed information, see xref:advanced/Upgrading_Your_Current_System.adoc#sect-upgrading-fedora-manual-reinstall[Manual System Upgrade or Reinstallation].
id: Anda dapat meningkatkan ke versi terakhir Fedora secara manual alih-alih mengandalkan [application]*dnf system upgrade*. Ini melibatkan mem-boot installer seolah Anda melakukan suatu instalasi bersih, membiarkannya mendetekai sistem Fedora Anda yang ada, dan menimpa partisi root sambil mempertahan data pada partisi dan volume lain. Proses yang sama juga dapat dipakai untuk menginstal ulang sistem, bila Anda perlu melakukannya. Untuk informasi rinci, lihat xref:advanced/Upgrading_Your_Current_System.adoc#sect-upgrading-fedora-manual-reinstall[Peningkatan Sistem Manual atau Instalasi Ulang].

source: Always back up your data before performing an upgrade or reinstalling your system, no matter which method you choose.
id: Selalu cadangkan data Anda sebelum melakukan upgrade atau instal ulang sistem Anda, apa pun metode yang Anda pilih.

source: Preparing Boot Media
id: Mempersiapkan Media Boot

source: Fedora images are `Hybrid ISOs` and can be used to create installation media with both optical and USB disks, for booting on both BIOS and UEFI systems.
id: Image Fedora adalah `ISO Hibrida` dan dapat digunakan untuk membuat media instalasi dengan disk optik dan USB, untuk boot pada sistem BIOS dan UEFI.

source: Fedora Media Writer
id: Penulis Media Fedora

source: [application]*Fedora Media Writer* has been significantly improved and is now the official, tested and supported way to make bootable media. [application]*Fedora Media Writer* supports Linux, Mac, and Windows. It is an easy way to make bootable USB media to install Fedora (or other operating systems). Using [application]*Fedora Media Writer* is strongly encouraged, although other USB media creation software can work as well.
id: [application]*Fedora Media Writer* telah meningkat secara signifikan dan sekarang menjadi resmi, diuji dan didukung cara untuk membuat media bootable. [application]*Fedora Media Writer* mendukung Linux, Mac, dan Windows. Ini adalah cara mudah untuk membuat media USB bootable untuk menginstal Fedora (atau sistem operasi lain). Menggunakan [application]*Fedora Media Writer* sangat dianjurkan, meskipun perangkat lunak pembuatan media USB lainnya dapat bekerja dengan baik.

source: Some of the new additions to [application]*Fedora Media Writer* are that Fedora Workstation and Server are easily and quickly accessible from the selection on the main screen. Further choices are available if you select the button below _Custom OS_. This offers a selection of various Fedora Spins, such as XFCE or Mate.
id: Beberapa tambahan baru untuk [application]*Fedora Media Writer* adalah bahwa Fedora Workstation dan Server mudah dan cepat diakses dari pilihan pada layar utama. Pilihan lebih lanjut tersedia jika Anda memilih tombol di bawah ini _OS Ubahan_. Ini menawarkan pilihan berbagai Fedora Spins, seperti XFCE atau Mate.

source: Historically, universal USB creation tools, such as [application]*Unetbootin*, are a popular way to create USB installers from ISOs intended for optical media. They typically create a filesystem on the USB drive by extracting files from the image, and writing [application]*syslinux* bootloader to the device.
id: Secara historis, alat kreasi USB universal, seperti [application]*Unetbootin*, adalah cara yang populer untuk membuat penginstal USB dari ISO yang ditujukan untuk media optik. Mereka biasanya membuat sistem berkas pada drive USB dengan mengekstrak berkas dari image, dan menulis bootloader [application]*syslinux* ke perangkat.

source: These methods circumvent the boot-loader configuration built into Fedora images, which are pre-partitioned and designed to boot on UEFI systems with SecureBoot enabled as well as BIOS systems, and thus they do not produce consistent results with Fedora images, especially on UEFI systems.
id: Metode ini memotong konfigurasi boot-loader yang dibangun ke dalam gambar Fedora, yang terprapartisi dan dirancang untuk boot pada sistem UEFI dengan SecureBoot yang diaktifkan serta sistem BIOS, dan dengan demikian mereka tidak memproduksi hasil yang konsisten dengan image Fedora, terutama pada sistem UEFI.

source: The best results are produced by utilities that use a direct write method and do not modify the Fedora image.
id: Hasil terbaik dihasilkan oleh utilitas yang menggunakan metode menulis langsung dan tidak memodifikasi image Fedora.

source: Always think twice before writing an image to the device. The media creation methods described in this article are destructive. All data on the USB stick are deleted during the process, so make sure you have a back up of the data on the USB stick. Double check that you have selected correct device to write the image to!
id: Selalu berpikir dua kali sebelum menulis image ke perangkat. Metode pembuatan media yang dijelaskan dalam artikel ini bersifat destruktif. Semua data pada USB stick akan dihapus selama proses, jadi pastikan Anda memiliki cadangan data pada USB stick. Periksa bahwa Anda telah memilih perangkat yang benar tempat menulis image!

source: Installing and running Fedora Media Writer
id: Menginstal dan menjalankan Fedora Media Writer

source: On Fedora
id: Pada Fedora

source: On Fedora 25 or later, [application]*Fedora Media Writer* is available in the default repository. You can use `dnf` to install the package.
id: Di Fedora 25 atau yang lebih baru, [application]*Fedora Media Writer* tersedia dalam repositori default. Anda dapat menggunakan `dnf` untuk menginstal paket.

source: To install the [application]*Fedora Media Writer* using:
id: Untuk menginstal [application]*Fedora Media Writer* menggunakan:

source: Run the [application]*Fedora Media Writer*:
id: Jalankan [application]*Fedora Media Writer*:

source: or in [application]*Gnome 3* select *Activities,* then select *Utilities*, and then click on [application]*Fedora Media Writer*.
id: atau dalam [application]*Gnome 3* pilih *Aktivitas,* kemudian pilih *Utilitas*, dan kemudian klik pada [application]*Fedora Media Writer*.

source: On other Linux distributions
id: Pada distribusi Linux lainnya

source: The best way to install [application]*Fedora Media Writer* on various Linux distributions is to use the pre-built _Flatpak_ package. The package can be obtained from the official Flatpak repository https://flathub.org/apps/details/org.fedoraproject.MediaWriter[Flathub.org].
id: Cara terbaik untuk menginstal [application]*Fedora Media Writer* pada berbagai distribusi Linux adalah dengan menggunakan paket pre-built _Flatpak_. Paket ini dapat diperoleh dari repositori resmi Flatpak https://flathub.org/apps/details/org.fedoraproject.MediaWriter[Flathub.org].

source: To setup *Flatpak* on your Linux system, follow the guidelines on the https://flatpak.org/setup/[Flatpak documentation] page.
id: Untuk menyiapkan *Flatpak* pada sistem Linux Anda, ikuti panduan tentang halaman https://flatpak.org/setup/[Dokumentasi Flatpak].

source: Run the application:
id: Jalankan aplikasi:

source: On Windows
id: Pada Windows

source: Download the latest Windows Installer file from link:++https://getfedora.org++[GetFedora.org]. The server automatically detects the running system and offers you the correct installation file for your Windows version.
id: Unduh berkas Penginstal Windows terbaru dari link:++https://getfedora.org++[GetFedora.org]. Server secara otomatis mendeteksi sistem yang berjalan dan menawarkan Anda berkas instalasi yang benar untuk versi Windows Anda.

source: Run the installation by double clicking the installer, and then continue through the set-up wizard. The Wizard lets you customize the software's installation if you choose to.
id: Jalankan instalasi dengan mengklik ganda penginstal, dan kemudian lanjutkan melalui wisaya set-up. Wisaya memungkinkan Anda menyesuaikan instalasi perangkat lunak jika Anda memilih untuk itu.

source: Run the application by clicking on a launcher.
id: Jalankan aplikasi dengan mengklik pada peluncur.

source: In Windows 8 and 10, the [application]*Fedora Media Writer* launcher will be placed in the _All apps_ menu under _F_. In Windows 10, you can just type [application]*Fedora Media Writer* in the search box on the task bar.
id: Pada Windows 8 dan 10, peluncur [application]*Fedora Media Writer* akan ditempatkan di menu _Semua app_ di bawah _F_. Di Windows 10, Anda dapat sekadar mengetikkan [application]*Fedora Media Writer* pada kotak pencarian pada bilah tugas.

source: On MacOS
id: Pada MacOS

source: Download the latest Macintosh Disk Image (the package will have a .dmg extension) from link:++https://getfedora.org++[GetFedora.org]. The server automatically detects the running system and offers a correct package for your MacOS.
id: Unduh Image Disk Macintosh terbaru (paket akan memiliki ekstensi .dmg) dari link:++https://getfedora.org++[GetFedora.org]. Server secara otomatis mendeteksi sistem yang berjalan dan menawarkan paket yang benar untuk MacOS Anda.

source: Open the `.dmg` file and copy the `mediawriter` file into your applications folder.
id: Buka berkas `.dmg` dan salin berkas `mediawriter` ke folder aplikasi Anda.

source: Navigate to your applications directory, and then launch the [application]*Fedora Media Writer* application.
id: Arahkan ke direktori aplikasi Anda, dan kemudian luncurkan aplikasi [application]*Fedora Media Writer*.

source: Select "Open" to run the program, when MacOS will ask you to confirm the action.
id: Pilih "Buka" untuk menjalankan program, ketika MacOS akan meminta Anda untuk mengkonfirmasi tindakan.

source: Writing the ISO image to the USB Media.
id: Menulis image ISO ke Media USB.

source: Select the Fedora Edition you wish to make a bootable USB drive for.
id: Pilih Fedora Edition yang Anda ingin buat bootable USB drive-nya.

source: Fedora Media Writer Main Screen: Choose your Edition of Fedora
id: Layar Utama Fedora Media Writer: Pilih Edisi Fedora Anda

source: Image of Fedora Media Writer Main Screen
id: Gambar Layar Utama Fedora Media Writer

source: The main selection lets you choose one of the default Fedora editions, Fedora *Workstation* or *Server*. [application]*Fedora Media Writer* displays more details about the edition before you can proceed with downloading the image and the USB creation. You can choose a different architecture, if you select _Other variants_.
id: Pilihan utama memungkinkan Anda memilih salah satu dari edisi Fedora default, Fedora *Workstation* atau *Server*. [application]*Fedora Media Writer* menampilkan rincian lebih lanjut tentang edisi sebelum Anda dapat melanjutkan mengunduh image dan penciptaan USB. Anda dapat memilih arsitektur yang berbeda, jika Anda memilih _Varian lain_.

source: Select "Create Live USB" to proceed.
id: Pilih "Buat Live USB" untuk melanjutkan.

source: Fedora Media Writer Distro Information
id: Informasi Distro Fedora Media Writer

source: Image of Fedora Media Writer Distro Information Screen
id: Gambar Layar Informasi Distro Fedora Media Writer

source: Fedora Media Writer will automatically download the ISO for you. If you have downloaded the ISO before and placed it in the _Downloads_ directory, it will be immediately available to use.
id: Fedora Media Writer akan secara otomatis mengunduh ISO untuk Anda. Jika Anda telah mengunduh ISO sebelumnya dan meletakkannya di direktori _Downloads_, maka akan seketika tersedia untuk digunakan.

source: Fedora Media Writer Automatic Download
id: Unduh Otomatis Fedora Media Writer

source: Image of Fedora Media Writer Automatic Download
id: Gambar Unduh Otomatis Fedora Media Writer

source: Plug in a USB drive on which you want to create the bootable media.
id: Tancapkan drive USB yang Anda inginkan untuk membuat media bootable.

source: To write the image onto the media, click the red btn:[Write to disk] button.
id: Untuk menulis image ke media, klik tombol merah btn:[Tulis ke disk].

source: Fedora Media Writer Write to USB Device
id: Fedora Media Writer Menulis ke Perangkat USB

source: Image of Fedora Media Writer write to device red button
id: Gambar Fedora Media Writer menulis ke perangkat tombol merah

source: Other methods to create a live USB
id: Metode lain untuk membuat live USB

source: Using the *Fedora Media Writer* is highly recommended for everybody, because it offers a reliable way to create a live USB stick for Fedora installation.
id: Menggunakan *Fedora Media Writer* sangat direkomendasikan untuk semua orang, karena menawarkan cara yang andal untuk membuat stik USB live untuk instalasi Fedora.

source: However, some experienced users may prefer to go through the creation process manually. If you decide to do so, you have to download the installation images and use an application to write them onto the USB stick.
id: Namun, beberapa pengguna yang berpengalaman mungkin lebih memilih untuk pergi melalui proses pembuatan secara manual. Jika Anda memutuskan untuk melakukannya, Anda harus menunduh image instalasi dan menggunakan aplikasi untuk menulis mereka ke USB stick.

source: If you have downloaded and verified the installation images manually, you still can write them onto the USB stick using *Fedora Media Writer*.
id: Jika Anda telah mengunduh dan memverifikasi image instalasi secara manual, Anda masih dapat menulis mereka ke USB stick menggunakan *Fedora Media Writer*.

source: Downloading Boot and Installation Images
id: Mengunduh Image Boot dan Instalasi

source: The Fedora Project offers different Editions tailored for some specific use cases. Choose the Fedora Edition best for you, or you can build your own by customizing after the installation, or by using a kickstart file as described in xref:advanced/Kickstart_Installations.adoc#sect-kickstart-file-create[Creating a Kickstart File]. Kickstart installation requires the `netinstall` media type, or a direct installation booting method such as PXE; kickstarts are not supported with live images.
id: Proyek Fedora menawarkan edisi yang berbeda disesuaikan untuk beberapa kasus penggunaan tertentu. Pilih edisi Fedora terbaik untuk Anda, atau Anda dapat membuat sendiri dengan menyesuaikan setelah instalasi, atau dengan menggunakan berkas Kickstart seperti yang dijelaskan dalam xref:advanced/Kickstart_Installations.adoc#sect-kickstart-file-create[Membuat Berkas Kickstart]. Instalasi Kickstart memerlukan jenis media `netinstall`, atau metode booting instalasi langsung seperti PXE; kickstarts tidak didukung dengan image live.

source: Read more about Fedora Workstation, Fedora Cloud, Fedora Server and the available media types in xref:Downloading_Fedora.adoc#chap-downloading-fedora[Downloading Fedora].
id: Baca lebih lanjut tentang Fedora Workstation, Fedora Cloud, Fedora Server, dan tipe-tipe media yang tersedia di xref:Downloading_Fedora.adoc#chap-downloading-fedora[Mengunduh Fedora].

source: You can also choose a Fedora _Spin_ featuring favorite alternative desktops or tools for specialized tasks at link:++https://spins.fedoraproject.org++[].
id: Anda juga dapat memilih Fedora _Spin_ yang menampilkan desktop alternatif favorit atau alat untuk tugas khusus di link:++https://spins.fedoraproject.org++[].

source: Verifying the Downloaded Image
id: Memverifikasi Image yang Diunduh

source: Because transmission errors or other problems may corrupt the Fedora image you have downloaded, it is important to verify the file's integrity. After the images are created, an operation is performed on the file that produces a value called a `checksum` using a complex mathematical algorithm. The operation is sufficiently complex that *any change* to the original file will produce a different checksum.
id: Karena kesalahan transmisi atau masalah lain mungkin merusak image Fedora yang telah Anda unduh, penting untuk memverifikasi integritas berkas. Setelah image dibuat, operasi dilakukan pada image yang menghasilkan nilai yang disebut `checksum` menggunakan algoritma matematika yang kompleks. Operasi ini cukup kompleks sehingga *sebarang perubahan* pada berkas asli akan menghasilkan checksum yang berbeda.

source: By calculating the image's `checksum` on your own computer and comparing it to the original `checksum`, you can verify the image has not been tampered with or corrupted. The original checksum values are provided at link:++https://getfedora.org/security/++[], and are [command]#gpg# signed to demonstrate their integrity.
id: Dengan menghitung `checksum` image pada komputer Anda sendiri dan membandingkannya dengan `checksum` asli, Anda dapat memverifikasi image belum diubah atau rusak. Nilai checksum asli disediakan di link:++https://getfedora.org/security/++[], dan ditandatangani [command]#gpg# untuk menunjukkan integritasnya.

source: Verifying checksums on Windows systems
id: Memverifikasi checksum pada sistem Windows

source: Download the Fedora image of your choice from link:++https://fedoraproject.org/get-fedora++[] and the corresponding checksum file from link:++https://getfedora.org/security/++[]
id: Unduh image Fedora pilihan Anda dari link:++https://fedoraproject.org/get-fedora++[] dan berkas checksum yang sesuai dari link:++https://getfedora.org/security/++[]

source: Open a [command]#powershell# session.
id: Buka sesi [command]#powershell#.

source: Change to the directory containing the downloaded files.
id: Pindah ke direktori yang berisi berkas yang diunduh.

source: Directory: C:\Users\Pete\Downloads
id: Direktori: C:\Users\Pete\Downloads

source: Load the resources required to calculate the checksum.
id: Muat sumber daya yang diperlukan untuk menghitung checksum.

source: Calculate the downloaded image's checksum. This will take a while!
id: Hitung checksum image yang diunduh. Ini akan memakan waktu lama!

source: Compare the calculated checksum to the expected checksum.
id: Bandingkan checksum yang dihitung ke checksum yang diharapkan.

source: > echo "Download Checksum: $download_checksum" > echo "Expected Checksum: $expected_checksum" > if ( $download_checksum -eq "$expected_checksum" ) { echo "Checksum test passed!" } else { echo "Checksum test failed." }
id: > echo "Checksum Unduhan: $download_checksum" > echo "Checksum Harapan: $expected_checksum" > if ( $download_checksum -eq "$expected_checksum" ) { echo "Uji checksum lolos!" } else { echo "Uji checksum gagal." }

source: Verifying checksums on Linux and OSX systems
id: Memverifikasi checksum pada sistem Linux dan OSX

source: Open a terminal window, and navigate to the directory with the downloaded files.
id: Buka jendela terminal, dan navigasikan ke direktori dengan berkas yang diunduh.

source: Use the appropriate utility to verify the image checksum.
id: Gunakan utilitas yang sesuai untuk memverifikasi checksum image.

source: For Linux:
id: Untuk Linux:

source: For OSX:
id: Untuk OSX:

source: Writing the images to USB media
id: Menulis image ke media USB

source: Creating USB media with [application]*GNOME Disks*
id: Membuat media USB dengan [application]*GNOME Disks*

source: On a system with [application]*GNOME*, or with the [package]*gnome-disk-utility* package installed, open `Disks` using the system menu.
id: Pada sistem dengan [application]*GNOME*, atau dengan paket [package]*gnome-disk-utility* terinstal, buka `Disks` menggunakan menu sistem.

source: Click your USB device in the left column.
id: Klik perangkat USB Anda di kolom sebelah kiri.

source: Click the menu icon in the upper right corner of the window, and choose the `Restore Disk Image` option.
id: Klik ikon menu di sudut kanan atas jendela, dan pilih opsi `Pulihkan Image Diska`.

source: Navigate to your image file and click `Start Restoring`. After a few minutes, it will report the process is complete and your installation media will be ready to use.
id: Arahkan ke berkas image Anda dan klik `Mulai Memulihkan`. Setelah beberapa menit, itu akan melaporkan proses selesai dan media instalasi Anda akan siap untuk digunakan.

source: Creating USB Media on the Linux command line
id: Membuat USB media pada baris perintah Linux

source: Open a terminal window and insert the usb drive.
id: Buka jendela terminal dan masukkan drive USB.

source: Find the `device node` assigned to the drive. In the example below, the drive is given `sdd`.
id: Temukan `node perangkat` yang ditetapkan ke drive. Dalam contoh di bawah ini, drive diberikan `sdd`.

source: Use the [command]#dd# utility to write the image.
id: Gunakan utilitas [command]#dd# untuk menulis image.

source: Pay extreme attention to the source (`if=`) and target (`of=`) device. The `dd` command destroys all data on the target device. If you made a mistake, you could lose important data.
id: Perhatikan dengan sangat cermat ke sumber (`if=`) dan target (`of=`) perangkat. Perintah `dd` menghancurkan semua data pada perangkat target. Jika Anda membuat kesalahan, Anda bisa kehilangan data penting.

source: Creating a Boot CD or DVD
id: Membuat CD atau DVD Boot
