Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f31/pages/install/Preparing_for_Installation.po
Languages: id

source: In addition to creating a bootable USB flash drive, you can also use the provided ISO images to create bootable optical media (a CD or DVD). This approach may be necessary when installing {PRODUCT} on an older system which can not boot from USB.
id: Selain membuat bootable USB flash drive, Anda juga dapat menggunakan image ISO yang disediakan untuk membuat media optik bootable (CD atau DVD). Pendekatan ini mungkin diperlukan ketika menginstal {PRODUCT} pada sistem yang lebih tua yang tidak dapat boot dari USB.

source: The exact steps you need to take to burn a bootable CD or DVD from an ISO image will vary depending on what disc burning software you use. This procedure only offers a general overview.
id: Langkah yang tepat yang perlu Anda ambil untuk membakar CD atau DVD bootable dari image ISO akan bervariasi tergantung pada apa perangkat lunak pembakaran disk yang Anda gunakan. Prosedur ini hanya menawarkan gambaran umum.

source: Insert a blank CD or DVD into your system's CD or DVD burner.
id: Masukkan CD atau DVD kosong ke pembakar CD atau DVD sistem Anda.

source: Open your system's burning software - for example, [application]*Brasero* on {PRODUCT} systems with [application]*GNOME* desktop environment, or [application]*Nero* on Windows systems. In the software's main menu, find an option which lets you burn an ISO image to a disc. For example, in [application]*Brasero*, this option is `Burn image` in the main menu on the left side of the window.
id: Buka perangkat lunak pembakaran sistem Anda - misalnya, [application]*Brasero* pada sistem {PRODUCT} dengan lingkungan desktop [application]*GNOME*, atau [application]*Nero* pada sistem Windows. Dalam menu utama perangkat lunak, temukan opsi yang memungkinkan Anda membakar image ISO ke disk. Misalnya, dalam [application]*Brasero*, pilihan ini adalah `Bakar image` di menu utama pada sisi kiri jendela.

source: When prompted, select the ISO image of {PRODUCT} to be burned, and the CD or DVD burner with a blank disc inside (if you have more than one drive).
id: Ketika diminta, pilih ISO image dari {PRODUCT} untuk dibakar, dan pembakar CD atau DVD dengan disk kosong di dalamnya (jika Anda memiliki lebih dari satu drive).

source: Confirm your selection, and wait for the disc to be burned.
id: Konfirmasikan pilihan Anda, dan tunggu hingga disk dibakar.
