Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f31/pages/Revision_History.po
Languages: es

source: Revision History
es: Historial de Revisión

source: Note that revision numbers relate to the edition of this manual, not to version numbers of Fedora.
es: Fijese que los números de revisión están relacionados con la edición de este manual, no con los números de versión de Fedora.

source: Tue Oct 30 2018, Petr Bokoč (pbokoc@redhat.com)
es: Martes 30 de Octubre de 2018, Petr Bokoč (pbokoc@redhat.com)

source: Fedora 29 Final release
es: Version Final de Fedora 29

source: All external links are now converted to HTTPS where applicable (link:++https://pagure.io/fedora-docs/install-guide/issue/3++[issue 3])
es: Todos los enlaces externos se convierten ahora a HTTPS donde es aplicable (link:++https://pagure.io/fedora-docs/system-administrators-guide/issue/3++[issue 3])

source: Removed a mention of a no longer available rescue image (link:++https://pagure.io/fedora-docs/install-guide/issue/4++[issue 4])
es: Borrada una mencion de una imagen de rescate ya no disponible (link:++https://pagure.io/fedora-docs/install-guide/issue/4++[issue 4])

source: New Kickstart commands and options: `url`, `network --bindto=`, and LUKS-related options for `autopart`, `part`, `logvol`, and `raid`.
es: Nuevos comandos y opciones Kickstart: `url`, `network --bindto=` y opciones relacionadas con LUKS para `autopart`, `part`, `logvol` y `raid`.

source: The `authconfig` Kickstart command is now deprecated and replaced by `authselect` (link:++https://pagure.io/fedora-docs/install-guide/issue/6++[issue 6])
es: El comando `authconfig` de Kickstart esta obsoleto y ha sido reemplazado por `authselect` (link:++https://pagure.io/fedora-docs/install-guide/issue/6++[issue 6])

source: New boot options: `inst.stag2.all=`, `inst.ks.all=`, `inst.xtimeout=`, `inst.decorated=`
es: Nuevas opciones de arranque: `inst.stag2.all=`, `inst.ks.all=`, `inst.xtimeout=`, `inst.decorated=`

source: Updated the Fedora Media Writer chapter (link:++https://pagure.io/fedora-docs/install-guide/issue/7++[issue 7])
es: Actualizado el capitulo de Fedora Media Writer (link:++https://pagure.io/fedora-docs/install-guide/issue/7++[issue 7])

source: Updated image verification instructions for Mac (link:++https://pagure.io/fedora-docs/install-guide/issue/15++[issue 15])
es: Actualizadas las instrucciones de verificación de imagen para Mac (link:++https://pagure.io/fedora-docs/install-guide/issue/15++[issue 15])

source: Various fixes related to the new publishing system
es: Diversas correcciones relacionadas con el nuevo sistema de publicación

source: Mon Jun 20 2016, Clayton Spicer (cspicer@redhat.com)
es: Lunes, 20 de Junio de 2019, Clayton Spicer (cspicer@redhat.com)

source: Fedora 24 Final release
es: Versión Final de Fedora 24

source: Added boot option [option]#inst.nosave=#
es: Añadida opcion de arranque [option]#inst.nosave=#

source: Typo fixes
es: Correcciones de errata

source: Mon Nov 02 2015, Petr Bokoč (pbokoc@redhat.com)
es: Lun 02 de Nov de 2015, Petr Bokoč (pbokoc@redhat.com)

source: Fedora 23 Final release
es: Versión Final de Fedora 23

source: Kickstart commands and boot options updated for F23
es: Comandos y opciones de arranque de Kickstart actualizadas para Fedora 23

source: Many typo fixes
es: Muchas correcciones de errata

source: Mon May 25 2015, Petr Bokoč (pbokoc@redhat.cogm)
es: Lun 25 de May de 2015, Petr Bokoč (pbokoc@redhat.com)

source: Fedora 22 Final release
es: Versión Final de Fedora 22

source: References to [application]*Yum* replaced with [application]*DNF* (the new default package manager)
es: Las referencias a [application]*Yum* han sido reemplazadas con referencias a [application]*DNF* (el nuevo administrador de paquetes por defecto)

source: Updates in boot options: [option]#inst.dnf# replaced with [option]#inst.nodnf#, added [option]#inst.kdump_addon=#
es: Actualizaciones en opciones de arranque: [option]#inst.dnf# reemplazado con [option]#inst.nodnf#, añadido [option]#inst.kdump_addon=#

source: Updates in Kickstart: [command]#%anaconda#, [command]#%addon#, [command]#sshkey#, [command]#pwpolicy#
es: Actualizaciones en Kickstart: [command]#%anaconda#, [command]#%addon#, [command]#sshkey#, [command]#pwpolicy#

source: Added the `Kdump` screen to the GUI docs
es: Añadida la ventana `Kdump` a la documentación GUI

source: Sun Dec 21 2014, Zach Oglesby (zach@oglesby.co)
es: Domingo, 21 de Diciembre de 2014, Zach Oglesby (zach@oglesby.co)

source: Fixed Windows checksum steps, BZ#1175759
es: Corregidos los pasos a seguir para comprobar el checksum en Windows, BZ#1175759

source: Mon Dec 15 2014, Petr Bokoč (pbokoc@redhat.com)
es: Lun 15 de Dic de 2014, Petr Bokoč (pbokoc@redhat.com)

source: Fixes in Boot Options: inst.headless is deprecated, inst.askmethod moved from removed to Installation Source
es: Correcciones a las Opciones de Arranque: inst.headless esta obsoleto, inst.askmethod movido de eliminados a Fuente de Instalacion

source: Parts of the network boot setup chapter have been updated with correct URLs
es: Partes del capitulo sobre Arranque por red han sido actualizados con las URLs correctas

source: Updates in Recommended Partitioning Scheme and Advice on Partitions in the Manual Partitioning section of the installation chapter
es: Actualizaciones en Esquema de Particiones Recomendado y Consejos sobre Particiones en la sección de Partición Manual del capitulo de instalación

source: Mon Dec 8 2014, Petr Bokoč (pbokoc@redhat.com)
es: Lun 8 de Dic de 2014, Petr Bokoč (pbokoc@redhat.com)

source: Publishing for Fedora 21
es: Publicando para Fedora 21

source: Mon Dec 8 2014, Pete Travis (immanetize@fedoraproject.org)
es: Lunes, 8 de Diciembre de 2014, Pete Travis (immanetize@fedoraproject.org)

source: added info on media types
es: añadida información sobre tipos de medios

source: Tue Dec 17 2013, Petr Bokoč (pbokoc@redhat.com)
es: Martes, 17 de Diciembre de 2013, Petr Bokoč (pbokoc@redhat.com)

source: Publishing for Fedora 20
es: Publicando para Fedora 20
