Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/_partials/Legal_Notice.po
Languages: id

source: Copyright {YEAR} {HOLDER}.
id: Hak cipta {YEAR} {HOLDER}.

source: The text of and illustrations in this document are licensed by Red Hat under a Creative Commons Attribution–Share Alike 3.0 Unported license ("CC-BY-SA"). An explanation of CC-BY-SA is available at link:++https://creativecommons.org/licenses/by-sa/3.0/++[]. The original authors of this document, and Red Hat, designate the Fedora Project as the "Attribution Party" for purposes of CC-BY-SA. In accordance with CC-BY-SA, if you distribute this document or an adaptation of it, you must provide the URL for the original version.
id: Teks dan ilustrasi dalam dokumen ini dilisensikan oleh Red Hat di bawah lisensi Creative Commons Attribution – Share Alike 3.0 Unported ("CC-BY-SA"). Penjelasan tentang CC-BY-SA tersedia di link:++https://creativecommons.org/licenses/by-sa/3.0/++[]. Penulis asli dokumen ini, dan Red Hat, menunjuk Proyek Fedora sebagai "Pihak Atribusi" untuk tujuan CC-BY-SA. Sesuai dengan CC-BY-SA, jika Anda mendistribusikan dokumen ini atau mengadaptasinya, Anda harus memberikan URL untuk versi aslinya.

source: Red Hat, as the licensor of this document, waives the right to enforce, and agrees not to assert, Section 4d of CC-BY-SA to the fullest extent permitted by applicable law.
id: Red Hat, sebagai pemegang lisensi dokumen ini, melepaskan hak untuk menegakkan, dan setuju untuk tidak menyatakan, Bagian 4d dari CC-BY-SA sejauh yang diizinkan oleh hukum yang berlaku.

source: Red Hat, Red Hat Enterprise Linux, the Shadowman logo, JBoss, MetaMatrix, Fedora, the Infinity Logo, and RHCE are trademarks of Red Hat, Inc., registered in the United States and other countries.
id: Red Hat, Red Hat Enterprise Linux, logo Shadowman, JBoss, MetaMatrix, Fedora, Logo Infinity, dan RHCE adalah merek dagang dari Red Hat, Inc., yang terdaftar di Amerika Serikat dan negara lain.

source: For guidelines on the permitted uses of the Fedora trademarks, refer to link:++https://fedoraproject.org/wiki/Legal:Trademark_guidelines++[].
id: Untuk pedoman tentang penggunaan yang diizinkan dari merek dagang Fedora, lihat link:++https://fedoraproject.org/wiki/Legal:Trademark_guidelines++[].

source: *Linux* (R) is the registered trademark of Linus Torvalds in the United States and other countries.
id: *Linux* (R) adalah merek dagang terdaftar dari Linus Torvalds di Amerika Serikat dan negara lain.

source: *Java* (R) is a registered trademark of Oracle and/or its affiliates.
id: *Java* (R) adalah merek dagang terdaftar dari Oracle dan/atau afiliasinya.

source: *XFS* (R) is a trademark of Silicon Graphics International Corp. or its subsidiaries in the United States and/or other countries.
id: *XFS* (R) adalah merek dagang dari Silicon Graphics International Corp. atau anak perusahaannya di Amerika Serikat dan/atau negara lain.

source: *MySQL* (R) is a registered trademark of MySQL AB in the United States, the European Union and other countries.
id: *MySQL* (R) adalah merek dagang terdaftar dari MySQL AB di Amerika Serikat, Uni Eropa, dan negara-negara lain.

source: All other trademarks are the property of their respective owners.
id: Semua merek dagang lain adalah properti dari pemiliknya masing-masing.
