Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/advanced/Kickstart_Installations.po
Languages: tr

source: Automating the Installation with Kickstart
tr: Kickstart ile Kurulumu Otomatikleştirme

source: Kickstart installations offer a means to automate the installation process, either partially or fully. Kickstart files contain answers to all questions normally asked by the installation program, such as what time zone do you want the system to use, how should the drives be partitioned or which packages should be installed. Providing a prepared Kickstart file when the installation begins therefore allows the you to perform the installation automatically, without need for any intervention from the user. This is especially useful when deploying {PRODUCT} on a large number of systems at once.
tr: Kickstart kurulumları, kurulum sürecini kısmen veya tamamen otomatikleştirmenin bir yolunu sunar. Kickstart dosyaları, sistemin hangi saat dilimini kullanmasını istediğiniz, disklerin nasıl bölümlendirilmesi veya hangi paketlerin kurulması gerektiği gibi normalde kurulum programı tarafından sorulan tüm soruların yanıtlarını içerir. Bu nedenle kurulum başladığında hazır bir Kickstart dosyası sağlamak, kullanıcının herhangi bir müdahalesine gerek kalmadan kurulumu otomatik olarak gerçekleştirmenizi sağlar. Bu, özellikle {PRODUCT}'yı aynı anda çok sayıda sisteme kurarken faydalıdır.

source: All Kickstart scripts and the log files of their execution are stored in the `/tmp` directory to assist with debugging installation issues.
tr: Tüm Kickstart betikleri ve bunların çalıştırılmasıyla ilgili günlük kaydı dosyaları, kurulum sorunlarının giderilmesine yardımcı olması için `/tmp` dizininde depolanır.

source: How to Perform a Kickstart Installation
tr: Kickstart Kurulumu Nasıl Gerçekleştirilir

source: Kickstart installations can be performed using a local DVD, a local hard drive, or via NFS, FTP, HTTP, or HTTPS.
tr: Kickstart kurulumları yerel bir DVD, yerel bir sabit disk veya NFS, FTP, HTTP veya HTTPS aracılığıyla gerçekleştirilebilir.

source: To use Kickstart, you must:
tr: Kickstart kullanmak için şunları yapmalısınız:

source: Create a Kickstart file.
tr: Bir Kickstart dosyası oluşturun.

source: Create boot media or configure a network boot (PXE) server which will be used to begin the installation.
tr: Önyükleme ortamı oluşturun veya kurulumu başlatmak için kullanılacak bir ağ önyükleme (PXE) sunucusu yapılandırın.

source: Make the Kickstart file available on removable media, a hard drive, or a network location.
tr: Kickstart dosyasını çıkarılabilir ortamda, bir sabit diskte veya ağ konumunda kullanılabilir duruma getirin.

source: Start the Kickstart installation by booting the installer and using a boot option to tell the installer where to find the Kickstart file.
tr: Kurucuyu önyükleyerek ve ona Kickstart dosyasını nerede bulacağını söylemek için bir önyükleme seçeneği kullanarak Kickstart kurulumunu başlatın.

source: This chapter explains these steps in detail.
tr: Bu bölümde bu adımlar ayrıntılı olarak açıklanmaktadır.

source: Creating a Kickstart File
tr: Kickstart Dosyası Oluşturma

source: The Kickstart file itself is a plain text file, containing keywords listed in xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference], which serve as directions for the installation. Any text editor able to save files as ASCII text (such as [application]*Gedit* or [application]*vim* on Linux systems or [application]*Notepad* on Windows systems) can be used to create and edit Kickstart files.
tr: Kickstart dosyasının kendisi, xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Söz Dizimi Referansı] bölümünde listelenen ve kurulum için yönlendirme görevi gören anahtar kelimeleri içeren bir düz metin dosyasıdır. Dosyaları ASCII metni olarak kaydedebilen herhangi bir metin düzenleyicisi (Linux sistemlerinde [application]*Gedit* veya [application]*vim* ya da Windows sistemlerinde [application]*Notepad* gibi) Kickstart dosyalarını oluşturmak ve düzenlemek için kullanılabilir.

source: The recommended approach to creating Kickstart files is to perform a manual installation on one system first. After the installation completes, all choices made during the installation are saved into a file named `anaconda-ks.cfg`, located in the `/root/` directory on the installed system. You can then copy this file, make any changes you need, and use the resulting configuration file in further installations.
tr: Kickstart dosyaları oluşturmak için tavsiye edilen yaklaşım, önce bir tane sistemde elle kurulum yapmaktır. Kurulum tamamlandıktan sonra kurulum sırasında yapılan tüm seçimler kurulu sistem üzerinde `/root/` dizininde bulunan `anaconda-ks.cfg` adında bir dosyaya kaydedilir. Daha sonra bu dosyayı kopyalayabilir, ihtiyacınız olan değişiklikleri yapabilir ve ortaya çıkan yapılandırma dosyasını sonraki kurulumlarda kullanabilirsiniz.

source: When creating a Kickstart file, keep in mind the following:
tr: Bir Kickstart dosyası oluştururken şunları aklınızda bulundurun:

source: Lines starting with a pound sign (`#`) are treated as comments and are ignored.
tr: `#` işaretiyle başlayan satırlar yorum olarak kabul edilir ve yok sayılır.

source: Sections must be specified *in order*. Items within the sections do not have to be in a specific order unless otherwise specified. The correct section order is:
tr: Bölümler *sırayla* belirtilmelidir. Bölümlerdeki ögelerin aksi belirtilmedikçe belirli bir sırada olması gerekmez. Doğru bölüm sırası şu şekildedir:

source: The command section which contains actual Kickstart commands and options as listed in xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference]. Note that some commands, such as [command]#install#, are mandatory, but most commands are optional.
tr: xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Söz Dizimi Referansı] bölümünde listelenen gerçek Kickstart komutlarını ve seçeneklerini içeren komut bölümü. [command]#install# gibi bazı komutların zorunlu olduğunu, ancak çoğu komutun isteğe bağlı olduğunu unutmayın.

source: The [command]#%packages# section which contains a list of packages and package groups to be installed. See xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-packages[%packages (required) - Package Selection] for details.
tr: Kurulacak paketlerin ve paket gruplarının listesini içeren [command]#%packages# bölümü. Ayrıntılar için xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-packages[%packages (gerekli) - Paket Seçimi] bölümüne bakın.

source: The [command]#%pre# and [command]#%post# sections, containing a pre-installation and post-installation scripts. These two sections can be in any order and are not mandatory. See xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-preinstall[%pre (optional) - Pre-installation Script] and xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-postinstall[%post (optional) - Post-installation Script] for details.
tr: Kurulum öncesi ve kurulum sonrası betiklerini içeren [command]#%pre# ve [command]#%post# bölümleri. Bu iki bölüm herhangi bir sırada olabilir ve zorunlu değildir. Ayrıntılar için xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-preinstall[%pre (isteğe bağlı) - Kurulum Öncesi Betiği] ve xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-postinstall[%post (isteğe bağlı) - Kurulum Sonrası Betiği] bölümlerine bakın.

source: The [command]#%packages#, [command]#%pre# and [command]#%post# sections must end with [command]#%end#, otherwise the installation program will refuse the Kickstart file. The main command section has no special ending statement.
tr: [command]#%packages#, [command]#%pre# and [command]#%post# bölümleri [command]#%end# ile bitmelidir, aksi takdirde kurulum programı Kickstart dosyasını reddedecektir. Ana komut bölümünün özel bir bitiş ifadesi yoktur.

source: Omitting any required item results in the installation program prompting the user for an answer to the related item, just as the user would be prompted during a typical installation. Once the answer is given, the installation will continue. Note that if the system you are installing has no display, you will not be able to see the prompt, and the installation will appear to have failed.
tr: Gerekli herhangi bir ögenin atlanması durumunda, tıpkı normal bir kurulum sırasında kullanıcıdan isteneceği gibi, kurulum programında kullanıcıdan ilgili ögeye yanıt vermesi istenir. Yanıt verildikten sonra kurulum devam edecektir. Kurmakta olduğunuz sistemin ekranı yoksa, isteği göremeyeceğinizi ve kurulumun başarısız görüneceğini unutmayın.

source: Verifying the Kickstart File
tr: Kickstart Dosyasını Doğrulama

source: When creating or customizing your kickstart file, it is useful to verify that it is valid before attempting to use it in an installation. {PRODUCT} includes the [application]*ksvalidator* command line utility which can be used to do this. This tool is a part of the [package]*pykickstart* package. To install this package, execute the following command:
tr: Kickstart dosyanızı oluştururken veya özelleştirirken, onu bir kurulumda kullanmaya çalışmadan önce geçerli olduğunu doğrulamanız faydalı olacaktır. {PRODUCT}, bunu yapmak için kullanılabilecek [application]*ksvalidator* komut satırı yardımcı programını içermektedir. Bu araç, [package]*pykickstart* paketinin bir parçasıdır. Bu paketi kurmak için aşağıdaki komutu çalıştırın:

source: After installing the package, you can validate a Kickstart file using the following command:
tr: Paketi kurduktan sonra, aşağıdaki komutu kullanarak bir Kickstart dosyasını doğrulayabilirsiniz:

source: $ [command]#ksvalidator _/path/to/kickstart.ks_#
tr: $ [command]#ksvalidator _/dosya/yolu/kickstart.ks_#

source: Replace _/path/to/kickstart.ks_ with the path to the Kickstart file you want to verify.
tr: _/dosya/yolu/kickstart.ks_ kısmını, doğrulamak istediğiniz Kickstart dosyasının yolu ile değiştirin.

source: For more information about this tool, see the `ksvalidator(1)` man page.
tr: Bu araç hakkında daha fazla bilgi için `ksvalidator(1)` kılavuz sayfasına bakın.

source: Keep in mind that the validation tool has its limitations. The Kickstart file can be very complicated; [application]*ksvalidator* can make sure the syntax is correct and that the file does not include removed options, but it cannot guarantee the installation will be successful. It also does not attempt to validate the [command]#%pre#, [command]#%post# and [command]#%packages# sections of the Kickstart file.
tr: Doğrulama aracının bazı sınırlamaları olduğunu unutmayın. Kickstart dosyası çok karmaşık olabilir; [application]*ksvalidator* söz diziminin doğru olduğundan ve dosyanın kaldırılan seçenekleri içermediğinden emin olabilir, ancak kurulumun başarılı olacağını garanti edemez. Ayrıca Kickstart dosyasının [command]#%pre#, [command]#%post# ve [command]#%packages# bölümlerini doğrulamaya çalışmaz.

source: Making the Kickstart File Available
tr: Kickstart Dosyasını Kullanılabilir Yapma

source: Once you create a Kickstart file, you can place it in one of the following locations:
tr: Bir Kickstart dosyası oluşturduğunuzda, onu aşağıdakilerden birine koyabilirsiniz:

source: On *removable media*, such as a DVD or USB flash drive connected to the installation system
tr: Kurulum sistemine bağlı DVD veya USB flash bellek gibi bir *çıkarılabilir ortam*

source: On a *hard drive* connected to the installation system
tr: Kurulum sistemine bağlı bir *sabit disk*

source: On a *network share* reachable from the installation system
tr: Kurulum sisteminden erişilebilen bir *ağ paylaşım konumu*

source: Normally, a Kickstart file is copied to removable media or a hard drive, or made available on the network. Placing the file in a network location complements the usual approach to Kickstart installations, which is also network-based: the system is booted using a PXE server, the Kickstart file is downloaded from a network share, and software packages specified in the file are downloaded from remote repositories.
tr: Normalde, bir Kickstart dosyası çıkarılabilir ortama veya sabit diske kopyalanır veya ağda kullanılabilir duruma getirilir. Dosyayı bir ağ konumuna yerleştirmek, kendisi de ağ tabanlı olan Kickstart kurulumlarına yönelik olağan yaklaşımı tamamlar: sistem bir PXE sunucusu kullanılarak önyüklenir, Kickstart dosyası bir ağ paylaşım konumundan indirilir ve dosyada belirtilen yazılım paketleri uzak depolardan indirilir.

source: xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Setting Up an Installation Server] offers some additional information about preparing for a network-based installation.
tr: xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Kurulum Sunucusu Ayarlama] bölümü, ağ tabanlı bir kuruluma hazırlanma hakkında bazı ek bilgiler sunmaktadır.

source: Starting the Kickstart Installation
tr: Kickstart Kurulumunu Başlatma

source: Once you have everything ready - you have created a valid Kickstart file and you have either local boot media or a PXE server available, you can start the Kickstart installation. You need to use the [option]#inst.ks=# boot option either in the boot menu (when booting from local media), or add this option to your PXE server configuration. For information about boot options used in Kickstart installations, see xref:advanced/Boot_Options.adoc#sect-boot-options-kickstart[Kickstart Boot Options].
tr: Her şey hazır olduğunda, yani geçerli bir Kickstart dosyası oluşturduysanız ve yerel önyükleme ortamınız veya kullanılabilir bir PXE sunucunuz varsa, Kickstart kurulumunu başlatabilirsiniz. (Yerel ortamdan önyükleme yaparken) önyükleme menüsünde [option]#inst.ks=# önyükleme seçeneğini kullanmanız veya bu seçeneği PXE sunucusu yapılandırmanıza eklemeniz gerekir. Kickstart kurulumlarında kullanılan önyükleme seçenekleri hakkında bilgi için xref:advanced/Boot_Options.adoc#sect-boot-options-kickstart[Kickstart Önyükleme Seçenekleri] bölümüne bakın.
