Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f31/pages/advanced/VNC_Installations.po
Languages: fi

source: Installing Using VNC
fi: Asennus VNC:llä

source: The graphical installation interface is the recommended method of installing {PRODUCT}. However, in some cases, accessing the graphical interface directly is difficult or impossible. Some systems lack the capability to connect a display and a keyboard, making VNC a necessity for manual (non-Kickstart) installations.
fi: Graafinen asennusliittymä on suositeltu tapa asentaa {PRODUCT}. Kuitenkin joissakin tapauksissa pääsy suoraan graafiseen käyttöliittymään on vaikeaa tai mahdotonta. Joistakin järjestelmistä puuttuu kyky yhdistää näyttöä ja näppäimistöä, mikä tekee VNC:stä välttämättömyyden manuaalisissa (ei-Kickstart) -asennuksissa.

source: To allow manual installations on _headless systems_ (systems without a directly connected display, keyboard and mouse), the [application]*Anaconda* installation program includes a _Virtual Network Computing_ (VNC) mode which allows the graphical mode of the installation program to run locally, but display on another system connected to the network. The VNC installation provides you with the full range of installation options.
fi: Manuaalisen asennuksen sallimiseksi _headless-järjestelmissä_ (järjestelmät, joissa ei ole suoraan kytkettyä näyttöä, näppäimistöä ja hiirtä), [application]*Anaconda*-asennusohjelma sisältää _Virtual Network Computing_ (VNC) -tilan, jonka avulla asennusohjelman graafinen tila voidaan suorittaa paikallisesti, mutta näyttää toisessa verkkoon yhdistetyssä järjestelmässä. VNC-asennus tarjoaa täyden valikoiman asennusvaihtoehtoja.

source: This chapter provides instructions on activating VNC mode on the installation system and connecting to it using a VNC viewer.
fi: Tämä luku sisältää ohjeet VNC-tilan aktivointiin asennusjärjestelmässä ja siihen liittymisen VNC-katseluohjelmalla.

source: Installing a VNC Viewer
fi: VNC Viewerin asentaminen

source: Performing a VNC installation requires a VNC viewer running on your workstation or another terminal computer. VNC viewers are available in the repositories of most Linux distributions; free VNC viewers are also available for other operating systems such as Windows. On Linux systems, use your package manager to search for a viewer for your distribution.
fi: VNC-asennuksen suorittaminen vaatii VNC-katseluohjelman, joka on käynnissä työasemassasi tai toisessa päätetietokoneessa. VNC-katseluohjelmat ovat saatavilla useimpien Linux-jakelujen asennuslähteistä; ilmaisia VNC-katseluohjelmia on saatavana myös muille käyttöjärjestelmille, kuten Windowsille. Linux-järjestelmissä etsi paketinhallinnan avulla jakelullesi katseluohjelma.

source: The following VNC viewers are available in {PRODUCT}:
fi: Seuraavat VNC-katseluohjelmat ovat saatavilla {PRODUCT} -tuotteessa:

source: [application]*TigerVNC* - A basic viewer independent of your desktop environment. Installed as the [package]*tigervnc* package.
fi: [application]*TigerVNC* – Peruskatseluohjelma, joka on riippumaton työpöytäympäristöstäsi. Asennettu pakettina [package]*tigervnc*.

source: [application]*Vinagre* - A viewer for the [application]*GNOME* desktop environment. Installed as the [package]*vinagre* package.
fi: [application]*Vinagre* – katseluohjelma [application]*GNOME*-työpöytäympäristöön. Asennettu pakettina [package]*vinagre*.

source: [application]*KRDC* - A viewer integrated with the [application]*KDE* desktop environment. Installed as the [package]*kdenetwork-krdc* package.
fi: [application]*KRDC* – [application]*KDE*-työpöytäympäristöön integroitu katseluohjelma. Asennettu pakettina [package]*kdenetwork-krdc*.

source: To install any of the viewers listed above, execute the following command as `root`:
fi: Asenna jokin yllä luetelluista katseluohjelmista suorittamalla seuraava komento "root"-käyttäjänä:

source: # dnf install package
fi: # dnf install paketti

source: Replace _package_ with the package name of the viewer you want to use (for example, [package]*tigervnc*).
fi: Korvaa _paketti_ sen katseluohjelman paketin nimellä, jota haluat käyttää (esimerkiksi [package]*tigervnc*).

source: Procedures in this chapter assume you are using [application]*TigerVNC* as your VNC viewer. Specific instructions for other viewers may differ, but the general principles still apply.
fi: Tämän luvun toimenpiteissä oletetaan, että käytät [application]*TigerVNC:tä* VNC-katseluohjelmana. Erityiset ohjeet muille katsojille voivat vaihdella, mutta yleiset periaatteet ovat silti samat.

source: Performing a VNC Installation
fi: VNC-asennuksen suorittaminen

source: The [application]*Anaconda* installation program offers two modes for VNC installation: _Direct mode_ and _Connect mode_. The modes differ in the way the connection between the server and viewer is established. After you successfully connect, the installation will progress the same way regardless of the mode you used.
fi: [application]*Anaconda*-asennusohjelma tarjoaa kaksi tilaa VNC-asennukseen: _Direct mode_ ja _Connect mode_. Tilat eroavat tavasta, jolla palvelimen ja katseluohjelman välinen yhteys muodostetaan. Kun yhdistät onnistuneesti, asennus etenee samalla tavalla käyttämästäsi tilasta riippumatta.

source: Direct Mode
fi: Suora tila

source: In this mode, [application]*Anaconda* is configured to start the installation and wait for an incoming connection from VNC viewer before proceeding. While waiting for an incoming connection, the system's IP address and the port on which the installer expects the connection is displayed on the display or console if available; this implies that you need at least a serial console to connect using this mode, but you can work around this limitation if you know the default VNC port and the system's IP address.
fi: Tässä tilassa [application]*Anaconda* on määritetty aloittamaan asennus ja odottamaan tulevaa yhteyttä VNC-katseluohjelmasta ennen edistymistä. Odottaessa saapuvaa yhteyttä järjestelmän IP-osoite ja portti, johon asentaja odottaa yhteyttä, näkyvät näytössä tai konsolissa, jos sellainen on saatavilla. Tämä tarkoittaa, että tarvitset vähintään sarjakonsolin muodostaaksesi yhteyden tässä tilassa, mutta voit kiertää tämän rajoituksen, jos tiedät oletusarvoisen VNC-portin ja järjestelmän IP-osoitteen.

source: Connect Mode
fi: Yhteystila

source: In this mode, the VNC viewer is started on the remote system in _listening mode_. The VNC viewer waits for an incoming connection on a specified port. Then, [application]*Anaconda* is started and the host name/IP address and port number of the viewer are provided using a boot option or a Kickstart command. When the installation begins, the installation program establishes a connection with the listening VNC viewer using the specified host name/IP address and port number. Connect mode is therefore easier to use on systems with no local display or console, but it also may require additional preparation, because the viewer system must be able to accept incoming connections on the specified port, which usually requires changing firewall settings.
fi: Tässä tilassa VNC-katseluohjelma käynnistetään etäjärjestelmässä _kuuntelutilassa_. VNC-katseluohjelma odottaa saapuvaa yhteyttä määritetyssä portissa. Sitten [application]*Anaconda* käynnistetään ja katselijan isäntänimi/IP-osoite ja porttinumero annetaan käynnistysvaihtoehdolla tai Kickstart-komennolla. Kun asennus alkaa, asennusohjelma muodostaa yhteyden kuuntelevaan VNC-katseluohjelmaan käyttämällä määritettyä isäntänimeä/IP-osoitetta ja porttinumeroa. Yhteystilaa on siksi helpompi käyttää järjestelmissä, joissa ei ole paikallista näyttöä tai konsolia, mutta se voi myös vaatia lisävalmisteluja, koska katselujärjestelmän on kyettävä vastaanottamaan saapuvat yhteydet määritettyyn porttiin, mikä vaatii yleensä palomuuriasetusten muuttamista.

source: Choosing a VNC Installation Mode
fi: VNC-asennustilan valitseminen

source: Visual and Interactive access to the system
fi: Visuaalinen ja interaktiivinen pääsy järjestelmään

source: If visual and interactive access to the system being installed is not available, then you should use Connect Mode.
fi: Jos visuaalinen ja interaktiivinen pääsy asennettavaan järjestelmään ei ole käytettävissä, sinun tulee käyttää Yhteystilaa.

source: Network Connection Rules and Firewalls
fi: Verkkoyhteyssäännöt ja palomuurit

source: If the system being installed is not allowed inbound connections by a firewall, then you must use Connect Mode or disable the firewall. Disabling a firewall may have security implications.
fi: Jos palomuuri ei salli asennettavia yhteyksiä, sinun on käytettävä yhteystilaa tai poistettava palomuuri käytöstä. Palomuurin poistamisella voi olla turvallisuusvaikutuksia.

source: If the remote system running the VNC viewer is not allowed incoming connections by a firewall, then you must use Direct Mode, or disable the firewall. Disabling a firewall may have security implications.
fi: Jos palomuuri ei salli VNC-katseluohjelmaa käyttävää etäjärjestelmää, sinun on käytettävä suoraa tilaa tai poistettava palomuuri käytöstä. Palomuurin poistamisella voi olla turvallisuusvaikutuksia.

source: Installing in VNC Direct Mode
fi: Asennus VNC Direct -tilassa

source: VNC Direct Mode is when the VNC viewer initiates a connection to the system being installed. [application]*Anaconda* will tell you when to initiate this connection.
fi: VNC-suoratilassa VNC-katseluohjelma muodostaa yhteyden asennettavaan järjestelmään. [application]*Anaconda* kertoo, milloin tämä yhteys on muodostettava.

source: Starting VNC in Direct Mode
fi: VNC:n käynnistäminen suorassa tilassa

source: TigerVNC Connection Details
fi: TigerVNC-yhteyden tiedot

source: TigerVNC after startup
fi: TigerVNC käynnistyksen jälkeen

source: Boot the installation system and wait for the boot menu to appear. In the menu, edit boot options (see xref:install/Booting_the_Installation.adoc#sect-boot-menu[The Boot Menu]) and append the [option]#inst.vnc# option to the end of the command line.
fi: Käynnistä asennusjärjestelmä ja odota käynnistysvalikon ilmestymistä. Muokkaa valikossa käynnistysasetuksia (katso xref:install/Booting_the_Installation.adoc#sect-boot-menu[Käynnistysvalikko]) ja lisää [option]#inst.vnc#-vaihtoehto komentorivin loppuun.

source: Optionally, if you want to restrict VNC access to the installation system, add the [option]#inst.vncpassword=pass:attributes[{blank}]_PASSWORD_pass:attributes[{blank}]# boot option as well. Replace _PASSWORD_ with the password you want to use for the installation. The VNC password must be between 6 and 8 characters long.
fi: Vaihtoehtoisesti, jos haluat rajoittaa VNC-käyttöä asennusjärjestelmään, lisää myös [option]#inst.vncpassword=pass:attributes[{blank}]_PASSWORD_pass:attributes[{blank}]# käynnistysvaihtoehto. Korvaa _PASSWORD_ salasanalla, jota haluat käyttää asennuksessa. VNC-salasanan on oltava 6–8 merkkiä pitkä.

source: Use a temporary password for the [option]#inst.vncpassword=# option. It should not be a real or root password you use on any system.
fi: Käytä väliaikaista salasanaa [option]#inst.vncpassword=#-vaihtoehdolle. Se ei saa olla oikea- tai root-salasana, jota käytät missään järjestelmässä.

source: Adding VNC Boot Options
fi: VNC-käynnistysasetusten lisääminen

source: Editing boot options to activate VNC
fi: Käynnistysasetusten muokkaaminen VNC:n aktivoimiseksi

source: Start the installation using the edited options. The system will initialize the installation program and start the necessary services. When the system is ready, you will see a message on the screen similar to the following:
fi: Aloita asennus muokatuilla vaihtoehdoilla. Järjestelmä alustaa asennusohjelman ja käynnistää tarvittavat palvelut. Kun järjestelmä on valmis, näet näytöllä seuraavankaltaisen viestin:

source: Note the IP address and port number (in the above example, `192.168.100.131:5901`).
fi: Ota ylös IP-osoite ja portin numero (edellä olevassa esimerkissä `192.168.100.131:5901`).

source: On the system running the VNC Viewer, enter the IP address and port number obtained in the previous step into the `Connection Details` dialog in the same format as it was displayed on the screen by the installer. Then, click `Connect`. The VNC viewer will now connect to the installation system. If you set up a VNC password, enter it when prompted and press `OK`.
fi: Syötä VNC Vieweria käyttävässä järjestelmässä edellisessä vaiheessa saatu IP-osoite ja portin numero Yhteystiedot-valintaikkunaan samassa muodossa kuin asennusohjelma näytti sen näytöllä. Napsauta sitten "Yhdistä". VNC-katseluohjelma muodostaa nyt yhteyden asennusjärjestelmään. Jos määritit VNC-salasanan, kirjoita se pyydettäessä ja paina `OK`.

source: When the connection is successfully established, a new window will open on the system running the VNC viewer, displaying the installation menu. This window will provide full remote access to the installer until the installation finishes and the system reboots for the first time.
fi: Kun yhteys on muodostettu onnistuneesti, VNC-katseluohjelmaa käyttävässä järjestelmässä avautuu uusi ikkuna, jossa näkyy asennusvalikko. Tämä ikkuna tarjoaa täyden etäkäytön asennusohjelmaan, kunnes asennus on valmis ja järjestelmä käynnistyy uudelleen ensimmäisen kerran.

source: You can then proceed with xref:install/Installing_Using_Anaconda.adoc#chap-installing-using-anaconda[Installing Using Anaconda].
fi: Voit sitten jatkaa komennolla xref:install/Installing_Using_Anaconda.adoc#chap-installing-using-anaconda[Asennus Anacondalla].

source: Installing in VNC Connect Mode
fi: Asennus VNC-liitäntätilassa

source: VNC connect mode is when the system being installed initiates a connection to the VNC viewer running on a remote system. Before you start, make sure the remote system is configured to accept incoming connection on the port you want to use for VNC. The exact way to make sure the connection will not be blocked depends on your network and on your workstation's configuration. Information about configuring the firewall in {PRODUCT} is available in the [citetitle]_{PRODUCT} Security{nbsp}Guide_, available at link:++https://docs.fedoraproject.org/++[].
fi: VNC-yhteystilassa asennettava järjestelmä aloittaa yhteyden etäjärjestelmässä toimivaan VNC-katseluohjelmaan. Ennen kuin aloitat, varmista, että etäjärjestelmä on määritetty hyväksymään saapuva yhteys portissa, jota haluat käyttää VNC:lle. Tarkka tapa varmistaa, ettei mikään estä yhteyttä, riippuu verkosta ja työasemasi kokoonpanosta. Tietoja palomuurin määrittämisestä tuotteessa {PRODUCT} on saatavilla [citetitle]_{PRODUCT} -tietoturvaoppaassa{nbsp}, joka on saatavilla osoitteesta link:++https://docs.fedoraproject.org/++[].

source: Starting VNC in Connect Mode
fi: VNC:n käynnistäminen yhteystilassa

source: Start the VNC viewer on the client system in listening mode. For example, on {PRODUCT} using [application]*TigerVNC*, execute the following command:
fi: Käynnistä VNC-katseluohjelma asiakasjärjestelmässä kuuntelutilassa. Suorita esimerkiksi seuraava komento tuotteessa {PRODUCT} käyttämällä [application]*TigerVNC*:tä:

source: $ [command]#vncviewer -listen _PORT_#
fi: $ [command]#vncviewer -listen _PORTTI_#

source: Replace _PORT_ with the port number you want to use for the connection.
fi: Korvaa _PORTTI_ portin numerolla, jota haluat käyttää yhteyteen.

source: The terminal will display a message similar to the following example:
fi: Pääte näyttää seuraavan esimerkin kaltaisen viestin:

source: TigerVNC Viewer Listening
fi: TigerVNC-katseluohjelman kuuntelu

source: TigerVNC Viewer 64-bit v1.3.0 (20130924) Built on Sep 24 2013 at 16:32:56 Copyright (C) 1999-2011 TigerVNC Team and many others (see README.txt) See https://tigervnc.org/ for information on TigerVNC.
fi: TigerVNC Viewer 64-bit v1.3.0 (20130924) Built on Sep 24 2013 at 16:33:56 Copyright (C) 1999-2011 TigerVNC Team and many others (see README.txt) See https://tigervnc.org/ for information on TigerVNC.

source: Thu Feb 20 15:23:54 2014 main: Listening on port 5901
fi: Thu Feb 20 15:24:54 2014 main: Listening on port 5901

source: When this message is displayed, the VNC viewer is ready and waiting for an incoming connection from the installation system.
fi: Kun tämä viesti tulee näkyviin, VNC-katseluohjelma on valmis ja odottaa tulevaa yhteyttä asennusjärjestelmästä.

source: Boot the installation system and wait for the boot menu to appear. In the menu, edit boot options (see xref:install/Booting_the_Installation.adoc#sect-boot-menu[The Boot Menu]) and append the following options to the end of the command line:
fi: Käynnistä asennusjärjestelmä ja odota käynnistysvalikon ilmestymistä. Muokkaa valikossa käynnistysasetuksia (katso xref:install/Booting_the_Installation.adoc#sect-boot-menu[Käynnistysvalikko]) ja lisää seuraavat vaihtoehdot komentorivin loppuun:

source: [option]#inst.vnc inst.vncconnect=pass:attributes[{blank}]_HOST_:pass:attributes[{blank}]_PORT_#
fi: [option]#inst.vnc inst.vncconnect=pass:attributes[{blank}]_HOST_:pass:attributes[{blank}]_PORTTI_#

source: Replace _HOST_ with the IP address of the system running the listening VNC viewer, and _PORT_ with the port number that the VNC viewer is listening on.
fi: Korvaa _HOST_ sen järjestelmän IP-osoitteella, jossa VNC-katseluohjelma on käynnissä, ja _PORTTI_ portin numerolla, jota VNC-katseluohjelma kuuntelee.

source: Start the installation. The system will initialize the installation program and start the necessary services. Once the initialization is finished, [application]*Anaconda* will attempt to connect to the IP address and port you provided in the previous step.
fi: Aloita asennus. Järjestelmä alustaa asennusohjelman ja käynnistää tarvittavat palvelut. Kun alustus on valmis, [application]*Anaconda* yrittää muodostaa yhteyden edellisessä vaiheessa antamaasi IP-osoitteeseen ja porttiin.

source: Kickstart Considerations
fi: Kickstart näkökohdat

source: Commands for using a VNC installation are also available in Kickstart installations. Using just the [command]#vnc# command will set up an installation using Direct Mode. Options are available to set up an installation using Connect Mode. For more information about the [command]#vnc# command and options used in Kickstart files, see xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference].
fi: VNC-asennuksen käyttöä koskevat komennot ovat saatavilla myös Kickstart-asennuksissa. Pelkän [command]#vnc#-komennon käyttäminen määrittää asennuksen käyttämällä suoraa tilaa. Vaihtoehdot ovat käytettävissä asennuksen määrittämiseksi Connect Mode -tilan avulla. Lisätietoja [command]#vnc#-komennosta ja Kickstart-tiedostoissa käytetyistä vaihtoehdoista on kohdassa xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart-syntaksiviittaus].

source: Considerations for Headless Systems
fi: Huomioita headless-järjestelmistä

source: When installing headless systems, the only choices are an automated Kickstart installation or an interactive VNC installation using connect mode. For more information about automated Kickstart installation, see xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart Syntax Reference]. The general process for an interactive VNC installation is described below.
fi: Kun asennat headless-järjestelmiä, ainoat vaihtoehdot ovat automaattinen Kickstart-asennus tai interaktiivinen VNC-asennus yhdistämistilaa käyttäen. Lisätietoja automaattisesta Kickstart-asennuksesta on kohdassa xref:appendixes/Kickstart_Syntax_Reference.adoc#appe-kickstart-syntax-reference[Kickstart-syntaksiviittaus]. Interaktiivisen VNC-asennuksen yleinen prosessi on kuvattu alla.

source: Set up a PXE server that will be used to start the installation. Information about installing and performing basic configurating of a PXE server can be found in xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Setting Up an Installation Server].
fi: Määritä PXE-palvelin, jota käytetään asennuksen aloittamiseen. Tietoja PXE-palvelimen asennuksesta ja perusasetusten suorittamisesta löytyy osoitteesta xref:advanced/Network_based_Installations.adoc#chap-pxe-server-setup[Asennuspalvelimen määrittäminen].
