Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/install/Booting_the_Installation.po
Languages: fi

source: Booting the Installation
fi: Asennuksen käynnistäminen

source: This chapter will explain how to boot the installer from local media or a network server as well as how to navigate the boot menu and use custom options.
fi: Tässä luvussa selitetään kuinka asennin käynnistetään paikalliselta medialta tai verkkopalvelimelta sekä kuinka navigoidaan käynnistysvalikossa ja käytetään mukautettuja vaihtoehtoja.

source: Preparing to Boot
fi: Valmistelee käynnistystä

source: After you have made a bootable USB flash drive or a CD or DVD using the steps described in xref:install/Preparing_for_Installation.adoc#sect-preparing-boot-media[Preparing Boot Media], you are ready to boot the installation. Note that the steps described below are generic and the exact steps will vary somewhat depending on your system - particularly on your motherboard manufacturer.
fi: Kun olet tehnyt käynnistettävän USB-muistitikun tai CD- tai DVD-levyn kohdassa xref:install/Preparing_for_Installation.adoc#sect-preparing-boot-media[Käynnistyslevyn valmistelu] kuvattujen vaiheiden avulla, olet valmis käynnistämään asennuksen. Huomaa, että alla kuvatut vaiheet ovat yleisiä ja tarkat vaiheet vaihtelevat jonkin verran järjestelmästäsi - erityisesti emolevyn valmistajasta riippuen.

source: There are no separate media provided for BIOS and UEFI systems; all of them can boot from the same ISO image. However, once you install {PRODUCT}, you cannot switch between UEFI and BIOS. The system must run on the same firmware it was installed on; if you, for example, perform the installation on an UEFI system in UEFI mode, and then switch it to BIOS compatibility mode, {PRODUCT} will no longer boot and will require a reinstallation.
fi: BIOS- ja UEFI-järjestelmille ei ole olemassa erillisiä asennusmedioita. Kaikki niistä voidaan käynnistää samasta ISO-levykuvasta. Sen jälkeen kun {PRODUCT} on asennettu, et voi kuitenkaan vaihtaa UEFI:n ja BIOSin välillä. Järjestelmää on ajettava samalla laiteohjelmistolla, johon se asennettiin; Jos esimerkiksi suoritat asennuksen UEFI-järjestelmään UEFI-tilassa ja vaihdat sen sitten BIOS-yhteensopivuustilaan, {PRODUCT} ei enää käynnisty ja se vaatii uudelleenasennuksen.

source: {PRODUCT} does not support UEFI booting for 32-bit x86 systems. Only BIOS boot is supported on these systems.
fi: {PRODUCT} ei tue UEFI-käynnistystä 32-bittisille x86-järjestelmille. Näissä järjestelmissä tuetaan vain BIOS-käynnistystä.

source: Also note that {PRODUCT} only fully supports version 2.2 of the UEFI specification. Hardware that supports version 2.3 or later will boot and work normally, but the additional functionality defined by these later specifications will not be available. The UEFI specifications are available from link:++https://www.uefi.org/specs/agreement/++[].
fi: Huomaa myös, että {PRODUCT} tukee täysin vain UEFI-määrityksen versiota 2.2. Laitteisto, joka tukee versiota 2.3 tai uudempaa, käynnistyy ja toimii normaalisti, mutta näiden myöhempien teknisten tietojen määrittelemät lisätoiminnot eivät ole käytettävissä. UEFI-spesifikaatiot ovat saatavilla sivulta link:++https://www.uefi.org/specs/agreement/++[].

source: To boot the {PRODUCT} installer, follow these steps:
fi: Käynnistä {PRODUCT} asennusohjelma seuraavasti:

source: Booting the {PRODUCT} Installer
fi: Käynnistetään {PRODUCT} -asennusohjelmaa

source: Plug in the boot USB drive, or insert the boot CD or DVD into your computer's optical disc drive. Alternatively, if you plan on booting from a network boot (PXE) server, make sure that the network cable is plugged in.
fi: Liitä käynnistys-USB-muistitikku tai aseta käynnistys-CD- tai DVD-levy tietokoneesi optiseen levyasemaan. Vaihtoehtoisesti, jos aiot käynnistää verkkokäynnistyspalvelimelta (PXE), varmista, että verkkokaapeli on kytketty.

source: Restart the system. Once it starts rebooting, it should display a prompt similar to the following (usually at the bottom of the screen):
fi: Käynnistä järjestelmä uudelleen. Kun se käynnistyy uudelleen, sen pitäisi näyttää seuraavanlainen kehote (yleensä näytön alareunassa):

source: Press F12 to select boot device, or Del to enter SETUP
fi: Paina F12 valitaksesi käynnistyslaitteen tai Del siirtyäksesi ASETUKSIIN

source: Follow the on-screen instructions to access the boot menu. If no instructions are displayed (some systems only display a graphical logo during early stages of boot), try pressing kbd:[F12], kbd:[F11], kbd:[F10] or kbd:[Del] several times; these are most commonly used keys. Note that there is usually a very short time window provided to access the menu; once it passes, you need to restart the system and try again.
fi: Noudata näytön ohjeita päästäksesi käynnistysvalikkoon. Jos ohjeita ei näytetä (jotkut järjestelmät näyttävät vain graafisen logon käynnistyksen alkuvaiheessa), yritä painaa useita kertoja kbd:[F12], kbd:[F11], kbd:[F10] tai kbd:[Del]. Nämä ovat yleisimmin käytettyjä avaimia. Huomaa, että valikkoon pääsemiseen on yleensä hyvin lyhyt aika; kun se menee ohi, sinun on käynnistettävä järjestelmä uudelleen ja yritettävä uudelleen.

source: Some older systems may not support choosing a boot device at startup. In that case, enter the system's SETUP (BIOS), and change the default boot order so that your boot media (CD, DVD, USB or network) has higher priority than internal hard drives.
fi: Jotkut vanhemmat järjestelmät eivät ehkä tue käynnistyslaitteen valintaa käynnistyksen yhteydessä. Siirry siinä tapauksessa järjestelmän ASETUKSIIN (BIOS) ja muuta oletuskäynnistysjärjestystä niin, että käynnistysmedialla (CD, DVD, USB tai verkko) on korkeampi prioriteetti kuin sisäisillä kiintolevyillä.

source: On Mac hardware, hold down the kbd:[Option] key to enter the boot media selection menu.
fi: Mac-laitteistossa paina kbd:[Option]-näppäintä päästäksesi käynnistysmedian valintavalikkoon.

source: When your system's boot menu opens, select an entry such as `Boot from USB` if you created a bootable USB drive, `Boot from CD/DVD` if you are using an optical disc to install {PRODUCT}, or `Boot from PXE` if you want to boot from a network location.
fi: Kun järjestelmän käynnistysvalikko avautuu, valitse merkintä, kuten "Boot from USB", jos loit käynnistettävän USB-aseman, "Boot from CD/DVD", jos käytät optista levyä {PRODUCT} -asennukseen, tai "Boot from PXE". ` jos haluat käynnistää verkkosijainnista.

source: Wait until the boot menu is displayed. The boot menu is described further in this chapter.
fi: Odota, kunnes käynnistysvalikko tulee näkyviin. Käynnistysvalikkoa kuvataan tarkemmin tässä luvussa.

source: The Boot Menu
fi: Käynnistysvalikko

source: In most cases, when you boot the {PRODUCT} installer from your prepared boot media or server, the boot menu will be the first thing that appears. From this menu, you can either start the actual installation, or you can use the boot media to rescue an existing system.
fi: Useimmissa tapauksissa, kun käynnistät {PRODUCT} -asennusohjelman valmiilta käynnistysmedialta tai palvelimelta, käynnistysvalikko tulee ensimmäisenä näkyviin. Tästä valikosta voit joko aloittaa varsinaisen asennuksen tai voit korjata olemassa olevan järjestelmän käynnistysmedian avulla.

source: The way the boot menu will look and function will vary somewhat depending on your system's firmware - BIOS systems use the [application]*SYSLINUX* boot loader, and UEFI systems use [application]*GRUB2*. However, both of the menus described below function very similarly from a user's point of view.
fi: Käynnistysvalikon ulkoasu ja toiminta vaihtelee jonkin verran järjestelmän laiteohjelmiston mukaan - BIOS-järjestelmät käyttävät [sovellus]*SYSLINUX* käynnistyslatainta ja UEFI-järjestelmät [sovellus]*GRUB2*:ta. Molemmat alla kuvatut valikot toimivat kuitenkin hyvin samalla tavalla käyttäjän näkökulmasta.

source: Use the arrow keys to select an entry in the menu and kbd:[Enter] to confirm your selection. The first two entries in the list will both proceed with the installation; the first one will start the installer directly, and the second one will verify the integrity of the boot media before starting the installation.
fi: Käytä nuolinäppäimiä valitaksesi merkintä valikosta ja kbd:[Enter] vahvistaaksesi valintasi. Luettelon kaksi ensimmäistä kohtaa jatkavat asennusta; ensimmäinen käynnistää asennusohjelman heti ja toinen varmistaa käynnistystietovälineen eheyden ennen asennuksen aloittamista.

source: The final entry in the list is `Troubleshooting`pass:attributes[{blank}]; this is a submenu. Selecting this entry and pressing kbd:[Enter] will display a new set of selections, where you can choose to install in basic graphics mode (useful if you want to do a manual graphical installation but your system has issues with the default graphical installer), rescue an existing system, or test your system's memory modules for errors (on BIOS systems only). The troubleshooting menu also allows you to exit the boot menu and boot normally from your system's hard drive via the `Boot from local drive` option.
fi: Viimeinen merkintä luettelossa on `Vianetsintä`pass:attributes[{blank}]; tämä on alivalikko. Tämän merkinnän valitseminen ja kbd:[Enter]-näppäimen painaminen näyttää uudet valinnat, joissa voit asentaa perusgrafiikkatilassa (hyödyllinen, jos haluat tehdä manuaalisen graafisen asennuksen, mutta järjestelmässäsi on ongelmia graafisen oletusasennusohjelman kanssa) , korjata olemassa olevaa järjestelmä tai etsiä järjestelmän muistimoduuleiden virheitä (vain BIOS-järjestelmissä). Vianmääritysvalikon avulla voit myös poistua käynnistysvalikosta ja käynnistää normaalisti järjestelmän kiintolevyltä "Boot from local drive" -vaihtoehdon kautta.

source: Every menu entry in the list is a predefined set of boot options, and these options can be customized to change some aspects of the installer's behavior. To edit the default set of boot options, press kbd:[Tab] on BIOS systems, or kbd:[e] on UEFI systems. The key to use is also displayed at the bottom of the screen.
fi: Jokainen luettelon valikkokohta on ennalta määritetty sarja käynnistysasetuksia, ja näitä asetuksia voidaan mukauttaa muuttamaan joitain asennusohjelman toiminnan näkökohtia. Voit muokata oletusarvoisia käynnistysasetuksia painamalla kbd:[Tab] BIOS-järjestelmissä tai kbd:[e] UEFI-järjestelmissä. Käytettävä avain näkyy myös näytön alareunassa.

source: Editing boot options in [application]*GRUB2* (on UEFI systems) will display the entire configuration for the selected entry. Actual boot options are configured on the line which starts with the `linux` (or `linux16` or `linuxefi`) keyword. Do not modify any other lines in the configuration.
fi: Käynnistysasetusten muokkaaminen kohdassa [application]*GRUB2* (UEFI-järjestelmissä) näyttää valitun merkinnän koko kokoonpanon. Todelliset käynnistysasetukset määritetään riville, joka alkaa avainsanalla "linux" (tai "linux16" tai "linuxefi"). Älä muuta kokoonpanon muita rivejä.

source: On systems with BIOS firmware, only the actual boot options are displayed when you press kbd:[Tab].
fi: Järjestelmässä, jossa on BIOS-laiteohjelmisto, vain mahdolliset käynnistysvaihtoehdot näytetään, kun painat kbd:[Tab].

source: When editing the default set of options, you can change the existing ones as well as append additional ones. Once you finish, press kbd:[Enter] on BIOS or kbd:[Ctrl + X] on UEFI to boot the installer using your customized options.
fi: Kun muokkaat oletusasetusjoukkoa, voit muuttaa olemassa olevia vaihtoehtoja sekä lisätä uusia. Kun olet valmis, paina kbd:[Enter] BIOSissa tai kbd:[Ctrl + X] UEFI:ssä käynnistääksesi asennusohjelman mukautetuilla asetuksillasi.

source: Editing boot options on a system with BIOS firmware
fi: Käynnistysasetusten muokkaaminen järjestelmässä, jossa on BIOS-laiteohjelmisto

source: The boot menu.
fi: Käynnistysvalikko.

source: Editing boot options on a system with UEFI firmware
fi: Käynnistysasetusten muokkaaminen järjestelmässä, jossa on UEFI-laiteohjelmisto

source: All available [application]*Anaconda* boot options are described in xref:advanced/Boot_Options.adoc#sect-boot-options-available[Available Boot Options].
fi: Kaikki käytettävissä olevat [sovellus]*Anaconda* käynnistysasetukset on kuvattu julkaisussa xref:advanced/Boot_Options.adoc#sect-boot-options-available[Käynnistysasetukset].
