Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f33/pages/_partials/Legal_Notice.po
Languages: fi, ko

source: Copyright {YEAR} {HOLDER}.
fi: Tekijänoikeus {YEAR} {HOLDER}.
ko: 저작권 {YEAR} {HOLDER}.

source: The text of and illustrations in this document are licensed by Red Hat under a Creative Commons Attribution–Share Alike 3.0 Unported license ("CC-BY-SA"). An explanation of CC-BY-SA is available at link:++https://creativecommons.org/licenses/by-sa/3.0/++[]. The original authors of this document, and Red Hat, designate the Fedora Project as the "Attribution Party" for purposes of CC-BY-SA. In accordance with CC-BY-SA, if you distribute this document or an adaptation of it, you must provide the URL for the original version.
fi: Tämän asiakirjan tekstit ja kuvat ovat Red Hatin myöntämiä käyttäen Creative Commons Attribution–Share Alike 4.0 International -lisenssiä ("CC BY-SA"). CC BY-SA:n selitys on saatavilla link:++https://creativecommons.org/licenses/by-sa/4.0/++[]. Tämän asiakirjan alkuperäiset kirjoittajat ja Red Hat nimeävät Fedora-projektin "Attribuutiopuoleksi" CC BY-SA:n tarkoituksia varten. CC BY-SA:n mukaisesti, jos jaat tätä asiakirjaa tai sen muunnelmaa, sinun on annettava alkuperäisen version URL-osoite.
ko: 이 문서에서 텍스트와 그림은 Creative Commons Attribution–Share Alike 3.0 Unported license( "CC-BY-SA")에 따라 Red Hat에 의해 허가되었습니다. CC-BY-SA의 설명은 다음 link:++https://creativecommons.org/licenses/by-sa/3.0/deed.ko[creative commons]에서 이용 할 수 있습니다. 이 문서의 원저자, 그리고 Red Hat은 페도라 프로젝트를 CC-BY-SA의 목표를 위해 "기여 당사자"로 지정합니다. CC-BY-SA에 따라서, 만약 당신은 본 문서나 수정본을 배포하는 경우에, 당신은 원본 버전의 URL을 제공해야만 합니다.

source: Red Hat, as the licensor of this document, waives the right to enforce, and agrees not to assert, Section 4d of CC-BY-SA to the fullest extent permitted by applicable law.
fi: Tämän asiakirjan lisenssinantajana Red Hat luopuu oikeudestaan panna täytäntöön CC BY-SA:n kohta 4d ja sitoutuu olemaan puolustamatta sitä sovellettavan lain sallimassa laajuudessa.
ko: Red Hat은 이 문서의 사용 허가권자로, CC-BY-SA의 부분 4d를 해당 법률에서 허용하는 최대 범위까지 시행 할 권리를 포기하고, 주장하지 않을 것에 동의합니다.

source: Red Hat, Red Hat Enterprise Linux, the Shadowman logo, JBoss, MetaMatrix, Fedora, the Infinity Logo, and RHCE are trademarks of Red Hat, Inc., registered in the United States and other countries.
fi: Red Hat, Red Hat Enterprise Linux, Shadowman-logo, JBoss, MetaMatrix, Fedora, Infinity-logo ja RHCE ovat Red Hat, Inc:n tavaramerkkejä, jotka on rekisteröity Yhdysvalloissa ja muissa maissa.
ko: Red Hat, Red Hat Enterprise Linux, Shadowman 로고, JBoss, MetaMatrix, Fedora, Infinity 로고와 RHCE는 미국과 다른 국가에서 등록된 Red Hat, Inc.의 상표입니다.

source: For guidelines on the permitted uses of the Fedora trademarks, refer to link:++https://fedoraproject.org/wiki/Legal:Trademark_guidelines++[].
fi: Ohjeet Fedora-tavaramerkkien sallittuun käyttöön löydät link:++https://fedoraproject.org/wiki/Legal:Trademark_guidelines++[].
ko: Fedora 상표의 허용된 사용에 대한 지침을 위하여, link:++https://fedoraproject.org/wiki/Legal:Trademark_guidelines++[]에서 언급되어 있습니다.

source: *Linux* (R) is the registered trademark of Linus Torvalds in the United States and other countries.
fi: *Linux* (R) on Linus Torvaldsin rekisteröity tavaramerkki Yhdysvalloissa ja muissa maissa.
ko: *Linux* (R)는 미국과 다른 국가에서 Linus Torvalds의 상표로 등록되어 있습니다.

source: *Java* (R) is a registered trademark of Oracle and/or its affiliates.
fi: *Java* (R) on Oraclen ja/tai sen tytäryhtiöiden rekisteröity tavaramerkki.
ko: *Java* (R)는 Oracle 및/또는 그 자회사의 상표로 등록되어 있습니다.

source: *XFS* (R) is a trademark of Silicon Graphics International Corp. or its subsidiaries in the United States and/or other countries.
fi: *XFS* (R) on Silicon Graphics International Corp.:n tai sen tytäryhtiöiden tavaramerkki Yhdysvalloissa ja/tai muissa maissa.
ko: *XFS* (R)는 Silicon Graphics International Corp. 또는 미국 및/또는 기타 국가의 자회사의 상표입니다.

source: *MySQL* (R) is a registered trademark of MySQL AB in the United States, the European Union and other countries.
fi: *MySQL* (R) on MySQL AB:n rekisteröity tavaramerkki Yhdysvalloissa, Euroopan unionissa ja muissa maissa.
ko: *MySQL* (R)은 미국, 유럽 및 기타 국가에서 MySQLAB의 상표로 등록되어 있습니다.

source: All other trademarks are the property of their respective owners.
fi: Kaikki muut tavaramerkit ovat omistajiensa omaisuutta.
ko: 모든 다른 상표는 해당 소유자의 자산입니다.
