Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/Downloading_Fedora.po
Languages: es

source: Downloading Fedora
es: Descargando Fedora

source: Fedora Editions
es: Ediciones de Fedora

source: Fedora provides three primary Editions tailored for some specific use cases. link:++https://getfedora.org++[] offers Fedora Cloud for scalable infrastructure, Fedora Server for organizational infrastructure, and Fedora Workstation for the developer and desktop user.
es: Fedora proporciones tres Ediciones principales diseñadas para algunos casos de uso específicos. El link:++https://getfedora.org++[] ofrece Fedora Cloud para infraestructura escalable, Fedora Server para infraestructura de organización y Fedora Workstation para usuarios desarrolladores y de sobremesa.

source: For alternative desktop environments or media built for more niche purposes, check out link:++https://spins.fedoraproject.org++[Fedora Spins].
es: Para entornos de escritorio alternativos o medios creados para fines más específicos, echa un vistazo a:++https://spins.fedoraproject.org++[Fedora Spins].

source: Each of these downloads provides a different set of default packages, but you can add to your system after the initial installation to customize it for your needs. The installation process is the same for all spins and Editions, so you can use this guide for any choice you make.
es: Cada una de estas descargas proporciona un conjunto diferente de paquetes predeterminados, pero usted puede añadir más después de la instalación inicial para adaptarse a sus necesidades. El proceso de instalación es el mismo para todos los Spins y Ediciones, de modo que puede usar esta guía para cualquiera de las elecciones que haga.

source: Which Architecture Is My Computer?
es: ¿Cúal es la Arquitectura de Mi Ordenador?

source: Most modern systems are 64{nbsp}bit x86 architecture. If your computer was manufactured after 2007, or you aren't sure, you probably have a `x86_64` system.
es: La mayoría de los sistemas modernos tienen una arquitectura 64{nbsp}bit x86. Si su ordenador está fabricado después de 2007, o no esta seguro, probablemente tenga un sistema `x86_64`.

source: Changing a Fedora installation from one architecture to another is not supported. Use the following table to determine the architecture of your computer according to the type of processor. Consult your manufacturer's documentation for details on your processor, or resources such as link:++https://ark.intel.com/++[] or link:++https://products.amd.com/++[], if necessary.
es: El cambio de una instalación Fedora de una arquitectura a otra no está soportado. Use la siguiente tabla para determinar la arquitectura de su ordenador de acuerdo al tipo de su procesador. Consulte en la documentación del fabricante los detalles sobre su procesador o recursos como link:++https://ark.intel.com/++[] o link:++https://products.amd.com/++[] si fuera necesario.

source: Processor and architecture types
es: Procesador y tipos de arquitectura

source: Media Types
es: Tipos de medios

source: Several media types are available. Choose the one that best suits your requirements.
es: Varios tipos de medios están disponibles. Seleccione la que mas se ajuste a sus requisitos.

source: Live Image
es: Imagen viva

source: Live images allow you to preview Fedora before installing it. Instead of booting directly into the installer, a live image loads the same environment you'll get after installation. Fedora Workstation and Fedora Spins are live images.
es: Las imágenes en vivo te permiten probar Fedora antes de instalarlo. En vez de iniciar directamente en el instalador, una imagen en vivo carga el mismo entorno que tendrás después de la instalación. Fedora Workstation y Fedora Spins son imagenes en vivo.

source: Use a live image to install your favorite system, test Fedora on new hardware, troubleshoot, or share with friends.
es: Usa una imagen en vivo para instalar tu sistema favorito, probar Fedora en hardware nuevo, resolver problemas, o para compartir con amigos.

source: DVD Image
es: Imagen DVD

source: DVD images boot directly into the installation environment, and allow you to choose from a variety of packages that are provided with it. In Fedora 21, the DVD option is only available in the *Fedora Server* Edition.
es: Las imágenes DVD inician directamente en el entorno de instalación, y te permiten elegir de la variedad de paquetes que se ofrece en ella. En Fedora 21, las imagenes DVD son la unica opcion disponible en la edición *Fedora Server*.

source: Use the Fedora Server DVD image when you want customized Fedora Server installations using an offline installation source.
es: Usa la imagen DVD Fedora Server cuando quieras instalaciones personalizadas de Fedora Server instaladas offline.

source: netinstall Image
es: Imagen netinstall (instalacion por red)

source: The netinstall image boots directly into the installation environment, and uses the online Fedora package repositories as the installation source. With a netinstall image, you can install any Fedora Edition or select a wide variety of packages to create a customized installation of Fedora.
es: La imagen "netinstall" inicia directamente en el entorno de instalación, y utiliza los repositorios de Fedora como fuente de instalación. Con una imagen "netinstall", puedes instalar cualquier edición de Fedora o elegir entre una gran variedad de paquetes para crear una instalación personalizada.

source: Compared to Fedora Workstation DVD image with Fedora Workstation installation: the netinstall images do not hide the GRUB2 menu.
es: Comparada con la Imagen DVD de Fedora Workstation: las imágenes "netinstall" no ocultan el menú de GRUB2.

source: The link:++https://alt.fedoraproject.org++[netinstall images] have different default settings:
es: El link:++https://alt.fedoraproject.org++[Imágenes netinstall] tiene distintos ajustes por defecto:

source: LVM with XFS file system configuration
es: LVM con configuración de sistema de archivos XFS

source: server firewall configuration
es: Configuración del firewall del servidor

source: 15 GiB hard disk space assigned to /; remaining free space left as unpartitioned LVM space
es: 15 GiB de espacio en el disco duro asignado a /; el resto se deja como espacio LVM no-particionado

source: Everything:
es: Todo:

source: BTRFS file system configuration
es: Configuración del sistema de archivos BTRFS

source: client firewall configuration
es: configuración del firewall del cliente

source: hard disk space assignment does not leave unpartitioned free space
es: la asignación de espacio en el disco duro no deja espacio libre sin particionar

source: ARM images
es: Imágenes ARM

source: For many ARM systems, Fedora provides preconfigured filesystem images. Write the image to removable media and boot directly into a Fedora installation that's ready to use.
es: Para muchos sistemas ARM, Fedora proporciona imágenes del sistema de archivos configuradora. Escribe la imagen en algún medio y accede directamente a una instalación de Fedora lista para utilizar.

source: ARM devices often require special setup procedures that aren't covered in this guide. Start learning about Fedora ARM at link:++https://fedoraproject.org/wiki/Architectures/ARM++[]
es: Los dispositivos ARM en muchas ocasiones requieren procedimientos de inicio especiales fuera del objetivo de esta guía. Puedes empezar a aprender sobre Fedora en ARM en el siguiente enlace:++https://fedoraproject.org/wiki/Architectures/ARM++[]

source: Cloud Images
es: Imágenes en la Nube

source: Fedora Cloud images are preconfigured filesystem images with very few packages installed by default. They include special tools for interacting with cloud platforms, and are not intended to be used outside of cloud environments.
es: Las imágenes Fedora Cloud son imágenes del sistema de archivos pre-configuradas con muy pocos paquetes instalados por defecto. Incluyen herramientas especiales para interactuar con plataformas en la nube, y su uso fuera de estos entornos no esta soportado.
