Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/Introduction.po
Languages: fi

source: Introduction
fi: Johdanto

source: This guide covers installation of Fedora, a Linux distribution built on free and open source software. This manual helps you install Fedora on desktops, laptops, and servers. The installation system is easy to use even if you lack previous knowledge of Linux or computer networks. If you select default options, Fedora provides a complete desktop operating system, including productivity applications, Internet utilities, and desktop tools.
fi: Tämä opas kattaa Fedoran, ilmaisiin ja avoimen lähdekoodin ohjelmistoihin perustuvan Linux-jakelun, asennuksen. Tämä opas auttaa sinua asentamaan Fedoran pöytätietokoneisiin, kannettaviin tietokoneisiin ja palvelimiin. Asennusjärjestelmää on helppo käyttää, vaikka sinulla ei olisi aiempaa Linux- tai tietokoneverkkotuntemusta. Jos valitset oletusasetukset, Fedora tarjoaa täydellisen työpöytäkäyttöjärjestelmän, mukaan lukien tuottavuussovellukset, Internet-apuohjelmat ja työpöytätyökalut.

source: This document details the full range of installation options, including those that apply only in limited or unusual circumstances. Understanding of all topics described in this document is not necessary to successfully perform the installation in most cases.
fi: Tämä asiakirja sisältää kaikki asennusvaihtoehdot, mukaan lukien ne, jotka ovat voimassa vain rajoitetuissa tai epätavallisissa olosuhteissa. Kaikkien tässä asiakirjassa kuvattujen aiheiden ymmärtäminen ei useimmissa tapauksissa ole välttämätöntä asennuksen onnistumiseksi.

source: Background
fi: Tausta

source: About Fedora
fi: Tietoa Fedorasta

source: To find out more about {PRODUCT}, visit the link:++https://getfedora.org/++[{PRODUCT} Project Website]. Other documentation describing additional topics related to {PRODUCT} is available at link:++https://docs.fedoraproject.org/++[{PRODUCT} Documentation]. Also see the link:++https://fedoraproject.org/wiki/Fedora_Project_Wiki++[{PRODUCT} Project Wiki].
fi: Saat lisätietoja tuotteesta {PRODUCT} vierailemalla link:++https://getfedora.org/++[{PRODUCT} Project Website]. Muita {PRODUCT} -tuotteeseen liittyviä aiheita kuvaavia asiakirjoja on osoitteessa link:++https://docs.fedoraproject.org/++[{PRODUCT} Documentation]. Katso myös link:++https://fedoraproject.org/wiki/Fedora_Project_Wiki++[{PRODUCT} Project Wiki].

source: Getting Additional Help
fi: Lisäohjeiden saaminen

source: If you encounter any problems which are not described in documentation, you might get help from members of the community - developers, users, and others. There are many ways to get help: the Ask Fedora website, mailing lists, forums, or IRC. For a summary of available resources, see the link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Communicating and Getting Help] page on the {PRODUCT} wiki.
fi: Jos kohtaat ongelmia, joita ei ole kuvattu dokumentaatiossa, saatat saada apua yhteisön jäseniltä – kehittäjiltä, käyttäjiltä ja muilta. On monia tapoja saada apua: Ask Fedora -verkkosivusto, postituslistat, foorumit tai IRC. Yhteenveto käytettävissä olevista resursseista on link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Communicating and Getting Help] -sivulla {PRODUCT} -wikissä.

source: About This Document
fi: Tietoja tästä asiakirjasta

source: Goals
fi: Tavoitteet

source: This guide helps a reader:
fi: Tämä opas auttaa lukijaa:

source: Understand how to locate the {PRODUCT} distribution online
fi: Osaat paikantaa {PRODUCT} -jakelun verkossa

source: Create configuration data that allows a computer to boot {PRODUCT}
fi: Luomaan määritystietoja, joiden avulla tietokone voi käynnistää tuotteen {PRODUCT}

source: Understand and interact with the {PRODUCT} installation program
fi: Ymmärtämään ja käyttämään {PRODUCT} -asennusohjelmaa

source: Complete basic post-installation configuration of a {PRODUCT} system
fi: Suorittamaan {PRODUCT} -järjestelmän asennuksen jälkeinen perusmääritys

source: This guide does not cover *use* of {PRODUCT}. To learn how to use an installed {PRODUCT} system, see the other manuals available at link:++https://docs.fedoraproject.org/++[Fedora Documentation].
fi: Tämä opas ei kata tuotteen {PRODUCT} *käyttöä*. Lisätietoja asennetun {PRODUCT} -järjestelmän käytöstä on muista oppaista, jotka ovat saatavilla osoitteessa link:++https://docs.fedoraproject.org/++[Fedora dokumentaatio].

source: Target Audience
fi: Kohdeyleisö

source: This guide is intended for {PRODUCT} users of all levels of experience. However, it describes the installation process and its many options in far greater detail than most users are likely to require. You do not need to read and understand this entire document to install {PRODUCT} on a computer. This document is most likely to help experienced users perform advanced and unusual installations.
fi: Tämä opas on tarkoitettu kaikentasoisille {PRODUCT} -käyttäjille. Se kuitenkin kuvaa asennusprosessia ja sen monia vaihtoehtoja paljon yksityiskohtaisemmin kuin useimmat käyttäjät todennäköisesti tarvitsevat. Sinun ei tarvitse lukea ja ymmärtää tätä asiakirjaa kokonaisuudessaan asentaaksesi {PRODUCT} tietokoneelle. Tämä asiakirja auttaa todennäköisesti kokeneita käyttäjiä suorittamaan edistyneitä ja epätavallisia asennuksia.
