Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/appendixes/Disk_Partitions.po
Languages: id

source: An Introduction to Disk Partitions
id: Pengenalan ke Partisi Disk

source: This appendix is not necessarily applicable to architectures other than AMD64 and Intel{nbsp}64. However, the general concepts mentioned here may apply.
id: Lampiran ini belum tentu berlaku ke arsitektur selain AMD64 dan Intel{nbsp}64. Namun, konsep umum yang disinggung di sini mungkin berlaku.

source: This section discusses basic disk concepts, disk repartitioning strategies, the partition naming scheme used by Linux systems, and related topics.
id: Bagian ini mendiskusikan konsep disk dasar, strategi partisi ulang disk, skema penamaan partisi yang dipakai oleh sistem Linux, dan topik-topik terkait.

source: Hard Disk Basic Concepts
id: Konsep Dasar Hard Disk

source: Hard disks perform a very simple function - they store data and reliably retrieve it on command.
id: Hard disk melakukan suatu fungsi sangat sederhana - mereka menyimpan data dan secara handal mengambilnya saat diperintah.

source: When discussing issues such as disk partitioning, it is important to have a understanding of the underlying hardware; however, since the theory is very complicated and expansive, only the basic concepts will be explained here. This appendix uses a set of simplified diagrams of a disk drive to help explain what is the process and theory behind partitions.
id: Saat membahas masalah seperti partisi disk, penting untuk memiliki pemahaman tentang perangkat keras yang mendasarinya; namun, karena teorinya sangat rumit dan ekspansif, hanya konsep dasarnya yang akan dijelaskan di sini. Lampiran ini menggunakan serangkaian diagram disk drive yang disederhanakan untuk membantu menjelaskan proses dan teori di balik partisi.

source: An Unused Disk Drive
id: Sebuah Disk Drive yang Tak Terpakai

source: Image of an unused disk drive.
id: Citra dari sebuah disk drive yang tak terpakai.

source: File Systems
id: Sistem Berkas

source: To store data on a disk drive, it is necessary to _format_ the disk drive first. Formatting (usually known as "making a _file system_pass:attributes[{blank}]") writes information to the drive, creating order out of the empty space in an unformatted drive.
id: Untuk menyimpan data pada disk drive, perlu _memformat_ disk drive tersebut terlebih dahulu. Pemformatan (biasanya dikenal sebagai "membuat sebuah _sistem berkas_pass:attributes[{blank}]") menulis informasi ke drive, membuat urutan dari ruang kosong di drive yang tidak diformat.

source: Disk Drive with a File System
id: Disk Drive dengan sebuah Sistem Berkas

source: Image of a formatted disk drive.
id: Citra dari sebuah disk drive yang terformat.

source: A small percentage of the driver's available space is used to store file system-related data and can be considered as overhead.
id: Sebagian kecil dari ruang driver yang tersedia digunakan untuk menyimpan data terkait sistem berkas dan dapat dianggap sebagai overhead.

source: Disk Drive with a Different File System
id: Disk Drive dengan suatu Sistem Berkas yang Berbeda

source: Image of a disk drive with a different file system.
id: Citra dari suatu disk drive dengan sebuah sistem berkas yang berbeda.

source: Writing a file system to disk is only the first step. The goal of this process is to actually *store* and *retrieve* data. The figure below shows a drive disk after some data have been written to it:
id: Menulis suatu sistem berkas ke disk hanyalah langkah pertama. Tujuan dari proses ini adalah untuk benar-benar *menyimpan* dan *mengambil* data. Gambar di bawah menunjukkan suatu disk drive setelah sebagian data telah ditulis ke sana:

source: Disk Drive with Data Written to It
id: Disk Drive dengan Data Telah Ditulis ke Sana

source: Image of a disk drive with data written to it.
id: Image dari suatu disk drive dengan data ditulis ke sana.

source: As with most computer-related technologies, disk drives changed over time after their introduction. In particular, they got bigger. Not larger in physical size, but bigger in their capacity to store information. And, this additional capacity drove a fundamental change in the way disk drives were used.
id: Seperti dengan kebanyakan teknolog terkait komputer, disk drive berubah dengan berjalannya waktu setelah diperkenalkan. Secara khusus, mereka menjadi semakin besar. Tidak lebih besar dalam ukuran fisik, tapi lebih besar dalam kapasitas mereka untuk menyimpan informasi. Dan kapasitas tambahan ini mendorong perubahan yang mendasar dalam carai disk drive dipakai.

source: Partitions: Turning One Drive Into Many
id: Partisi: Membuat Satu Drive Menjadi Banyak

source: Disk drives can be divided into _partitions_. Each partition can be accessed as if it was a separate disk. This is done through the addition of a _partition table_.
id: Disk drive dapat dibagi menjadi _partisi_. Setiap partisi dapat diakses seolah itu disk terpisah. Ini dilakukan melalui penambahan sebuah _tabel partisi_.

source: There are several reasons for allocating disk space into separate disk partitions, for example:
id: Ada beberapa alasan untuk mengalokasikan ruang disk ke dalam partisi-partisi disk yang terpisah, misalnya:

source: Logical separation of the operating system data from the user data
id: Pemisahan logis data sistem operasi dari data pengguna

source: Ability to use different file systems
id: Kemampuan memakai sistem berkas yang berbeda

source: Ability to run multiple operating systems on one machine
id: Kemampuan menjalankan beberapa sistem operasi pada satu mesin

source: While the diagrams in this chapter show the partition table as being separate from the actual disk drive, this is not entirely accurate. In reality, the partition table is stored at the very start of the disk, before any file system or user data. But for clarity, they are separate in our diagrams.
id: Sementara diagram dalam bab ini menunjukkan tabel partisi sebagai yang terpisah dari disk drive sebenarnya, ini tidak sepenuhnya akurat. Dalam realita, tabel partisi disimpan di bagian disk paling awal, sebelum sebarang sistem berkas atau data pengguna. Tapi untuk kejelasan, mereka terpisah dalam diagram kita.

source: Disk Drive with Partition Table
id: Disk Drive dengan Tabel Partisi

source: Image of an unused disk drive with a partition table.
id: Citra dari suatu disk drive yang belum terpakai dengan sebuah tabel partisi.

source: Each partition table entry contains several important characteristics of the partition:
id: Setiap tabel partisi memuat beberapa karakteristik penting dari partisi:

source: The points on the disk where the partition starts and ends
id: Titik-titik pada disk tempat partisi dimulai dan berakhir

source: The partition's type
id: Tipe partisi

source: The type is a number that identifies the partition's anticipated usage. Some operating systems use the partition type to denote a specific file system type, to flag the partition as being associated with a particular operating system, to indicate that the partition contains a bootable operating system, or some combination of the three.
id: Jenisnya adalah angka yang mengidentifikasi penggunaan yang diantisipasi partisi. Beberapa sistem operasi menggunakan jenis partisi untuk menunjukkan jenis sistem berkas tertentu, untuk menandai partisi sebagai terkait dengan sistem operasi tertentu, untuk menunjukkan bahwa partisi berisi sistem operasi yang dapat di-boot, atau beberapa kombinasi dari ketiganya.

source: Disk Drive With Single Partition
id: Disk Drive Dengan Partisi Tunggal

source: Image of a disk drive with a single partition.
id: Citra dari suatu disk drive dengan partisi tunggal.

source: The single partition in this example is labeled as `DOS`. This label shows the *partition type*, with `DOS` being one of the most common ones. The table below shows a list of some of the commonly used partition types and hexadecimal numbers used to represent them.
id: Partisi tunggal dalam contoh ini diberi label sebagai `DOS`. Label ini menunjukkan *jenis partisi*, dengan `DOS` menjadi salah satu yang paling umum. Tabel di bawah ini menunjukkan daftar beberapa jenis partisi yang umum digunakan dan angka heksadesimal yang digunakan untuk mewakilinya.

source: Partition Types
id: Tipe Partisi

source: |Partition Type|Value|Partition Type|Value |Empty|00|Novell Netware 386|65 |DOS 12-bit FAT|01|PIC/IX|75 |XENIX root|02|Old MINIX|80 |XENIX usr|03|Linux/MINUX|81 |DOS 16-bit <=32M|04|Linux swap|82 |Extended|05|Linux native|83 |DOS 16-bit >=32|06|Linux extended|85 |OS/2 HPFS|07|Amoeba|93 |AIX|08|Amoeba BBT|94 |AIX bootable|09|BSD/386|a5 |OS/2 Boot Manager|0a|OpenBSD|a6 |Win95 FAT32|0b|NEXTSTEP|a7 |Win95 FAT32 (LBA)|0c|BSDI fs|b7 |Win95 FAT16 (LBA)|0e|BSDI swap|b8 |Win95 Extended (LBA)|0f|Syrinx|c7 |Venix 80286|40|CP/M|db |Novell|51|DOS access|e1 |PReP Boot|41|DOS R/O|e3 |GNU HURD|63|DOS secondary|f2 |Novell Netware 286|64|BBT|ff
id: |Tipe Partisi|Nilai|Tipe Partisi|Nilai |Kosong|00|Novell Netware 386|65 |DOS 12-bit FAT|01|PIC/IX|75 |XENIX root|02|MINIX lama|80 |XENIX usr|03|Linux/MINUX|81 |DOS 16-bit <=32M|04|Linux swap|82 |Extended|05|Linux native|83 |DOS 16-bit >=32|06|Linux extended|85 |OS/2 HPFS|07|Amoeba|93 |AIX|08|Amoeba BBT|94 |AIX bootable|09|BSD/386|a5 |OS/2 Boot Manager|0a|OpenBSD|a6 |Win95 FAT32|0b|NEXTSTEP|a7 |Win95 FAT32 (LBA)|0c|BSDI fs|b7 |Win95 FAT16 (LBA)|0e|BSDI swap|b8 |Win95 Extended (LBA)|0f|Syrinx|c7 |Venix 80286|40|CP/M|db |Novell|51|DOS access|e1 |PReP Boot|41|DOS R/O|e3 |GNU HURD|63|DOS sekunder|f2 |Novell Netware 286|64|BBT|ff

source: Partitions Within Partitions - An Overview of Extended Partitions
id: Partisi Dalam Partisi - Ringkasan dari Partisi Extended

source: Disk Drive With Extended Partition
id: Disk Drive Dengan Partisi Extended

source: Image of a disk drive with an extended partition.
id: Gambar disk drive dengan partisi extended.

source: As this figure implies, there is a difference between primary and logical partitions - there can only be four primary partitions, but there is no fixed limit to the number of logical partitions that can exist. However, due to the way in which partitions are accessed in Linux, no more than 12 logical partitions should be defined on a single disk drive.
id: Seperti yang tersirat dalam gambar ini, ada perbedaan antara partisi primer dan logis - hanya ada empat partisi utama, tetapi tidak ada batasan tetap untuk jumlah partisi logis yang dapat ada. Namun, karena cara di mana partisi diakses di Linux, tidak lebih dari 12 partisi logis harus didefinisikan pada satu disk drive.

source: GUID Partition Table (*GPT*) is a newer partitioning scheme based on using Globally Unique Identifiers (*GUID*). *GPT* was developed to cope with limitations of the *MBR* partition table, especially with the limited maximum addressable storage space of a disk. Unlike *MBR*, which is unable to address storage space larger than 2.2 terabytes, *GPT* can be used with hard disks larger than this; the maximum addressable disk size is 2.2 zettabytes. In addition, *GPT* by default supports creating up to 128 primary partitions. This number could be extended by allocating more space to the partition table.
id: Guid Partition Table (*GPT*) adalah skema partisi yang lebih baru berdasarkan penggunaan Globally Unique Identifiers (*GUID*). *GPT* dikembangkan untuk mengatasi keterbatasan tabel partisi *MBR*, terutama dengan terbatasnya ruang penyimpanan maksimum disk yang dapat dialamatkan. Tidak seperti *MBR*, yang tidak bisa mengalamati ruang penyimpanan lebih dari 2,2 terabyte, *GPT* dapat digunakan dengan hard disk yang lebih besar dari ini; ukuran disk maksimum yang dapat dialamatkan adalah 2,2 zettabyte. Selain itu, *GPT* secara baku mendukung pembuatan hingga 128 partisi utama. Cacah ini dapat diperluas dengan mengalokasikan lebih banyak ruang ke tabel partisi.

source: *GPT* disks use logical block addressing (LBA) and the partition layout is as follows:
id: Disk *GPT* menggunakan pengalamatan blok logis (LBA) dan tata letak partisi adalah sebagai berikut:

source: The _primary *GPT* header_ begins on the second logical block (*LBA* 1) of the device. The header contains the disk GUID, the location of the primary partition table, the location of the secondary GPT header, and CRC32 checksums of itself and the primary partition table. It also specifies the number of partition entries of the table.
id: _Header *GPT* primer_ dimulai pada blok logis kedua (*LBA* 1) dari perangkat. Header berisi GUID disk, lokasi tabel partisi primer, lokasi header GPT sekunder, dan checksum CRC32 itu sendiri dan tabel partisi primer. Ini juga menentukan cacah entri partisi tabel.

source: The _primary *GPT* table_ includes, by default, 128 partition entries, each with an entry size 128 bytes, its partition type GUID and unique partition GUID.
id: _Tabel *GPT* primer_ mencakup, secara baku, 128 entri partisi, masing-masing dengan ukuran entri 128 byte, GUID jenis partisinya, dan GUID partisi unik.

source: The _secondary *GPT* table_ is identical to the primary *GPT* table. It is used mainly as a backup table for recovery in case the primary partition table is corrupted.
id: _Tabel *GPT* sekunder_ identik dengan tabel *GPT* primer. Ini digunakan terutama sebagai tabel cadangan untuk pemulihan jika tabel partisi primer rusak.

source: The _secondary *GPT* header_ is located on the last logical sector of the disk and it can be used to recover *GPT* information in case the primary header is corrupted. It contains the disk GUID, the location of the secondary partition table and the primary *GPT* header, CRC32 checksums of itself and the secondary partition table, and the number of possible partition entries.
id: _Header *GPT* sekunder_ terletak di sektor logis terakhir dari disk dan dapat digunakan untuk memulihkan informasi *GPT* jika header primer rusak. Ini berisi GUID disk, lokasi tabel partisi sekunder dan header *GPT* primer, checksum CRC32 dari dirinya sendiri dan tabel partisi sekunder, dan cacah entri partisi yang mungkin.

source: There must be a BIOS boot partition for the boot loader to be installed successfully onto a disk that contains a GPT (GUID Partition Table). This includes disks initialized by [application]*Anaconda*. If the disk already contains a BIOS boot partition, it can be reused.
id: Harus ada partisi boot BIOS agar boot loader berhasil dipasang ke disk yang berisi GPT (GUID Partition Table). Ini termasuk disk yang diinisialisasi oleh [application]*Anaconda*. Jika disk sudah berisi partisi boot BIOS, itu dapat digunakan kembali.

source: Strategies for Disk Repartitioning
id: Strategi untuk Repartisi Disk

source: There are several different ways that a disk can be repartitioned. This section discusses the following possible approaches:
id: Ada beberapa cara yang berbeda bahwa disk dapat dipartisi ulang. Bagian ini membahas kemungkinan pendekatan berikut:

source: Unpartitioned free space is available
id: Tersedia ruang kosong yang tidak dipartisi

source: An unused partition is available
id: Tersedia partisi yang tidak digunakan

source: Free space in an actively used partition is available
id: Tersedia ruang kosong dalam partisi yang aktif digunakan

source: Note that this section discusses the aforementioned concepts only theoretically and it does not include any procedures showing how to perform disk repartitioning step-by-step. Such detailed information are beyond the scope of this document.
id: Perhatikan bahwa bagian ini membahas konsep-konsep yang disebutkan di atas hanya secara teoritis dan tidak termasuk prosedur yang menunjukkan bagaimana melakukan partisi ulang disk langkah demi langkah. Informasi terperinci tersebut berada di luar cakupan dokumen ini.

source: Keep in mind that the following illustrations are simplified in the interest of clarity and do not reflect the exact partition layout that you encounter when actually installing {PRODUCT}.
id: Perlu diingat bahwa ilustrasi berikut disederhanakan untuk kepentingan kejelasan dan tidak mencerminkan tata letak partisi yang tepat yang Anda temui ketika benar-benar memasang {PRODUCT}.

source: Using Unpartitioned Free Space
id: Menggunakan Ruang Kosong Yang Tidak Dipartisi

source: Disk Drive with Unpartitioned Free Space
id: Disk Drive dengan Ruang Kosong Yang Tidak Dipartisi

source: Image of a disk drive with unpartitioned free space
id: Gambar disk drive dengan ruang kosong yang tidak dipartisi

source: In the above example, `1` represents an undefined partition with unallocated space and `2` represents a defined partition with allocated space.
id: Dalam contoh di atas, `1` mewakili partisi yang tidak terdefinisi dengan ruang yang tidak teralokasikan dan `2` mewakili partisi yang ditentukan dengan ruang yang dialokasikan.

source: An unused hard disk also falls into this category. The only difference is that *all* the space is not part of any defined partition.
id: Hard disk yang tidak terpakai juga termasuk dalam kategori ini. Satu-satunya perbedaan adalah bahwa *semua* ruang bukan bagian dari partisi yang ditentukan.

source: Using Space from an Unused Partition
id: Menggunakan Ruang dari Partisi yang Tidak Digunakan

source: Disk Drive with an Unused Partition
id: Disk Drive dengan Partisi yang Tidak Digunakan

source: Image of a disk drive with an unused partition
id: Gambar disk drive dengan partisi yang tidak digunakan

source: In the above example, `1` represents an unused partition and `2` represents reallocating an unused partition for Linux.
id: Dalam contoh di atas, `1` mewakili partisi yang tidak digunakan dan `2` mewakili realokasi partisi yang tidak digunakan untuk Linux.

source: In this situation, you can use the space allocated to the unused partition. You first must delete the partition and then create the appropriate Linux partition(s) in its place. You can delete the unused partition and manually create new partitions during the installation process.
id: Dalam situasi ini, Anda dapat menggunakan ruang yang dialokasikan ke partisi yang tidak digunakan. Terlebih dahulu Anda harus menghapus partisi dan kemudian membuat partisi Linux yang sesuai menggantikannya. Anda dapat menghapus partisi yang tidak digunakan dan membuat partisi baru secara manual selama proses instalasi.

source: Using Free Space from an Active Partition
id: Menggunakan Ruang Kosong dari Partisi Aktif

source: This is the most common situation. It is also, unfortunately, the hardest to handle. The main problem is that, even if you have enough free space, it is presently allocated to a partition that is already in use. If you purchased a computer with pre-installed software, the hard disk most likely has one massive partition holding the operating system and data.
id: Ini adalah situasi yang paling umum. Sayangnya, ini juga yang paling sulit untuk ditangani. Masalah utamanya adalah, bahkan jika Anda memiliki cukup ruang kosong, saat ini dialokasikan ke partisi yang sudah digunakan. Jika Anda membeli komputer dengan perangkat lunak ter-pra-instalasi, hard disk kemungkinan besar memiliki satu partisi besar yang memegang sistem operasi dan data.

source: Aside from adding a new hard drive to your system, you have two choices:
id: Selain menambahkan hard drive baru ke sistem Anda, Anda memiliki dua pilihan:

source: *Destructive Repartitioning*
id: *Repartisi Destruktif*

source: In this case, the single large partition is deleted and several smaller ones are created instead. Any data held in the original partition is destroyed. This means that making a complete backup is necessary. It is highly recommended to make two backups, use verification (if available in your backup software), and try to read data from the backup *before* deleting the partition.
id: Dalam hal ini, partisi besar tunggal dihapus dan beberapa yang lebih kecil dibuat sebagai gantinya. Setiap data yang disimpan di partisi asli dihancurkan. Ini berarti bahwa membuat cadangan lengkap diperlukan. Sangat disarankan untuk membuat dua cadangan, menggunakan verifikasi (jika tersedia di perangkat lunak cadangan Anda), dan mencoba membaca data dari cadangan *sebelum* menghapus partisi.

source: If an operating system was installed on that partition, it must be reinstalled if you want to use that system as well. Be aware that some computers sold with pre-installed operating systems may not include the installation media to reinstall the original operating system. You should check whether this applies to your system is *before* you destroy your original partition and its operating system installation.
id: Jika sistem operasi dipasang pada partisi itu, itu harus dipasang ulang jika Anda ingin menggunakan sistem itu juga. Ketahuilah bahwa beberapa komputer yang dijual dengan sistem operasi ter-pra-instalasi mungkin tidak menyertakan media instalasi untuk memasang ulang sistem operasi asli. Anda harus memeriksa apakah ini berlaku untuk sistem Anda *sebelum* Anda menghancurkan partisi asli Anda dan instalasi sistem operasinya.

source: Disk Drive Being Destructively Repartitioned
id: Disk Drive Sedang Dipartisi Ulang secara Destruktif

source: Image of a disk drive being destructively repartitioned
id: Gambar disk drive yang sedang dipartisi ulang secara destruktif

source: In the above example, `1` represents before and `2` represents after.
id: Dalam contoh di atas, `1` mewakili sebelum dan `2` mewakili setelah.

source: Any data previously present in the original partition is lost.
id: Data apa pun yang sebelumnya ada di partisi asli hilang.

source: *Non-Destructive Repartitioning*
id: *Repartisi Non-Destruktif*

source: With non-destructive repartitioning you execute a program that makes a big partition smaller without losing any of the files stored in that partition. This method is usually reliable, but can be very time-consuming on large drives.
id: Dengan repartisi non-destruktif Anda mengeksekusi program yang membuat partisi besar lebih kecil tanpa kehilangan salah satu berkas yang disimpan dalam partisi itu. Metode ini biasanya dapat diandalkan, tetapi bisa sangat memakan waktu pada drive besar.

source: While the process of non-destructive repartitioning is rather straightforward, there are three steps involved:
id: Sementara proses repartisi non-destruktif agak mudah, ada tiga langkah yang terlibat:

source: Compress and backup existing data
id: Mengompres dan mencadangkan data yang ada

source: Resize the existing partition
id: Mengubah ukuran partisi yang ada

source: Create new partition(s)
id: Membuat partisi baru

source: Each step is described further in more detail.
id: Setiap langkah dijelaskan lebih lanjut secara lebih rinci.

source: Disk Drive Being Compressed
id: Disk Drive Sedang Dikompresi

source: Image of a disk drive being compressed
id: Gambar disk drive yang sedang dikompresi

source: This step is crucial. Without it, the location of the data could prevent the partition from being resized to the extent desired. Note also that, for one reason or another, some data cannot be moved. If this is the case (and it severely restricts the size of your new partition(s)), you may be forced to destructively repartition your disk.
id: Langkah ini sangat penting. Tanpa itu, lokasi data dapat mencegah partisi diubah ukurannya sejauh yang diinginkan. Perhatikan juga bahwa, karena satu dan lain alasan, sebagian data tidak dapat dipindahkan. Jika ini masalahnya (dan sangat membatasi ukuran partisi baru Anda), Anda mungkin dipaksa untuk secara merusak repartisi disk Anda.

source: Disk Drive with Partition Resized
id: Disk Drive dengan Partisi Diubah Ukurannya

source: Image of a disk drive with a resized partition
id: Gambar disk drive dengan partisi yang diubah ukurannya
