Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/appendixes/Disk_Partitions.po
Languages: id

source: It is important to understand what the resizing software you use does with the newly freed space, so that you can take the appropriate steps. In the case illustrated here, it would be best to delete the new DOS partition and create the appropriate Linux partition(s).
id: Penting untuk memahami apa yang dilakukan perangkat lunak pengubah ukuran yang Anda gunakan dengan ruang yang baru dibebaskan, sehingga Anda dapat mengambil langkah-langkah yang tepat. Dalam kasus yang diilustrasikan di sini, akan lebih baik untuk menghapus partisi DOS baru dan membuat partisi Linux yang sesuai.

source: Disk Drive with Final Partition Configuration
id: Disk Drive dengan Konfigurasi Partisi Akhir

source: Image of a disk drive with final partition configuration
id: Gambar disk drive dengan konfigurasi partisi akhir

source: Partition Naming Schemes and Mount Points
id: Skema Penamaan Partisi dan Titik Kait

source: Partition Naming Scheme
id: Skema Penamaan Partisi

source: Linux uses a naming scheme that is file-based, with file names in the form of `/dev/pass:attributes[{blank}]_xxyN_pass:attributes[{blank}]`.
id: Linux menggunakan skema penamaan yang berbasis berkas, dengan nama berkas dalam bentuk `/dev/pass:attributes[{blank}]_xxyN_pass:attributes[{blank}]`.

source: Device and partition names consist of the following:
id: Nama perangkat dan partisi terdiri dari yang berikut:

source: This is the name of the directory in which all device files reside. Because partitions reside on hard disks, and hard disks are devices, the files representing all possible partitions reside in `/dev/`.
id: Ini adalah nama direktori di mana semua berkas perangkat berada. Karena partisi berada di hard disk, dan hard disk adalah perangkat, berkas yang mewakili semua partisi yang mungkin, berada di `/dev/`.

source: The first two letters of the partition name indicate the type of device on which the partition resides, usually `sd`.
id: Dua huruf pertama dari nama partisi menunjukkan jenis perangkat di mana partisi berada, biasanya `sd`.

source: This letter indicates which device the partition is on. For example, `/dev/sda` for the first hard disk, `/dev/sdb` for the second, and so on.
id: Huruf ini menunjukkan perangkat mana partisi berada. Misalnya, `/dev/sda` untuk hard disk pertama, `/dev/sdb` untuk yang kedua, dan seterusnya.

source: The final number denotes the partition. The first four (primary or extended) partitions are numbered `1` through `4`. Logical partitions start at `5`. So, for example, `/dev/sda3` is the third primary or extended partition on the first hard disk, and `/dev/sdb6` is the second logical partition on the second hard disk.
id: Angka akhir menunjukkan partisi. Empat partisi pertama (primer atau extended) diberi nomor `1` hingga `4`. Partisi logis dimulai dari `5`. Jadi, misalnya, `/dev/sda3` adalah partisi primer atau extended ketiga pada hard disk pertama, dan `/dev/sdb6` adalah partisi logis kedua pada hard disk kedua.

source: Even if your system can identify and refer to all types of disk partitions, it might not be able to *read* the file system and therefore access stored data on every partition type. However, in many cases, it is possible to successfully access data on a partition dedicated to another operating system.
id: Bahkan jika sistem Anda dapat mengidentifikasi dan merujuk ke semua jenis partisi disk, itu mungkin tidak dapat *membaca* sistem berkas dan karenanya tidak bisa mengakses data yang tersimpan pada setiap jenis partisi. Namun, dalam banyak kasus, adalah mungkin untuk berhasil mengakses data pada partisi yang didedikasikan untuk sistem operasi lain.

source: Disk Partitions and Mount Points
id: Partisi Disk dan Titik Kait

source: Each partition is used to form part of the storage necessary to support a single set of files and directories. This is done by associating a partition with a directory through a process known as _mounting_. Mounting a partition makes its storage available starting at the specified directory (known as a _mount point_).
id: Setiap partisi digunakan untuk membentuk bagian dari penyimpanan yang diperlukan untuk mendukung satu set berkas dan direktori. Ini dilakukan dengan mengaitkan partisi dengan direktori melalui proses yang dikenal sebagai _mounting_ (mengait). Mengait partisi membuat penyimpanannya tersedia mulai dari direktori yang ditentukan (dikenal sebagai _mount point_ atau titik kait).

source: For example, if partition `/dev/sda5` is mounted on `/usr/`, that would mean that all files and directories under `/usr/` physically reside on `/dev/sda5`. So the file `/usr/share/doc/FAQ/txt/Linux-FAQ` would be stored on `/dev/sda5`, while the file `/etc/gdm/custom.conf` would not.
id: Misalnya, jika partisi `/dev/sda5` dikait pada `/usr/`, itu berarti bahwa semua berkas dan direktori di bawah `/usr/` secara fisik berada di `/dev/sda5`. Jadi berkas `/usr/share/doc/FAQ/txt/Linux-FAQ` akan disimpan di `/dev/sda5`, sedangkan berkas `/etc/gdm/custom.conf` tidak akan.

source: Continuing the example, it is also possible that one or more directories below `/usr/` would be mount points for other partitions. For instance, a partition (say, `/dev/sda7`) could be mounted on `/usr/local/`, meaning that `/usr/local/man/whatis` would then reside on `/dev/sda7` rather than `/dev/sda5`.
id: Melanjutkan contoh, mungkin juga bahwa satu atau lebih direktori di bawah `/usr/` akan menjadi titik kait untuk partisi lain. Misalnya, partisi (katakanlah, `/dev/sda7`) dapat dikait pada `/usr/local/`, yang berarti bahwa `/usr/local/man/whatis` kemudian akan berada di `/dev/sda7` bukan `/dev/sda5`.

source: How Many Partitions?
id: Berapa Banyak Partisi?

source: At this point in the process of preparing to install {PRODUCT}, you should give some consideration to the number and size of the partitions to be used by your new operating system. However, there is no one right answer to this question. It depends on your needs and requirements.
id: Pada titik ini dalam proses mempersiapkan untuk memasang {PRODUCT}, Anda harus memberikan beberapa pertimbangan untuk cacah dan ukuran partisi yang akan digunakan oleh sistem operasi baru Anda. Namun, tidak ada jawaban yang benar untuk pertanyaan ini. Itu tergantung pada kebutuhan dan persyaratan Anda.
