Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f34/pages/_partials/install/CustomSpoke_AddBtrfs.po
Languages: pt_br

source: Creating a Btrfs Layout
pt_br: Criando um layout Btrfs

source: _Btrfs_ is a type of file system, but it has several features characteristic of a storage device. It is designed to make the file system tolerant of errors, and to facilitate the detection and repair of errors when they occur. It uses checksums to ensure the validity of data and metadata, and supports snapshots that can be used for backup, replication, and namespace isolation (e.g. for use in containers).
pt_br: _Btrfs_ é um tipo de sistema de arquivos, mas possui vários recursos característicos de um dispositivo de armazenamento. Ele é projetado para tornar o sistema de arquivos tolerante a erros e para facilitar a detecção e o reparo de erros quando eles ocorrerem. Ele usa somas de verificação para garantir a validade dos dados e metadados e oferece suporte a instantâneos que podem ser usados para backup, replicação e isolamento de namespace (por exemplo, para uso em contêineres).

source: Creating a Btrfs layout is somewhat similar to LVM (described in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Creating a Logical Volume Management (LVM) Layout]) with slightly different terminology. A Btrfs _volume_ is the equivalent of an LVM volume group, and a Btrfs _subvolume_ is similar to a LVM logical volume. An important difference to note is how [application]*Anaconda* reports sizes for separate mount points: For LVM, the exact size of each logical volume is shown next to each mount point in the left pane, while with Btrfs, the total size of the entire volume is shown next to each subvolume.
pt_br: A criação de um layout Btrfs é um pouco semelhante ao LVM (descrito em xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Criando um layout de Gerenciamento de Volume Lógico (LVM)]) com terminologia ligeiramente diferente. Um _volume_ Btrfs é o equivalente a um grupo de volume LVM e um _subvolume_ Btrfs é semelhante a um volume lógico LVM. Uma diferença importante a ser observada é como o [application]*Anaconda* relata tamanhos para pontos de montagem separados: Para LVM, o tamanho exato de cada volume lógico é mostrado próximo a cada ponto de montagem no painel esquerdo, enquanto com Btrfs, o tamanho total de todo o volume é mostrado próximo a cada subvolume.

source: Some partition types - notably the BIOS Boot and EFI partitions - cannot be placed on Btrfs subvolumes. Use standard physical volumes for them. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for more information.
pt_br: Alguns tipos de partição - notadamente as partições BIOS Boot e EFI - não podem ser colocados em subvolumes Btrfs. Use volumes físicos padrão para eles. Veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Esquema de particionamento recomendado] para obter mais informações.

source: Create Btrfs Subvolume
pt_br: Criar subvolume Btrfs

source: The Manual Partitioning screen
pt_br: A tela Particionamento manual

source: Follow the procedure below to create Btrfs volumes and subvolumes:
pt_br: Siga o procedimento abaixo para criar volumes e subvolumes Btrfs:

source: Creating Btrfs Subvolumes and Volumes
pt_br: Criando subvolumes e volumes Btrfs

source: Click the `+` button at the bottom of the list showing existing mount points. A new dialog window will open.
pt_br: Clique no botão `+` na parte inferior da lista mostrando os pontos de montagem existentes. Uma nova janela de diálogo será aberta.

source: In the new dialog window, specify a mount point for which you want to create a separate subvolume - for example, `/`. Anaconda will create a Btrfs subvolume for each mount point you create. Similar to directories, subvolumes have no discrete size of their own. Finally, click `Add mount point` to add the subvolume and return to the main partitioning screen.
pt_br: Na nova janela de diálogo, especifique um ponto de montagem para o qual deseja criar um subvolume separado – por exemplo, `/`. O Anaconda criará um subvolume Btrfs para cada ponto de montagem que você criar. Semelhante aos diretórios, os subvolumes não têm tamanho distinto próprio. Finalmente, clique em `Adicionar um ponto de montagem` para adicionar o subvolume e retornar à tela principal de particionamento.

source: When creating a mount point for swap on Btrfs, specify the mount point as `swap`.
pt_br: Ao criar um ponto de montagem para swap no Btrfs, especifique o ponto de montagem como `swap`.

source: Once the mount point is created, select the newly created mount point in the left pane, and configure it further in the right pane. When finished, click `Update Settings` in the bottom right corner of the screen.
pt_br: Assim que o ponto de montagem for criado, selecione o ponto de montagem recém-criado no painel esquerdo e configure-o posteriormente no painel direito. Quando terminar, clique em `Atualizar configurações` no canto inferior direito da tela.

source: In the `Volume` area, you can see that the mount point's subvolume has been assigned to an automatically created volume. Click the `Modify` button under the drop-down menu to access the configure volume settings.
pt_br: Na área `Volume`, você pode ver que o subvolume do ponto de montagem foi atribuído a um volume criado automaticamente. Clique no botão `Modificar` no menu suspenso para acessar as configurações de ajuste de volume.

source: In the `Configure Volume` dialog, you can change the volume's name, whether it's encrypted, its `RAID level` (see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types] for information about available RAID types), and you can also specify which physical devices (disks) this volume should reside on. You can select one or more disks which will be used to hold this volume by holding down kbd:[Ctrl] and clicking each disk in the list.
pt_br: Na caixa de diálogo `Configurar volume`, você pode alterar o nome do volume, se está criptografado, seu `Nível de RAID` (veja xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Tipos de dispositivos, sistemas de arquivos e RAID] para obter informações sobre os tipos de RAID disponíveis), e você também pode especificar em quais dispositivos físicos (discos) este volume deve residir. Você pode selecionar um ou mais discos que serão usados para manter este volume, mantendo pressionado kbd:[Ctrl] e clicando em cada disco na lista.

source: The installer supports LUKS encryption of entire Btrfs volumes. To enable, click on the Modify button under Volume. Then check Encrypt. See the [citetitle]_{PRODUCT} Security Guide_, available at link:++https://docs.fedoraproject.org/++[], for information about LUKS disk encryption.
pt_br: O instalador oferece suporte à criptografia LUKS de volumes Btrfs inteiros. Para ativar, clique no botão Modificar em Volume. Em seguida, marque Criptografar. Veja o [citetitle]_{PRODUCT} Security Guide_ (guia de segurança), disponível em link:++https://docs.fedoraproject.org/++[], para obter informações sobre criptografia de disco LUKS.

source: Additionally, you can set a fixed size for the volume by selecting the `Fixed` option from the `Size policy` menu and entering a size for the volume group.
pt_br: Além disso, você pode definir um tamanho fixo para o volume selecionando a opção `Fixo` no menu` Política de tamanho` e inserindo um tamanho para o grupo de volume.

source: After you finish configuring the Btrfs volume settings, click `Save` to return to the main `Manual Partitioning` screen.
pt_br: Depois de definir as configurações de volume do Btrfs, clique em `Salvar` para retornar à tela principal` Particionamento manual`.

source: If you need to create more than one Btrfs volume, open the `Volume` drop-down menu and select the `Create a new volume` option. A new dialog window will open, identical to the one described in the previous step. Again, select a name, storage devices, encryption settings, RAID level and size policy for the new volume, and click `Save`. The new volume will then become available in the `Volume` drop-down menu; you can then go through your existing mount points and change this setting to assign them to a different volume.
pt_br: Se você precisar criar mais de um volume Btrfs, abra o menu suspenso `Volume` e selecione a opção `Criar um novo volume`. Uma nova janela de diálogo será aberta, idêntica à descrita na etapa anterior. Novamente, selecione um nome, dispositivos de armazenamento, configurações de criptografia, nível de RAID e política de tamanho para o novo volume e clique em `Salvar`. O novo volume ficará disponível no menu suspenso `Volume`; você pode então percorrer seus pontos de montagem existentes e alterar esta configuração para atribuí-los a um volume diferente.

source: Configure other settings specific to the subvolume - its `Mount Point`, `Device Type`, and `Name`. Press `Update Settings` to apply any changes to the configuration.
pt_br: Configure outras configurações específicas para o subvolume – seu `Ponto de montagem`, `Tipo de dispositivo` e `Nome`. Pressione `Atualizar configurações` para aplicar quaisquer alterações à configuração.

source: Repeat this procedure for any additional Btrfs subvolumes you want to create. Note that when creating additional subvolumes, a new volume is not automatically created each time; instead, any additional subvolumes are assigned to an existing volume.
pt_br: Repita este procedimento para quaisquer subvolumes Btrfs adicionais que você deseja criar. Observe que, ao criar subvolumes adicionais, um novo volume não é criado automaticamente a cada vez; em vez disso, quaisquer subvolumes adicionais são atribuídos a um volume existente.

source: For each mount point you create, review its settings and make sure that it is assigned to the correct volume, that it has sufficient capacity, and that it has a descriptive name so you can identify the subvolume.
pt_br: Para cada ponto de montagem que você criar, revise suas configurações e certifique-se de que esteja atribuído ao volume correto, que tenha capacidade suficiente e que tenha um nome descritivo para que você possa identificar o subvolume.
