Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f34/pages/_partials/install/CustomSpoke.po
Languages: fi

source: Manual Partitioning
fi: Manuaalinen osiointi

source: The `Manual Partitioning` screen allows you to create a storage configuration for your {PRODUCT} system manually, giving you a greater control over your system's storage.
fi: "Manuaalinen osiointi" -näytössä voit luoda tallennuskokoonpanon {PRODUCT} -järjestelmällesi manuaalisesti, jolloin voit hallita paremmin järjestelmäsi tallennustilaa.

source: [application]*Anaconda* uses an opposite approach. First, you create all separate mount points you need, and everything needed to create them (creating a volume group, logical volumes inside it, and physical volumes where the volume group will reside) is performed automatically. You can then adjust the automatic settings as you require.
fi: [sovellus]*Anaconda* käyttää päinvastaista lähestymistapaa. Ensin luot kaikki tarvitsemasi erilliset liitoskohdat, ja kaikki niiden luomiseen tarvittava (taltioryhmän luominen, sen sisällä olevat loogiset taltiot ja fyysiset taltiot, joissa taltioryhmä sijaitsee) suoritetaan automaattisesti. Tämän jälkeen voit säätää automaattisia asetuksia tarpeen mukaan.

source: No permanent changes will be made to your disks during the actual partitioning process. The configuration you have selected will only be written to your system after you press the `Begin installation` button in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
fi: Varsinaisen osiointiprosessin aikana levyihin ei tehdä pysyviä muutoksia. Valitsemasi kokoonpano kirjoitetaan järjestelmääsi vasta sen jälkeen, kun painat `Aloita asennus` -painiketta kohdassa xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Asennusyhteenveto].

source: The Manual Partitioning screen. At this point
fi: Manuaalinen osiointi -näyttö. Tässä tilanteessa

source: When you first open the `Manual Partitioning` screen, the column on the left side will display all previously existing partitions on all drives which you selected as installation targets in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]. If none of the selected drives contain any existing partitions, then a message informing you that no mount points currently exist will appear.
fi: Kun avaat Manuaalinen osiointi -näytön ensimmäisen kerran, vasemman reunan sarake näyttää kaikki olemassa olevat osiot kaikissa asemissa, jotka valitsit asennuskohteiksi tiedostossa xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning [Asennuskohde]. Jos mikään valituista asemista ei sisällä olemassa olevia osioita, näyttöön tulee viesti, joka ilmoittaa, ettei liitospisteitä ole tällä hetkellä.

source: Here, you can choose a partitioning scheme such as `LVM` or `BTRFS` and click the `Click here to create them automatically` to prompt the installer to create a basic partitioning layout; this layout follows the guidelines described in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme]. The created layout is a basic layout where partition/volume sizes are determined automatically based on the total amount of available space.
fi: Täällä voit valita osiointimallin, kuten `LVM` tai `BTRFS`, ja napsauta `Luo ne automaattisesti napsauttamalla tästä` pyytääksesi asennusohjelmaa luomaan perusosiointiasettelun. Tämä asettelu noudattaa ohjeita, jotka on kuvattu kohdassa xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Suositeltu osiointikaavio]. Luotu asettelu on perusasettelu, jossa osion/taltion koot määritetään automaattisesti käytettävissä olevan tilan kokonaismäärän perusteella.

source: Click the `+` button to add a mount point. In the dialog window that opens, choose a mount point such as `/` or `/home`, and the desired capacity for the mount point (such as `10GB` or `500MB`). Note that specifying the mount point is mandatory, but you do not have to specify the capacity at this point; this is useful when adding a mount point which you want to make larger than the current available space permits. Then, click `Add mount point` to add it to the list using the default settings, which means it will be created as a logical volume, and a new volume group will be created for it unless one already exists.
fi: Lisää liitoskohta napsauttamalla +-painiketta. Valitse avautuvasta valintaikkunasta liitoskohta, kuten `/` tai `/home`, ja haluttu liitäntäpisteen kapasiteetti (kuten `10 Gt` tai `500 Mt`). Huomaa, että liitoskohdan määrittäminen on pakollista, mutta sinun ei tarvitse määrittää kapasiteettia tässä vaiheessa. Tämä on hyödyllistä lisättäessä liitoskohtaa, jonka haluat tehdä suuremmiksi kuin käytettävissä oleva tila sallii. Napsauta sitten Lisää liitoskohta lisätäksesi sen luetteloon oletusasetuksia käyttäen, mikä tarkoittaa, että se luodaan loogisena taltiona ja sille luodaan uusi taltioryhmä, ellei sellaista ole jo olemassa.

source: Then, select the newly created mount point in the list on the left side. A set of controls will display on the right side of the screen, allowing you to change its mount point, the device on which it will physically reside, its capacity, file system, etc. When you change any settings, press `Update Settings` on the bottom right. This will save the adjusted configuration; you can now create another mount point, or select a different existing one and adjust its settings as well.
fi: Valitse sitten äskettäin luotu kiinnityspiste vasemmalla olevasta luettelosta. Näytön oikealla puolella näkyy joukko säätimiä, joiden avulla voit muuttaa sen liitoskohtaa, laitetta, jossa se fyysisesti sijaitsee, sen kapasiteettia, tiedostojärjestelmää jne. Kun muutat asetuksia, paina "Päivitä asetukset" oikeassa alakulmassa. Tämä tallentaa säädetyt asetukset; voit nyt luoda toisen kiinnityspisteen tai valita jo olemassa olevan ja säätää myös sen asetuksia.

source: For a description of available device and file system types, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types].
fi: Kuvaus saatavilla olevista laite- ja tiedostojärjestelmätyypeistä on kohdassa xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[laite-, tiedostojärjestelmä- ja RAID-tyypit].

source: To remove a mount point, select it in the list and press the `-` button below.
fi: Voit poistaa liitoskohdan valitsemalla sen luettelosta ja painamalla alla olevaa `-` -painiketta.

source: The exact steps for configuring your storage depend on your specific needs and your system configuration. Procedures for creating specific layouts are described further in this chapter. Before you start, you should also review xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] and xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-advice[Advice on Partitions] for a list of requirements and tips for partitioning your disks for {PRODUCT}.
fi: Tallennustilan määrittämisen tarkat vaiheet riippuvat erityistarpeistasi ja järjestelmäkokoonpanostasi. Tiettyjen asettelujen luontimenettelyt kuvataan tarkemmin tässä luvussa. Ennen kuin aloitat, sinun tulee myös tarkistaa xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Suositeltu osiointikaavio] ja xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-manual -advice[Osioiden neuvoja] saadaksesi luettelon vaatimuksista ja vihjeistä {PRODUCT} -levyjen osiointiin.

source: Below the list of existing mount points are two fields, showing you how much free space is left on your storage devices and how much total space they have.
fi: Olemassa olevien liitoskohtien luettelon alla on kaksi kenttää, jotka näyttävät kuinka paljon vapaata tilaa tallennuslaitteissasi on jäljellä ja kuinka suuria laitteet ovat on.

source: Click the `pass:attributes[{blank}]_X_ storage devices selected` to view a summary of currently selected storage devices; this may help you with orientation in more complicated storage schemas. Devices displayed here are the ones you have selected in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]. If you want to add or remove any storage devices from your configuration, return to that screen and change your selection.
fi: Napsauta `pass:attributes[{blank}]_X_ tallennuslaitetta valittuna` nähdäksesi yhteenvedon tällä hetkellä valituista tallennuslaitteista. Tämä saattaa auttaa sinua perehtymään monimutkaisempiin tallennusmalleihin. Tässä näkyvät laitteet ovat ne laitteet, jotka olet valinnut kohdassa xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Asennuskohde]. Jos haluat lisätä tai poistaa tallennuslaitteita määrityksistäsi, palaa kyseiselle näytölle ja muuta valintaasi.

source: You can press the `Reset All` button in the bottom right corner at any time to reset the storage configuration to the state it was in when you last opened the `Manual Partitioning` screen. This means that if you modify the storage configuration, leave the screen, and then come back, the Reset button will reset the configuration back to the already modified state, discarding only the changes you have made recently, not all changes to the storage configuration since you booted the installer.
fi: Voit painaa Nollaa kaikki -painiketta oikeassa alakulmassa milloin tahansa palauttaaksesi tallennusasetukset tilaan, jossa ne olivat, kun viimeksi avasit Manuaalinen osiointi -näytön. Tämä tarkoittaa, että jos muutat tallennuskokoonpanoa, poistut näytöltä ja palaat sitten takaisin, Reset-painike palauttaa kokoonpanon takaisin jo muutettuun tilaan ja hylkää vain äskettäin tekemäsi muutokset, ei kaikkia tallennuskokoonpanoon tehtyjä muutoksia asennusohjelman käynnistyksen jälkeen.

source: To discard all changes, and to also detect any new drives which have not been detected when the installer started (usually when you attached a new drive after you started), press the button marked by a circular arrow in the set of controls below the list of mount points on the left side of the screen. In the dialog window that opens, press `Rescan Disks` and wait until the scanning process completes. Then, press `OK` to return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]; all detected disks including any new ones will be displayed in the `Local Standard Disks` section.
fi: Jos haluat hylätä kaikki muutokset ja havaita myös uudet asemat, joita ei ole havaittu, kun asennusohjelma käynnistyi (yleensä kun liität uuden aseman käynnistyksen jälkeen), paina pyöreällä nuolella merkittyä painiketta liitoskohtien luettelon alla näytön vasemmalla puolella. Paina avautuvassa valintaikkunassa "Rescan Disks" ja odota, kunnes tarkistus on valmis. Paina sitten OK palataksesi kohtaan xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Asennuskohde]; kaikki havaitut levyt, mukaan lukien kaikki uudet, näytetään Paikalliset vakiolevyt -osiossa.

source: Rescan Disks
fi: Skannaa levyt uudelleen

source: The Rescan Disks dialog
fi: Tarkista levyt uudelleen -valintaikkuna

source: After you finish configuring your system storage, press `Done` in the top left corner to save the configuration and return to the `Installation Summary` screen. At this point, the installer will check if your storage configuration is valid. If an error was detected, a message will be displayed at the bottom of the screen. Click the message to open a dialog window explaining what kind of error has been detected (for example, you put `/boot` on a Btrfs subvolume, or you did not create a BIOS Boot partition when your system requires one).
fi: Kun olet määrittänyt järjestelmätallennustilan, paina `Valmis` vasemmassa yläkulmassa tallentaaksesi asetukset ja palataksesi Asennusyhteenveto-näyttöön. Tässä vaiheessa asennusohjelma tarkistaa, onko tallennuskokoonpanosi kelvollinen. Jos havaitaan virhe, näytön alareunaan tulee viesti. Napsauta viestiä avataksesi valintaikkunan, jossa kerrotaan, millainen virhe on havaittu (esimerkiksi laitoit `/boot` Btrfs-alilevylle tai et luonut BIOS-käynnistysosiota, kun järjestelmäsi sitä vaatii).

source: If such a message is displayed, go back and fix any issues found by the installer; otherwise you will not be able to proceed with the installation. You can also press `Done` again to return to the `Installation Summary` anyway, but a storage configuration error will prevent you from starting the actual installation process.
fi: Jos tällainen viesti tulee näkyviin, palaa takaisin ja korjaa asennusohjelman löytämät ongelmat. Et voi muuten jatkaa asennusta. Voit myös painaa 'Valmis' uudelleen palataksesi 'Asennusyhteenvetoon', mutta tallennustilan määritysvirhe estää sinua aloittamasta varsinaista asennusta.

source: If no error message is displayed and if you made any changes since the last time you have visited this screen, a summary dialog will appear, displaying a detailed list of the changes you made. Review the list and click `Accept Changes` to proceed with xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary], or click `Cancel & Return to Custom Partitioning` if you want to make any more changes.
fi: Jos virheilmoitusta ei näytetä ja jos olet tehnyt muutoksia sen jälkeen, kun viimeksi kävit tässä näytössä, näkyviin tulee yhteenvetoikkuna, joka näyttää yksityiskohtaisen luettelon tekemistäsi muutoksista. Tarkista luettelo ja napsauta "Hyväksy muutokset" jatkaaksesi xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Asennusyhteenveto] tai napsauta "Peruuta ja palaa mukautettuun osiointiin", jos haluat tehdä jotain muutoksia.
