Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f34/pages/_partials/install/DateTimeSpoke.po
Languages: fi

source: Date & Time
fi: Aika & päiväys

source: The `Date & Time` screen allows you to configure time and date-related settings for your system. This screen is automatically configured based on the settings you selected in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Welcome Screen and Language Selection], but you can change your date, time and location settings before you begin the installation.
fi: "Päivämäärä ja aika" -näytössä voit määrittää järjestelmäsi kellonajan ja päivämäärän asetukset. Tämä näyttö konfiguroidaan automaattisesti kohdassa xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Tervetulonäyttö ja kielen valinta] valitsemiesi asetusten perusteella, mutta voit muuttaa päivämäärä-, aika- ja sijaintiasetuksiasi ennen kuin aloitat asennus.

source: Screenshot of the Date & Time screen
fi: Kuvakaappaus Päivämäärä ja aika -näytöstä

source: First, select your `Region` using the drop-down menu in the top left corner of the screen. Then, select your `City`, or the city closest to your location in the same time zone. Selecting a specific location helps {PRODUCT} ensure that your time is always set correctly including automatic time changes for daylight savings time if applicable.
fi: Valitse ensin alueesi näytön vasemmassa yläkulmassa olevasta avattavasta valikosta. Valitse sitten kaupunkisi tai sijaintiasi lähinnä oleva kaupunki samalla aikavyöhykkeellä. Tietyn sijainnin valitseminen auttaa {PRODUCT}a varmistamaan, että aikasi on aina asetettu oikein, mukaan lukien mahdolliset automaattiset kesäajan muutokset.

source: You can also select a time zone relative to Greenwich Mean Time (GMT) without setting your location to a specific region. To do so, select `Etc` as your region.
fi: Voit myös valita aikavyöhykkeen suhteessa Greenwichin aikaan (GMT) asettamatta sijaintiasi tietylle alueelle. Valitse alueeksi "Etc".

source: The switch labeled `Network Time` in the top right corner of the screen can be used to enable or disable network time synchronization using the Network Time Protocol (NTP). Enabling this option will keep your system time correct as long as the system can access the internet. By default, four NTP _pools_ are configured; you can add others and disable or remove the default ones by clicking the gear wheel button next to the switch.
fi: Näytön oikeassa yläkulmassa olevaa "Network Time" -kytkimen avulla voidaan ottaa käyttöön tai poistaa käytöstä verkon ajan synkronointi Network Time Protocol (NTP) -protokollan avulla. Tämän vaihtoehdon ottaminen käyttöön pitää järjestelmäaikasi oikeana niin kauan kuin järjestelmä voi käyttää Internetiä. Oletuksena neljä NTP _pools_ on määritetty; Voit lisätä muita ja poistaa käytöstä tai poistaa oletusarvot napsauttamalla kytkimen vieressä olevaa hammaspyöräpainiketta.

source: The Add and mark for usage NTP servers dialog
fi: Lisää ja merkitse käyttöön NTP-palvelimia -valintaikkuna

source: A dialog window allowing you to add or remove NTP pools from your system configuration
fi: Valintaikkuna, jossa voit lisätä tai poistaa NTP-varantoja järjestelmäkokoonpanostasi

source: If you disable network time synchronization, the controls at the bottom of the screen will become active, and you will be able to set the current time and date manually.
fi: Jos poistat verkon ajan synkronoinnin käytöstä, näytön alareunassa olevat säätimet aktivoituvat ja voit asettaa kellonajan ja päivämäärän manuaalisesti.

source: After configuring your time and date settings, press the `Done` button in the top left corner to return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
fi: Kun olet määrittänyt aika- ja päivämääräasetukset, paina vasemmassa yläkulmassa olevaa Valmis-painiketta palataksesi kohtaan xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Asennusyhteenveto].
