Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f34/pages/_partials/install/FilterSpoke_AddFCoE.po
Languages: pt_br

source: Add FCoE SAN
pt_br: Adicionar FCoE SAN

source: The following procedure explains how to add _Fibre Channel over Ethernet_ (FCoE) storage devices and make them available during the installation:
pt_br: O procedimento a seguir explica como adicionar dispositivos de armazenamento _Fibre Channel over Ethernet_ (FCoE) e torná-los disponíveis durante a instalação:

source: Add FCoE Target
pt_br: Adicionar destino FCoE

source: Click the `Add FCoE SAN` button in the bottom right corner of xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks]. A new dialog window will open.
pt_br: Clique no botão `Adicionar FCoE SAN` no canto inferior direito de xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Destino da instalação - Discos especializados e de rede]. Uma nova janela de diálogo será aberta.

source: Select the network interface (`NIC`) which is connected to your FCoE switch from the drop-down menu. Note that this network interface must be configured and connected - see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Network & Hostname].
pt_br: Selecione a interface de rede (`NIC`) que está conectada ao seu switch FCoE no menu suspenso. Note que esta interface de rede deve ser configurada e conectada - veja xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Rede e nome do host].

source: Below the `NIC` drop-down menu are two choices:
pt_br: Embaixo do menu suspenso `NIC` estão duas opções:

source: `Use DCB`
pt_br: `Usar DCB`

source: _Data Center Bridging_ (DCB) is a set of enhancements to the Ethernet protocols designed to increase the efficiency of Ethernet connections in storage networks and clusters. This option should only be enabled for network interfaces that require a host-based DCBX client. Configurations on interfaces that implement a hardware DCBX client should leave this check box empty.
pt_br: _Data Center Bridging_ (DCB) é um conjunto de melhorias para os protocolos Ethernet projetados para aumentar a eficiência das conexões Ethernet em redes de armazenamento e clusters. Esta opção deve ser habilitada apenas para interfaces de rede que requerem um cliente DCBX baseado em host. As configurações em interfaces que implementam um cliente DCBX de hardware devem deixar esta caixa de seleção vazia.

source: `Use auto vlan`
pt_br: `Usar auto vlan`

source: This option indicates whether VLAN discovery should be performed. If this box is checked, then the _FCoE Initiation Protocol_ (FIP) VLAN discovery protocol will run on the Ethernet interface once the link configuration has been validated. If they are not already configured, network interfaces for any discovered FCoE VLANs will be automatically created and FCoE instances will be created on the VLAN interfaces. This option is enabled by default.
pt_br: Esta opção indica se a descoberta de VLAN deve ser executada. Se esta caixa estiver marcada, o protocolo de descoberta de VLAN _FCoE Initiation Protocol_ (FIP) será executado na interface Ethernet assim que a configuração do link for validada. Se ainda não estiverem configuradas, as interfaces de rede para quaisquer VLANs FCoE descobertas serão criadas automaticamente e as instâncias FCoE serão criadas nas interfaces VLAN. Essa opção está ativada por padrão.

source: After you select which interface and options to use, click `Add FCoE Disk(s)`. Discovered FCoE storage devices will be displayed under the `Other SAN Devices` tab in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks].
pt_br: Depois de selecionar qual interface e opções usar, clique em `Adicionar disco(s) FCoE`. Os dispositivos de armazenamento FCoE descobertos serão exibidos na aba `Outros dispositivos SAN` em xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Destino da instalação - Discos especializados e de rede].
