Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f34/pages/_partials/install/UserSpoke.po
Languages: fi

source: Create User
fi: Luo käyttäjä

source: The `Create User` screen can be used to create and configure one normal (non-`root`) user account during the installation. Only one user account can be configured here; if you require more accounts, wait until the installation completes, reboot your system and then create other accounts using either the [command]#useradd# command in a terminal, or a graphical utility for managing user accounts (for example, the `Users` screen in the Settings menu in [application]*GNOME*).
fi: Luo käyttäjä -näyttöä voidaan käyttää yhden normaalin (ei-root-käyttäjätilin) luomiseen ja määrittämiseen asennuksen aikana. Vain yksi käyttäjätili voidaan määrittää tähän; Jos tarvitset lisää tilejä, odota, kunnes asennus on valmis, käynnistä järjestelmä uudelleen ja luo sitten muita tilejä käyttämällä joko [command]#useradd#-komentoa terminaalissa tai graafista apuohjelmaa käyttäjätilien hallintaan (esimerkiksi "Käyttäjät"). -näyttö Asetukset-valikossa kohdassa [sovellus]*GNOME*).

source: Creating a normal user account is not required to finish the installation; however, it is highly recommended. If you do not create one, you will have to log in to the system as `root` directly, which is *not* recommended.
fi: Asennuksen viimeistely ei edellytä normaalin käyttäjätilin luomista. se on kuitenkin erittäin suositeltavaa. Jos et luo sitä, sinun on kirjauduttava järjestelmään suoraan root-tunnuksella, mitä *ei* suositella.

source: The Create User screen. Use the text input fields to create a user account and configure its settings.
fi: Luo käyttäjä -näyttö. Käytä tekstinsyöttökenttiä käyttäjätilin luomiseen ja sen asetusten määrittämiseen.

source: To configure a user account, fill out the `Full name` (for example, `John Smith`) and `Username` (for example, `jsmith`). The `username` will used to log in from a command line; if you install a graphical environment, then your graphical login manager will use `Full name`.
fi: Määritä käyttäjätili täyttämällä "koko nimi" (esimerkiksi "Pekka Puupää") ja "käyttäjänimi" (esimerkiksi "ppuupaa"). Käyttäjätunnusta käytetään kirjautumiseen komentoriviltä; jos asennat graafisen ympäristön, graafinen kirjautumisen hallinta käyttää "koko nimeä".

source: Make sure that the `Require a password to use this account` check box is enabled, enter a password you want to use for this account into the `Password` field. The characters you write will be displayed as dots for security. Then, repeat the same password in the `Confirm password` field below to ensure you entered it properly. Both entered passwords must be the same.
fi: Varmista, että Vaadi salasana tämän tilin käyttämiseen -valintaruutu on käytössä, kirjoita salasana, jota haluat käyttää tällä tilillä, "Salasana"-kenttään. Kirjoittamasi merkit näkyvät pisteinä turvallisuuden vuoksi. Toista sitten sama salasana alla olevaan Vahvista salasana -kenttään varmistaaksesi, että annoit sen oikein. Molempien syötettyjen salasanojen on oltava samat.

source: As you enter the password, it will be evaluated and the installer will determine the password's strength. If the installer considers your password weak, a message will appear at the bottom of the screen, explaining which aspect of your chosen password is considered insuficient. For example:
fi: Kun annat salasanan, se arvioidaan ja asennusohjelma määrittää salasanan vahvuuden. Jos asennusohjelma pitää salasanaasi heikkona, näytön alareunaan ilmestyy viesti, joka selittää, mikä valitun salasanan osa katsotaan riittämättömäksi. Esimerkiksi:

source: `The password you have provided is weak:` `The password is shorter than 5 characters.`
fi: `Antamasi salasana on heikko:` `Salasana on lyhyempi kuin 5 merkkiä.`

source: If a message similar to the above appears, it is highly recommended to choose a different, stronger password.
fi: Jos yllä olevan kaltainen viesti tulee näkyviin, on erittäin suositeltavaa luoda toinen, vahvempi salasana.

source: The `Make this user administrator` check box gives the user you are creatng administrative rights (by adding this user into the `wheel` group), allowing this user to use the [command]#sudo# command to perform tasks normally only available to `root` using only the user password, instead of the `root` password. This may be more convenient, but can also pose a security risk.
fi: "Tee tästä käyttäjästä järjestelmänvalvoja" -valintaruutu antaa käyttäjälle, jonka luot, järjestelmänvalvojan oikeudet (lisäämällä tämän käyttäjän "wheel"-ryhmään), jolloin tämä käyttäjä voi käyttää [command]#sudo#-komentoa suorittaakseen tehtäviä, jotka ovat normaalisti käytettävissä vain "root" käyttämällä vain käyttäjän omaa salasanaa "root"-salasanan sijaan. Tämä voi olla kätevämpää, mutta voi myös aiheuttaa turvallisuusriskin.

source: If you give administrator privileges to an user, make sure that the account is protected by a strong password. Never give an user administrator privileges without requiring any password for the account.
fi: Jos annat käyttäjälle järjestelmänvalvojan oikeudet, varmista, että tili on suojattu vahvalla salasanalla. Älä koskaan anna käyttäjälle järjestelmänvalvojan oikeuksia ilman, että vaadit salasanaa käyttäjän tilille.

source: See the [citetitle]_{PRODUCT} Security Guide_, available at the link:++https://docs.fedoraproject.org/++[], for detailed information about password security including guidelines for selecting strong passwords.
fi: Katso [citetitle]_{PRODUCT} Security Guide_, joka on saatavilla link:++https://docs.fedoraproject.org/++[], saadaksesi yksityiskohtaisia tietoja salasanasuojauksesta, mukaan lukien ohjeet vahvojen salasanojen valitsemiseen.

source: To additional settings, click the `Advanced` button below the password input fields. A new dialog window titled `Advanced User Configuration` will open. This dialog is described in the following section.
fi: Jos haluat lisäasetuksia, napsauta "Lisäasetukset" -painiketta salasanan syöttökenttien alla. Uusi valintaikkuna nimeltä "Advanced User Configuration" avautuu. Tämä valintaikkuna on kuvattu seuraavassa osiossa.

source: Advanced User Configuration
fi: Käyttäjän lisäasetukset

source: The `Advanced User Configuration` dialog allows you to change the following settings for the new user account.
fi: "Advanced User Configuration" -valintaikkunassa voit muuttaa seuraavia uuden käyttäjätilin asetuksia.

source: Advanced settings for the new user account.
fi: Uuden käyttäjätilin lisäasetukset.

source: The user's `Home directory` (`/home/pass:attributes[{blank}]_username_pass:attributes[{blank}]` by default).
fi: Käyttäjän kotihakemisto (`/home/pass:attributes[{blank}]_username_pass:attributes[{blank}]` oletuksena).

source: The user's group membership. The user account you are creating will always have one default group membership (the user's default group with an ID set in the `Specify a group ID manually` field). In the `Group Membership` field, you can specify additional groups as a comma-separated list. Groups which do not already exist will be created; you can specify custom GIDs for them in parentheses. If you do not specify a custom GID for a new group, it will be assigned automatically.
fi: Käyttäjän ryhmän jäsenyys. Luomallasi käyttäjätilillä on aina yksi oletusryhmäjäsenyys (käyttäjän oletusryhmä, jonka tunnus on asetettu "Määritä ryhmätunnus manuaalisesti" -kenttään). Ryhmän jäsenyys -kentässä voit määrittää lisäryhmiä pilkuilla eroteltuna luettelona. Ryhmät, joita ei vielä ole olemassa, luodaan. Voit määrittää niille mukautetut GID:t suluissa. Jos et määritä mukautettua GID:tä uudelle ryhmälle, se määritetään automaattisesti.
