Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/_partials/Feedback.po
Languages: pt_br

source: We want feedback
pt_br: Queremos feedback

source: indexterm:[feedback,contact information for this manual] If you find errors or have suggestions for improvement, we want your advice. Open an issue at {BZURL}.
pt_br: indexterm:[feedback,informações de contato para este manual] Se você encontrar erros ou tiver sugestões de melhorias, queremos seu conselho. Preencha um relatório de problema em {BZURL}.

source: In the issue:
pt_br: No relatório de problema:

source: Provide a short summary of the error or your suggestion in the `Issue Title` field.
pt_br: Forneça um breve resumo do erro ou sua sugestão no campo `Título do Problema`.

source: Copy the following template into the `Comment` field and give us the details of the error or suggestion as specifically as you can. If possible, include some surrounding text so we know where the error occurs or the suggestion fits.
pt_br: Copie o modelo a seguir no campo `Comentário` e forneça os detalhes do erro ou sugestão da maneira mais específica possível. Se possível, inclua algum texto ao redor para sabermos onde o erro ocorre ou a sugestão se encaixa.

source: Document URL:
pt_br: URL do Documento:

source: Section name:
pt_br: Nome da seção:

source: Error or suggestion:
pt_br: Erro ou sugestão:

source: Additional information:
pt_br: Informação adicional:

source: Click the btn:[Create Issue] button.
pt_br: Clique no botão btn:[Criar Problema].
