Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/Introduction.po
Languages: id

source: Introduction
id: Perkenalan

source: This guide covers installation of Fedora, a Linux distribution built on free and open source software. This manual helps you install Fedora on desktops, laptops, and servers. The installation system is easy to use even if you lack previous knowledge of Linux or computer networks. If you select default options, Fedora provides a complete desktop operating system, including productivity applications, Internet utilities, and desktop tools.
id: Panduan ini mencakup instalasi Fedora, distribusi Linux yang dibangun di atas perangkat lunak bebas dan sumber terbuka. Panduan ini membantu Anda menginstal Fedora di desktop, laptop, dan server. Sistem instalasi mudah digunakan bahkan jika Anda tidak memiliki pengetahuan sebelumnya tentang Linux atau jaringan komputer. Jika Anda memilih opsi default, Fedora menyediakan sistem operasi desktop yang lengkap, termasuk aplikasi produktivitas, utilitas internet, dan alat desktop.

source: This document details the full range of installation options, including those that apply only in limited or unusual circumstances. Understanding of all topics described in this document is not necessary to successfully perform the installation in most cases.
id: Dokumen ini merinci pilihan lengkap instalasi, termasuk yang berlaku hanya dalam keadaan terbatas atau tidak biasa. Memahami semua topik yang dijelaskan dalam dokumen ini tidak diperlukan untuk berhasil melakukan instalasi dalam banyak kasus.

source: Background
id: Latar Belakang

source: About Fedora
id: Tentang Fedora

source: To find out more about {PRODUCT}, visit the link:++https://fedoraproject.org/++[{PRODUCT} Project Website]. Other documentation describing additional topics related to {PRODUCT} is available at link:++https://docs.fedoraproject.org/++[{PRODUCT} Documentation]. Also see the link:++https://fedoraproject.org/wiki/Fedora_Project_Wiki++[{PRODUCT} Project Wiki].
id: Untuk mengetahui lebih lanjut tentang {PRODUCT}, kunjungi link:++https:/fedoraproject.org/++[Situs Web Proyek {PRODUCT}]. Dokumentasi lain yang menjelaskan topik tambahan yang terkait dengan {PRODUCT} tersedia di link:++https://docs.fedoraproject.org/++[Dokumentasi {PRODUCT}]. Lihat juga link:++https:/fedoraproject.org/wiki/Fedora_Project_Wiki++[Wiki Proyek {PRODUCT}].

source: Getting Additional Help
id: Mendapatkan Bantuan Tambahan

source: If you encounter any problems which are not described in documentation, you might get help from members of the community - developers, users, and others. There are many ways to get help: the Ask Fedora website, mailing lists, forums, or IRC. For a summary of available resources, see the link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Communicating and Getting Help] page on the {PRODUCT} wiki.
id: Jika Anda mengalami masalah yang tidak dijelaskan dalam dokumentasi, Anda mungkin mendapatkan bantuan dari anggota komunitas - pengembang, pengguna, dan lain-lain. Ada banyak cara untuk mendapatkan bantuan: situs web Fedora, milis, forum, atau IRC. Untuk ringkasan sumber daya yang tersedia, lihat halaman link:++https:/fedoraproject.org/wiki/Communicating_and_getting_help++ [Mengkomunikasikan dan Mendapatkan Bantuan] di wiki {PRODUCT}.

source: About This Document
id: Tentang Dokumen Ini

source: Goals
id: Tujuan

source: This guide helps a reader:
id: Panduan ini membantu pembaca:

source: Understand how to locate the {PRODUCT} distribution online
id: Memahami cara menemukan distribusi {PRODUCT} daring

source: Create configuration data that allows a computer to boot {PRODUCT}
id: Membuat data konfigurasi yang memungkinkan komputer untuk boot {PRODUCT}

source: Understand and interact with the {PRODUCT} installation program
id: Memahami dan berinteraksi dengan program instalasi {PRODUCT}

source: Complete basic post-installation configuration of a {PRODUCT} system
id: Menyelesaikan konfigurasi pasca instalasi dasar sistem {PRODUCT}

source: This guide does not cover *use* of {PRODUCT}. To learn how to use an installed {PRODUCT} system, see the other manuals available at link:++https://docs.fedoraproject.org/++[Fedora Documentation].
id: Panduan ini tidak mencakup *penggunaan* dari {PRODUCT}. Untuk mempelajari cara menggunakan sistem {PRODUCT} yang terinstal, lihat buku petunjuk lain yang tersedia di link:++https://docs.fedoraproject.org/++[Dokumentasi Fedora].

source: Target Audience
id: Target Pemirsa

source: This guide is intended for {PRODUCT} users of all levels of experience. However, it describes the installation process and its many options in far greater detail than most users are likely to require. You do not need to read and understand this entire document to install {PRODUCT} on a computer. This document is most likely to help experienced users perform advanced and unusual installations.
id: Panduan ini ditujukan untuk pengguna {PRODUCT} dari semua tingkatan pengalaman. Namun, ini menjelaskan proses instalasi dan banyak pilihannya dalam detail yang jauh lebih dalam daripada yang mungkin diperlukan oleh kebanyakan pengguna. Anda tidak perlu membaca dan memahami seluruh dokumen ini untuk menginstal {PRODUCT} di komputer. Dokumen ini paling mungkin untuk membantu pengguna berpengalaman melakukan instalasi canggih dan tidak biasa.
