Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/rawhide/pages/Revision_History.po
Languages: tr

source: Revision History
tr: Değişiklik Geçmişi

source: Note that revision numbers relate to the edition of this manual, not to version numbers of Fedora.
tr: Değişiklik numaralarının Fedora sürüm numaralarıyla değil, bu kılavuzun sürümüyle ilgili olduğunu unutmayın.

source: Tue Oct 30 2018, Petr Bokoč (pbokoc@redhat.com)
tr: 30 Ekim 2018 Salı, Petr Bokoč (pbokoc@redhat.com)

source: Fedora 29 Final release
tr: Fedora 29 Son sürüm

source: All external links are now converted to HTTPS where applicable (link:++https://pagure.io/fedora-docs/install-guide/issue/3++[issue 3])
tr: Tüm harici bağlantılar artık uygulanabilir olduğunda HTTPS'ye dönüştürülüyor (link:++https://pagure.io/fedora-docs/install-guide/issue/3++[sorun 3])

source: Removed a mention of a no longer available rescue image (link:++https://pagure.io/fedora-docs/install-guide/issue/4++[issue 4])
tr: Artık kullanılabilir olmayan bir kurtarma kalıbından bahsetme kaldırıldı (link:++https://pagure.io/fedora-docs/install-guide/issue/4++[sorun 4])

source: New Kickstart commands and options: `url`, `network --bindto=`, and LUKS-related options for `autopart`, `part`, `logvol`, and `raid`.
tr: Yeni Kickstart komutları ve seçenekleri: `url`, `network --bindto=`; ve `autopart`, `part`, `logvol`, ve `raid` için LUKS ile ilgili seçenekler.

source: The `authconfig` Kickstart command is now deprecated and replaced by `authselect` (link:++https://pagure.io/fedora-docs/install-guide/issue/6++[issue 6])
tr: `authconfig` Kickstart komutu artık kullanımdan kaldırıldı ve `authselect` ile değiştirildi (link:++https://pagure.io/fedora-docs/install-guide/issue/6++[sorun 6])

source: New boot options: `inst.stag2.all=`, `inst.ks.all=`, `inst.xtimeout=`, `inst.decorated=`
tr: Yeni önyükleme seçenekleri: `inst.stag2.all=`, `inst.ks.all=`, `inst.xtimeout=`, `inst.decorated=`

source: Updated the Fedora Media Writer chapter (link:++https://pagure.io/fedora-docs/install-guide/issue/7++[issue 7])
tr: Fedora Media Writer bölümü güncellendi (link:++https://pagure.io/fedora-docs/install-guide/issue/7++[sorun 7])

source: Updated image verification instructions for Mac (link:++https://pagure.io/fedora-docs/install-guide/issue/15++[issue 15])
tr: Mac için kalıp doğrulama talimatları güncellendi (link:++https://pagure.io/fedora-docs/install-guide/issue/15++[sorun 15])

source: Various fixes related to the new publishing system
tr: Yeni yayınlama sistemiyle ilgili çeşitli düzeltmeler

source: Mon Jun 20 2016, Clayton Spicer (cspicer@redhat.com)
tr: 20 Haziran 2016 Pazartesi, Clayton Spicer (cspicer@redhat.com)

source: Fedora 24 Final release
tr: Fedora 24 Son sürüm

source: Added boot option [option]#inst.nosave=#
tr: [option]#inst.nosave=# önyükleme seçeneği eklendi

source: Typo fixes
tr: Yazım hatası düzeltmeleri

source: Mon Nov 02 2015, Petr Bokoč (pbokoc@redhat.com)
tr: 2 Kasım 2015 Pazartesi, Petr Bokoč (pbokoc@redhat.com)

source: Fedora 23 Final release
tr: Fedora 23 Son sürüm

source: Kickstart commands and boot options updated for F23
tr: Kickstart komutları ve önyükleme seçenekleri F23 için güncellendi

source: Many typo fixes
tr: Birçok yazım hatası düzeltmesi

source: Mon May 25 2015, Petr Bokoč (pbokoc@redhat.cogm)
tr: 25 Mayıs 2015 Pazartesi, Petr Bokoč (pbokoc@redhat.com)

source: Fedora 22 Final release
tr: Fedora 22 Son sürüm

source: References to [application]*Yum* replaced with [application]*DNF* (the new default package manager)
tr: [application]*Yum* komutunun geçtiği yerler [application]*DNF* ile değiştirildi (yeni öntanımlı paket yöneticisi)

source: Updates in boot options: [option]#inst.dnf# replaced with [option]#inst.nodnf#, added [option]#inst.kdump_addon=#
tr: Önyükleme seçenekleri güncellemeleri: [option]#inst.dnf#, [option]#inst.nodnf# ile değiştirildi, [option]#inst.kdump_addon=# eklendi

source: Updates in Kickstart: [command]#%anaconda#, [command]#%addon#, [command]#sshkey#, [command]#pwpolicy#
tr: Kickstart güncellemeleri: [command]#%anaconda#, [command]#%addon#, [command]#sshkey#, [command]#pwpolicy#

source: Added the `Kdump` screen to the GUI docs
tr: Grafiksel kullanıcı arayüzü belgelerine `Kdump` ekranı eklendi

source: Sun Dec 21 2014, Zach Oglesby (zach@oglesby.co)
tr: 21 Aralık 2014 Pazar, Zach Oglesby (zach@oglesby.co)

source: Fixed Windows checksum steps, BZ#1175759
tr: Windows sağlama toplamı adımları düzeltildi, BZ#1175759

source: Mon Dec 15 2014, Petr Bokoč (pbokoc@redhat.com)
tr: 15 Aralık 2014 Pazartesi, Petr Bokoč (pbokoc@redhat.com)

source: Fixes in Boot Options: inst.headless is deprecated, inst.askmethod moved from removed to Installation Source
tr: Önyükleme seçeneklerindeki düzeltmeler: inst.headless kullanımdan kaldırıldı, inst.askmethod kaldırılmış durumdan Kurulum Kaynağına taşındı

source: Parts of the network boot setup chapter have been updated with correct URLs
tr: Ağ önyükleme kurulumu bölümünün bazı bölümleri doğru URL'lerle güncellendi

source: Updates in Recommended Partitioning Scheme and Advice on Partitions in the Manual Partitioning section of the installation chapter
tr: Kurulum bölümünün Elle Bölümlendirme kısmında Tavsiye Edilen Bölümlendirme Düzeni ve Bölümlerle İlgili Tavsiyeler kısımlarında güncellemeler

source: Mon Dec 8 2014, Petr Bokoč (pbokoc@redhat.com)
tr: 8 Aralık 2014 Pazartesi, Petr Bokoč (pbokoc@redhat.com)

source: Publishing for Fedora 21
tr: Fedora 21 için yayınlama

source: Mon Dec 8 2014, Pete Travis (immanetize@fedoraproject.org)
tr: 8 Aralık 2014 Pazartesi, Pete Travis (immanetize@fedoraproject.org)

source: added info on media types
tr: ortam türleri hakkında bilgi eklendi

source: Tue Dec 17 2013, Petr Bokoč (pbokoc@redhat.com)
tr: 17 Aralık 2013 Salı, Petr Bokoč (pbokoc@redhat.com)

source: Publishing for Fedora 20
tr: Fedora 20 için yayınlama
