Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/install/After_Installation.po
Languages: id

source: After the Installation
id: Setelah Instalasi

source: This chapter describes the initial setup tools which open after you finish the installation, reboot the system, and log in for the first time.
id: Bab ini menjelaskan alat pengaturan awal yang terbuka setelah Anda menyelesaikan instalasi, me-reboot sistem, dan masuk untuk pertama kalinya.

source: Two separate configuration tools are part of {PRODUCT}. If you installed the [application]*GNOME* desktop environment (the default {PRODUCT} environment, installed for example as part of the {PRODUCT} Workstation Edition), the [application]*GNOME Initial Setup* utility will open; for all other graphical environments, the [application]*Initial Setup* tool serves the same purpose.
id: Dua alat konfigurasi terpisah adalah bagian dari {PRODUCT}. Jika Anda menginstal lingkungan desktop [application]*GNOME* (lingkungan default {PRODUCT}, yang diinstal misalnya sebagai bagian dari edisi {PRODUCT}) Workstation, utilitas [application]*Penyiapan Awal GNOME* akan terbuka; untuk semua lingkungan grafis lainnya, alat [application]*Penyiapan Awal* melayani tujuan yang sama.

source: Both of these tools will allow you to configure user-specific settings which have not been configured during the installation. Some of the settings are available both in the graphical installer (or as Kickstart commands) as well as in the initial-setup utilities; in that case, they will only be displayed after the first reboot if you skipped them during the installation. This means that, for example, if you configured a user account before the installation finished, you will not be prompted to do so again after the installation completes.
id: Kedua alat ini akan memungkinkan Anda untuk mengkonfigurasi pengaturan pengguna khusus yang belum dikonfigurasi selama instalasi. Beberapa pengaturan yang tersedia baik dalam installer grafis (atau sebagai perintah Kickstart) serta di utilitas penyiapan-awal; dalam hal ini, mereka hanya akan ditampilkan setelah reboot pertama jika Anda melewatkan mereka selama instalasi. Ini berarti bahwa, misalnya, jika Anda mengonfigurasi akun pengguna sebelum penginstalan selesai, Anda tidak akan diminta untuk melakukannya lagi setelah penginstalan selesai.

source: GNOME Initial Setup
id: Penyiapan Awal GNOME

source: The [application]*GNOME Initial Setup* utility will be displayed after you log in for the first time with any user account, as long as your first login is in the [application]*GNOME* desktop environment.
id: Utilitas [application]*Penyiapan Awal GNOME* akan ditampilkan setelah Anda masuk untuk pertama kalinya dengan setiap akun pengguna, selama login pertama Anda adalah dalam lingkungan desktop [application]*GNOME*.

source: GNOME Initial Setup with language selection displayed.
id: Penyiapan Awal GNOME dengan pemilihan bahasa ditampilkan.

source: This utility allows you to configure several user-specific settings, such as system language or the default keyboard layout. Use the `Next` and `Previous` buttons at the top of the window to navigate between screens. Some screens (`Configure online accounts` in particular) are optional and can be skipped using the `Skip` button in the top right corner.
id: Utilitas ini memungkinkan Anda untuk mengkonfigurasi beberapa pengaturan khusus pengguna, seperti bahasa sistem atau tata letak papan tik default. Gunakan tombol `Selanjutnya` dan `Sebelumnya` di bagian atas jendela untuk menavigasi antar layar. Beberapa layar (`Konfigurasi akun daring` secara khusus) bersifat opsional dan dapat dilewati menggunakan tombol `Lewati` di pojok kanan atas.

source: After you finish configuring all screens, click `Start using Fedora` to exit the utility. After that, the `Getting Started` page from GNOME help will be displayed, and you can either browse the help content, or close it and start using your desktop.
id: Setelah Anda selesai mengonfigurasi semua layar, klik `Mulai menggunakan Fedora` untuk keluar dari utilitas. Setelah itu, halaman `Memulai` dari bantuan GNOME akan ditampilkan, dan Anda dapat meramban konten bantuan, atau menutupnya dan mulai menggunakan desktop Anda.

source: Common Post-installation Tasks
id: Tugas Pasca-instalasi Umum

source: After you finish the installation and go through one of the initial setup utilities described above, your system is ready for use. However, other administrative tasks not covered by the installer or the initial setup utilities may still be necessary, depending on how you plan to use your system. The list below describes some of the more common tasks usually performed immediately after a new installation.
id: Setelah Anda menyelesaikan instalasi dan pergi melalui salah satu utilitas penyiapan awal yang dijelaskan di atas, sistem Anda siap untuk digunakan. Namun, tugas administratif lainnya yang tidak tercakup oleh penginstal atau utilitas penyiapan awal mungkin masih diperlukan, tergantung pada bagaimana Anda berencana untuk menggunakan sistem Anda. Daftar di bawah ini menjelaskan beberapa tugas yang lebih umum biasanya dilakukan segera setelah instalasi baru.

source: Recover a lost `root` password
id: Memulihkan kata sandi `root` yang hilang

source: The `root` password, which is configured during the installation, is required for accessing the system as the `root` user. Without this password you will not be able to configure your system or install additional software. If you lost or forgot your `root` password, you can reset it by following the steps described in xref:install/Troubleshooting.adoc#sect-trouble-after-reset-root-password[Resetting the Root Password].
id: Kata sandi `root`, yang dikonfigurasi selama instalasi, diperlukan untuk mengakses sistem sebagai pengguna `root`. Tanpa kata sandi ini Anda tidak akan dapat mengkonfigurasi sistem Anda atau menginstal perangkat lunak tambahan. Jika Anda kehilangan atau lupa kata sandi `root`, Anda dapat mengatur ulang dengan mengikuti langkah yang dijelaskan dalam xref:install/Troubleshooting.adoc#sect-trouble-after-reset-root-password[Mereset Kata Sandi Root].

source: Configure the network
id: Mengkonfigurasi jaringan

source: In most cases, network access is configured during the installation process, either in the [application]*Anaconda* installation program (see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Network & Hostname]) or in a Kickstart file (see xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-network[network (optional) - Configure Network Interfaces]). For information on configuring the network after the installation, see the [citetitle]_{PRODUCT} Networking Guide_, available at link:++https://docs.fedoraproject.org/++[].
id: Dalam kebanyakan kasus, akses jaringan dikonfigurasi selama proses instalasi, baik dalam program instalasi [application]*Anaconda* (lihat xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Jaringan & Nama Host]) atau dalam berkas Kickstart (lihat xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-network[jaringan (opsional) - Mengkonfigurasi Antarmuka Jaringan]). Untuk informasi tentang konfigurasi jaringan setelah instalasi, lihat jaringan [citetitle]_Panduan Jaringan {PRODUCT}_, tersedia di link:++https://docs.fedoraproject.org/++[].

source: Perform an initial system update
id: Melakukan pembaruan sistem awal

source: If you installed {PRODUCT} from a full installation ISO image (such as the Workstation live image or full Server DVD), it is recommended to perform an initial system update, because your installation media likely contained older versions of software packages. During the initial update, all installed packages are updated to their latest available versions. Updates to packages provide security fixes, bug fixes and enhancements.
id: Jika Anda menginstal {PRODUCT} dari image ISO instalasi penuh (seperti image Workstation live atau DVD Server penuh), disarankan untuk melakukan pembaruan sistem awal, karena media instalasi Anda mungkin berisi versi paket perangkat lunak yang lebih lama. Selama pembaruan awal, semua paket yang diinstal dimutakhirkan ke versi terbaru mereka yang tersedia. Pembaruan paket menyediakan perbaikan keamanan, perbaikan bug, dan penyempurnaan.

source: The [application]*DNF* package manager is used for updating installed packages. For more information about updating your system with [application]*DNF*, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
id: Manajer paket [application]*DNF* digunakan untuk memperbarui paket yang terpasang. Untuk informasi selengkapnya tentang memperbarui sistem Anda dengan [application]*DNF*, lihat [citetitle]_Panduan Administrator Sistem {PRODUCT}_, tersedia di link:++https://docs.fedoraproject.org/++[].

source: Install driver updates
id: Menginstal pemutakhiran driver

source: Usually, drivers for system devices are already supported in the kernel provided by Red{nbsp}Hat Enterprise{nbsp}Linux. However, occasionally, support for devices that have been released recently could be missing. In these cases, a driver update enabling your device may be available.
id: Biasanya, driver untuk perangkat sistem sudah didukung di kernel yang disediakan oleh Red{nbsp}Hat Enterprise{nbsp}Linux. Namun, terkadang, dukungan untuk perangkat yang telah dirilis baru-baru ini dapat hilang. Dalam kasus ini, pembaruan driver yang memungkinkan perangkat Anda mungkin tersedia.

source: Devices necessary to complete the installation can have driver updates provided before the installation begins. If a device is missing a driver, but it is not essential during the installation, it is recommended to wait until after the installation completes, and install additional drivers afterwards. For instructions on installing and enabling additional drivers on the installed system using [application]*RPM* and [application]*DNF*, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
id: Perangkat yang diperlukan untuk menyelesaikan instalasi dapat memiliki update driver yang disediakan sebelum instalasi dimulai. Jika perangkat kekurangan driver, tetapi tidak penting selama instalasi, dianjurkan untuk menunggu sampai setelah instalasi selesai, dan menginstal driver tambahan sesudahnya. Untuk petunjuk tentang cara menginstal dan mengaktifkan driver tambahan pada sistem diinstal menggunakan [application]*RPM* dan [application]*DNF*, lihat [citetitle]_Panduan Administrator Sistem {PRODUCT}_, tersedia di link:++https://docs.fedoraproject.org/++[].

source: Configure additional repositories
id: Mengkonfigurasi repositori tambahan

source: New software is installed from _package repositories_. Package repositories are organized sets of software and metadata that can be accessed by the [application]*DNF* package manager. By default, several update repositories provided by {PRODUCT} are configured automatically and you can install updates and additional software from those. However, if you want to set up additional repositories, for example ones containing your own software, some extra steps are needed.
id: Perangkat lunak baru diinstal dari _repositori paket_. Repositori paket adalah set perangkat lunak dan metadata terorganisasi yang dapat diakses oleh manajer paket [application]*DNF*. Secara default, beberapa repositori pembaruan yang disediakan oleh {PRODUCT} dikonfigurasi secara otomatis dan Anda dapat menginstal pembaruan dan perangkat lunak tambahan dari mereka. Namun, jika Anda ingin menyiapkan repositori tambahan, misalnya yang berisi perangkat lunak Anda sendiri, beberapa langkah tambahan diperlukan.

source: For information about configuring additional software repositories, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
id: Untuk informasi tentang cara mengonfigurasi repositori perangkat lunak tambahan, lihat [citetitle]_Panduan Administrator Sistem {PRODUCT}_, tersedia di link:++https://docs.fedoraproject.org/++[].

source: Install additional packages
id: Menginstal paket tambahan

source: You can control which packages will be installed by selecting an environment in the `Software Selection` dialog in the graphical installation (see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Software Selection]). This dialog does not provide a way to choose individual packages, only predefined sets. However, you can use the [application]*DNF* package manager to install additional packages after the installation. See the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[], for more information.
id: Anda dapat mengontrol paket mana yang akan diinstal dengan memilih lingkungan dalam dialog `Pemilihan Perangkat Lunak` di instalasi grafis (lihat xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Pemilihan Perangkat Lunak]). Dialog ini tidak menyediakan cara untuk memilih paket individual, hanya set terpradefinisi. Namun, Anda dapat menggunakan manajer paket [application]*DNF* untuk menginstal paket tambahan setelah penginstalan. Lihat [citetitle]_Panduan Administrator Sistem {PRODUCT}_, tersedia di link:++https://docs.fedoraproject.org/++[], untuk informasi lebih lanjut.

source: Switch to a graphical login
id: Beralih ke login grafis

source: Depending on the options you chose during the installation process, it is possible that your system does not have a graphical interface, instead offering only a text-based prompt. If this is the case and you wish to enable a graphical desktop after the installation, you must install the [application]*X Window System* and your preferred desktop environment (either [application]*GNOME* or [application]*KDE*).
id: Tergantung pada pilihan yang Anda pilih selama proses instalasi, adalah mungkin bahwa sistem Anda tidak memiliki antarmuka grafis, melainkan hanya menawarkan prompt berbasis teks. Jika hal ini terjadi dan Anda ingin mengaktifkan desktop grafis setelah instalasi, Anda harus menginstal [application]*X Window System* dan lingkungan desktop pilihan Anda (baik [application]*GNOME* atau [application]*KDE*).

source: As with all other software, these packages can be installed using the [application]*DNF* package manager. For information about using [application]*DNF* to install new packages, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[]. For information on how to enable graphical login by default, see xref:install/Troubleshooting.adoc#sect-trouble-after-graphical-login[Booting into a Graphical Environment].
id: Seperti semua perangkat lunak lainnya, paket ini dapat diinstal menggunakan manajer paket [application]*DNF*. Untuk informasi tentang menggunakan [application]*DNF* untuk menginstal paket baru, lihat [citetitle]_Panduan Administrator Sistem {PRODUCT}_, tersedia di link:++https://docs.fedoraproject.org/++[]. Untuk informasi tentang cara mengaktifkan login grafis secara default, lihat xref:install/Troubleshooting.adoc#sect-trouble-after-graphical-login[Mem-boot ke dalam Lingkungan Grafis].
