Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/install/Booting_the_Installation.po
Languages: es

source: Booting the Installation
es: Iniciar la Instalación

source: This chapter will explain how to boot the installer from local media or a network server as well as how to navigate the boot menu and use custom options.
es: Este capitulo explicara como iniciar el instalador desde medios locales o desde la red ademas de explicar como navegar el menú de inicio y utilizar opciones personalizadas.

source: Preparing to Boot
es: Preparándose para iniciar

source: After you have made a bootable USB flash drive or a CD or DVD using the steps described in xref:install/Preparing_for_Installation.adoc#sect-preparing-boot-media[Preparing Boot Media], you are ready to boot the installation. Note that the steps described below are generic and the exact steps will vary somewhat depending on your system - particularly on your motherboard manufacturer.
es: Una vez hayas hecho un USB de arranque o un CD/DVD usando los pasos especificados en xref:install/Preparing_for_Installation.adoc#sect-preparing-boot-media[Preparing Boot Media], estaras list@ para iniciar la instalación. Fíjese que los pasos descritos abajo son genéricos y los pasos exactos variaran dependiendo de tu sistema - particularmente de tu placa base.

source: There are no separate media provided for BIOS and UEFI systems; all of them can boot from the same ISO image. However, once you install {PRODUCT}, you can not switch between UEFI and BIOS. The system must run on the same firmware it was installed on; if you, for example, perform the installation on an UEFI system in UEFI mode, and then switch it to BIOS compatibility mode, {PRODUCT} will no longer boot and will require a reinstallation.
es: No hay medio separado proporcionado para sistemas BIOS y UEFI; todos pueden arrancar desde la misma imagen ISO. Sin embargo, una vez que instala {PRODUCT}, no puede conmutar entre UEFI y BIOS. El sistema debe correr sobre el mismo firmware en que se haya instalado; si usted, por ejemplo, lleva a cabo la instalación sobre un sistema UEFI en modo UEFI y después conmutar a modo de compatibilidad BIOS, {PRODUCT} no arrancará más y requerirá una reinstalación.

source: {PRODUCT} does not support UEFI booting for 32-bit x86 systems. Only BIOS boot is supported on these systems.
es: {PRODUCT} no soporta arranque UEFI para sistemas x86 de 32 bits. Solo arranque por BIOS esta soportado en estos sistemas.

source: Also note that {PRODUCT} only fully supports version 2.2 of the UEFI specification. Hardware that supports version 2.3 or later will boot and work normally, but the additional functionality defined by these later specifications will not be available. The UEFI specifications are available from link:++https://www.uefi.org/specs/agreement/++[].
es: También fíjese que {PRODUCT} solo tiene soporte completo para la versión 2.2 de la especificación UEFI. El hardware que soporte la versión 2.3 en adelante podrá iniciar y funcionaran normalmente, pero las funciones adicionales definidas en esas especificaciones no estarán disponibles. Puede consultar las especificaciones UEFI en el siguiente enlace:++https://www.uefi.org/specs/agreement/++[].

source: To boot the {PRODUCT} installer, follow these steps:
es: Para iniciar el instalador de {PRODUCT}, siga los siguientes pasos:

source: Booting the {PRODUCT} Installer
es: Iniciar el instalador de {PRODUCT}

source: Plug in the boot USB drive, or insert the boot CD or DVD into your computer's optical disc drive. Alternatively, if you plan on booting from a network boot (PXE) server, make sure that the network cable is plugged in.
es: Conecta el USB de arranque, o inserte el CD/DVD de arranque en la unidad óptica de su ordenador. De forma alternativa, si tiene planeado iniciar desde un servidor PXE, asegúrese de que el cable de red esta conectado.

source: Restart the system. Once it starts rebooting, it should display a prompt similar to the following (usually at the bottom of the screen):
es: Reinicie el sistema. Una vez empiece a iniciar, debería mostrar un aviso como el siguiente (normalmente en la parte inferior de la pantalla):

source: Press F12 to select boot device, or Del to enter SETUP
es: Pulse F12 para seleccionar el dispositivo de arranque, o Del para entrar al SETUP

source: Follow the on-screen instructions to access the boot menu. If no instructions are displayed (some systems only display a graphical logo during early stages of boot), try pressing kbd:[F12], kbd:[F11], kbd:[F10] or kbd:[Del] several times; these are most commonly used keys. Note that there is usually a very short time window provided to access the menu; once it passes, you need to restart the system and try again.
es: Siga las instrucciones indicadas en la pantalla para acceder al menú de arranque. Si no se muestra ninguna tecla (algunos sistemas solo muestran un logo durante las primeras fases del arranque), prueba a pulsar kbd:[F12], kbd:[F11], kbd:[F10] o kbd:[Del] varias veces; estas son las teclas mas usadas para acceder. Fíjese que, en la mayoría de sistemas, dispone de una ventana muy pequeña para acceder al menú; una vez pasa, necesitaras reiniciar el sistema e intentarlo otra vez.

source: Some older systems may not support choosing a boot device at startup. In that case, enter the system's SETUP (BIOS), and change the default boot order so that your boot media (CD, DVD, USB or network) has higher priority than internal hard drives.
es: Puede que algunos sistemas mas antiguos no tengan soporte para elegir un dispositivo de arranque cuando se están iniciando. En ese caso, entra al menú SETUP (BIOS), y cambia el orden de arranque para que tus medios de arranque (CD, DVD, USB, o red) tengan mas prioridad que los discos duros internos.

source: On Mac hardware, hold down the kbd:[Option] key to enter the boot media selection menu.
es: En hardware Mac, mantén pulsada la tecla kbd:[Option] para acceder al menú de selección de medios de arranque.

source: When your system's boot menu opens, select an entry such as `Boot from USB` if you created a bootable USB drive, `Boot from CD/DVD` if you are using an optical disc to install {PRODUCT}, or `Boot from PXE` if you want to boot from a network location.
es: Cuando se abra el menú de arranque de tu sistema, selecciona una entrada como `Iniciar desde USB` si has creado un USB de arranque, `Iniciar desde CD/DVD` si estas usando un disco óptico para instalar {PRODUCT}, o `Iniciar desde PXE` si quieres iniciar desde la red.

source: Wait until the boot menu is displayed. The boot menu is described further in this chapter.
es: Espere hasta que se muestre el menú de arranque, El menú de inicio se describe mas adelante en este capitulo.

source: The Boot Menu
es: El Menú de Arranque

source: In most cases, when you boot the {PRODUCT} installer from your prepared boot media or server, the boot menu will be the first thing that appears. From this menu, you can either start the actual installation, or you can use the boot media to rescue an existing system.
es: En la mayoría de casos, cuando inicias el instalador de {PRODUCT} desde tus medios de instalación o servidor, el menú de arranque sera la primera cosa que aparezca en la pantalla. Desde este menú, puedes iniciar la instalación, o usar los medios de instalación para rescatar un sistema ya existente.

source: The way the boot menu will look and function will vary somewhat depending on your system's firmware - BIOS systems use the [application]*SYSLINUX* boot loader, and UEFI systems use [application]*GRUB2*. However, both of the menus described below function very similarly from a user's point of view.
es: La forma que adopte el menú de arranque y sus funciones variaran dependiendo del firmware de tu sistema - los sistemas BIOS usan la aplicación [application]*SYSLINUX*, y los sistemas UEFI usan [application]*GRUB2*. Sin embargo, ambos funcionaran de forma muy similar desde el punto de vista del usuario.

source: The final entry in the list is `Troubleshooting`pass:attributes[{blank}]; this is a submenu. Selecting this entry and pressing kbd:[Enter] will display a new set of selections, where you can choose to install in basic graphics mode (useful if you want to do a manual graphical installation but your system has issues with the default graphical installer), rescue an existing system, or test your system's memory modules for errors (on BIOS systems only). The troubleshooting menu also allows you to exit the boot menu and boot normally from your system's hard drive via the `Boot from local drive` option.
es: La ultima entrada en la lista es `Resolución de problemas`pass:attributes[{blank}]; este es un sub-menú. Tras seleccionar esta entrada y pulsar kbd:[Enter] se mostrara una nueva selección de opciones, donde podrás elegir instalar en modo de gráficos básico (útil si quieres hacer una instalación manual pero tu equipo tiene problemas con el instalador gráfico por defecto), rescatar un sistema existente, o probar los módulos de memoria de tu sistema en búsqueda de errores (solo sistemas BIOS). El menú de resolución de problemas también te permite salir del menú de arranque y iniciar normalmente desde el disco duro de tu sistema a través de la opción `Arranque desde disco local`.

source: Every menu entry in the list is a predefined set of boot options, and these options can be customized to change some aspects of the installer's behavior. To edit the default set of boot options, press kbd:[Tab] on BIOS systems, or kbd:[e] on UEFI systems. The key to use is also displayed at the bottom of the screen.
es: Cada entrada en la lista es un conjunto de opciones de arranque predeterminados, estas opciones se pueden personalizar para cambiar algunos aspectos del comportamiento del instalador. Para editar las opciones de arranque, pulsa kbd:[Tab] en sistemas BIOS, o kbd:[e] en sistemas UEFI. La tecla que hay que usar también se muestra en la parte inferior de la pantalla.

source: Editing boot options in [application]*GRUB2* (on UEFI systems) will display the entire configuration for the selected entry. Actual boot options are configured on the line which starts with the `linux` (or `linux16` or `linuxefi`) keyword. Do not modify any other lines in the configuration.
es: Al editar las opciones de arranque en [application]*GRUB2* (sistemas UEFI) se mostrara la configuración completa para la entrada seleccionada. Las opciones de arranque están configuradas en la linea que empieza con `linux` (o `linux16` o `linuxefi`). No modifique ninguna otra linea en la configuración.

source: On systems with BIOS firmware, only the actual boot options are displayed when you press kbd:[Tab].
es: En los sistemas con firmware BIOS, solo se muestran las opciones de arranque cuando pulsas kbd:[Tab].

source: When editing the default set of options, you can change the existing ones as well as append additional ones. Once you finish, press kbd:[Enter] on BIOS or kbd:[Ctrl + X] on UEFI to boot the installer using your customized options.
es: Cuando este editando la configuración por defecto, puedes tanto cambiar las opciones existentes como añadir opciones adicionales. Una vez que finalizes, pulsa kbd:[Enter] en sistemas BIOS o kbd:[Ctrl + X] en sistemas UEFI para iniciar el instalador usando las opciones personalizadas.

source: Editing boot options on a system with BIOS firmware
es: Editando las opciones de arranque en un sistema BIOS

source: The boot menu.
es: Menu de inicio.

source: All available [application]*Anaconda* boot options are described in xref:advanced/Boot_Options.adoc#sect-boot-options-available[Available Boot Options].
es: Todas las opciones de arranque de [application]*Anaconda* están documentadas en xref:advanced/Boot_Options.adoc#sect-boot-options-available[Available Boot Options].
