Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/install/Installing_Using_Anaconda.po
Languages: uk

source: Installing Using Anaconda
uk: Встановлення за допомогою Anaconda

source: This chapter provides step-by-step instructions for installing {PRODUCT} using the [application]*Anaconda* installer. The bulk of this chapter describes installation using the graphical user interface. A text mode is also available for systems with no graphical display, but this mode is limited in certain aspects (for example, custom partitioning is not possible in text mode).
uk: У цьому розділі наведено покрокові інструкції щодо встановлення {PRODUCT} за допомогою інсталятора [application]*Anaconda*. Основна частина цього розділу описує встановлення за допомогою графічного інтерфейсу користувача. Текстовий режим також доступний для систем без графічного дисплея, але цей режим обмежений певними аспектами (наприклад, ручне розділення диска неможливе у текстовому режимі).

source: If your system does not have the ability to use the graphical mode, you can:
uk: Якщо у вашій системі немає можливості використовувати графічний режим, ви можете:

source: Use Kickstart to automate the installation as described in xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart]
uk: Використовуйте Kickstart для автоматизації встановлення, як описано в xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Автоматизація встановлення за допомогою Kickstart]

source: Perform the graphical installation remotely by connecting to the installation system from another computer with a graphical display using the _VNC_ (Virtual Network Computing) protocol - see xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Installing Using VNC]
uk: Виконайте графічне встановлення віддалено, підключившись до системи встановлення з іншого комп’ютера з графічним дисплеєм за допомогою протоколу _VNC_ (Virtual Network Computing) — див. xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Встановлення за допомогою VNC]

source: Introduction to Anaconda
uk: Знайомство з Anaconda

source: The {PRODUCT} installer, [application]*Anaconda*, is different from most other operating system installation programs due to its parallel nature. Most installers follow a fixed path: you must choose your language first, then you configure network, then installation type, then partitioning, etc. There is usually only one way to proceed at any given time.
uk: Програма встановлення {PRODUCT}, [програма]*Anaconda*, відрізняється від більшості інших програм встановлення операційної системи завдяки своїй паралельній природі. Більшість інсталяторів дотримуються фіксованого шляху: спочатку потрібно вибрати мову, потім налаштувати мережу, потім тип інсталяції, потім розділення тощо. Зазвичай існує лише один спосіб продовжити в будь-який момент часу.

source: In [application]*Anaconda* you are only required to select your language and locale first, and then you are presented with a central screen, where you can configure most aspects of the installation in any order you like. This does not apply to all parts of the installation process, however - for example, when installing from a network location, you must configure the network before you can select which packages to install.
uk: У [application]*Anaconda* вам потрібно лише спочатку вибрати мову та локаль, а потім ви опинитесь на центральному екрані, де ви можете налаштувати більшість аспектів встановлення в будь-якому порядку. Однак це не стосується всіх частин процесу інсталяції - наприклад, під час інсталяції з мережевого розташування ви повинні налаштувати мережу, перш ніж ви зможете вибрати, які пакети інсталювати.

source: Additional differences appear in certain screens; notably the custom partitioning process is very different from other Linux distributions. These differences are described in each screen's subsection.
uk: В певних пунктах з’являються додаткові відмінності; зокрема, власний процес розділення дуже відрізняється від інших дистрибутивів Linux. Ці відмінності описано в підрозділах кожного пункту.

source: Consoles and Logging During the Installation
uk: Консолі та журналювання під час інсталяції

source: The following sections describe how to access logs and an interactive shell during the installation. This is useful when troubleshooting problems, but should not be necessary in most cases.
uk: У наступних розділах описано, як отримати доступ до журналів та інтерактивної оболонки під час встановлення. Це корисно під час усунення несправностей, але в більшості випадків це не обов’язково.

source: Accessing Consoles
uk: Доступ до консолей

source: The {PRODUCT} installer uses the [application]*tmux* terminal multiplexer to display and control several windows you can use in addition to the main interface. Each of these windows serves a different purpose - they display several different logs, which can be used to troubleshoot any issues during the installation, and one of the windows provides an interactive shell prompt with `root` privileges, unless this prompt was specifically disabled using a boot option or a Kickstart command.
uk: Програма встановлення {PRODUCT} використовує термінальний мультиплексор [application]*tmux* для відображення та керування кількома вікнами, які можна використовувати на додаток до основного інтерфейсу. Кожне з цих вікон має різну мету – вони відображають кілька різних журналів, які можна використовувати для усунення будь-яких проблем під час інсталяції, а одне з вікон надає інтерактивну оболонки з привілеями `root`, якщо ця оболонка не була спеціально вимкнена за допомогою параметрів завантаження або команди Kickstart.

source: In general, there is no reason to leave the default graphical installation environment unless you need to diagnose an installation problem.
uk: Загалом, немає причин залишати стандартне графічне середовище встановлення, якщо вам не потрібно діагностувати проблему зі встановленням.

source: The terminal multiplexer is running in virtual console 1. To switch from the actual installation environment to [application]*tmux*, press kbd:[Ctrl + Alt + F1]. To go back to the main installation interface which runs in virtual console 6, press kbd:[Ctrl + Alt + F6].
uk: Мультиплексор терміналу працює у віртуальній консолі 1. Щоб переключитися з фактичного середовища встановлення на [application]*tmux*, натисніть kbd:[Ctrl + Alt + F1]. Щоб повернутися до основного інтерфейсу встановлення, який працює у віртуальній консолі 6, натисніть kbd:[Ctrl + Alt + F6].

source: If you choose text mode installation, you will start in virtual console 1 ([application]*tmux*), and switching to console 6 will open a shell prompt instead of a graphical interface.
uk: Якщо ви виберете інсталяцію в текстовому режимі, ви почнете з віртуальної консолі 1 ([application]*tmux*), а перехід на консоль 6 відкриє інтерактивну оболонку замість графічного інтерфейсу.

source: The console running [application]*tmux* has 5 available windows; their contents are described in the table below, along with keyboard shortcuts used to access them. Note that the keyboard shortcuts are two-part: first press kbd:[Ctrl + b], then release both keys, and press the number key for the window you want to use.
uk: Консоль, на якій запущено [application]*tmux*, має 5 доступних вікон; їхній вміст описано в таблиці нижче разом із сполученнями клавіш, які використовуються для доступу до них. Зауважте, що комбінації клавіш складаються з двох частин: спочатку натисніть kbd:[Ctrl + b], потім відпустіть обидві клавіші та натисніть цифрову клавішу для вікна, яке ви хочете використати.

source: You can also use kbd:[Ctrl + b] kbd:[n] and kbd:[Ctrl + b] kbd:[p] to switch to the next or previous [application]*tmux* window, respectively.
uk: Ви також можете використовувати kbd:[Ctrl + b] kbd:[n] і kbd:[Ctrl + b] kbd:[p], щоб перейти до наступного або попереднього вікна [application]*tmux* відповідно.

source: Available tmux Windows
uk: Доступні вікна tmux

source: |Shortcut|Contents |kbd:[Ctrl + b] kbd:[1]|Main installation program window. Contains text-based prompts (during text mode installation or if you use VNC direct mode), and also some debugging information. |kbd:[Ctrl + b] kbd:[2]|Interactive shell prompt with `root` privileges. |kbd:[Ctrl + b] kbd:[3]|Installation log; displays messages stored in `/tmp/anaconda.log`. |kbd:[Ctrl + b] kbd:[4]|Storage log; displays messages related storage devices from kernel and system services, stored in `/tmp/storage.log`. |kbd:[Ctrl + b] kbd:[5]|Program log; displays messages from other system utilities, stored in `/tmp/program.log`.
uk: |Shortcut|Перелік |kbd:[Ctrl + b] kbd:[1]|Головне вікно інсталяційної програми. Містить текстові підказки (під час встановлення текстового режиму або якщо ви використовуєте прямий режим VNC), а також деяку інформацію про налагодження. |kbd:[Ctrl + b] kbd:[2]|Інтерактивна оболонка з привілеями `root`. |kbd:[Ctrl + b] kbd:[3]|Журнал встановлення; відображає повідомлення, що зберігаються в `/tmp/anaconda.log`. |kbd:[Ctrl + b] kbd:[4]|Журнал зберігання; відображає повідомлення, пов’язані з пристроями зберігання даних від ядра та системних служб, які зберігаються в `/tmp/storage.log`. |kbd:[Ctrl + b] kbd:[5]|Журнал програми; відображає повідомлення від інших системних утиліт, які зберігаються в `/tmp/program.log`.

source: In addition to displaying diagnostic information in [application]*tmux* windows, [application]*Anaconda* also generates several log files, which can be transferred from the installation system. These log files are described in xref:install/Troubleshooting.adoc#sect-troubleshooting-log-files[Log Files Generated During the Installation], and directions for transferring them from the installation system are available in xref:install/Troubleshooting.adoc#sect-troubleshooting-transferring-logs[Transferring Log Files from the Installation System].
uk: Окрім відображення діагностичної інформації у вікнах [application]*tmux*, [application]*Anaconda* також генерує декілька файлів журналу, які можна передати із системи встановлення. Ці файли журналу описані в xref:install/Troubleshooting.adoc#sect-troubleshooting-log-files[файли журналу, створені під час інсталяції], а вказівки щодо їх передачі із системи встановлення доступні в xref:install/Troubleshooting.adoc#sect-troubleshooting-transferring-logs[Передача файлів журналу із системи встановлення].

source: Saving Screenshots
uk: Збереження скріншотів

source: You can press kbd:[Shift + Print Screen] at any time during the graphical installation to capture the current screen. These screenshots are saved to `/tmp/anaconda-screenshots`.
uk: Ви можете натиснути kbd:[Shift + Print Screen] у будь-який час під час графічної інсталяції, щоб захопити поточний екран. Ці знімки екрана зберігаються в `/tmp/anaconda-screenshots`.

source: Additionally, you can use the [command]#autostep --autoscreenshot# command in a Kickstart file to capture and save each step of the installation automatically. See xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-autostep[autostep (optional) - Go Through Every Screen] for details.
uk: Крім того, ви можете використовувати команду [command]#autostep --autoscreenshot# у файлі Kickstart для автоматичного запису та збереження кожного кроку встановлення. Додаткову інформацію див. xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-autostep[autostep (optional) - Go Through Every Screen].

source: Installing in Text Mode
uk: Встановлення в текстовому режимі

source: Text mode installation offers an interactive, non-graphical interface for installing {PRODUCT}. This may be useful on systems with no graphical capabilities; however, you should always consider the available alternatives before starting a text-based installation. Text mode is limited in the amount of choices you can make during the installation.
uk: Встановлення в текстовому режимі пропонує інтерактивний неграфічний інтерфейс для встановлення {PRODUCT}. Це може бути корисним у системах без графічних можливостей; однак, ви завжди повинні розглядати доступні альтернативи перед початком текстової інсталяції. Текстовий режим обмежений у кількості варіантів, які ви можете вибрати під час інсталяції.

source: There are two alternatives to text mode which can both be used even if the installation system does not have a graphical display. You can either connect to the installation system using VNC and perform an interactive graphical installation remotely (see xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Installing Using VNC]), or you can create a Kickstart file to perform the installation automatically (see xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Automating the Installation with Kickstart]).
uk: Є дві альтернативи текстовому режиму, які можна використовувати, навіть якщо система встановлення не має графічного дисплея. Ви можете підключитися до системи інсталяції за допомогою VNC і виконати інтерактивну графічну інсталяцію віддалено (див. xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Встановлення за допомогою VNC]), або ви можете створити файл Kickstart для виконання інсталяції автоматично (див. xref:advanced/Kickstart_Installations.adoc#chap-kickstart-installations[Автоматизація встановлення за допомогою Kickstart]).

source: Text Mode Installation
uk: Інсталяція в текстовому режимі

source: The main menu in during a text-based installation.
uk: Головне меню під час текстового встановлення.

source: Installation in text mode follows a pattern similar to the graphical installation: There is no single fixed progression; you can configure many settings in any order you want using the main status screen. Screens which have already been configured, either automatically or by you, are marked as `[x]`, and screens which require your attention before the installation can begin are marked with `[!]`. Available commands are displayed below the list of available options.
uk: Інсталяція в текстовому режимі відбувається за схемою, подібною до графічної інсталяції: немає єдиної фіксованої послідовності; ви можете налаштувати багато параметрів у будь-якому порядку за допомогою головного екрана налаштувань. Параметри, які вже налаштовано автоматично або вами, позначаються як `[x]`, а параметри, які потребують вашої уваги перед початком встановлення, позначаються `[!]`. Доступні команди відображаються під списком доступних параметрів.

source: Limits of interactive text mode installation include:
uk: Обмеження інсталяції в інтерактивному текстовому режимі включають:

source: The installer will always use the English language and the US English keyboard layout. You can configure your language and keyboard settings, but these settings will only apply to the installed system, not to the installation.
uk: Інсталятор завжди використовуватиме англійську мову та американську англійську розкладку клавіатури. Ви можете налаштувати мову та параметри клавіатури, але ці параметри застосовуватимуться лише до встановленої системи, а не до встановлення.

source: It is not possible to configure custom partitioning; you must use one of the automatic partitioning settings. You also cannot configure where the boot loader will be installed.
uk: Неможливо налаштувати розділення диску по своєму; ви повинні використовувати один із параметрів автоматичного розділення. Ви також не можете налаштувати місце встановлення завантажувача.

source: To start a text mode installation, boot the installation with the [option]#inst.text# boot option used either at the boot command line in the boot menu, or in your PXE server configuration. See xref:install/Booting_the_Installation.adoc#chap-booting-the-installation[Booting the Installation] for information about booting and using boot options.
uk: Щоб розпочати інсталяцію в текстовому режимі, завантажте інсталяцію за допомогою параметра [option]#inst.text#, який використовується або в командному рядку завантаження в меню завантаження, або в конфігурації сервера PXE. Див. xref:install/Booting_the_Installation.adoc#chap-booting-the-installation[Завантаження інсталяції], щоб отримати інформацію про завантаження та використання параметрів завантаження.

source: Installing in the Graphical User Interface
uk: Встановлення в графічному інтерфейсі

source: The graphical installation interface is the preferred method of manually installing {PRODUCT}. It allows you full control over all available settings, including custom partitioning and advanced storage configuration, and it is also localized to many languages other than English, allowing you to perform the entire installation in a different language. The graphical mode is used by default when you boot the system from local media (a CD, DVD or a USB flash drive).
uk: Графічний інтерфейс інсталяції є кращим способом інсталяції {PRODUCT} вручну. Він дає вам повний контроль над усіма доступними параметрами, включаючи розділення диску та розширену конфігурацію сховища, а також локалізацію для багатьох мов, окрім англійської, що дозволяє виконувати всю установку іншою мовою. Графічний режим використовується за замовчуванням, коли ви завантажуєте систему з локального носія (CD, DVD або флеш-диск).

source: The sections below discuss each screen available in the installation process. Note that due to the installer's parallel nature, most of the screens do not have to be completed in the order in which they are described here.
uk: У розділах нижче розглядається всі параметри, доступні у процесі встановлення. Зауважте, що через паралельну природу інсталятора більшість параметрів не потрібно налаштовувати в тому порядку, у якому вони тут описані.

source: Each screen in the graphical interface contains a `Help` button. This button opens the [application]*Yelp* help browser displaying the section of the _{PRODUCT} Installation Guide_ relevant to the current screen.
uk: Кожен екран у графічному інтерфейсі містить кнопку «Довідка». Ця кнопка відкриває довідковий браузер [application]*Yelp*, де відображається розділ посібника з встановлення _{PRODUCT}_, що стосується поточного екрана.

source: You can also control the graphical installer with your keyboard. Use kbd:[Tab] and kbd:[Shift + Tab] to cycle through active control elements (buttons, check boxes, etc.) on the current screen, kbd:[Up] and kbd:[Down] arrow keys to scroll through lists, and kbd:[Left] and kbd:[Right] to scroll through horizontal toolbars or table entries. kbd:[Space] or kbd:[Enter] can be used to select or remove a highlighted item from selection and to expand and collapse drop-down menus.
uk: Ви також можете керувати графічним інсталятором за допомогою клавіатури. Використовуйте kbd:[Tab] і kbd:[Shift + Tab] для циклічного переходу між активними елементами керування (кнопками, прапорцями тощо) на поточному екрані, клавіші зі стрілками kbd:[Вгору] і kbd:[Вниз] для прокручування списків та kbd:[Left] і kbd:[Right] для прокручування горизонтальних панелей інструментів або записів таблиці. kbd:[Пробіл] або kbd:[Enter] можна використовувати для вибору або видалення виділеного елемента, а також для розгортання та згортання спадних меню.

source: Additionally, elements in each screen can be toggled using their respective shortcuts. These shortcuts are highlighted (underlined) when you hold down the kbd:[Alt] key; to toggle that element, press kbd:[Alt + _X_pass:attributes[{blank}]], where _X_ is the highlighted letter.
uk: Крім того, елементи на кожному екрані можна перемикати за допомогою відповідних ярликів. Ці ярлики виділяються (підкреслюються), коли ви утримуєте клавішу kbd:[Alt]; щоб перемкнути цей елемент, натисніть kbd:[Alt + _X_pass:attributes[{blank}]], де _X_ — це виділена літера.

source: Your current keyboard layout is displayed in the top right hand corner. Only one layout is configured by default; if you configure more than layout in the `Keyboard Layout` screen (xref:sect-installation-gui-keyboard-layout[Keyboard Layout]), you can switch between them by clicking the layout indicator.
uk: Ваша поточна розкладка клавіатури відображається у верхньому правому куті. За замовчуванням налаштовано лише один варіант; якщо на екрані `Розкладка клавіатури` (xref:sect-installation-gui-keyboard-layout[Розкладка клавіатури]) ви налаштовуєте більше ніж одну розкладку, ви можете переключатися між ними, клацаючи індикатор розкладки.
