Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/install/Troubleshooting.po
Languages: es

source: Some BIOS types do not support booting from RAID cards. After you finish the installation and reboot the system for the first time, a text-based screen showing the boot loader prompt (for example, `grub>`) and a flashing cursor may be all that appears. If this is the case, you must repartition your system and move your `/boot` partition and the boot loader outside the RAID array. The `/boot` partition and the boot loader must be on the same drive.
es: Algunos tipos de BIOS no soportan el arranque desde tarjetas RAID. Después de que termine la instalación y reinicie el sistema por primera vez debe parecer una pantalla de texto mostrando el símbolo del sistema del cargador de arranque (por ejemplo, `grub>`) y todo lo que debe aparecer es un cursor intermitente. Si es este el caso, debe volver a particionar su sistema y llevar su partición `/boot` y el cargador de arranque fuera del conjunto RAID. La partición `/boot` y el cargador de arranque deben estar en el mismo dispositivo.

source: Once these changes have been made, you should be able to finish your installation and boot the system properly. For more information about partitioning, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination].
es: Una vez que se han hecho estos cambios debería ser capaz de terminar su instalación y arrancar el sistema apropiadament. Más información sobre el particionado en xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Destino de la Instalación].

source: Trouble With the Graphical Boot Sequence
es: Problemas Con la Secuencia de Arranque Gráfico

source: After you finish the installation and reboot your system for the first time, it is possible that the system stops responding during the graphical boot sequence, requiring a reset. In this case, the boot loader is displayed successfully, but selecting any entry and attempting to boot the system results in a halt. This usually means a problem with the graphical boot sequence; to solve this issue, you must disable graphical boot. To do this, temporarily alter the setting at boot time before changing it permanently.
es: Después de que termine la instalación y reinicie el sistema por primera vez es posible que el sistema deje de responder durante la secuencia de arranque gráfico, requiriendo un reajuste. En este caso, el cargaor de arranque se visualizará bien pero al seleccioar cualquier entrada e intentar arrancar el sistema lleva a una parada. Esto normalmente significa que hay un problema con la secuencia de arranque gráfico; para resolver esta cuestión debe deshabilitar el arranque gráfico. Para hacer esto, altere temporalmente el ajuste en el momento del arranque antes de cambiarlo permanentemente.

source: Disabling Graphical Boot Temporarily
es: Deshabilitar el Arranque Gráfico Temporalmente

source: Start your computer and wait until the boot loader menu appears. If you set your boot loader timeout period to 0, hold down the kbd:[Esc] key to access it.
es: Encienda su ordenaor y espere hasta que aparezca el menú del cargador de arranque. Si estableció el tiempo de salida del cargador de arranque a = pulse la tecla kbd:[Esc] para acceder.

source: When the boot loader menu appears, use your cursor keys to highlight the entry you want to boot and press the kbd:[e] key to edit this entry's options.
es: Cuando aparezca el menú del cargador de arraque utilice sus teclas de cursor para resaltar la entrada en la que desea arrancar y pulse la tecla kbd:[e] para editar las opciones de esta entrada.

source: In the list of options, find the kernel line - that is, the line beginning with the keyword `linux` (or, in some cases, `linux16` or `linuxefi`). On this line, locate the `rhgb` option and delete it. The option may not be immediately visible; use the cursor keys to scroll up and down.
es: En la lista de opciones busque la línea kernel - esto es, la línea que empieza con la palabra clave `linux` (o, en algunos casos, `linux16` o `linuxefi`). En esta línea, localice la opción `rhgb` y borrela. La opción puede ser que no esté visible inmediatamente; use las teclas de cursor para ir arraba y abajo.

source: Press kbd:[F10] or kbd:[Ctrl + X] to boot your system with the edited options.
es: Presione kbd:[F10] o kbd:[Ctrl + X] para arrancar su sistema con las opciones editadas.

source: If the system started successfully, you can log in normally. Then you will need to disable the graphical boot permanently - otherwise you will have to perform the previous procedure every time the system boots. To permanently change boot options, do the following.
es: Si el sistema arranca con éxito ysted puede acceder normalmente. Entonces usted necesitará deshabilitar el arranque gráfico permanentemente - de otro modo tendrá que llevar a cabo el procedimiento anterios cada vez que arranque el sistema. Para cambiar las opciones de arranque permanentemente, haga lo siguiente.

source: Disabling Graphical Boot Permanently
es: Deshabilitando el Arranque Gráfico Permanentemente

source: Log in to the `root` account using the [command]#su -# command:
es: Acceda a la cuenta `root` usando el comando [command]#su -#:

source: Open the `/etc/default/grub` configuration file using a plain text editor such as [application]*vim*.
es: Abra el archivo de configuración `/etc/default/grub` usando un editor de texto plano como [application]*vim*.

source: Within the `grub` file, locate the line beginning with `GRUB_CMDLINE_LINUX`. The line should look similar to the following:
es: Dentro del archivo `grub`, localice la línea que empieza con `GRUB_CMDLINE_LINUX`. La línea debería parecerse a lo siguiente:

source: On this line, delete the `rhgb` option.
es: En este línea, borre la opción `rhgb`.

source: Save the edited configuration file.
es: Guarde el archivo de configuración editado.

source: Refresh the boot loader configuration by executing the following command:
es: Refresque la configuración del cargador de arranque ejecutando el siguiente comando:

source: After you finish this procedure, you can reboot your computer. {PRODUCT} will not use the graphical boot sequence any more. If you wish to enable graphical boot, follow the same procedure, add the `rhgb` option to the `GRUB_CMDLINE_LINUX` line in the `/etc/default/grub` file and refresh the boot loader configuration again using the [command]#grub2-mkconfig# command.
es: Después de que termine este procedimiento puede reiniciar su ordenador. {PRODUCT} no usará nunca más la secuencia de arranque gráfico. Si desea habilitar el arranque gráfico, siga el mismo procedimiento añadiendo la opción `rhgb` a la línea `GRUB_CMDLINE_LINUX` en el archivo `/etc/default/grub` y refresque la configuración del cargador de arranque otra vez usando el comando [command]#grub2-mkconfig#.

source: See the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[], for more information about working with the [application]*GRUB2* boot loader.
es: Vean en la [citetitle]_{PRODUCT} Guía de Administrador del Sistema_, disponible en link:++https://docs.fedoraproject.org/++[], más información sobre el trabajo con el cargador de arranque [application]*GRUB2*.

source: Booting into a Graphical Environment
es: Arrancar en un Entorno Gráfico

source: If you have installed the [application]*X Window System* and a desktop environment such as [application]*GNOME*, but are not seeing a graphical desktop environment once you log into your system, you can start it manually using the [command]#startx# command. Note, however, that this is just a one-time fix and does not change the log in process for future log ins.
es: Si usted tiene instalado [application]*X Window System* y un entorno de escritorio como [application]*GNOME*, pero no está viendo un entorno de escritorio gráfico una vez que ha accedido a su sistema, puede arráncarlo manualmente usando el comando [command]#startx#. Advierta, sin embargo, que esto lo corrige para una sola vez y no cambia el proceso de acceso para futuros accesos.

source: To set up your system so that you can log in at a graphical login screen, you must change the default [application]*systemd* target to `graphical.target`. When you are finished, reboot the computer. You will presented with a graphical login prompt after the system restarts.
es: Para configurar su sistema de modo que puede acceder en una pantalla de acceso gráfica, debe cambiar el objetivo de [application]*systemd* a `graphical.target`. Cuando haya terminado, reinicie el ordenador. Se le presentará una petiión de acceso gráfica después de que el sistema arranque.

source: Setting Graphical Login as Default
es: Configurar el Acceso Gráfico como Predeterminado

source: Open a shell prompt. If you are in your user account, become root by typing the [command]#su -# command.
es: Abra un terminal de shell. Si está en una cuenta de usuario, hágase root tecleando el comando [command]#su -#.

source: Change the default target to `graphical.target`. To do this, execute the following command:
es: Cambie el objetivo predeterminado a `graphical.target`. Para hacer esto, ejecute el siguiente comando:

source: Graphical login is now enabled by default - you will be presented with a graphical login prompt after the next reboot. If you want to reverse this change and keep using the text-based login prompt, execute the following command as `root`:
es: El acceso gráfico está habilitado ahora de modo predeterminado - se le presentará un indicador de inicio de sesión gŕafico después del próximo reinicio. Si desea revertir este cambio usando un indicador de inicio de sesión basado en texto, ejecute el siguiente comando como `root`:

source: For more information about targets in [application]*systemd*, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
es: Para más información sobre objetivos en [application]*systemd*, vea la [citetitle]_{PRODUCT} Guía de Administrador del Sisema_, disoponible en link:++https://docs.fedoraproject.org/++[].

source: No Graphical User Interface Present
es: No Hay Interfaz Gráfica de Usuario Presente

source: If you are having trouble getting [application]*X* (the [application]*X Window System*) to start, it is possible that it has not been installed. Some of the pre-set base environments you can select during the installation, such as `Minimal install` or `Web Server`, do not include a graphical interface - it has to be installed manually.
es: Si tiene problemas obteniendo [application]*X* (el [application]*X Window System*) para arrancar, es posible que no haya sido instalado. Algunos de los entorno base preestablecidos que puede seleccionar durante la instalación como `Minimal install` o `Web Server`, no incluyen interfaz gráfica - tiene que ser instalada manualmente.

source: If you want [application]*X*, you can install the necessary packages after the installation using the [application]*DNF* package manager. For example, to install [application]*GNOME*, use [command]#dnf install gnome-shell# as `root`.
es: Si desea [application]*X*, puede instalar los paquetes necesarios después de la instalación usando el administrador de paquetes [application]*DNF*. Por ejemplo, para instalar [application]*GNOME*, use como `root` [command]#dnf install gnome-shell# .

source: X Server Crashing After User Logs In
es: El Servidor X Falla Después de que el Usuario Haya Iniciado Sesión

source: If you are having trouble with the [application]*X* server crashing when a user logs in, one or more of your file systems may be full (or nearly full). To verify that this is the problem you are experiencing, execute the following command:
es: Si tiene problemas con el servidor [application]*X* que falla después que un usuario acceda, uno o más de sus sistemas de archivos pueden estar llenos (o cerca de estarlo). Para verificar que este el problema que está experimentando, ejecute el siguiente comando:

source: The output will help you diagnose which partition is full - in most cases, the problem will be on the `/home` partition. A sample output of the [command]#df# command may look similar to the following:
es: La salida le ayudará a diagnosticar que partición está llena - en la mayoría de los casos el problema estará en la partición `/home`. Una salida de muestra del comando [command]#df# puede parecer similar a la siguiente:

source: In the above example, you can see that the `/home` partition is full, which causes the crash. You can make some room on the partition by removing unneeded files. After you free up some disk space, start [application]*X* using the [command]#startx# command.
es: En el ejemplo de anterior puede ver que la partición `/home` está llena, lo que provoca el problema. Puede hacer espacio en la partición borrando archivos innecesarios. Después de que libere algún espacio en el disco, inicie [application]*X* usando el comando [command]#startx#.

source: For additional information about [command]#df# and an explanation of the options available (such as the [option]#-h# option used in this example), see the `df(1)` man page.
es: Para información adicional sobre [command]#df# y una explicación de las opciones disponbles (como la opción [option]#-h# usada en el ejemplo), vea la página man `df(1)`.

source: Is Your RAM Not Being Recognized?
es: ¿No Se Reconoce su RAM?

source: In some cases the kernel does not recognize all of your memory (RAM), which causes the system to use less memory than is installed. You can find out how much RAM is being utilized using the [command]#free -m# command. If the displayed total amount of memory does not match your expectations, it is likely that at least one of your memory modules is faulty. On BIOS-based systems, you can use the [application]*Memtest86+* utility to test your system's memory - see xref:advanced/Boot_Options.adoc#sect-boot-options-memtest[Loading the Memory (RAM) Testing Mode] for details.
es: En algunos casos el kernel no recomoce toda su memoria (RAM), lo que causa que el sistema use menos memoria de la que tiene instalada. Usted puede saber cuanta RAM se esta utilizando usando el comando [command]#free -m#. Si la cantida total de memoria visualizada no coincide con sus expectativas, es posible que al menos uno de sus módulos de memoria falle. En los sistemas basados en BIOS, puede usar la utilidad [application]*Memtest86+* para probar la memoria de su sistema - vea detalles xref:advanced/Boot_Options.adoc#sect-boot-options-memtest[Cargando el Modo de Prueba de Memoria (RAM)].

source: If you have 4GB or more memory installed, but {PRODUCT} only shows around 3.5GB or 3.7GB, you have probably installed a 32-bit version of {PRODUCT} on a 64bit kernel. For modern systems, use the 64-bit (x86_64) version.
es: Si tiene 4GB o más de memoria instalada, pero {PRODUCT} solo muestra alrededor de 3.5GB o 3.7GB, usted tiene, probablemente, instalada la versión de 32-bit de {PRODUCT} sobre un kernel de 64bit. Para sistemas modernos, use la versión de 64-bit (x86_64).

source: Some hardware configurations have a part of the system's RAM reserved and unavailable to the main system. Notably, laptop computers with integrated graphics cards will reserve some memory for the GPU. For example, a laptop with 4{nbsp}GB of RAM and an integrated Intel graphics card will show only roughly 3.7{nbsp}GB of available memory, even with a 64-bit system.
es: Algunas configuraciones hardware tienen una parte de la RAM del sistema reservada y no disponibles para el sistema principal. Notablemente, los ordenadores portátiles con tarjetas gráficas integradas reservarán memoria para la GPU. Por ejemplo, un portátil con 4{nbsp}GB de RAM y una tarjeta gráfica Intel integrada mostrará aproximadamente solo 3.7{nbsp}GB de memoria disponible, incluso con un sistema de 64-bit.

source: Additionally, the [application]*kdump* crash kernel dumping mechanism reserves some memory for the secondary kernel used in case of the primary kernel crashing. This reserved memory will also not be displayed as available when using the [command]#free# command. For details about [application]*kdump* and its memory requirements, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
es: Adicionalmente, [application]*kdump* el mecanismo de volcado de rupturas del kernel reserva alguna memoria para el kernel secundario que se usa en caso de ruptura del kernel primario. Esta memoria reservada tampoco se mostrará como disponible cuando se usa el comando [command]#free#. Para detalles sobre [application]*kdump* y sus requisitos de memoria, vea la [citetitle]_{PRODUCT} Guía de Adminstrador del Sistema_, disponible en link:++https://docs.fedoraproject.org/++[].

source: If you made sure that your memory does not have any issues, you can try and set the amount of memory manually using the [option]#mem=# kernel option.
es: Si está seguro de que su memoria no tiene ningún problema, puede probar y configurar la memoria manualmente usando la opción del kernel [option]#mem=#.

source: Configuring the Memory Manually
es: Configurar la Memoria Manualmente

source: In the list of options, find the kernel line - that is, the line beginning with the keyword `linux` (or, in some cases, `linux16`). Append the following option to the end of this line:
es: En la lista de opciones, bsque la línea kernel - esto es, la línea que empieza con la palabra clave `linux` (o, en algunos casos, `linux16`). Añada la siguiente opción al final de esta línea:

source: Replace _xx_ with the amount of RAM you have in megabytes.
es: Reemplace _xx_ con la cantidad de RAM que tiene en megabytes.

source: Wait for the system to boot and log in. Then, open a command line and execute the [command]#free -m# command again. If total amount of RAM displayed by the command matches your expectations, append the following to the line beginning with `GRUB_CMDLINE_LINUX` in the `/etc/default/grub` file to make the change permanent:
es: Espere a que el sistema arranque y acceda. Después, abra un terminal y ejecute otra vez el comando [command]#free -m#. Si la cantidad total de RAM mostrada coincide con sus expectativas, añada lo siguiente a la línea que empieza con `GRUB_CMDLINE_LINUX` en el archivo `/etc/default/grub` para hacer el cambio permanente:

source: After you updated the file and saved it, refresh the boot loader configuration so that the change will take effect. Run the following command with root privileges:
es: Despues actualice el archivo y guardelo, refresque la configuración del cargador de arranque para que el cambio tenga efecto. Ejecute el siguiente comando con privilegios de root:

source: In `/etc/default/grub`, the above example would look similar to the following:
es: En `/etc/default/grub`, el ejemplo anterior deberia ser similar a lo siguiente:
