Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/install/Troubleshooting.po
Languages: es

source: Troubleshooting
es: Soporte

source: This chapter offers some pointers on how to get help when something goes wrong. It also discusses some common installation problems and their solutions.
es: Este capítulo ofrece algunos apuntes sobre como obtener ayuda cuando algo va mal. Tambien desarrolla algunos problemas comunes de instalación y sus soluciones.

source: Getting Help
es: Obteniendo Ayuda

source: There are many places on the internet which can help you when you encounter a problem not described in this chapter: discussion boards, blogs, IRC, and more. Some of the more popular places where you can find help include:
es: Hay muchos sitios en internet que le pueden ayudar cuando usted encuentre un problema no descrito en este capítulo: foros de discusión, blogs, IRC y más. Algunos de los sitios más populares que puede encontrar son:

source: link:++https://ask.fedoraproject.org/en/questions/++[Ask Fedora] - Fedora's knowledge base, available in multiple languages
es: link:++https://ask.fedoraproject.org/en/questions/++[Ask Fedora] - base de datos de conocimiento de Fedora, disponible en diversos idiomas

source: The #fedora IRC channel on link:++https://freenode.net//++[FreeNode] - one of the main IRC channels used by Fedora users, English only
es: El canal IRC #fedora en link:++https://freenode.net//++[FreeNode] - uno de los principales canales IRC usados por los usuarios de Fedora, sólo en inglés

source: link:++https://fedoraproject.org/wiki/++[Fedora Project Wiki] - the official wiki for Fedora Project
es: link:++https://fedoraproject.org/wiki/++[Fedora Project Wiki] - la wiki oficial para el Proyecto Fedora

source: link:++https://unix.stackexchange.com/++[Stack Exchange] - an English language Q&A board, not specific to Fedora
es: link:++https://unix.stackexchange.com/++[Stack Exchange] - un tablero de preguntas y respuestas en Inglés, no específico de Fedora

source: The above list is by no means complete - you can find help in many other places as well. Additional information about available resources such as IRC channels and mailing lists is available at link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[].
es: La lista anterior no está completa - puede encontrar ayuda en muchos otros sitios también. Información adicional sobre recursos disponibles como canales IRC y listas de correo está disponible en link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[].

source: Before you open a new discussion or ask anyone for help on IRC, you should always do some research on your own. If you are encountering an issue, there is usually a good chance that someone else ran into the same problem before you and published a solution somewhere. Opening a discussion about something already explained elsewhere, or asking a common question which has been answered many times before, is not likely to result in a friendly, constructive response.
es: Antes de abrir un nuevo debate o pedir ayuda a alguien en la IRC, debería hacer siempre alguna búsqueda usted mismo. Si se encuentra con un problema, por lo general existe una buena posibilidad de que alguien haya tenido el mismo problema antes y haya publicado una solución en alguna parte. Abrir una cuestión sobre algo ya explicado en algún sitio o preguntando sobre cuestiones que hayan sido contestadas muchas veces antes no es probable que lleve a una respuesta amistosa o constructiva.

source: When you ask for help troubleshooting problems related to the installation, you may be asked to provide log files generated by the installer. The sections below explain which files are generated, what their contents are, and how to transfer them from the installation system.
es: Cuando usted pide ayuda para resolver problemas relacionados con la instalación puede que se le pida que proporcione archvos de registro generados por el instalador. La siguientes secciones explican que archivos se generan, cúal es su contenido y como transferirlos desde la instalación del sistema.

source: Log Files Generated During the Installation
es: Archivos de Registro Generados Durante la Instalación

source: For debugging purposes, [application]*Anaconda* logs installation actions into files in the `/tmp` directory. These files are listed in the following table.
es: Para fines de depuración [application]*Anaconda* registra las acciones de instalación en archivos en el directorio `/tmp`. Estos archivos se listan en la siguiente tabla.

source: Log Files and Their Contents
es: Archivos de Registro y Sus Contenidos

source: |Log file|Contents |`/tmp/anaconda.log`|general [application]*Anaconda* messages |`/tmp/program.log`|all external programs run during the installation |`/tmp/storage.log`|extensive storage module information |`/tmp/packaging.log`|[application]*dnf* and [application]*rpm* package installation messages |`/tmp/syslog`|hardware-related system messages
es: |Archivo de registro|Contenidos |`/tmp/anaconda.log`|mensajes generales de [application]*Anaconda* |`/tmp/program.log`|todos los programas externos ejecutados durante la instalación |`/tmp/storage.log`|amplia información del módulo de almacenamiento |`/tmp/packaging.log`|mensajes de instalación de paquetes [application]*dnf* y [application]*rpm* |`/tmp/syslog`|mensajes del sistema relacionados con el hardware

source: If the installation fails, the messages from these files are consolidated into `/tmp/anaconda-tb-_identifier_pass:attributes[{blank}]`, where _identifier_ is a random string.
es: Si la instalación falla, los mensajes de estos archivos se consolidan en `/tmp/anaconda-tb-_identifier_pass:attributes[{blank}]`, donde _identifier_ es una cadena aleatoria.

source: Transferring Log Files from the Installation System
es: Transfiriendo Archivos de Registro desde la Instalación del Sistema

source: Transferring Log Files Onto a USB Drive
es: Transfiriendo los Archivos de Registro a un Dispositivo USB

source: On the system you are installing, press kbd:[Ctrl + Alt + F2] to access a shell prompt. You will be logged into a root account and you will have access to the installation program's temporary file system.
es: En el sistema que está instalando, presione kbd:[Ctrl + Alt + F2] para acceder al símbolo del sistema. Accederá en una cuenta root y tendrá acceso al sistema de archivos temporal del programa de instalación.

source: Connect a USB flash drive to the system and execute the [command]#dmesg# command. A log detailing all recent events will be displayed. At the bottom of this log, you will see a set of messages caused by the USB flash drive you just connected. It will look like a set of lines similar to the following:
es: Conecte el dispositivo flash USB al sistema y ejecute el comando [command]#dmesg#. Se mostrará un registro detallando todos los eventos recientes. Al final de este registro verá un conjunto de mensajes originados por el dispositivo flash USB que acaba de conectar. Se verá como un conjunto de líneas parecidas a las siguientes:

source: Note the name of the connected device - in the above example, it is `sdb`.
es: Observe el nombre del dispositivo conectado - en el ejemplo anterior es `sdb`.

source: Go to the `/mnt` directory and once there, create new directory which will serve as the mount target for the USB drive. The name of the directory does not matter; this example uses the name `usb`.
es: Vaya al directorio `/mnt` y una vez allí cree un nuevo directorio que le servirá como punto de montaje del dispositivo USB. El nombre del directorio no tiene importancia; este ejemplo usa el nombre `usb`.

source: Mount the USB flash drive onto the newly created directory. Note that in most cases, you do not want to mount the whole drive, but a partition on it. Therefore, do not use the name `sdb` - use the name of the partition you want to write the log files to. In this example, the name `sdb1` is used.
es: Monte el dispositivo flash USB en el directorio recién creado. Observe que en la mayoría de los casos no querrá montar el dispositivo entero sino solo una partición. Por lo tanto, no use el nombre `sdb` - utilice el nombre de la partición donde desea escribir los archivos de registro. En este ejemplo se usa el nombre `sdb1`.

source: You can now verify that you mounted the correct device and partition by accessing it and listing its contents - the list should match what you expect to be on the drive.
es: Usted puede ahora verificar que ha montado el dispositivo correcto y la partición accediendo y listando sus contenido - la lista debería coincidir con lo que usted espera que haya en el dispositivo.

source: Copy the log files to the mounted device.
es: Copie los archivos de registro en el dispositivo montado.

source: Unmount the USB flash drive. If you get an error message saying that the target is busy, change your working directory to outside the mount (for example, `/`).
es: Desmonte el dispositivo flash USB. Si le aparece un mensaje de error diciendo que el dispositivo está ocupado, cambie el directorio de trabajo fuera del punto de montaje (por ejemplo, `/`).

source: The log files from the installation are now saved on the USB flash drive.
es: Los archivos de registro de la instalación están ahora guardados en el dispositivo flash USB.

source: Transferring Log Files Over the Network
es: Transfiriendo los Archivos de Registro Sobre la Red

source: Switch to the `/tmp` directory where the log files are located:
es: Vaya al directorio `/tmp` donde están situados los archivos de registro:

source: Copy the log files onto another system on the network using the [command]#scp# command:
es: Copie los archivos de registro en otro sistema en la red usando el comando [command]#scp#:

source: Replace _user_ with a valid user name on the target system, _address_ with the target system's address or host name, and _path_ with the path to the directory you wish to save the log files into. For example, if you want to log in as `john` to a system with an IP address of `192.168.0.122` and place the log files into the `/home/john/logs/` directory on that system, the command will have the following form:
es: Reemplace _user_ con un nombre válido de usuario en el sistema objetivo, _address_ con la dirección o nombre de host del sistema objetivo y _path_ con la ruta al directorio donde quiere guardar los archivos de registro. Por ejemplo, si desea acceder como `john` a un sistema con la dirección IP `192.168.0.122` y colocar los archivos de registro en el directorio `/home/john/logs/` de ese sistema, el comando tendrá la siguiente forma:

source: When connecting to the target system for the first time, you may encounter a message similar to the following:
es: Cuando se conecte al sistema objetivo por primera vez puede que encuentre un mensaje parecido al siguiente:

source: Type `yes` and press kbd:[Enter] to continue. Then, provide a valid password when prompted. The files will start transferring to the specified directory on the target system.
es: Teclee `yes` y pulse kbd:[Enter] para continuar. Después, dé una contraseña válida cuando se le pida. Los ficheros empezarán a transferirse al directorio especificado en el sistema objetivo.

source: The log files from the installation are now permanently saved on the target system and available for review.
es: Los archivos de registro están ahora guardados permanentemente en el sistema objetivo y disponibles para ser revisados.

source: Trouble Beginning the Installation
es: Problemas Empezando la Instalación

source: Problems with Booting into the Graphical Installation
es: Problemas con el Arranque de la Instalación Gráfica

source: Systems with some video cards have trouble booting into the graphical installation program. If the installation program does not run using its default settings, it attempts to run in a lower resolution mode. If that still fails, the installation program attempts to run in text mode.
es: Los sistemas con algunas tarjetas de vídeo tienen problemas arrancando el programa de instalación gráfica. Si el programa de instalación no corre usando sus ajustes predeterminados inténtelo en un modo de resolución más bajo. Si sigue fallando, el programa de instalación intentará correr en modo texto.

source: There are several possible solutions to display issues, most of which involve specifying custom boot options. For more information, see xref:advanced/Boot_Options.adoc#sect-boot-options-installer[Configuring the Installation System at the Boot Menu].
es: Hay diversas posibles soluciones a cuestiones de visualización, la mayoría de las cuales implica especificar opciones de arranque personalizadas. Para más información, vea xref:advanced/Boot_Options.adoc#sect-boot-options-installer[Configurando la Instalación del Sistema en el Menú de Arranque].

source: Use the basic graphics mode
es: Utilizar el modo gráfico básico

source: You can attempt to perform the installation using the basic graphics driver. To do this, edit the installation program's boot options and append [option]#inst.xdriver=vesa# at the end of the command line.
es: Usted puede intentar llevar a cabo la instalación usando el controlador básico de gráficos. Para hacer esto, edite las opciones de arranque del programa de instalación y añada [option]#inst.xdriver=vesa# al final de la línea de comando.

source: Specify the display resolution manually
es: Especificar las resolución de pantalla manualmente

source: If the installation program fails to detect your screen resolution, you can override the automatic detection and specify it manually. To do this, append the [option]#inst.resolution=pass:attributes[{blank}]_x_pass:attributes[{blank}]# option at the boot menu, where _x_ is your display's resolution (for example, `1024x768`).
es: Si el programa de instalación falla al detectar su resolución de pantalla usted puede anualar la detección automática y especificarla manualmente. Para hacer esto, añada la opción [option]#inst.resolution=pass:attributes[{blank}]_x_pass:attributes[{blank}]# al menú de arranque, donde _x_ es su resolución de pantalla (por ejemplo, `1024x768`).

source: Use an alternate video driver
es: Usar un controlador de vídeo alternativo

source: You can also attempt to specify a custom video driver, overriding the installation program's automatic detection. To specify a driver, use the [option]#inst.xdriver=pass:attributes[{blank}]_x_pass:attributes[{blank}]# option, where _x_ is the device driver you want to use (for example, `nouveau`).
es: También puede intentar especificar un controlador de vídeo personal anulando la detección automática del programa de instalación. Para especificar un controlador, use la opción [option]#inst.xdriver=pass:attributes[{blank}]_x_pass:attributes[{blank}]#, donde _x_ es el controlador de dispositivo que desea usar (por ejemplo, `nouveau`).

source: If specifying a custom video driver solves your problem, you should report it as a bug at link:++https://bugzilla.redhat.com++[] under the `anaconda` component. [application]*Anaconda* should be able to detect your hardware automatically and use the appropriate driver without your intervention.
es: Si especificando un controlador personal resuelve su problema debería informar esto como un error en link:++https://bugzilla.redhat.com++[] bajo el componente `anaconda`. [application]*Anaconda* deberia ser capaz de detectar su hardware automáticamente y usar el controlador apropiado sin su intervención.

source: Perform the installation using VNC
es: Llevar a cabo la instalación usando VNC

source: If the above options fail, you can use a separate system to access the graphical installation over the network, using the _Virtual Network Computing_ (VNC) protocol. For details on installing using VNC, see xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Installing Using VNC].
es: Si las opciones anteriores fallan usted puede usar un sistema separado para acceder a la instalación gráfica a través de la red, usando el protocolo _Computación de Red Virtual_ (VNC). Para detalles sobre la instalación usando VNC vea xref:advanced/VNC_Installations.adoc#chap-vnc-installations[Instalación Usando VNC].

source: Serial Console Not Detected
es: Consola Serie No Detectada

source: In some cases, attempting to install in text mode using a serial console will result in no output on the console. This happens on systems which have a graphics card, but no monitor connected. If [application]*Anaconda* detects a graphics card, it will attempt to use it for a display, even if no display is connected.
es: En algunos casos, al intentar la instalación en modo texto usando una consola serie puede resultar que no haya salida en la consola. Esto sucede en sistemas que tienen tarjeta gráfica pero no tienen monitor conectado. Si [application]*Anaconda* detecta una tarjeta gráfica intentará usarla para visualizar aunque no haya pantalla conectada.

source: If you want to perform a text-based installation on a serial console, use the [option]#inst.text# and [option]#console=# boot options. See xref:advanced/Boot_Options.adoc#chap-anaconda-boot-options[Boot Options] for more details.
es: Si desea llevar a cabo una instalación basada en texto sobre una consola serie utilice las opciones de arranque [option]#inst.text# y [option]#console=#. Vea más detalles en xref:advanced/Boot_Options.adoc#chap-anaconda-boot-options[Opciones de Arranque].

source: Trouble During the Installation
es: Problemas Durante la Instalación

source: No Disks Detected
es: No se Detectan Discos

source: In the `Installation Destination` screen, the following error message may appear at the bottom: `No disks detected. Please shut down the computer, connect at least one disk, and restart to complete installation`.
es: En la pantalla `Destino de la Instalación` puede aparecer el siguiente mensaje de error en la parte inferior: `No se detectan discos. Por favor apague el ordenador, conecte al menos un disco y reinicie la instalación completa`.

source: The message indicates that [application]*Anaconda* did not find any writable storage devices to install to. In that case, first make sure that your system does have at least one storage device attached.
es: El mensaje indica que [application]*Anaconda* no encuentra ningún dispositivo de almecemiento en el que pueda escribir para instalar. En este caso, asegure primero que su sistema tiene al menos un dispositivo de almacenamiento conectado.

source: If your system uses a hardware RAID controller, verify that the controller is properly configured and working. See your controller's documentation for instructions.
es: Si su sistema utiliza un controlador hardware RAID, verifique que el controlador está configurado apropiadamente y trabajando. Vea instrucciones en la documentación de su controlador.

source: If you are installing into one or more iSCSI devices and there is no local storage present on the system, make sure that all required LUNs (_Logical Unit Numbers_) are being presented to the appropriate HBA (_Host Bus Adapter_).
es: Si está instalando en uno o más dispositivos iSCSI y no hay almacenamiento local presente en el sistema, asegure que todos los LUNs (_Números Lógicos de Unidad_) requeridos se presentan al HBA (_Adaptador de Bus de Host_) apropiado.

source: If you made sure you have a connected and properly configured storage device and the message still appears after you reboot the system and start the installation again, it means that the installation program failed to detect the storage. In most cases this message appears when you attempt to install on an SCSI device which has not been recognized by the installation program.
es: Si se ha asegurado de tener conectado y configurado apropiadamente un dispositivo de almacenamiento y el mensaje aún aparece después de que haya reiniciado y comenzado la instalación otra vez, significa que el programa de instalación falla al detectar el almacenamiento. En la mayoría de los casos el mensaje aparece cuando intenta instalar sobre un dispositivo SCSI que no ha sido reconocido por el programa de instalación.

source: Problems After Installation
es: Problemas Después de la Instalación

source: Resetting the Root Password
es: Volviendo a Establecer la Contraseña de Root

source: If you lost the root password to the system and you have access to the boot loader, you can reset the password by editing the GRUB2 configuration.
es: Si ha perdido la contraseña de root del sistema y tiene acceso al cargador de arranque, puede volvera establecer la contraseña editando la configuración GRUB2.

source: Boot your system and wait until the GRUB2 menu appears.
es: Arranque su sistema y espere hasta que aparezca el menú GRUB2.

source: In the boot loader menu, highlight any entry and press kbd:[e] to edit it.
es: En el menú del cargador de arranque, resalte cualquier entrada y presione kbd:[e] para editarla.

source: Find the line beginning with `linux`. At the end of this line, append the following:
es: Busque la línea que empieza con `linux`. Al final de esta línea añada lo siguiente:

source: Press kbd:[F10] or kbd:[Ctrl + X] to boot the system using the options you just edited.
es: Presione kbd:[F10] o kbd:[Ctrl + X] para arrancar el sistema con las opciones que acaba de editar.

source: Once the system boots, you will be presented with a shell prompt without having to enter any user name or password:
es: Una vez que el sistema arranque, se le presentará un símbolo del sistema sin tener que introducir ningún nombre de usuario o contraseña:

source: Load the installed SELinux policy:
es: Cargue la política SELinux instalada:

source: Execute the following command to remount your root partition:
es: Ejecute el siguiente comando para volver a montar su partición root:

source: Reset the root password:
es: Vuelva a establecer la contraseña de root:

source: When prompted to, enter your new root password and confirm by pressing the kbd:[Enter] key. Enter the password for the second time to make sure you typed it correctly and confirm with kbd:[Enter] again. If both passwords match, a message informing you of a successful root password change will appear.
es: Cuando se le pida introduzca una nueva contraseña de root y confirme presionando la tecla kbd:[Enter] key. Introduzca la contraseña por segunda vez asegure que la ha tecleado correctamente y presione kbd:[Enter] otra vez. Si coinciden ambas contraseña aparecerá un mensaje informándole de que el cambio de contraseña de root ha tenido éxito.

source: Remount the root partition again, this time as read-only:
es: Vuelva a montar la partición root otra vez, esta vez como de sólo lectura:

source: Reboot the system. From now on, you will be able to log in as the root user using the new password set up during this procedure.
es: Reinicie el sistema. Desde ahora será capaz de acceder como usuario root usando la nueva contraseña establecida durante este procedimiento.

source: Are You Unable to Boot With Your RAID Card?
es: ¿No Puede Arrancar Con Su Tarjeta RAID?

source: If you have performed an installation and cannot boot your system properly, you may need to reinstall and partition your system's storage differently.
es: Si ha llevado a cabo una instalación y no puede arrancar apropiadamente su sistema, es posible que necesita reinstalar y particionar el almacenamiento de su sistema de un modo distinto.
