Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f29/pages/install/Booting_the_Installation.po
Languages: uk

source: Booting the Installation
uk: Завантаження програми встановлення

source: This chapter will explain how to boot the installer from local media or a network server as well as how to navigate the boot menu and use custom options.
uk: У цьому розділі пояснюється, як завантажити програму встановлення з локального носія або мережевого сервера, а також як переміщатися в меню завантаження та використовувати спеціальні параметри.

source: Preparing to Boot
uk: Підготовка до завантаження

source: After you have made a bootable USB flash drive or a CD or DVD using the steps described in xref:install/Preparing_for_Installation.adoc#sect-preparing-boot-media[Preparing Boot Media], you are ready to boot the installation. Note that the steps described below are generic and the exact steps will vary somewhat depending on your system - particularly on your motherboard manufacturer.
uk: Після того, як ви створили завантажувальний флеш-накопичувач USB, компакт-диск чи DVD, використовуючи кроки, описані в xref:install/Preparing_for_Installation.adoc#sect-preparing-boot-media[Підготовка завантажувального носія], ви готові до завантаження інсталяції. Зауважте, що кроки, описані нижче, є загальними, і точні кроки дещо відрізнятимуться залежно від вашої системи, зокрема від виробника материнської плати.

source: {PRODUCT} does not support UEFI booting for 32-bit x86 systems. Only BIOS boot is supported on these systems.
uk: {PRODUCT} не підтримує завантаження UEFI для 32-розрядних систем x86. У цих системах підтримується лише завантаження BIOS.

source: Also note that {PRODUCT} only fully supports version 2.2 of the UEFI specification. Hardware that supports version 2.3 or later will boot and work normally, but the additional functionality defined by these later specifications will not be available. The UEFI specifications are available from link:++https://www.uefi.org/specs/agreement/++[].
uk: Також зауважте, що {PRODUCT} повністю підтримує лише версію 2.2 специфікації UEFI. Обладнання, яке підтримує версію 2.3 або новішу, завантажиться та працюватиме нормально, але додаткові функції, визначені цими пізнішими специфікаціями, будуть недоступні. Специфікації UEFI доступні за посиланням:++https://www.uefi.org/specs/agreement/++[].

source: To boot the {PRODUCT} installer, follow these steps:
uk: Щоб завантажити інсталятор {PRODUCT}, виконайте такі дії:

source: Booting the {PRODUCT} Installer
uk: Завантаження програми встановлення {PRODUCT}

source: Plug in the boot USB drive, or insert the boot CD or DVD into your computer's optical disc drive. Alternatively, if you plan on booting from a network boot (PXE) server, make sure that the network cable is plugged in.
uk: Підключіть завантажувальний USB-накопичувач або вставте завантажувальний компакт-диск або DVD-диск у оптичний дисковод комп’ютера. Крім того, якщо ви плануєте завантажуватися з сервера мережевого завантаження (PXE), переконайтеся, що мережевий кабель підключено.

source: Restart the system. Once it starts rebooting, it should display a prompt similar to the following (usually at the bottom of the screen):
uk: Перезапустіть систему. Коли вона почне перезавантажуватися, вона має відобразити підказку, подібну до наведеної нижче (зазвичай у нижній частині екрана):

source: Press F12 to select boot device, or Del to enter SETUP
uk: Натисніть F12, щоб вибрати завантажувальний пристрій, або Del, щоб увійти в НАЛАШТУВАННЯ

source: Follow the on-screen instructions to access the boot menu. If no instructions are displayed (some systems only display a graphical logo during early stages of boot), try pressing kbd:[F12], kbd:[F11], kbd:[F10] or kbd:[Del] several times; these are most commonly used keys. Note that there is usually a very short time window provided to access the menu; once it passes, you need to restart the system and try again.
uk: Дотримуйтеся вказівок на екрані, щоб отримати доступ до меню завантаження. Якщо вказівки не відображаються (деякі системи відображають лише графічний логотип під час ранніх етапів завантаження), спробуйте кілька разів натиснути kbd:[F12], kbd:[F11], kbd:[F10] або kbd:[Del]; це клавіші, які найчастіше використовуються. Зверніть увагу, що для доступу до меню зазвичай надається дуже короткий час; як тільки він пройде, потрібно перезавантажити систему та повторити спробу.

source: Some older systems may not support choosing a boot device at startup. In that case, enter the system's SETUP (BIOS), and change the default boot order so that your boot media (CD, DVD, USB or network) has higher priority than internal hard drives.
uk: Деякі старі системи можуть не підтримувати вибір завантажувального пристрою під час запуску. У такому випадку увійдіть у налаштування системи (BIOS) і змініть порядок завантаження за замовчуванням, щоб ваш завантажувальний носій (CD, DVD, USB або мережа) мав вищий пріоритет, ніж внутрішні жорсткі диски.

source: On Mac hardware, hold down the kbd:[Option] key to enter the boot media selection menu.
uk: На обладнанні Mac утримуйте клавішу kbd:[Option], щоб увійти в меню вибору завантажувального носія.

source: When your system's boot menu opens, select an entry such as `Boot from USB` if you created a bootable USB drive, `Boot from CD/DVD` if you are using an optical disc to install {PRODUCT}, or `Boot from PXE` if you want to boot from a network location.
uk: Коли відкриється меню завантаження вашої системи, виберіть такий запис, як «Завантажити з USB», якщо ви створили завантажувальний USB-диск, «Завантажити з CD/DVD», якщо ви використовуєте оптичний диск для встановлення {PRODUCT}, або «Завантажити з PXE», якщо ви хочете завантажитися з мережі.

source: Wait until the boot menu is displayed. The boot menu is described further in this chapter.
uk: Зачекайте, поки не відобразиться меню завантаження. Меню завантаження описано далі в цьому розділі.

source: The Boot Menu
uk: Меню завантаження

source: In most cases, when you boot the {PRODUCT} installer from your prepared boot media or server, the boot menu will be the first thing that appears. From this menu, you can either start the actual installation, or you can use the boot media to rescue an existing system.
uk: У більшості випадків, коли ви завантажуєте програму встановлення {PRODUCT} із підготовленого завантажувального носія або сервера, першим, що з’являється, буде меню завантаження. У цьому меню ви можете розпочати фактичне встановлення або використати завантажувальний носій для відновлення існуючої системи.

source: The way the boot menu will look and function will vary somewhat depending on your system's firmware - BIOS systems use the [application]*SYSLINUX* boot loader, and UEFI systems use [application]*GRUB2*. However, both of the menus described below function very similarly from a user's point of view.
uk: Вигляд і функціонування меню завантаження дещо відрізнятиметься залежно від мікропрограми вашої системи – системи BIOS використовують завантажувач [application]*SYSLINUX*, а системи UEFI використовують [application]*GRUB2*. Однак обидва описані нижче меню функціонують дуже подібно з точки зору користувача.

source: The final entry in the list is `Troubleshooting`pass:attributes[{blank}]; this is a submenu. Selecting this entry and pressing kbd:[Enter] will display a new set of selections, where you can choose to install in basic graphics mode (useful if you want to do a manual graphical installation but your system has issues with the default graphical installer), rescue an existing system, or test your system's memory modules for errors (on BIOS systems only). The troubleshooting menu also allows you to exit the boot menu and boot normally from your system's hard drive via the `Boot from local drive` option.
uk: Останнім записом у списку є `Вирішення проблем`pass:attributes[{blank}]; це підменю. Якщо вибрати цей запис і натиснути kbd:[Enter], відобразиться новий набір вибраних параметрів, у якому ви зможете вибрати встановлення в базовому графічному режимі (корисно, якщо ви хочете виконати графічне встановлення вручну, але ваша система має проблеми з графічним інсталятором за замовчуванням) , відновлення існуючої системи або перевірка модулів пам’яті вашої системи на наявність помилок (лише в системах BIOS). Меню усунення несправностей також дає змогу вийти з меню завантаження та нормально завантажитися з жорсткого диска системи за допомогою параметра «Завантажити з локального диска».

source: Every menu entry in the list is a predefined set of boot options, and these options can be customized to change some aspects of the installer's behavior. To edit the default set of boot options, press kbd:[Tab] on BIOS systems, or kbd:[e] on UEFI systems. The key to use is also displayed at the bottom of the screen.
uk: Кожен пункт меню у списку є попередньо визначеним набором параметрів завантаження, і ці параметри можна налаштувати, щоб змінити деякі аспекти поведінки інсталятора. Щоб змінити стандартний набір параметрів завантаження, натисніть kbd:[Tab] у системах BIOS або kbd:[e] у системах UEFI. Ключ для використання також відображається внизу екрана.

source: Editing boot options in [application]*GRUB2* (on UEFI systems) will display the entire configuration for the selected entry. Actual boot options are configured on the line which starts with the `linux` (or `linux16` or `linuxefi`) keyword. Do not modify any other lines in the configuration.
uk: Редагування параметрів завантаження в [програмі]*GRUB2* (у системах UEFI) відобразить повну конфігурацію для вибраного запису. Фактичні параметри завантаження налаштовуються в рядку, який починається з ключового слова `linux` (або `linux16` або `linuxefi`). Не змінюйте жодних інших рядків у конфігурації.

source: On systems with BIOS firmware, only the actual boot options are displayed when you press kbd:[Tab].
uk: У системах із мікропрограмою BIOS лише фактичні параметри завантаження відображаються, коли ви натискаєте kbd:[Tab].

source: When editing the default set of options, you can change the existing ones as well as append additional ones. Once you finish, press kbd:[Enter] on BIOS or kbd:[Ctrl + X] on UEFI to boot the installer using your customized options.
uk: Під час редагування стандартного набору параметрів ви можете змінити наявні, а також додати додаткові. Завершивши, натисніть kbd: [Enter] у BIOS або kbd: [Ctrl + X] в UEFI, щоб завантажити інсталятор із використанням налаштованих параметрів.

source: Editing boot options on a system with BIOS firmware
uk: Редагування параметрів завантаження в системі з мікропрограмою BIOS

source: The boot menu.
uk: Меню завантаження.

source: All available [application]*Anaconda* boot options are described in xref:advanced/Boot_Options.adoc#sect-boot-options-available[Available Boot Options].
uk: Усі доступні параметри завантаження [application]*Anaconda* описано в xref:advanced/Boot_Options.adoc#sect-boot-options-available[Доступні параметри завантаження].
