Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f29/pages/install/Preparing_for_Installation.po
Languages: tr

source: In addition to creating a bootable USB flash drive, you can also use the provided ISO images to create bootable optical media (a CD or DVD). This approach may be necessary when installing {PRODUCT} on an older system which can not boot from USB.
tr: Önyüklenebilir bir USB flash sürücü oluşturmaya ek olarak, sağlanan ISO kalıplarını önyüklenebilir optik ortam (CD veya DVD) oluşturmak için de kullanabilirsiniz. Bu yaklaşım, USB'den önyükleme yapamayan eski bir sisteme {PRODUCT} kurarken gerekli olabilir.

source: The exact steps you need to take to burn a bootable CD or DVD from an ISO image will vary depending on what disc burning software you use. This procedure only offers a general overview.
tr: Bir ISO kalıbından önyüklenebilir bir CD veya DVD yazmak için atmanız gereken kesin adımlar, kullandığınız disk yazma programına bağlı olarak değişecektir. Buradaki yöntem sadece genel bir bakış sunar.

source: Insert a blank CD or DVD into your system's CD or DVD burner.
tr: Sisteminizin CD veya DVD yazıcısına boş bir CD veya DVD yerleştirin.

source: Open your system's burning software - for example, [application]*Brasero* on {PRODUCT} systems with [application]*GNOME* desktop environment, or [application]*Nero* on Windows systems. In the software's main menu, find an option which lets you burn an ISO image to a disc. For example, in [application]*Brasero*, this option is `Burn image` in the main menu on the left side of the window.
tr: Sisteminizin yazma programını açın - örneğin, [application]*GNOME* masaüstü ortamına sahip {PRODUCT} sistemlerinde [application]*Brasero* veya Windows sistemlerinde [application]*Nero*. Programın ana menüsünde, diske bir ISO kalıbı yazmanıza izin veren bir seçenek bulun. Örneğin, [application]*Brasero*'da, bu seçenek pencerenin sol tarafındaki ana menüdeki `Kalıp yazdır` seçeneğidir.

source: When prompted, select the ISO image of {PRODUCT} to be burned, and the CD or DVD burner with a blank disc inside (if you have more than one drive).
tr: İstendiğinde, yazdırılacak {PRODUCT} ürününün ISO kalıbını ve içinde boş bir disk bulunan CD veya DVD yazıcıyı (birden fazla sürücünüz varsa) seçin.

source: Confirm your selection, and wait for the disc to be burned.
tr: Seçiminizi doğrulayın ve diskin yazdırılmasını bekleyin.
