Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f29/pages/install/Preparing_for_Installation.po
Languages: tr

source: Preparing for Installation
tr: Kurulum için Hazırlama

source: This chapter describes the steps you need take before you begin the installation. Not every step must be strictly followed - for example, if you plan to use the default installation settings, you do not need to gather system information such as disk device labels/UUIDs or network information such as the system's IP address. However, you should still go through this chapter, as it also describes the available types of installation media and how to prepare boot media and installation sources.
tr: Bu bölümde, kuruluma başlamadan önce atmanız gereken adımlar açıklanmaktadır. Her adımın kesinlikle takip edilmesi gerekmemektedir - örneğin, öntanımlı kurulum ayarlarını kullanmayı planlıyorsanız, disk aygıtı etiketleri/UUID'leri gibi sistem bilgilerini veya sistemin IP adresi gibi ağ bilgilerini toplamanız gerekmez. Bununla birlikte, kullanılabilir kurulum ortamı türlerini ve önyükleme ortamı ve kurulum kaynaklarının nasıl hazırlanacağını da açıkladığı için bu bölümü gözden geçirmeniz gerekmektedir.

source: Upgrade or Install?
tr: Yükseltme ya da Kurma?

source: If you already have Fedora installed and want to upgrade your installation to the current version, there are two basic ways to do so:
tr: Zaten bir Fedora kurulumunuz varsa ve onu şu anki güncel sürüme yükseltmek istiyorsanız, bunu yapmanın iki temel yolu vardır:

source: Automatic upgrade using [application]*dnf system upgrade*
tr: [application]*dnf sistem yükseltme* kullanarak otomatik yükseltme

source: The preferred way to upgrade your system is an automatic upgrade using the [application]*dnf system upgrade* utility. For information on performing an automatic upgrade, see link:++https://fedoraproject.org/wiki/DNF_system_upgrade++[Fedora Wiki dnf system upgrade].
tr: Sisteminizi yükseltmenin tercih edilen yolu, [application]*dnf sistem yükseltme* aracını kullanarak otomatik bir yükseltme yapmaktır. Otomatik yükseltme yapma hakkında bilgi için, link:++https://fedoraproject.org/wiki/DNF_system_upgrade++[Fedora Wiki dnf sistem yükseltme] sayfasına bakın.

source: Manual Reinstallation
tr: Elle yeniden kurulum

source: You can upgrade to the latest version of Fedora manually instead of relying on [application]*dnf system upgrade*. This involves booting the installer as if you were performing a clean installation, letting it detect your existing Fedora system, and overwriting the root partition while preserving data on other partitions and volumes. The same process can also be used to reinstall the system, if you need to. For detailed information, see xref:advanced/Upgrading_Your_Current_System.adoc#sect-upgrading-fedora-manual-reinstall[Manual System Upgrade or Reinstallation].
tr: [application]*dnf sistem yükseltme* kullanmak yerine, Fedora'nın en son sürümüne elle yükseltebilirsiniz. Bu, kurucuyu baştan bir kurulum yapıyormuş gibi önyüklemeyi, mevcut Fedora sisteminizi algılamasını sağlamayı ve diğer bölümler ve birimlerdeki verilere dokunmadan kök bölümünün üzerine yazmayı içermektedir. Aynı işlem gerekirse sistemi yeniden kurmak için de kullanılabilir. Ayrıntılı bilgi için xref:advanced/Upgrading_Your_Current_System.adoc#sect-upgrading-fedora-manual-reinstall[Elle Sistem Yükseltme veya Yeniden Kurulum] bölümüne bakın.

source: Always back up your data before performing an upgrade or reinstalling your system, no matter which method you choose.
tr: Hangi yöntemi seçerseniz seçin, sisteminizi yükseltmeden veya yeniden kurmadan önce her zaman verilerinizi yedekleyin.

source: Preparing Boot Media
tr: Önyükleme Ortamını Hazırlama

source: Fedora images are `Hybrid ISOs` and can be used to create installation media with both optical and USB disks, for booting on both BIOS and UEFI systems.
tr: Fedora kalıpları `Hibrit ISO` kalıplarıdır ve hem BIOS hem de UEFI sistemlerinde önyükleme yapmak için, optik ve USB disklerle kurulum ortamı oluşturmakta kullanılabilir.

source: [application]*Fedora Media Writer* has been significantly improved and is now the official, tested and supported way to make bootable media. [application]*Fedora Media Writer* supports Linux, Mac, and Windows. It is an easy way to make bootable USB media to install Fedora (or other operating systems). Using [application]*Fedora Media Writer* is strongly encouraged, although other USB media creation software can work as well.
tr: [application]*Fedora Media Writer* önemli ölçüde iyileştirildi ve artık resmi, test edilmiş ve desteklenen önyüklenebilir ortam oluşturma yoludur. [application]*Fedora Media Writer* Linux, Mac ve Windows'u desteklemektedir. Fedora'yı (veya diğer işletim sistemlerini) kurmak için önyüklenebilir USB ortamı oluşturmanın kolay bir yoludur. Diğer USB ortam oluşturma programları da düzgün çalışmaktadır, bununla birlikte [application]*Fedora Media Writer* kullanılması şiddetle önerilir.

source: Some of the new additions to [application]*Fedora Media Writer* are that Fedora Workstation and Server are easily and quickly accessible from the selection on the main screen. Further choices are available if you select the button below _Custom OS_. This offers a selection of various Fedora Spins, such as XFCE or Mate.
tr: [application]*Fedora Media Writer* için yeni özelliklerden bazıları, Fedora Workstation ve Server sürümlerinin ana ekrandaki seçimden kolay ve hızlı bir şekilde erişilebilir olmasıdır. _Özel İşletim Sistemi_nin altındaki düğmeyi seçerseniz kullanılabilir başka seçenekler de bulunmaktadır. Burada XFCE veya Mate gibi çeşitli Fedora Spin seçenekleri sunulmaktadır.

source: Historically, universal USB creation tools, such as [application]*Unetbootin*, are a popular way to create USB installers from ISOs intended for optical media. They typically create a filesystem on the USB drive by extracting files from the image, and writing [application]*syslinux* bootloader to the device.
tr: Tarihsel olarak, yaygın USB oluşturma araçları, [application]*Unetbootin* gibi, optik ortamlar için tasarlanan ISO'lardan USB kurucular oluşturmanın popüler bir yoludur. Genellikle kalıptan dosyaları çıkararak ve [application]*syslinux* önyükleyicisini aygıta yazarak USB sürücüde bir dosya sistemi oluştururlar.

source: These methods circumvent the boot-loader configuration built into Fedora images, which are pre-partitioned and designed to boot on UEFI systems with SecureBoot enabled as well as BIOS systems, and thus they do not produce consistent results with Fedora images, especially on UEFI systems.
tr: Bu yöntemler, SecureBoot etkinleştirilmiş UEFI sistemlerinin yanı sıra BIOS sistemlerinde de önyükleme yapmak üzere bölümlendirilmiş ve tasarlanmış olan Fedora kalıplarındaki önyükleyici ayarlarını atlar ve bu nedenle Fedora kalıpları ile, özellikle UEFI sistemlerinde tutarlı sonuçlar vermezler.

source: The best results are produced by utilities that use a direct write method and do not modify the Fedora image.
tr: En iyi sonuçlar, doğrudan yazma yöntemi kullanan ve Fedora kalıbını değiştirmeyen programlar tarafından üretilmektedir.

source: Always think twice before writing an image to the device. The media creation methods described in this article are destructive. All data on the USB stick are deleted during the process, so make sure you have a back up of the data on the USB stick. Double check that you have selected correct device to write the image to!
tr: Kalıbı aygıta yazmadan önce daima iki kere düşünün. Bu makalede açıklanan ortam oluşturma yöntemleri yok edicidir. İşlem sırasında USB bellekteki tüm veriler silinir, bu nedenle USB bellekteki verilerin yedeklendiğinden emin olun. Kalıbı yazmak için doğru aygıtı seçtiğinizi iki kere denetleyin!

source: Installing and running Fedora Media Writer
tr: Fedora Media Writer'ı kurma ve çalıştırma

source: On Fedora
tr: Fedora'da

source: On Fedora 25 or later, [application]*Fedora Media Writer* is available in the default repository. You can use `dnf` to install the package.
tr: Fedora 25 veya sonrasında, [application]*Fedora Media Writer* öntanımlı depoda bulunmaktadır. Paketi kurmak için `dnf` kullanabilirsiniz.

source: To install the [application]*Fedora Media Writer* using:
tr: [application]*Fedora Media Writer*'ı kurmak için:

source: Run the [application]*Fedora Media Writer*:
tr: [application]*Fedora Media Writer*'ı çalıştırın:

source: or in [application]*Gnome 3* select *Activities,* then select *Utilities*, and then click on [application]*Fedora Media Writer*.
tr: veya [application]*Gnome 3*'de *Etkinlikler*'i, sonra *Araçlar*'ı seçin, ve sonra [application]*Fedora Media Writer*'a tıklayın.

source: On other Linux distributions
tr: Diğer Linux dağıtımlarında

source: The best way to install [application]*Fedora Media Writer* on various Linux distributions is to use the pre-built _Flatpak_ package. The package can be obtained from the official Flatpak repository https://flathub.org/apps/details/org.fedoraproject.MediaWriter[Flathub.org].
tr: [application]*Fedora Media Writer*'ı çeşitli Linux dağıtımlarına kurmanın en iyi yolu, önceden oluşturulmuş _Flatpak_ paketini kullanmaktır. Paket, resmi Flatpak deposu https://flathub.org/apps/details/org.fedoraproject.MediaWriter[Flathub.org]'dan edinilebilir.

source: To setup *Flatpak* on your Linux system, follow the guidelines on the https://flatpak.org/setup/[Flatpak documentation] page.
tr: Linux sisteminize *Flatpak* kurmak için https://flatpak.org/setup/[Flatpak belgelendirmesi] sayfasındaki yönergeleri izleyin.

source: Run the application:
tr: Uygulamayı çalıştırın:

source: On Windows
tr: Windows'ta

source: Download the latest Windows Installer file from link:++https://getfedora.org++[GetFedora.org]. The server automatically detects the running system and offers you the correct installation file for your Windows version.
tr: En son Windows Installer dosyasını link:++https://getfedora.org++[GetFedora.org] adresinden indirin. Sunucu çalışan sistemi otomatik olarak algılar ve size Windows sürümünüz için doğru kurulum dosyasını sunar.

source: Run the installation by double clicking the installer, and then continue through the set-up wizard. The Wizard lets you customize the software's installation if you choose to.
tr: Kurucuya çift tıklayarak kurulumu çalıştırın ve ardından kurulum sihirbazını takip ederek devam edin. Sihirbaz, isterseniz yazılımın kurulumunu özelleştirmenize izin vermektedir.

source: Run the application by clicking on a launcher.
tr: Başlatıcıya tıklayarak uygulamayı çalıştırın.

source: In Windows 8 and 10, the [application]*Fedora Media Writer* launcher will be placed in the _All apps_ menu under _F_. In Windows 10, you can just type [application]*Fedora Media Writer* in the search box on the task bar.
tr: Windows 8 ve 10'da, [application]*Fedora Media Writer* başlatıcısı _Tüm uygulamalar_ menüsünde _F_ harfi altında olacaktır. Windows 10'da, görev çubuğundaki arama kutusuna [application]*Fedora Media Writer* yazmanız yeterlidir.

source: On MacOS
tr: MacOS'de

source: Download the latest Macintosh Disk Image (the package will have a .dmg extension) from link:++https://getfedora.org++[GetFedora.org]. The server automatically detects the running system and offers a correct package for your MacOS.
tr: En son Macintosh Disk Kalıbını (paket .dmg uzantılı olacaktır) link:++https://getfedora.org++[GetFedora.org] adresinden indirin. Sunucu, çalışan sistemi otomatik olarak algılar ve MacOS'niz için doğru bir paket sunar.

source: Open the `.dmg` file and copy the `mediawriter` file into your applications folder.
tr: `.dmg` dosyasını açın `mediawriter` dosyasını uygulamalar klasörünüze kopyalayın.

source: Navigate to your applications directory, and then launch the [application]*Fedora Media Writer* application.
tr: Uygulamalar dizininize gidin ve ardından [application]*Fedora Media Writer* uygulamasını başlatın.

source: Select "Open" to run the program, when MacOS will ask you to confirm the action.
tr: MacOS işlemi onaylamanızı istediğinde programı çalıştırmak için "Aç" seçeneğini seçin.

source: Writing the ISO image to the USB Media.
tr: ISO kalıbını USB ortamına yazma.

source: Select the Fedora Edition you wish to make a bootable USB drive for.
tr: Önyüklenebilir bir USB sürücü yapmak istediğiniz Fedora sürümünü seçin.

source: Fedora Media Writer Main Screen: Choose your Edition of Fedora
tr: Fedora Media Writer Ana Ekranı: Fedora Sürümünüzü Seçin

source: Image of Fedora Media Writer Main Screen
tr: Fedora Media Writer Ana Ekranının Görüntüsü

source: The main selection lets you choose one of the default Fedora editions, Fedora *Workstation* or *Server*. [application]*Fedora Media Writer* displays more details about the edition before you can proceed with downloading the image and the USB creation. You can choose a different architecture, if you select _Other variants_.
tr: Ana seçim ekranı, öntanımlı Fedora sürümlerinden birini, Fedora *Workstation* veya *Server*, seçmenize izin vermektedir. [application]*Fedora Media Writer*, kalıbı indirmeye ve USB oluşturmaya devam etmeden önce sürüm hakkında daha fazla ayrıntı görüntüler. _Diğer çeşitler_ seçeneğine tıklarsanız farklı bir mimari seçebilirsiniz.

source: Select "Create Live USB" to proceed.
tr: Devam etmek için "Canlı USB Oluştur" düğmesine tıklayın.

source: Fedora Media Writer Distro Information
tr: Fedora Media Writer Dağıtım Bilgileri

source: Image of Fedora Media Writer Distro Information Screen
tr: Fedora Media Writer Dağıtım Bilgileri Ekranının Görüntüsü

source: Fedora Media Writer will automatically download the ISO for you. If you have downloaded the ISO before and placed it in the _Downloads_ directory, it will be immediately available to use.
tr: Fedora Media Writer ISO dosyasını sizin için otomatik olarak indirecektir. ISO dosyasını daha önce indirdiyseniz ve _İndirilenler_ dizinine yerleştirdiyseniz, indirmek yerine onu kullanacaktır.

source: Fedora Media Writer Automatic Download
tr: Fedora Media Writer Otomatik İndirme

source: Image of Fedora Media Writer Automatic Download
tr: Fedora Media Writer Otomatik İndirme Ekranının Görüntüsü

source: Plug in a USB drive on which you want to create the bootable media.
tr: Önyüklenebilir ortam oluşturmak istediğiniz bir USB sürücüsü takın.

source: To write the image onto the media, click the red btn:[Write to disk] button.
tr: Kalıbı ortama yazmak için kırmızı btn:[Diske yaz] düğmesine tıklayın.

source: Fedora Media Writer Write to USB Device
tr: Fedora Media Writer USB Aygıta Yazma

source: Image of Fedora Media Writer write to device red button
tr: Fedora Media Writer Aygıta Yazma Kırmızı Düğmesinin Görüntüsü

source: Other methods to create a live USB
tr: Canlı USB oluşturmanın diğer yöntemleri

source: Using the *Fedora Media Writer* is highly recommended for everybody, because it offers a reliable way to create a live USB stick for Fedora installation.
tr: Fedora kurulumu için canlı USB bellek oluşturmanın güvenilir bir yolunu sunduğu için, *Fedora Media Writer* kullanılması herkes için şiddetle tavsiye edilmektedir.

source: However, some experienced users may prefer to go through the creation process manually. If you decide to do so, you have to download the installation images and use an application to write them onto the USB stick.
tr: Yine de, bazı deneyimli kullanıcılar oluşturma işlemini elle yapmayı tercih edebilir. Bunu yapmaya karar verirseniz, kurulum kalıplarını indirmeli ve bunları USB belleğe yazacak bir uygulama kullanmalısınız.

source: If you have downloaded and verified the installation images manually, you still can write them onto the USB stick using *Fedora Media Writer*.
tr: Kurulum kalıplarını elle indirip doğruladıysanız, onları USB belleğe yazmak için yine *Fedora Media Writer* kullanabilirsiniz.

source: Downloading Boot and Installation Images
tr: Önyükleme ve Kurulum Kalıplarını İndirme

source: The Fedora Project offers different Editions tailored for some specific use cases. Choose the Fedora Edition best for you, or you can build your own by customizing after the installation, or by using a kickstart file as described in xref:advanced/Kickstart_Installations.adoc#sect-kickstart-file-create[Creating a Kickstart File]. Kickstart installation requires the `netinstall` media type, or a direct installation booting method such as PXE; kickstarts are not supported with live images.
tr: Fedora Projesi, bazı özel kullanım durumlarına göre uyarlanmış farklı sürümler sunmaktadır. Sizin için en uygun Fedora sürümünü seçebilir veya kurulum işleminden sonra özelleştirerek veya xref:advanced/Kickstart_Installations.adoc#sect-kickstart-file-create[Kickstart Dosyası Oluşturma] bölümünde açıklandığı gibi bir kickstart dosyası kullanarak kendinize özel bir tane oluşturabilirsiniz. Kickstart kurulumu için `ağ üzerinden kurulum` ortam türü veya PXE gibi doğrudan kurulum önyükleme yöntemi gerekmektedir; kickstart canlı kalıplarla desteklenmez.

source: Read more about Fedora Workstation, Fedora Cloud, Fedora Server and the available media types in xref:Downloading_Fedora.adoc#chap-downloading-fedora[Downloading Fedora].
tr: Fedora Workstation, Fedora Cloud, Fedora Server ve kullanılabilir ortam türleri hakkında xref:Downloading_Fedora.adoc#chap-downloading-fedora[Fedora'yı İndirme] bölümünde daha fazla bilgi edinin.

source: You can also choose a Fedora _Spin_ featuring favorite alternative desktops or tools for specialized tasks at link:++https://spins.fedoraproject.org++[].
tr: Ayrıca favori alternatif masaüstü ortamınızı veya özel görevler için araçlarınızı içeren bir Fedora _Spinini_ link:++https://spins.fedoraproject.org++[] adresinde seçebilirsiniz.

source: Verifying the Downloaded Image
tr: İndirilen Kalıbı Doğrulama

source: Because transmission errors or other problems may corrupt the Fedora image you have downloaded, it is important to verify the file's integrity. After the images are created, an operation is performed on the file that produces a value called a `checksum` using a complex mathematical algorithm. The operation is sufficiently complex that *any change* to the original file will produce a different checksum.
tr: Aktarım hataları veya diğer sorunlar indirdiğiniz Fedora kalıbını bozabileceğinden, dosyanın bütünlüğünü doğrulamak önemlidir. Kalıplar oluşturulduktan sonra, dosya üzerinde karmaşık bir matematik algoritması kullanarak `checksum` (sağlama toplamı) adı verilen bir değer üreten bir işlem gerçekleştirilmektedir. İşlem, orijinal dosyada yapılan *herhangi bir değişikliğin* farklı bir sağlama toplamı üreteceği kadar karmaşıktır.

source: By calculating the image's `checksum` on your own computer and comparing it to the original `checksum`, you can verify the image has not been tampered with or corrupted. The original checksum values are provided at link:++https://fedoraproject.org/verify++[], and are [command]#gpg# signed to demonstrate their integrity.
tr: Kalıbın `checksum` değerini kendi bilgisayarınızda hesaplayarak ve orijinal `checksum` değeriyle karşılaştırarak kalıbın değiştirilmediğini veya bozulmadığını doğrulayabilirsiniz. Orijinal sağlama toplamı değerleri link:++https://getfedora.org/security/++[] adresinde bulunmaktadır ve bütünlüklerini kanıtlamak için [command]#gpg# ile imzalanmışlardır.

source: Verifying checksums on Windows systems
tr: Windows sistemlerinde sağlama toplamlarını doğrulama

source: Download the Fedora image of your choice from link:++https://fedoraproject.org/get-fedora++[] and the corresponding checksum file from link:++https://fedoraproject.org/verify++[]
tr: Seçtiğiniz Fedora kalıbını link:++https://fedoraproject.org/get-fedora++[] adresinden ve karşılık gelen sağlama toplamı dosyasını link:++https://getfedora.org/security/++[] adresinden indirin.

source: Open a [command]#powershell# session.
tr: Bir [command]#powershell# oturumu açın.

source: Change to the directory containing the downloaded files.
tr: İndirilen dosyaları içeren dizine gidin.

source: Load the resources required to calculate the checksum.
tr: Sağlama toplamını hesaplamak için gereken kaynakları yükleyin.

source: Calculate the downloaded image's checksum. This will take a while!
tr: İndirilen kalıbın sağlama toplamını hesaplayın. Bu işlem biraz zaman alacaktır!

source: Compare the calculated checksum to the expected checksum.
tr: Hesaplanan sağlama toplamını beklenen sağlama toplamıyla karşılaştırın.

source: > echo "Download Checksum: $download_checksum" > echo "Expected Checksum: $expected_checksum" > if ( $download_checksum -eq "$expected_checksum" ) { echo "Checksum test passed!" } else { echo "Checksum test failed." }
tr: > echo "İndirilenin Sağlama Toplamı: $download_checksum" > echo "Beklenen Sağlama Toplamı: $expected_checksum" > if ( $download_checksum -eq "$expected_checksum" ) { echo "Sağlama toplamı testi başarıyla sonuçlandı!" } else { echo "Sağlama toplamı testi başarısız oldu." }

source: Verifying checksums on Linux and OSX systems
tr: Linux ve OSX sistemlerinde sağlama toplamlarını doğrulama

source: Open a terminal window, and navigate to the directory with the downloaded files.
tr: Bir terminal penceresi açın ve indirilen dosyaların bulunduğu dizine gidin.

source: $ [command]#cd ~/Downloads#
tr: $ [command]#cd ~/İndirilenler#

source: Use the appropriate utility to verify the image checksum.
tr: Kalıbın sağlama toplamını doğrulamak için uygun aracı kullanın.

source: For Linux:
tr: Linux için:

source: For OSX:
tr: OSX için:

source: Writing the images to USB media
tr: Kalıpları USB ortamına yazma

source: Creating USB media with [application]*GNOME Disks*
tr: USB ortamını [application]*GNOME Diskler* ile oluşturma

source: On a system with [application]*GNOME*, or with the [package]*gnome-disk-utility* package installed, open `Disks` using the system menu.
tr: [application]*GNOME* veya [package]*gnome-disk-utility* kurulu bir sistemde, sistem menüsünü kullanarak `Diskler` uygulamasını açın.

source: Click your USB device in the left column.
tr: Sol sütunda USB aygıtınıza tıklayın.

source: Click the menu icon in the upper right corner of the window, and choose the `Restore Disk Image` option.
tr: Pencerenin sağ üst köşesindeki menü simgesini tıklayın ve `Disk Kalıbını Geri Yükle` seçeneğini seçin.

source: Navigate to your image file and click `Start Restoring`. After a few minutes, it will report the process is complete and your installation media will be ready to use.
tr: Kalıp dosyanıza gidin ve `Geri Yüklemeyi Başlat` düğmesine tıklayın. Birkaç dakika sonra, işlemin tamamlandığı ve kurulum ortamınızın kullanıma hazır olduğu bildirilecektir.

source: Creating USB Media on the Linux command line
tr: USB ortamını Linux komut satırında oluşturma

source: Open a terminal window and insert the usb drive.
tr: Bir terminal penceresi açın ve usb sürücüsünü takın.

source: Find the `device node` assigned to the drive. In the example below, the drive is given `sdd`.
tr: Sürücüye atanan `aygıt düğümünü` bulun. Aşağıdaki örnekte, sürücüye `sdd` verilmiştir.

source: Use the [command]#dd# utility to write the image.
tr: Kalıbı yazmak için [command]#dd# komutunu kullanın.

source: # dd if=/path/to/Fedora-Live-Security-x86_64-21.iso of=/dev/sdd
tr: # dd if=/kalıp/dosyasının/bulunduğu/yol/Fedora-Live-Security-x86_64-21.iso of=/dev/sdd

source: Pay extreme attention to the source (`if=`) and target (`of=`) device. The `dd` command destroys all data on the target device. If you made a mistake, you could lose important data.
tr: Kaynak (`if=`) ve hedef (`of=`) aygıta çok dikkat edin. `dd` komutu, hedef aygıttaki tüm verileri yok eder. Bir hata yaparsanız, önemli verileri kaybedebilirsiniz.

source: Creating a Boot CD or DVD
tr: Önyükleme CD'si veya DVD'si oluşturma
