Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f30/pages/Downloading_Fedora.po
Languages: cs

source: Downloading Fedora
cs: Stažení Fedory

source: Fedora Editions
cs: Edice Fedory

source: Fedora provides three primary Editions tailored for some specific use cases. link:++https://getfedora.org++[] offers Fedora Cloud for scalable infrastructure, Fedora Server for organizational infrastructure, and Fedora Workstation for the developer and desktop user.
cs: Fedora poskytuje 3 základní edice zaměřené na některé zvláštní případy užití. link:++https://getfedora.org++[] nabízí Fedoru Cloud pro škálovatelnou infrastrukturu, Fedoru Server pro infrastrukturu organizace a Fedoru Workstation pro vývojáře a uživatele stolních počítačů.

source: For alternative desktop environments or media built for more niche purposes, check out link:++https://spins.fedoraproject.org++[Fedora Spins].
cs: Máte-li zájem o alternativní prostředí pracovní plochy nebo nosiče připravené pro méně používané účely, přejděte na link:++https://spins.fedoraproject.org++[Spiny Fedory].

source: Each of these downloads provides a different set of default packages, but you can add to your system after the initial installation to customize it for your needs. The installation process is the same for all spins and Editions, so you can use this guide for any choice you make.
cs: Každá z těchto možností stažení poskytuje různou sadu výchozích balíčků, ale váš systém lze po původní instalaci uzpůsobit přidáním součástí tak, aby odpovídal vašim potřebám. Instalační proces je stejný pro všechny spiny a edice, proto lze tuto příručku použít pro kterýkoliv váš výběr.

source: Which Architecture Is My Computer?
cs: Jaké architektury je můj počítač?

source: Most modern systems are 64{nbsp}bit x86 architecture. If your computer was manufactured after 2007, or you aren't sure, you probably have a `x86_64` system.
cs: Většina moderních systémů je 64bitové x86 architektury. Byl-li váš počítač vyroben pro roce 2007, nebo nejste-li si jisti, pravděpodobně máte systém `x86_64`.

source: Changing a Fedora installation from one architecture to another is not supported. Use the following table to determine the architecture of your computer according to the type of processor. Consult your manufacturer's documentation for details on your processor, or resources such as link:++https://ark.intel.com/++[] or link:++https://products.amd.com/++[], if necessary.
cs: Změna instalace Fedory z jedné architektury na druhou není podporována. Použijte následující tabulku, abyste určili architekturu svého počítače dle typu procesoru. Je-li to nezbytné, obraťte se na dokumentaci výrobce ohledně informací o vašem procesoru nebo zdroje jako např. link:++https://ark.intel.com/++[] or link:++https://products.amd.com/++[].

source: Processor and architecture types
cs: Typy procesorů a architektur

source: |Processor manufacturer and model|Architecture type for Fedora |some Intel Atom, Core series, Pentium 4, and recent vintage Xeon; AMD Athlon, Duron, some Semprons; and older; VIA C3, C7|`i386` |some Intel Atom, Core 2 series, Core i series and Xeon; AMD: Athlon 64, Athlon II, Sempron64, Phenom series, Fusion series, Bulldozer series and Opteron; Apple MacBook, MacBook Pro, and MacBook Air|`x86_64`
cs: |Výrobce procesoru a model|Typ architektury pro Fedoru |některé Intel Atom, Core série, Pentium 4, a poslední vintage Xeon; AMD Athlon, Duron, některé Semprony; a starší; VIA C3, C7|`i386` |některé Intel Atom, Core 2 série, Core i série a Xeon; AMD: Athlon 64, Athlon II, Sempron64, Phenom série, Fusion série, Bulldozer série a Opteron; Apple MacBook, MacBook Pro a MacBook Air|`x86_64`

source: Media Types
cs: Typy nosičů

source: Several media types are available. Choose the one that best suits your requirements.
cs: Je k dispozici několik typů nosičů. Vyberte si, který nejlépe odpovídá vašim požadavkům.

source: Live Image
cs: Spustitelný obraz

source: Live images allow you to preview Fedora before installing it. Instead of booting directly into the installer, a live image loads the same environment you'll get after installation. Fedora Workstation and Fedora Spins are live images.
cs: Spustitelné (též live neboli "živé") obrazy vám umožní si prohlédnout Fedoru před jejím nainstalováním. Místo zavedení přímo instalačního programu, spustitelný obraz zavede do paměti stejné prostředí, které obdržíte po instalaci. Fedora Workstation a Spiny Fedory jsou spustitelné obrazy.

source: Use a live image to install your favorite system, test Fedora on new hardware, troubleshoot, or share with friends.
cs: Použijte spustitelný obraz pro instalaci oblíbeného systému, otestování Fedory na novém hardwaru, řešení potíží nebo sdílení s přáteli.

source: DVD Image
cs: DVD obraz

source: DVD images boot directly into the installation enviroment, and allow you to choose from a variety of packages that are provided with it. In Fedora 21, the DVD option is only available in the *Fedora Server* Edition.
cs: DVD obrazy zavedou rovnou instalační prostředí a umožní výběr různých balíčků, které jsou s ním poskytovány. Ve Fedoře 21 je možnost DVD obrazu k dispozici pouze pro edici *Fedora Server*.

source: Use the Fedora Server DVD image when you want customized Fedora Server installations using an offline installation source.
cs: Použijte obraz DVD Fedory Server, chcete-li získat přizpůsobenou instalaci Fedora Serveru z off-line instalačního zdroje.

source: netinstall Image
cs: Obraz pro instalaci po síti

source: The netinstall image boots directly into the installation environment, and uses the online Fedora package repositories as the installation source. With a netinstall image, you can select a wide variety of packages to create a customized installation of Fedora.
cs: Obraz pro instalaci po síti (netinstall) zavede rovnou instalační prostředí a jako instalační zdroje využívá on-line repozitáře balíčků Fedory. S obrazem pro instalaci po síti lze vybrat celou škálu balíčků, kterými si uzpůsobíte instalaci Fedory.

source: The Fedora Server netinstall image is a universal one, and can be used to install any Fedora Edition or your own set of favorite packages.
cs: Obraz pro instalaci po síti Fedory Server je univerzální a lze ho použít pro instalaci kterékoliv edice Fedory nebo vlastnímu souboru oblíbených balíčků.

source: ARM images
cs: Obrazy pro ARM

source: For many ARM systems, Fedora provides preconfigured filesystem images. Write the image to removable media and boot directly into a Fedora installation that's ready to use.
cs: Pro mnoho systémů ARM poskytuje Fedora přednastavené obrazy souborových systémů. Zapiště obraz na vyměnitelný nosič a rovnou zaveďte instalaci Fedory, která je hned připravena k použití.

source: ARM devices often require special setup procedures that aren't covered in this guide. Start learning about Fedora ARM at link:++https://fedoraproject.org/wiki/Architectures/ARM++[]
cs: Zařízení ARM často vyžadují zvláštní postup nastavení, který není součástí této příručky. Chcete-li se dozvědět více o Fedoře ARM viz link:++https://fedoraproject.org/wiki/Architectures/ARM++[]

source: Cloud Images
cs: Obrazy pro cloud

source: Fedora Cloud images are preconfigured filesystem images with very few packages installed by default. They include special tools for interacting with cloud platforms, and are not intended to be used outside of cloud environments.
cs: Obrazy Fedory Cloud jsou přednastavené obrazy souborových systémů, ve výchozím nastavení jen s několika málo nainstalovanými balíčky. Obsahují zvláštní nástroje pro interakci s cloudovými platformami a nejsou určeny pro používání mimo cloudová prostředí.

source: Fedora Cloud comes in several varieties. The Fedora Cloud Base image is a minimal base for cloud deployments. The Fedora Cloud Atomic image is a Docker container host that uses link:++https://www.projectatomic.io/++[Project Atomic] technology for updates. A Docker base image for Fedora is also available.
cs: Fedora Cloud přichází v několika variantách. Obraz Fedora Cloud Base je minimální základ pro nasazení v cloudu. Obraz Fedora Cloud Atomic je kontejnerový host Docker, který využívá pro aktualizace technologii link:++https://www.projectatomic.io/++[Projektu Atomic]. Rovněž je pro Fedoru k dispozici základní obraz Docker.

source: Cloud images are preconfigured and do not require installation as described in this guide. Get started using Fedora Cloud at link:++https://fedoraproject.org/wiki/Cloud++[]
cs: Obrazy pro cloud jsou přednastavené a nevyžadují instalaci popisovanou v této příručce. Pomoc s používáním Fedory Cloud viz link:++https://fedoraproject.org/wiki/Cloud++[]

source: Boot Images
cs: Zaveditelné obrazy

source: The tiny images at link:++https://boot.fedoraproject.org/++[] are written to CDs, USB drives, or even floppy disks. The BFO image loads installation media from Fedora's servers and directly loads an installation environment, like the netinstall ISO.
cs: Drobné obrazy na stránce link:++https://boot.fedoraproject.org/++[] lze zapsat na CD, disk USB nebo dokonce disketu. Obrazy BFO natáhnou instalační nosič ze serverů Fedory a rovnou zavedou do paměti instalační prostředí, podobně jako obrazy ISO pro instalaci po síti.

source: BFO images work like PXE deployments, without having to set up a server.
cs: Obrazy BFO fungují jako prostředí PXE, bez povinnosti nastavení serveru.
