Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f30/pages/Introduction.po
Languages: cs, ko

source: Introduction
cs: Úvod
ko: 안내

source: This guide covers installation of Fedora, a Linux distribution built on free and open source software. This manual helps you install Fedora on desktops, laptops, and servers. The installation system is easy to use even if you lack previous knowledge of Linux or computer networks. If you select default options, Fedora provides a complete desktop operating system, including productivity applications, Internet utilities, and desktop tools.
cs: Příručka se zabývá instalací Fedory, linuxové distribuce postavené na svobodném a open-source softwaru. Pomáhá s instalací Fedory na stolní počítače, laptopy a servery. Instalační systém je snadno použitelný, i přesto že nedisponujete žádnou znalostí Linuxu nebo počítačových sítí. Zvolíte-li výchozí možnosti, poskytne vám Fedora plně funkční operační systém s prostředím pracovní plochy, vč. aplikací zaměřených na produktivitu, pomocných programů pro Internet a nástrojů pracovní plochy.
ko: 이 안내는 페도라, 무료이고 개방형 원천 소프트웨어로 구축 된 리눅스 배포판의 설치를 다룹니다. 이 설명서는 데스크탑, 노트북, 그리고 서버에서 페도라를 설치는데 도움을 줍니다. 설치 시스템은 리눅스 또는 컴퓨터 네트워크에 대한 사전 지식이 부족해도 쉽게 사용 할 수 있습니다. 만약 기본 선택을 지정하면, 페도라는 완전한 데스크탑 운영체제, 생산성 응용프로그램을 포함하여, 인터넷 유틸리티, 그리고 데스크탑 도구를 제공합니다.

source: This document details the full range of installation options, including those that apply only in limited or unusual circumstances. Understanding of all topics described in this document is not necessary to successfully perform the installation in most cases.
cs: Tento dokument podrobně rozebírá plnou škálu instalačních možností, včetně těch, které se vztahují pouze na omezené či neobvyklé podmínky. Pochopení všech témat popsaných v tomto dokumentu není nezbytné, abyste ve většině případů provedli instalaci úspěšně.
ko: 이 문서는 제한적이거나 비정상적인 상황에서만 적용되는 것을 포함하여 전체 설치 선택의 범위를 자세히 설명합니다. 이 문서에서 설명하는 모든 주제를 이해 할 필요는 없으며, 대부분의 경우에서 설치를 성공적으로 수행 할 수 있습니다.

source: Background
cs: Východiska
ko: 백그라운드

source: About Fedora
cs: O Fedoře
ko: 페도라에 대하여

source: To find out more about {PRODUCT}, visit the link:++https://fedoraproject.org/++[{PRODUCT} Project Website]. Other documentation describing additional topics related to {PRODUCT} is available at link:++https://docs.fedoraproject.org/++[{PRODUCT} Documentation]. Also see the link:++https://fedoraproject.org/wiki/Fedora_Project_Wiki++[{PRODUCT} Project Wiki].
cs: Přejete-li si zjistit více o {PRODUCT}, navštivte link:++https://fedoraproject.org/++[Webové stránky Projektu {PRODUCT}]. Další dokumentace popisující ostatní témata související s {PRODUCT} je k dispozici v link:++https://docs.fedoraproject.org/++[Dokumentaci {PRODUCT}]. Viz také link:++https://fedoraproject.org/wiki/Fedora_Project_Wiki++[Wiki stránky Projektu {PRODUCT}].
ko: {PRODUCT}에 대하여 자세히 알아 보려면, 연결:++https://fedoraproject.org/++[{PRODUCT} 프로젝트 웹 사이트]를 방문하세요. {PRODUCT}와 연관된 추가적인 주제를 설명하는 기타 문서는 연결:++https://docs.fedoraproject.org/++ [{PRODUCT} 문서]에서 사용 할 수 있습니다. 또한, 연결:++https://fedoraproject.org/wiki/Fedora_Project_Wiki++ [{PRODUCT} 프로젝트 위키]를 참고하세요.

source: Getting Additional Help
cs: Získání další pomoci
ko: 추가 도움 얻기

source: If you encounter any problems which are not described in documentation, you might get help from members of the community - developers, users, and others. There are many ways to get help: the Ask Fedora website, mailing lists, forums, or IRC. For a summary of available resources, see the link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Communicating and Getting Help] page on the {PRODUCT} wiki.
cs: Narazíte-li na jakýkoliv problém, který není řešen v dokumentaci, lze získat radu od členů komunity - vývojářů, uživatelů a dalších. Existuje mnoho způsobů, jak získat pomoc: webové stránky Zeptejte se Fedory, elektronické poštovní konference, fóra nebo IRC. Shrnutí dostupných zdrojů viz wiki stránka {PRODUCT} link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Komunikace a získání pomoci].
ko: 만약 문서에서 설명되지 않은 어떤 문제에 처하면, 당신은 커뮤니티 구성원에서 부터-개발자, 사용자, 그리고 다른 분들의 도움을 받을 수 있습니다. 도움을 받을 수 있는 다양한 방법이 있습니다: Ask 페도라 웹사이트, 전자우편 목록, 포럼 또는 IRC. 사용 가능한 자원에 대한 요약을 위해, {PRODUCT} 위키에서 연결:++https://fedoraproject.org/wiki/Communicating_and_getting_help++ [소통과 도움 얻기] 부분을 참고하세요.

source: About This Document
cs: O tomto dokumentu
ko: 이 문서에 대하여

source: Goals
cs: Cíle
ko: 목표

source: This guide helps a reader:
cs: Příručka čtenáři pomůže:
ko: 이 안내는 독자를 도와줍니다:

source: Understand how to locate the {PRODUCT} distribution online
cs: Pochopit, kde nalézt distribuci {PRODUCT} online
ko: {PRODUCT} 배포 온라인에서 찾는 방법 이해

source: Create configuration data that allows a computer to boot {PRODUCT}
cs: Vytvořit konfigurační údaje, které umožní počítači zavést {PRODUCT} do paměti po svém spuštění
ko: 컴퓨터를 부트 {PRODUCT} 할 수 있도록 구성 자료를 생성합니다

source: Understand and interact with the {PRODUCT} installation program
cs: Porozumět a používat instalační program {PRODUCT}
ko: {PRODUCT} 설치 프로그램에 대한 이해 및 상호 작용

source: Complete basic post-installation configuration of a {PRODUCT} system
cs: Dokončit základní poinstalační nastavení systému {PRODUCT}
ko: {PRODUCT} 시스템의 완전한 기본 설치 후 구성

source: This guide does not cover *use* of {PRODUCT}. To learn how to use an installed {PRODUCT} system, see the other manuals available at link:++https://docs.fedoraproject.org/++[Fedora Documentation].
cs: Příručka nepokrývá *používání* {PRODUCT}. Chcete-li zjistit, jak nainstalovaný systém {PRODUCT} používat, viz další příručky v link:++https://docs.fedoraproject.org/++[Dokumentaci Fedory].
ko: 이 안내는 {PRODUCT}의 *사용*을 다루지 않습니다. 설치된 {PRODUCT} 시스템을 사용하는 방법을 이해하려면, 연결:++https://docs.fedoraproject.org/++[페도라 문서]에서 사용 가능한 다른 문서를 참조하세요.

source: Target Audience
cs: Cílová skupina
ko: 대상 청중

source: This guide is intended for {PRODUCT} users of all levels of experience. However, it describes the installation process and its many options in far greater detail than most users are likely to require. You do not need to read and understand this entire document to install {PRODUCT} on a computer. This document is most likely to help experienced users perform advanced and unusual installations.
cs: Příručka je určena uživatelům {PRODUCT} na všech úrovních zkušeností. Přestože popisuje instalační proces a mnohé jeho možnosti daleko podrobněji, než většina uživatelů pravděpodobně potřebuje. Na to abyste nainstalovali {PRODUCT} na počítač, není nutné přečíst a porozumět celému dokumentu. Dokument bude nejspíše nápomocen i zkušeným uživatelům při provádění pokročilých a méně obvyklých instalací.
ko: 이 안내는 모든 수준의 경험을 가진 {PRODUCT} 사용자를 위한 대상으로 합니다. 아뭏튼, 이는 설치 처리를 설명하고 대부분의 사용자가 요구하는 것보다 훨씬 자세하게 많은 선택을 가지고 있습니다. 컴퓨터에서 {PRODUCT}를 설치하는데 이 전체 문서를 읽고 이해 할 필요는 없습니다. 이 문서는 대부분 숙련된 사용자가 고급 및 비정상적인 설치를 수행하는데 도움이 될 것입니다.
