Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/nav.po
Languages: pt_br

source: xref:index.adoc[Installation Guide]
pt_br: xref:index.adoc[Guia de instalação]

source: xref:Preface.adoc[Preface]
pt_br: xref:Preface.adoc[Prefácio]

source: xref:Introduction.adoc[Introduction]
pt_br: xref:Introduction.adoc[Introdução]

source: xref:Downloading_Fedora.adoc[Downloading Fedora]
pt_br: xref:Downloading_Fedora.adoc[Baixando o Fedora]

source: Installing Fedora
pt_br: Instalando o Fedora

source: xref:install/Preparing_for_Installation.adoc[Preparing for Installation]
pt_br: xref:install/Preparing_for_Installation.adoc[Preparando para instalação]

source: xref:install/Booting_the_Installation.adoc[Booting the Installation]
pt_br: xref:install/Booting_the_Installation.adoc[Inicializando a instalação]

source: xref:install/Installing_Using_Anaconda.adoc[Installing Using Anaconda]
pt_br: xref:install/Installing_Using_Anaconda.adoc[Instalando usando o Anaconda]

source: xref:install/After_Installation.adoc[After the Installation]
pt_br: xref:install/After_Installation.adoc[Após a instalação]

source: xref:install/Troubleshooting.adoc[Troubleshooting]
pt_br: xref:install/Troubleshooting.adoc[Solução de problemas]

source: Advanced Installation Options
pt_br: Opções avançadas de instalação

source: xref:advanced/Boot_Options.adoc[Boot Options]
pt_br: xref:advanced/Boot_Options.adoc[Opções de inicialização]

source: xref:advanced/Kickstart_Installations.adoc[Automating the Installation with Kickstart]
pt_br: xref:advanced/Kickstart_Installations.adoc[Automatizando a instalação com Kickstart]

source: xref:advanced/Network_based_Installations.adoc[Setting Up an Installation Server]
pt_br: xref:advanced/Network_based_Installations.adoc[Configurando um servidor de instalação]

source: xref:advanced/VNC_Installations.adoc[Installing Using VNC]
pt_br: xref:advanced/VNC_Installations.adoc[Instalando usando VNC]

source: xref:advanced/Upgrading_Your_Current_System.adoc[Upgrading Your Current System]
pt_br: xref:advanced/Upgrading_Your_Current_System.adoc[Atualizando seu sistema atual]

source: Technical Appendixes
pt_br: Apêndices técnicos

source: xref:appendixes/Kickstart_Syntax_Reference.adoc[Kickstart Syntax Reference]
pt_br: xref:appendixes/Kickstart_Syntax_Reference.adoc[Referência da sintaxe do Kickstart]

source: xref:appendixes/Disk_Partitions.adoc[An Introduction to Disk Partitions]
pt_br: xref:appendixes/Disk_Partitions.adoc[Uma introdução a partições de disco]

source: xref:appendixes/Understanding_LVM.adoc[Understanding LVM]
pt_br: xref:appendixes/Understanding_LVM.adoc[Entendendo LVM]

source: xref:Revision_History.adoc[Revision History]
pt_br: xref:Revision_History.adoc[Histórico de revisão]
