Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/Downloading_Fedora.po
Languages: fr, zh_hans

source: Downloading Fedora
fr: Télécharger Fedora
zh_hans: 获取 Fedora

source: Fedora Editions
fr: Editions de Fedora
zh_hans: Fedora 版本

source: Fedora provides three primary Editions tailored for some specific use cases. link:++https://getfedora.org++[] offers Fedora Cloud for scalable infrastructure, Fedora Server for organizational infrastructure, and Fedora Workstation for the developer and desktop user.
fr: Fedora fournit trois éditions principales adaptées à certains cas d'utilisation spécifiques. link:++https://getfedora.org++[] propose Fedora Cloud pour l'infrastructure évolutive, Fedora Server pour l'infrastructure organisationnelle et Fedora Workstation pour le développeur et l'utilisateur de bureau.
zh_hans: Fedora 包含三个不同的版本，不同版本的目标人群也不一样。正如 link:++https://getfedora.org++[] 所述，Fedora Cloud 专为可伸缩基础设施打造，Fedora Server 专为组织基础设施设计，Fedora Workstation 则主要面向开发者和桌面用户。

source: For alternative desktop environments or media built for more niche purposes, check out link:++https://spins.fedoraproject.org++[Fedora Spins].
fr: Pour des environnements de bureau alternatifs ou des supports conçus à des fins plus spécialisées, consultez le lien : ++https://spins.fedoraproject.org++[Fedora Spins].
zh_hans: 如果你需要其他桌面环境或为特定需求打造的版本，可以尝试 link:++https://spins.fedoraproject.org++[Fedora Spins] 。

source: Each of these downloads provides a different set of default packages, but you can add to your system after the initial installation to customize it for your needs. The installation process is the same for all spins and Editions, so you can use this guide for any choice you make.
fr: Chacun de ces téléchargements fournit un ensemble différent de packages par défaut, mais vous pouvez l'ajouter à votre système après l'installation initiale pour le personnaliser selon vos besoins. Le processus d'installation est le même pour tous les spins et éditions, vous pouvez donc utiliser ce guide pour tout choix que vous faites.
zh_hans: 不同的版本搭载的软件包组都不一样，当然在系统安装完成后你可以随时对系统的软件包进行调整。不同的版本安装流程可以说是几乎一样的，所以你可以放心地使用这份指南安装任意你选择的版本。

source: Which Architecture Is My Computer?
fr: Quelle est l'architecture de mon ordinateur ?
zh_hans: 我的计算机使用的是何种架构？

source: Most modern systems are 64{nbsp}bit x86 architecture. If your computer was manufactured after 2007, or you aren't sure, you probably have a `x86_64` system.
fr: La plupart des systèmes modernes sont une architecture x86 64{nbsp}bit. Si votre ordinateur a été fabriqué après 2007, ou si vous n'êtes pas sûr, vous avez probablement un système `x86_64`.
zh_hans: 大部分现代的电脑都有着 64 位 x86 架构。如果你的电脑在 2007 年后出厂，或者你对此并不确定，你大概率有着 `x86_64` 系统。

source: Changing a Fedora installation from one architecture to another is not supported. Use the following table to determine the architecture of your computer according to the type of processor. Consult your manufacturer's documentation for details on your processor, or resources such as link:++https://ark.intel.com/++[] or link:++https://products.amd.com/++[], if necessary.
fr: La modification d'une installation Fedora d'une architecture à une autre n'est pas prise en charge. Utilisez le tableau suivant pour déterminer l'architecture de votre ordinateur en fonction du type de processeur. Consultez la documentation de votre fabricant pour plus de détails sur votre processeur, ou des ressources telles que lien :++https://ark.intel.com/++[] ou lien :++https://products.amd.com/++[ ], si nécessaire.

source: Processor and architecture types
fr: Processeurs et types d'architectures
zh_hans: 处理器和架构类型

source: |Processor manufacturer and model|Architecture type for Fedora |some Intel Atom, Core series, Pentium 4, and recent vintage Xeon; AMD Athlon, Duron, some Semprons; and older; VIA C3, C7|`i386` |some Intel Atom, Core 2 series, Core i series and Xeon; AMD: Athlon 64, Athlon II, Sempron64, Phenom series, Fusion series, Bulldozer series and Opteron; Apple MacBook, MacBook Pro, and MacBook Air|`x86_64`
fr: | Fabricant et modèle du processeur|Type d’architecture pour Fedora |certains Intel Atom, série Core, Pentium 4 et anciens Xeon ; AMD Athlon, Duron, certains Semprons ; et plus anciens ; VIA C3, C7|`i386` |certains Intel Atom, série Core 2, série Core i et Xeon ; AMD : Athlon 64, Athlon II, Sempron64, série Phenom, série Fusion, série Bulldozer et Opteron ; Apple MacBook, MacBook Pro, et MacBook Air|`x86_64`

source: Media Types
fr: Types de médias
zh_hans: 媒体类型

source: Several media types are available. Choose the one that best suits your requirements.
fr: Plusieurs types de médias sont disponibles. Choisissez celui qui convient le mieux à vos besoins.
zh_hans: 我们提供了多种类型的媒体介质，你可以从中选择最符合你需要的。

source: Live Image
fr: Image Live
zh_hans: Live 映像

source: Live images allow you to preview Fedora before installing it. Instead of booting directly into the installer, a live image loads the same environment you'll get after installation. Fedora Workstation and Fedora Spins are live images.
fr: Les images Live vous permettent de prévisualiser Fedora avant de l'installer. Au lieu de démarrer directement dans le programme d'installation, une image Live charge le même environnement que vous obtiendrez après l'installation. Fedora Workstation et Fedora Spins sont des images Live.
zh_hans: Live镜像允许你在安装Fedora之前预览它。不同于直接启动进入安装器，一个Live镜像加载的是你将在安装后得到的相同的环境。Fedora Workstation和Fedora Spins是Live镜像。

source: Use a live image to install your favorite system, test Fedora on new hardware, troubleshoot, or share with friends.
fr: Utilisez une image en direct pour installer votre système préféré, tester Fedora sur un nouveau matériel, dépanner ou partager avec des amis.
zh_hans: 使用一个Live镜像来安装你的最喜欢的操作系统，在新的硬件上测试Fedora、疑难解答或者将其分享给朋友。

source: DVD Image
fr: Image DVD
zh_hans: DVD 映像

source: DVD images boot directly into the installation enviroment, and allow you to choose from a variety of packages that are provided with it. In Fedora 21, the DVD option is only available in the *Fedora Server* Edition.
fr: Les images DVD s’amorcent directement dans l’environnement d’installation et vous permettent de choisir parmi une variété de paquets qui sont fournis avec celui-ci. Dans Fedora 21, l’option DVD n’est disponible que dans l’édition *Fedora Server*.
zh_hans: DVD镜像直接启动到安装环境中，并且允许你选择多种提供于其中的软件包。在Fedora21中，DVD选项只在*Fedora Server*发行版中才存在。

source: Use the Fedora Server DVD image when you want customized Fedora Server installations using an offline installation source.
fr: Utilisez l'image du DVD Fedora Server lorsque vous souhaitez des installations personnalisées de Fedora Server à l'aide d'une source d'installation hors ligne.
zh_hans: 如果你想用离线的资源来自定义Fedora Server安装，那么就使用Fedora Server DVD镜像。

source: netinstall Image
fr: Image d'installation en ligne (netinstall)
zh_hans: 网络安装映像

source: The netinstall image boots directly into the installation environment, and uses the online Fedora package repositories as the installation source. With a netinstall image, you can select a wide variety of packages to create a customized installation of Fedora.
fr: L'image d'installation en ligne démarre directement dans l'environnement d'installation et utilise les référentiels de packages Fedora en ligne comme source d'installation. Avec une image d'installation en ligne , vous pouvez sélectionner une grande variété de packages pour créer une installation personnalisée de Fedora.
zh_hans: 网络安装镜像将启动到安装环境中，并且使用离线的Fedora软件源作为安装源。用了网络安装镜像，你可以选择一个范围宽泛的软件包来创建一个自定义的Fedora安装。

source: The Fedora Server netinstall image is a universal one, and can be used to install any Fedora Edition or your own set of favorite packages.
fr: L'image d'installation en ligne de Fedora Server est universelle et peut être utilisée pour installer n'importe quelle édition de Fedora ou votre propre ensemble de packages préférés.
zh_hans: Fedora Server网络安装镜像是一个大合集镜像，并且它可以被用于安装任何Fedora发行版或者你自己最喜欢的软件包的集合。

source: ARM images
fr: Images ARM
zh_hans: ARM镜像

source: For many ARM systems, Fedora provides preconfigured filesystem images. Write the image to removable media and boot directly into a Fedora installation that's ready to use.
fr: Pour de nombreux systèmes ARM, Fedora fournit des images de système de fichiers préconfigurées. Écrivez l'image sur un support amovible et démarrez directement dans une installation Fedora prête à l'emploi.
zh_hans: 对于很多ARM系统而言，Fedora提供了预配置的文件系统镜像。向可移动媒体中写入镜像并且启动进入Fedora安装，然后你的系统就立等可用了。

source: ARM devices often require special setup procedures that aren't covered in this guide. Start learning about Fedora ARM at link:++https://fedoraproject.org/wiki/Architectures/ARM++[]
fr: Les appareils ARM nécessitent souvent des procédures de configuration spéciales qui ne sont pas abordées dans ce guide. Commencez à en apprendre davantage sur Fedora ARM sur le lien : ++https://fedoraproject.org/wiki/Architectures/ARM++[]
zh_hans: ARM设备一般而言需要特殊的设置步骤，这些步骤不包含在此指南中。开始学习Fedora ARM详见link:++https://fedoraproject.org/wiki/Architectures/ARM++[]

source: Cloud Images
fr: Images Cloud
zh_hans: 网络映像

source: Fedora Cloud images are preconfigured filesystem images with very few packages installed by default. They include special tools for interacting with cloud platforms, and are not intended to be used outside of cloud environments.
fr: Les images Fedora Cloud sont des images de système de fichiers préconfigurées avec très peu de packages installés par défaut. Ils incluent des outils spéciaux pour interagir avec les plateformes cloud et ne sont pas destinés à être utilisés en dehors des environnements cloud.
zh_hans: Fedora Cloud镜像是预配置的、有少量软件包预安装的文件系统镜像。它们包括特殊的工具便于和云平台进行交互，且不推荐在云环境之外使用。

source: Fedora Cloud comes in several varieties. The Fedora Cloud Base image is a minimal base for cloud deployments. The Fedora Cloud Atomic image is a Docker container host that uses link:++https://www.projectatomic.io/++[Project Atomic] technology for updates. A Docker base image for Fedora is also available.
fr: Fedora Cloud est disponible en plusieurs variantes. L'image Fedora Cloud Base est une base minimale pour les déploiements cloud. L'image Fedora Cloud Atomic est un hôte de conteneur Docker qui utilise la technologie link:++https://www.projectatomic.io/++[Project Atomic] pour les mises à jour. Une image de base Docker pour Fedora est également disponible.

source: Cloud images are preconfigured and do not require installation as described in this guide. Get started using Fedora Cloud at link:++https://fedoraproject.org/wiki/Cloud++[]
fr: Les images cloud sont préconfigurées et ne nécessitent pas d'installation comme décrit dans ce guide. Commencez à utiliser Fedora Cloud sur le lien :++https://fedoraproject.org/wiki/Cloud++[]

source: Boot Images
fr: Images de démarrage
zh_hans: 可启动映像

source: The tiny images at link:++https://boot.fedoraproject.org/++[] are written to CDs, USB drives, or even floppy disks. The BFO image loads installation media from Fedora's servers and directly loads an installation environment, like the netinstall ISO.
fr: Les images miniscules (++https://boot.fedoraproject.org/++[]) sont écrites sur des CD, des clés USB ou même des disquettes. L'image BFO charge le support d'installation à partir des serveurs de Fedora et charge directement un environnement d'installation, comme l'ISO netinstall.
zh_hans: link:++https://boot.fedoraproject.org/++[]的tiny镜像被写入CD、USB磁盘，甚至软盘中。BFO镜像从Fedora服务器中读取安装媒体，并且直接读取安装环境，这就像是netinstall镜像一样。

source: BFO images work like PXE deployments, without having to set up a server.
fr: Les images BFO fonctionnent comme des déploiements PXE, sans avoir à configurer de serveur.
zh_hans: BFO镜像工作就像PXE部署一样，不必须设置安装服务器。
