Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/Introduction.po
Languages: fr

source: This guide covers installation of Fedora, a Linux distribution built on free and open source software. This manual helps you install Fedora on desktops, laptops, and servers. The installation system is easy to use even if you lack previous knowledge of Linux or computer networks. If you select default options, Fedora provides a complete desktop operating system, including productivity applications, Internet utilities, and desktop tools.
fr: Ce guide couvre l’installation de Fedora, une distribution Linux basée sur des logiciels libres et open sources. Ce manuel vous aide à installer Fedora sur des ordinateurs de bureau, des ordinateurs portables et des serveurs. Le système d’installation est facile à utiliser même si vous n’avez pas de connaissances préalables de Linux ou des réseaux informatiques. Si vous sélectionnez les options par défaut, Fedora fournit un système d’exploitation de bureau complet, comprenant des applications de productivité, des utilitaires Internet et des outils de bureau.

source: This document details the full range of installation options, including those that apply only in limited or unusual circumstances. Understanding of all topics described in this document is not necessary to successfully perform the installation in most cases.
fr: Ce document détaille toute la gamme des options d’installation, y compris celles qui ne s’appliquent que dans des circonstances limitées ou inhabituelles. Dans la plupart des cas, il n’est pas nécessaire de comprendre tous les sujets décrits dans ce document pour réussir l’installation.

source: Background
fr: Informations générales

source: About Fedora
fr: À propos de Fedora

source: To find out more about {PRODUCT}, visit the link:++https://fedoraproject.org/++[{PRODUCT} Project Website]. Other documentation describing additional topics related to {PRODUCT} is available at link:++https://docs.fedoraproject.org/++[{PRODUCT} Documentation]. Also see the link:++https://fedoraproject.org/wiki/Fedora_Project_Wiki++[{PRODUCT} Project Wiki].
fr: Pour en savoir plus sur {PRODUCT}, visitez le link:++https://fedoraproject.org/++[site Web du projet {PRODUCT}]. Une documentation supplémentaire décrivant d’autres sujets liés à {PRODUCT} est disponible ici : link:++https://docs.fedoraproject.org/++[Documentation {PRODUCT}]. Vous pouvez également vous référer au link:++https://fedoraproject.org/wiki/Fedora_Project_Wiki++[Wiki du projet {PRODUCT}].

source: Getting Additional Help
fr: Obtenir une aide supplémentaire

source: If you encounter any problems which are not described in documentation, you might get help from members of the community - developers, users, and others. There are many ways to get help: the Ask Fedora website, mailing lists, forums, or IRC. For a summary of available resources, see the link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Communicating and Getting Help] page on the {PRODUCT} wiki.
fr: Si vous rencontrez des problèmes qui ne sont pas décrits dans la documentation, vous pouvez obtenir de l’aide auprès des membres de la communauté — développeurs, utilisateurs et autres. Il existe de nombreuses façons d’obtenir de l’aide : le site web Ask Fedora, les listes de diffusion, les forums ou IRC. Pour un résumé des ressources disponibles, référez vous à la page link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Communiquer et obtenir de l’aide] sur Wiki {PRODUCT}.

source: About This Document
fr: À propos de ce document

source: Goals
fr: Objectifs

source: This guide helps a reader:
fr: Ce guide aide le lecteur à :

source: Understand how to locate the {PRODUCT} distribution online
fr: Comprendre où trouver la distribution {PRODUCT} en ligne

source: Create configuration data that allows a computer to boot {PRODUCT}
fr: Créer les données de configuration pour permettre à un ordinateur de démarrer {PRODUCT}

source: Understand and interact with the {PRODUCT} installation program
fr: Comprendre et interagir avec le programme d’installation de {PRODUCT}

source: Complete basic post-installation configuration of a {PRODUCT} system
fr: Configuration de base complète post-installation d’un système {PRODUCT}

source: This guide does not cover *use* of {PRODUCT}. To learn how to use an installed {PRODUCT} system, see the other manuals available at link:++https://docs.fedoraproject.org/++[Fedora Documentation].
fr: Ce guide ne couvre pas l’*utilisation* de {PRODUCT}. Pour apprendre à utiliser un système {PRODUCT} installé, référez vous aux autres manuels disponibles dans la link:++https://docs.fedoraproject.org/++[Documentation Fedora].

source: Target Audience
fr: Public cible

source: This guide is intended for {PRODUCT} users of all levels of experience. However, it describes the installation process and its many options in far greater detail than most users are likely to require. You do not need to read and understand this entire document to install {PRODUCT} on a computer. This document is most likely to help experienced users perform advanced and unusual installations.
fr: Ce guide est destiné aux utilisateurs de {PRODUCT} de tous niveaux d’expérience. Toutefois, il décrit le processus d’installation et ses nombreuses options de manière beaucoup plus détaillée que ce que la plupart des utilisateurs sont susceptibles d’exiger. Il n’est pas nécessaire de lire et de comprendre l’ensemble de ce document pour installer {PRODUCT} sur un ordinateur. Ce document est plus susceptible d’aider les utilisateurs expérimentés à effectuer des installations avancées et inhabituelles.
