Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/Revision_History.po
Languages: fr, id, ko, pt_br

source: Revision History
fr: Historique des modifications
id: Riwayat Revisi
ko: 개정 기록
pt_br: Histórico de revisão

source: Note that revision numbers relate to the edition of this manual, not to version numbers of Fedora.
fr: Veuillez noter que les numéros de révision se rapportent à l’édition de ce manuel, et non aux numéros de version de Fedora.
id: Perhatikan bahwa angka revisi berhubungan dengan edisi manual ini, bukan ke nomor versi Fedora.
ko: 개정 번호는 페도라의 버전 번호가 아니라, 이 설명서의 버전과 관련된 번호의 기록입니다.
pt_br: Repare que números de revisão são relacionados à edição desse manual, não a números de versão do Fedora.

source: Tue Oct 30 2018, Petr Bokoč (pbokoc@redhat.com)
fr: Mar 30 oct 2018, Petr Bokoč (pbokoc@redhat.com)
id: Sel 30 Okt 2018, Petr Bokoč (pbokoc@redhat.com)
ko: 2018년 10월 30일 화요일, Petr Bokoč (pbokoc@redhat.com)
pt_br: Ter 30 out 2018, Petr Bokoč (pbokoc@redhat.com)

source: Fedora 29 Final release
fr: Publication finale de Fedora 29
id: Fedora 29 Rilis final
ko: 페도라 29 최종 출시
pt_br: Lançamento Final do Fedora 29

source: All external links are now converted to HTTPS where applicable (link:++https://pagure.io/fedora-docs/install-guide/issue/3++[issue 3])
fr: Tous les liens externes sont désormais convertis en HTTPS (link:++https://pagure.io/fedora-docs/install-guide/issue/3++[incident 3])
id: Semua taut eksternal sekarang dikonversi ke HTTPS bila berlaku (link:++https://pagure.io/fedora-docs/install-guide/issue/3++[issue 3])
ko: 모든 외부 연결은 현재 가용한 곳에서 HTTPS로 전환되었습니다 (link:++https://pagure.io/fedora-docs/install-guide/issue/3++[사건 3])
pt_br: Agora todos os links externos são convertidos para HTTPS onde for aplicável (link:++https://pagure.io/fedora-docs/install-guide/issue/3++[issue 3])

source: Removed a mention of a no longer available rescue image (link:++https://pagure.io/fedora-docs/install-guide/issue/4++[issue 4])
fr: Suppression de la mention d’une image de secours qui n’est plus disponible (link:++https://pagure.io/fedora-docs/install-guide/issue/4++[incident 4])
id: Menghapus penyebutan image penyelamatan yang tidak lagi tersedia (link:++https://pagure.io/fedora-docs/install-guide/issue/4++[issue 4])
ko: 더 이상 사용 할 수없는 복구 이미지에 대한 언급이 제거되었습니다 (link:++https://pagure.io/fedora-docs/install-guide/issue/4++[사건 4])
pt_br: Removida uma menção a uma imagem de recuperação não mais disponível (link:++https://pagure.io/fedora-docs/install-guide/issue/4++[issue 4])

source: New Kickstart commands and options: `url`, `network --bindto=`, and LUKS-related options for `autopart`, `part`, `logvol`, and `raid`.
fr: Nouvelles commandes et options Kickstart : `url`, `network --bindto=`, ainsi que de nouvelles options liées à LUKS pour `autopart`, `part`, `logvol` et`raid`.
id: Perintah dan opsi Kickstart baru: `url`, `network --bindto=`, dan opsi terkait LUKS untuk `autopart`, `part`, `logvol`, dan `raid`.
ko: 새로운 킥스타트 명령과 선택: `url`, `network --bindto=`, and LUKS-related options for `autopart`, `part`, `logvol`, and `raid`.
pt_br: Novos comandos e opções Kickstart: `url`, `network --bindto=`, e opções relacionadas ao LUKS para `autopart`, `part`, `logvol` e `raid`.

source: The `authconfig` Kickstart command is now deprecated and replaced by `authselect` (link:++https://pagure.io/fedora-docs/install-guide/issue/6++[issue 6])
fr: La commande Kickstart `authconfig` est obsolète et a été remplacée par `authselect` (link:++https://pagure.io/fedora-docs/install-guide/issue/6++[incident 6])
id: Perintah Kickstart `authconfig` sekarang sudah usang dan digantikan oleh `authselect` (link:++https://pagure.io/fedora-docs/install-guide/issue/6++[issue 6])
ko: `authconfig` 킥스타트 명령은 현재 `authselect`에 의해 누락되거나 대체됩니다 (link:++https://pagure.io/fedora-docs/install-guide/issue/6++[사건 6])
pt_br: O comando Kickstart `authconfig` agora está descontinuado e substituído pelo `authselect` (link:++https://pagure.io/fedora-docs/install-guide/issue/6++[issue 6])

source: New boot options: `inst.stag2.all=`, `inst.ks.all=`, `inst.xtimeout=`, `inst.decorated=`
fr: Nouvelles options d’amorçage : `inst.stag2.all=`, `inst.ks.all=`, `inst.xtimeout=`, `inst.decorated=`
id: Opsi boot baru: `inst.stag2.all=`, `inst.ks.all=`, `inst.xtimeout=`, `inst.decorated=`
ko: 새로운 부트 선택: `inst.stag2.all=`, `inst.ks.all=`, `inst.xtimeout=`, `inst.decorated=`
pt_br: Novas opções de inicialização: `inst.stag2.all=`, `inst.ks.all=`, `inst.xtimeout=`, `inst.decorated=`

source: Updated the Fedora Media Writer chapter (link:++https://pagure.io/fedora-docs/install-guide/issue/7++[issue 7])
fr: Mise à jour du chapitre sur Fedora Media Writer (link:++https://pagure.io/fedora-docs/install-guide/issue/7++[incident 7])
id: Memperbarui bab Fedora Media Writer (link:++https://pagure.io/fedora-docs/install-guide/issue/7++[issue 7])
ko: 페도라 미디어 작성기 장은 최신화 되었습니다 (link:++https://pagure.io/fedora-docs/install-guide/issue/7++[사건 7])
pt_br: Atualizado o capítulo do Fedora Media Writer (link:++https://pagure.io/fedora-docs/install-guide/issue/7++[issue 7])

source: Updated image verification instructions for Mac (link:++https://pagure.io/fedora-docs/install-guide/issue/15++[issue 15])
fr: Mise à jour des instructions de vérification des images pour Mac (link:++https://pagure.io/fedora-docs/install-guide/issue/15++[incident 15])
id: Petunjuk verifikasi image yang diperbarui untuk Mac (link:++https://pagure.io/fedora-docs/install-guide/issue/15++[issue 15])
ko: 맥에서 이미지 확인 명령이 최신화 되었습니다 (link:++https://pagure.io/fedora-docs/install-guide/issue/15++[사건 15])
pt_br: Atualizadas as instruções de verificação da imagem para Mac (link:++https://pagure.io/fedora-docs/install-guide/issue/15++[issue 15])

source: Various fixes related to the new publishing system
fr: Diverses corrections liées au nouveau système de publication
id: Berbagai perbaikan yang terkait dengan sistem penerbitan baru
ko: 새로운 출시 시스템과 연관된 다양한 부분이 수정되었습니다
pt_br: Várias correções relacionadas ao novo sistema de publicação

source: Mon Jun 20 2016, Clayton Spicer (cspicer@redhat.com)
fr: Lun 20 juin 2016, Clayton Spicer (cspicer@redhat.com)
id: Sen 20 Jun 2016, Clayton Spicer (cspicer@redhat.com)
ko: 2016년 6월 20일 월요일, Clayton Spicer (cspicer@redhat.com)
pt_br: Seg 20 jun 2016, Clayton Spicer (cspicer@redhat.com)

source: Fedora 24 Final release
fr: Publication finale de Fedora 24
id: Fedora 24 Rilis final
ko: 페도라 24 최종 출시
pt_br: Lançamento Final do Fedora 24

source: Added boot option [option]#inst.nosave=#
fr: Ajout de l’option d’amorçage [option]#inst.nosave=#
id: Ditambahkan opsi boot [option]#inst.nosave=#
ko: 추가된 부트 선택 [option]#inst.nosave=#
pt_br: Adicionada a opção de inicialização [option]#inst.nosave=#

source: Typo fixes
fr: Correction de fautes de frappe
id: Perbaikan tipo
ko: 오타 수정
pt_br: Correções de erros de escrita

source: Mon Nov 02 2015, Petr Bokoč (pbokoc@redhat.com)
fr: Lun 2 nov 2015, Petr Bokoč (pbokoc@redhat.com)
id: Sen 02 Nov 2015, Petr Bokoč (pbokoc@redhat.com)
ko: 2015년 11월 2일 월요일, Petr Bokoč (pbokoc@redhat.com)
pt_br: Seg 02 nov 2015, Petr Bokoč (pbokoc@redhat.com)

source: Fedora 23 Final release
fr: Publication finale de Fedora 23
id: Fedora 23 Rilis final
ko: 페도라 23 최종 출시
pt_br: Lançamento Final do Fedora 23

source: Kickstart commands and boot options updated for F23
fr: Commandes Kickstart et options d’amorçage mises à jour pour F23
id: Perintah dan opsi boot Kickstart diperbarui untuk F23
ko: F23을 위해 킥스타트 명령과 부트 선택이 최신화됨
pt_br: Comandos de kickstart e opções de inicialização atualizados para F23

source: Many typo fixes
fr: Nombreuses corrections de fautes de frappe
id: Banyak perbaikan kesalahan ketik
ko: 많은 오타 수정
pt_br: Muitas correções de erros de escrita

source: Mon May 25 2015, Petr Bokoč (pbokoc@redhat.cogm)
fr: Lun 25 mai 2015, Petr Bokoč (pbokoc@redhat.cogm)
id: Sen 25 Mei 2015, Petr Bokoč (pbokoc@redhat.cogm)
ko: 2015년 5월 25일 월요일, Petr Bokoč (pbokoc@redhat.cogm)
pt_br: Seg 25 mai 2015, Petr Bokoč (pbokoc@redhat.cogm)

source: Fedora 22 Final release
fr: Publication finale de Fedora 22
id: Fedora 22 Rilis final
ko: 페도라 22 최종 출시
pt_br: Lançamento Final do Fedora 22

source: References to [application]*Yum* replaced with [application]*DNF* (the new default package manager)
fr: Les références à [application]*Yum* ont été remplacées par [application]*DNF* (le nouveau gestionnaire de paquets par défaut)
id: Referensi untuk [application]*Yum* digantikan dengan [application]*DNF* (manajer paket default baru)
ko: [application]에 참조 *Yum*은 [application]*DNF* (새로운 기본 꾸러미 관리자)로 교체되었습니다
pt_br: Referências a [application]*Yum* substituídas por [application]*DNF* (o novo gerenciador de pacotes padrão)

source: Updates in boot options: [option]#inst.dnf# replaced with [option]#inst.nodnf#, added [option]#inst.kdump_addon=#
fr: Mises à jour des options d’amorçage : [option]#inst.dnf# remplacé par [option]#inst.nodnf#, [option]#inst.kdump_addon=# ajouté
id: Pembaruan pada opsi boot: [option]#inst.dnf# diganti dengan [option]#inst.nodnf#, ditambahkan [option]#inst.kdump_addon=#
ko: 부트 선택이 최신화 되었습니다: [option]#inst.dnf# replaced with [option]#inst.nodnf#, added [option]#inst.kdump_addon=#
pt_br: Atualizações nas opções de inicialização: [option]#inst.dnf# substituída por [option]#inst.nodnf#, adicionada [option]#inst.kdump_addon=#

source: Updates in Kickstart: [command]#%anaconda#, [command]#%addon#, [command]#sshkey#, [command]#pwpolicy#
fr: Mises à jour dans Kickstart : [command]#%anaconda#, [command]#%addon#, [command]#sshkey#, [command]#pwpolicy#
id: Pembaruan di Kickstart: [command]#%anaconda#, [command]#%addon#, [command]#sshkey#, [command]#pwpolicy#
ko: 킥스트타로 최신화 되었습니다: [command]#%anaconda#, [command]#%addon#, [command]#sshkey#, [command]#pwpolicy#
pt_br: Atualizações no Kickstart: [command]#%anaconda#, [command]#%addon#, [command]#sshkey#, [command]#pwpolicy#

source: Added the `Kdump` screen to the GUI docs
fr: Ajout de l’écran `Kdump` dans la documentation de l’interface graphique
id: Menambahkan layar `Kdump` ke dokumen GUI
ko: `Kdump` 화면이 GUI 문서에 추가되었습니다
pt_br: Adicionada a tela `Kdump` para as documentações de GUI

source: Sun Dec 21 2014, Zach Oglesby (zach@oglesby.co)
fr: Dim 21 déc 2014, Zach Oglesby (zach@oglesby.co)
id: Min 21 Des 2014, Zach Oglesby (zach@oglesby.co)
ko: 2014년 12월 21일 일요일, Zach Oglesby (zach@oglesby.co)
pt_br: Dom 21 dez 2014, Zach Oglesby (zach@oglesby.co)

source: Fixed Windows checksum steps, BZ#1175759
fr: Correction des étapes de vérification des sommes de contrôle sous Windows, BZ#1175759
id: Memperbaiki langkah checksum Windows, BZ#1175759
ko: 윈도우 체크섬 단계 수정됨, BZ#1175759
pt_br: Corrigidas as instruções de soma de verificação no Windows, BZ#1175759

source: Mon Dec 15 2014, Petr Bokoč (pbokoc@redhat.com)
fr: Lun 15 déc 2014, Petr Bokoč (pbokoc@redhat.com)
id: Sen 15 Des 2014, Petr Bokoč (pbokoc@redhat.com)
ko: 2014년 12월 15일 월요일, Petr Bokoč (pbokoc@redhat.com)
pt_br: Seg 15 dez 2014, Petr Bokoč (pbokoc@redhat.com)

source: Fixes in Boot Options: inst.headless is deprecated, inst.askmethod moved from removed to Installation Source
fr: Corrections dans les options d’amorçage : inst.headless est déprécié, inst.askmethod déplacé de retiré à Source d’installation
id: Perbaikan dalam opsi boot: inst.headless usang, metode inst.askmethod dipindah dari dihapus ke Sumber Instalasi
ko: 부트 선택에 고정: inst.headless는 더 이상 사용되지 않으며, inst.askmethod는 제거되어 설치 원천으로 이동했습니다
pt_br: Correções nas opções de inicialização: inst.headless foi desconectinuada, inst.askmethod movida de removida para a fonte de instalação

source: Parts of the network boot setup chapter have been updated with correct URLs
fr: Certaines parties du chapitre sur la configuration du démarrage en réseau ont été mises à jour avec les URL correctes
id: Bagian dari bab penyiapan boot jaringan telah diperbarui dengan URL yang benar
ko: 네트워크 부팅 설정 부분의 일부분은 올바른 URL로 최신화되었습니다
pt_br: Partes do capítulo de configuração de inicialização de rede foram atualizadas com URLs corretas

source: Updates in Recommended Partitioning Scheme and Advice on Partitions in the Manual Partitioning section of the installation chapter
fr: Mises à jour de Schéma de partitionnement recommandé et de Conseils sur les partitions de la section Partitionnement manuel du chapitre sur l’installation
id: Pemutakhiran di Skema Pemartisian Yang Direkomendasikan dan Saran tentang Partisi dalam bagian Pemartisian Manual dari bab instalasi
ko: 설치 장의 수동 파티션 부분에 있는 권장 파티션 구성표의 최신화와 파티션에 대한 조언
pt_br: Atualizações no esquema de particionamento recomendado e conselhos sobre partições na seção Particionamento manual do capítulo de instalação

source: Mon Dec 8 2014, Petr Bokoč (pbokoc@redhat.com)
fr: Lun 8 déc 2014, Petr Bokoč (pbokoc@redhat.com)
id: Sen 8 Des 2014, Petr Bokoč (pbokoc@redhat.com)
ko: 2014년 12월 8일 월요일, Petr Bokoč (pbokoc@redhat.com)
pt_br: Seg 8 dez 2014, Petr Bokoč (pbokoc@redhat.com)

source: Publishing for Fedora 21
fr: Publication de Fedora 21
id: Penerbitan untuk Fedora 21
ko: 페도라 21 게시
pt_br: Publicação para Fedora 21

source: Mon Dec 8 2014, Pete Travis (immanetize@fedoraproject.org)
fr: Lun 8 déc 2014, Pete Travis (immanetize@fedoraproject.org)
id: Sen 8 Des 2014, Pete Travis (immanetize@fedoraproject.org)
ko: 2014년 12월 8일 월요일, Pete Travis (immanetize@fedoraproject.org)
pt_br: Seg 8 dez 2014, Pete Travis (immanetize@fedoraproject.org)

source: added info on media types
fr: Ajout d’informations sur les types de médias
id: menambahkan info tentang tipe media
ko: 미디어 유형에 추가된 정보
pt_br: Adicionadas informações sobre tipos de mídia

source: Tue Dec 17 2013, Petr Bokoč (pbokoc@redhat.com)
fr: Mar 17 déc 2013, Petr Bokoč (pbokoc@redhat.com)
id: Sel 17 Des 2013, Petr Bokoč (pbokoc@redhat.com)
ko: 2013년 12월 17일 화요일, Petr Bokoč (pbokoc@redhat.com)
pt_br: Ter 17 dez 2013, Petr Bokoč (pbokoc@redhat.com)

source: Publishing for Fedora 20
fr: Publication de Fedora 20
id: Penerbitan untuk Fedora 20
ko: 페도라 20 게시
pt_br: Publicação para Fedora 20
