Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f36/pages/_partials/install/FilterSpoke.po
Languages: pt_br

source: Installation Destination - Specialized & Network Disks
pt_br: Destino da Instalação - Discos Especializados e de Rede

source: This part of the `Installation Destination` screen allows you to configure non-local storage devices, namely iSCSI and FCoE storage. This section will mostly be useful to advanced users who have a need for networked disks. For instructions on setting up local hard drives, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination].
pt_br: Esta parte da tela `Destino da Instalação` permite que você configure dispositivos de armazenamento não locais, ou seja, armazenamento iSCSI e FCoE. Esta seção será útil principalmente para usuários avançados que precisam de discos em rede. Para obter instruções sobre como configurar discos rígidos locais, consulte xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Destino da Instalação].

source: This section only explains how to make existing network disks available inside the installer. It does not explain how to set up your network or a storage server, only how to connect to them.
pt_br: Esta seção explica apenas como disponibilizar os discos de rede existentes no instalador. Ele não explica como configurar sua rede ou um servidor de armazenamento, apenas como se conectar a eles.

source: Installation Destination - Network Storage Filters
pt_br: Destino da Instalação - Filtros de Armazenamento de Rede

source: A list of currently configured network storage devices
pt_br: Uma lista de dispositivos de armazenamento de rede atualmente configurados

source: The screen contains a list of all currently available (discovered) network storage devices. When the screen is opened for the first time, the list will be empty in most cases because no network storage has been discovered - the installer makes no attempt at discovering this unless you configure network disks using a Kickstart file.
pt_br: A tela contém uma lista de todos os dispositivos de armazenamento de rede atualmente disponíveis (descobertos). Quando a tela é aberta pela primeira vez, a lista estará vazia na maioria dos casos porque nenhum armazenamento de rede foi descoberto – o instalador não tenta descobrir isso a menos que você configure os discos de rede usando um arquivo Kickstart.

source: To add one or more storage devices to the screen so you can search them and use them in the installation, click `Add iSCSI Target` or `Add FCoE SAN` in the bottom right corner of the screen, and follow the instructions in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination-add-iscsi[Add iSCSI Target] or xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination-add-fcoe[Add FCoE SAN], depending on which type of network storage you want to add.
pt_br: Para adicionar um ou mais dispositivos de armazenamento à tela para que você possa pesquisá-los e usá-los na instalação, clique em `Adicionar Destino iSCSI` ou `Adicionar FCoE SAN` no canto inferior direito da tela e siga as instruções em xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination-add-iscsi[Adicionar Destino iSCSI] ou xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination-add-fcoe[Adicionar FCoE SAN], dependendo de qual tipo de armazenamento de rede você deseja adicionar.

source: Network storage devices successfully discovered and configured by the installer will then be displayed in the main list, along with identifying information such as `Name`, `WWID`, `Model` and `Target`. To sort the list by a specific column (for example `WWID`), click the column's heading.
pt_br: Os dispositivos de armazenamento de rede descobertos e configurados com sucesso pelo instalador serão exibidos na lista principal, juntamente com informações de identificação, como `Nome`, `WWID`, `Modelo` e `Destino`. Para classificar a lista por uma coluna específica (por exemplo, `WWID`), clique no título da coluna.

source: On lower display resolutions, the list may be too wide to fit on the screen, and some of the columns or buttons may be hidden initially. Use the horizontal scroll bar at the bottom of the list to move your view and see all available table columns and controls.
pt_br: Em resoluções de vídeo mais baixas, a lista pode ser muito ampla para caber na tela e algumas das colunas ou botões podem estar ocultos inicialmente. Use a barra de rolagem horizontal na parte inferior da lista para mover sua visualização e ver todas as colunas e controles da tabela disponíveis.

source: There are three tabs on the top of the list, which display different information:
pt_br: Existem três abas no topo da lista, que exibem informações diferentes:

source: Search
pt_br: Buscar

source: Displays all available devices, regardless of their type, and allows you to filter them either by their _World Wide Identifier_ (WWID) or by the port, target, or logical unit number (LUN) at which they are accessed.
pt_br: Exibe todos os dispositivos disponíveis, independentemente de seu tipo, e permite filtrá-los por seu _World Wide Identifier_ (WWID) ou pela porta, destino ou número de unidade lógica (LUN) em que são acessados.

source: Multipath Devices
pt_br: Dispositivos de Caminhos Múltiplos

source: Storage devices accessible through more than one path, such as through multiple SCSI controllers or Fiber Channel ports on the same system.
pt_br: Dispositivos de armazenamento acessíveis por meio de mais de um caminho, como por meio de vários controladores SCSI ou portas Fibre Channel no mesmo sistema.

source: The installation program only detects multipath storage devices with serial numbers that are 16 or 32 characters long.
pt_br: O programa de instalação detecta apenas dispositivos de armazenamento de caminhos múltiplos com números de série de 16 ou 32 caracteres.

source: Other SAN Devices
pt_br: Outros dispositivos SAN

source: Devices available on a Storage Area Network (SAN).
pt_br: Dispositivos disponíveis em uma Rede de Área de Armazenamento (SAN).

source: Depending on the tab you are currently in, you can filter the discovered devices by using the `Filter By` field. Some of the filtering options are automatically populated based on discovered devices (for example, if you select `Filter By:` `Vendor`, another drop-down menu will appear showing all vendors of all discovered devices). Other filters require your input (for example when filtering by WWID), and present you with a text input field instead of a drop-down menu.
pt_br: Dependendo da guia em que você está atualmente, você pode filtrar os dispositivos descobertos usando o campo `Filtrar por`. Algumas das opções de filtragem são preenchidas automaticamente com base nos dispositivos descobertos (por exemplo, se você selecionar `Filtrar por:` `Fabricante`, outro menu suspenso aparecerá mostrando todos os fornecedores de todos os dispositivos descobertos). Outros filtros exigem sua entrada (por exemplo, ao filtrar por WWID) e apresentam um campo de entrada de texto em vez de um menu suspenso.

source: In the list (regardless of how it is filtered), each device is presented on a separate row, with a check box to its left. Mark the check box to make the device available during the installation process; this will cause this device (node) to be shown in the `Specialized & Network Disks` section in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]. There, you can select the disk as an installation target and proceed with either manual or automatic partitioning.
pt_br: Na lista (independentemente de como é filtrado), cada dispositivo é apresentado em uma linha separada, com uma caixa de seleção à sua esquerda. Marque a caixa de seleção para disponibilizar o dispositivo durante o processo de instalação; isso fará com que este dispositivo (nó) seja mostrado na seção `Discos de Rede e Especiais` em xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Destino da Instalação]. Lá, você pode selecionar o disco como um destino de instalação e prosseguir com o particionamento manual ou automático.

source: Devices that you select here are not automatically wiped by the installation process. Selecting a device on this screen does not, in itself, place data stored on the device at risk. Also note that any devices that you do not select here to form part of the installed system can be added to the system after installation by modifying the `/etc/fstab` file.
pt_br: Os dispositivos selecionados aqui não são apagados automaticamente pelo processo de instalação. Selecionar um dispositivo nesta tela não coloca, por si só, os dados armazenados no dispositivo em risco. Observe também que quaisquer dispositivos que você não selecionar aqui para fazer parte do sistema instalado podem ser adicionados ao sistema após a instalação, modificando o arquivo `/etc/fstab`.

source: When you have selected the storage devices to make available during installation, click `Done` to return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination].
pt_br: Quando você tiver selecionado os dispositivos de armazenamento para disponibilizar durante a instalação, clique em `Concluído` para retornar a xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Destino da Instalação].
