Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f36/pages/_partials/install/LangSupportSpoke.po
Languages: fi

source: Language Support
fi: Kielituki

source: The `Language Support` screen allows you to configure language settings for your system. The default language is determined by your selection in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Welcome Screen and Language Selection] and support for this language cannot be removed. You can only add additional languages, which will be available on the installed system - not during the installation.
fi: "Language Support" (Kielituki) -näytössä voit määrittää järjestelmäsi kieliasetukset. Oletuskieli määräytyy kohdassa xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Welcome Screen and Language Selection] tekemäsi valinnan perusteella, eikä tämän kielen tukea voi poistaa. Voit lisätä vain muita kieliä, jotka ovat käytettävissä asennetussa järjestelmässä - ei asennuksen aikana.

source: If you want to change the default language, or the language used during the installation, you must reboot your system, start the installer again, and select a different language in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Welcome Screen and Language Selection].
fi: Jos haluat vaihtaa oletuskieltä tai asennuksen aikana käytettyä kieltä, sinun on käynnistettävä järjestelmä uudelleen, käynnistettävä asennusohjelma uudelleen ja valittava toinen kieli tiedostosta xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[ Tervetuloa-näyttö ja kielen valinta].

source: Adding support for another language does not automatically configure the corresponding keyboard layout. Layouts are a separate setting configured in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-keyboard-layout[Keyboard Layout].
fi: Tuen lisääminen toiselle kielelle ei määritä automaattisesti vastaavaa näppäimistöasettelua. Asettelut ovat erillinen asetus, joka on määritetty kohdassa xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-keyboard-layout[Näppäimistön asettelu].

source: Language Support
fi: Kielituki

source: The language configuration screen. The left side shows that at least one variant of English and French have been selected; the right column shows that French (France) and French (Canada) are selected in the currently highlighted French group.
fi: Kielen määritysnäyttö. Vasemmalla puolella näkyy, että ainakin yksi englannin ja ranskan versio on valittu; oikea sarake näyttää, että ranska (Ranska) ja ranska (Kanada) on valittu tällä hetkellä korostetusta ranskankielisestä ryhmästä.

source: The left panel contains a list of available language groups such as `English` or `Bulgarian`. If at least one language from a group is selected, a check mark will be displayed next to the group, and the list entry will be highlighted. This allows you to easily see which languages you have configured support for.
fi: Vasemmassa paneelissa on luettelo käytettävissä olevista kieliryhmistä, kuten "englanti" tai "bulgaria". Jos vähintään yksi kieli ryhmästä on valittu, ryhmän vieressä näkyy valintamerkki ja luettelon merkintä on korostettu. Tämän avulla voit helposti nähdä, mille kielelle olet määrittänyt tuen.

source: To add support for one or more additional languages, click a group in the left panel, and then select one or more regional variations in the right panel using check boxes next to list entries. Repeat this process for all languages you want to install support for.
fi: Jos haluat lisätä tuen yhdelle tai useammalle lisäkielelle, napsauta ryhmää vasemmassa paneelissa ja valitse sitten yksi tai useampi alueellinen muunnelma oikeasta paneelista käyttämällä luettelomerkintöjen vieressä olevia valintaruutuja. Toista tämä prosessi kaikille kielille, joille haluat asentaa tuen.

source: Enabling support for some languages (typically languages which use non-Latin script) will install additional packages - for example, enabling support for one or more languages from the `Arabic` group will also install the `arabic-support` package group. For more information about packages, see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Software Selection].
fi: Tuen käyttöönotto joillekin kielille (yleensä kielille, jotka käyttävät ei-latinalaista kirjoitusta) asentaa lisäpaketteja - esimerkiksi tuen ottaminen käyttöön yhdelle tai useammalle kielelle "arabia"-ryhmästä asentaa myös "arabic-support" -pakettiryhmän. Lisätietoja paketeista on kohdassa xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Software Selection].

source: Once you have made your selections, click `Done` in the top left corner to return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
fi: Kun olet tehnyt valinnat, napsauta "Valmis" vasemmassa yläkulmassa palataksesi kohtaan xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Asennusyhteenveto].
