Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f36/pages/_partials/install/PasswordSpoke.po
Languages: tr

source: Root Password
tr: Root Parolası

source: The `Root Password` screen is used to configure the `root` password for your system. This password will be used to log into the administrator (also known as superuser) account, which is used for system administration tasks such as installing and updating software packages and changing system-wide configuration such as network and firewall settings, storage options and adding or modifying users, groups and file permissions.
tr: `Root Parolası` ekranı, sisteminiz için `root` parolasını yapılandırmak için kullanılır. Bu parola yazılım paketlerinin kurulması ve güncellenmesi ile ağ ve güvenlik duvarı ayarları, depolama seçenekleri gibi sistem genelindeki yapılandırmaların değiştirilmesi ve kullanıcıların, grupların ve dosya izinlerinin eklenmesi ve değiştirilmesi gibi sistem yönetimi görevleri için kullanılan yönetici (süper kullanıcı olarak da bilinir) hesabında oturum açmak için kullanılacaktır.

source: The `root` account will always be created during the installation. However, you should always also create a normal user account in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-create-user[Create User] and use that account to log in to the system. Only switch to the administrator account only when you need to perform a task which requires administrator access.
tr: `root` hesabı, kurulum sırasında her zaman oluşturulacaktır. Ancak, xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-create-user[Kullanıcı Oluştur] ekranında her zaman normal bir kullanıcı hesabı da oluşturmalı ve sistemde oturum açmak için bu hesabı kullanmalısınız. Yönetici hesabına yalnızca yönetici erişimi gerektiren bir görevi gerçekleştirmeniz gerektiğinde geçiş yapın.

source: The `root` account has complete control over the system. If an unauthorized person gains access to this account, they can access or delete all users’ personal files or otherwise exploit the machine for their own nefarious purposes. See the [citetitle]_{PRODUCT} Security Guide_, available at link:++https://docs.fedoraproject.org/++[], for detailed documentation about account security and guidelines for choosing a strong password.
tr: `root` hesabı, sistem üzerinde tam denetime sahiptir. Yetkisiz bir kişi bu hesaba erişim kazanırsa, tüm kullanıcıların kişisel dosyalarına erişebilir veya bunları silebilir veya makineyi kendi kötü amaçları için kullanabilir. Hesap güvenliği hakkında ayrıntılı belgelendirme ve güçlü bir parola seçme yönergeleri için link:++https://docs.fedoraproject.org/++[] adresindeki [citetitle]_{PRODUCT} Güvenlik Kılavuzuna_ bakın.

source: The Root Password screen. Use the text input fields to provide your root password.
tr: Root Parolası ekranı. Root parolanızı sağlamak için metin giriş alanlarını kullanın.

source: Once you choose a strong password, enter it in the `Root Password` field. The characters you write will be displayed as dots for security. Then, type the same password into the `Confirm` field to ensure you entered it properly. Both entered passwords must be the same.
tr: Güçlü bir parola seçtikten sonra, bunu `Root Parolası` alanına girin. Yazdığınız karakterler güvenlik gerekçesiyle nokta olarak görüntülenecektir. Ardından, doğru bir şekilde girdiğinizden emin olmak için `Onayla` alanına aynı parolayı yazın. Girilen her iki parola da aynı olmalıdır.

source: As you enter the password, it will be evaluated and the installer will determine the password's strength. If the installer considers your password weak, a message will appear at the bottom of the screen, explaining which aspect of your chosen password is considered insuficient. For example:
tr: Siz girerken parolanız değerlendirilecek ve kurucu parolanın sağlamlığını belirleyecektir. Kurucu parolanızın zayıf olduğunu düşünürse, ekranın alt kısmında seçtiğiniz parolanın hangi yönünün yetersiz olduğunu açıklayan bir mesaj görünecektir. Örneğin:

source: `The password you have provided is weak:` `The password is shorter than 5 characters.`
tr: `Sağladığınız parola zayıf:` `Parola 5 karakterden kısa.`

source: If a message similar to the above appears, it is highly recommended to choose a different, stronger password.
tr: Yukarıdakine benzer bir mesaj görünürse, farklı ve daha sağlam bir parola seçmeniz şiddetle tavsiye edilir.

source: Once you configure the superuser password, click `Done` in the top left corner to return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Configuration and Installation Progress]. If you selected a weak password, you must press the button twice.
tr: Süper kullanıcı parolasını yapılandırdıktan sonra, xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Yapılandırma ve Kurulum İlerlemesi] ekranına dönmek için sol üst köşedeki `Bitti` düğmesine tıklayın. Zayıf bir parola seçtiyseniz, düğmeye iki kez basmanız gerekir.
