Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/_partials/install/CustomSpoke_AddBtrfs.po
Languages: tr, zh_hans

source: Creating a Btrfs Layout
tr: Btrfs Düzeni Oluşturma
zh_hans: 创建一个Btrfs布局

source: _Btrfs_ is a type of file system, but it has several features characteristic of a storage device. It is designed to make the file system tolerant of errors, and to facilitate the detection and repair of errors when they occur. It uses checksums to ensure the validity of data and metadata, and supports snapshots that can be used for backup, replication, and namespace isolation (e.g. for use in containers).
tr: _Btrfs_ bir tür dosya sistemi türüdür, ancak bir depolama aygıtına özgü birtakım özelliklere sahiptir. Dosya sistemini hatalara dayanıklı hale getirmek ve hatalar oluştuğunda tespit ve onarımını kolaylaştırmak için tasarlanmıştır. Verilerin ve üst verilerin doğruluğunu sağlamak için sağlama toplamları kullanır ve yedekleme, çoğaltma ve ad uzayı yalıtımı için (örneğin, konteynerlerde kullanmak için) kullanılabilen anlık görüntüleri destekler.
zh_hans: _Btrfs_是一种文件系统，但在一个存储设备上有多种特性。它被设计用于令文件系统能够容错、能够查错并且能够修复错误。它使用checksums确保数据和元数据的完整性，并且支持快照，用快照可以实现备份、磁盘对拷和命名空间隔离（例如在容器上的应用）。

source: Creating a Btrfs layout is somewhat similar to LVM (described in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Creating a Logical Volume Management (LVM) Layout]) with slightly different terminology. A Btrfs _volume_ is the equivalent of an LVM volume group, and a Btrfs _subvolume_ is similar to a LVM logical volume. An important difference to note is how [application]*Anaconda* reports sizes for separate mount points: For LVM, the exact size of each logical volume is shown next to each mount point in the left pane, while with Btrfs, the total size of the entire volume is shown next to each subvolume.
tr: Bir Btrfs düzeni oluşturmak, biraz farklı terimler kullanarak LVM'ye (xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[Mantıksal Birim Yönetimi (Logical Volume Management - LVM) Düzeni Oluşturma] bölümünde açıklanmıştır) benzer. Bir Btrfs _birimi_, bir LVM birim grubuna eş değerdir ve bir Btrfs _alt birimi_, bir LVM mantıksal birimine benzer. Unutulmaması gereken önemli bir fark, [application]*Anaconda*'nın ayrı bağlama noktaları için boyutları nasıl bildirdiğidir: LVM için sol bölmedeki her bağlama noktasının yanında her mantıksal birimin tam boyutu gösterilirken, Btrfs için her alt birimin yanında tüm birimin toplam boyutu gösterilir.
zh_hans: 创建一个Btrfs布局有点像LVM（详见xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-lvm[创建一个逻辑卷管理（LVM） 布局]），而只是稍微有一点点术语上的区别。一个Btrfs_卷_和一个LVM卷组是等价的，并且一个Btrfs_子卷_和一个LVM逻辑卷是相似的。需要注意的一点是：如何使用[应用]*Anaconda*上报分离挂载点的大小。对于LVM而言，每个逻辑卷的精确大小在左侧面板的挂载点旁边来显示。但对于Btrfs而言，每个子卷旁边显示的是整个卷的大小。

source: Some partition types - notably the BIOS Boot and EFI partitions - cannot be placed on Btrfs subvolumes. Use standard physical volumes for them. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for more information.
tr: Bazı bölüm türleri - özellikle BIOS Önyükleme ve EFI bölümleri - Btrfs alt birimlerine yerleştirilemez. Onlar için standart fiziksel birimler kullanın. Daha fazla bilgi için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın.
zh_hans: 有些分区类型——特别注意BIOS启动分区和EFI分区——不能用Btrfs子卷放置，要用普通逻辑分区来放置它们。详见xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[推荐的分区方案]。

source: Create Btrfs Subvolume
tr: Btrfs Alt Birimi Oluştur
zh_hans: 创建Btrfs子卷

source: The Manual Partitioning screen
tr: Elle Bölümlendirme ekranı
zh_hans: 手动分区屏幕

source: Follow the procedure below to create Btrfs volumes and subvolumes:
tr: Btrfs birimleri ve alt birimleri oluşturmak için aşağıdaki adımları izleyin:
zh_hans: 按以下流程来创建Btrfs卷和子卷：

source: Creating Btrfs Subvolumes and Volumes
tr: Btrfs Birimleri ve Alt Birimleri Oluşturma
zh_hans: 创建Btrfs子卷和卷

source: Click the `+` button at the bottom of the list showing existing mount points. A new dialog window will open.
tr: Mevcut bağlama noktalarını gösteren listenin altındaki `+` düğmesine tıklayın. Yeni bir iletişim penceresi açılacaktır.
zh_hans: 按下现存挂载点列表底部的“+"按钮，然后将开启一个新的对话框。

source: In the new dialog window, specify a mount point for which you want to create a separate subvolume - for example, `/`. Anaconda will create a Btrfs subvolume for each mount point you create. Similar to directories, subvolumes have no discrete size of their own. Finally, click `Add mount point` to add the subvolume and return to the main partitioning screen.
tr: Yeni iletişim penceresinde, kendisi için ayrı bir alt birim oluşturmak istediğiniz bir bağlama noktası belirtin - örneğin, `/`. Anaconda, oluşturduğunuz her bağlama noktası için bir Btrfs alt birimi oluşturacaktır. Dizinlere benzer şekilde, alt birimlerin kendilerine ait ayrı boyutları yoktur. Son olarak, alt birimi eklemek ve ana bölümlendirme ekranına dönmek için `Bağlama noktası ekle` düğmesine tıklayın.
zh_hans: 在这个新的对话框中，你需要指定一个现存的挂载点来创建分离挂载点——例如：挂载点“/”。Anaconda将对每一个你创建的挂载点都创建一个Btrfs子卷。类似于目录的概念，子卷没有属于它们各自的大小。最后，点击“增加挂载点”来增加子卷，然后返回分区主屏幕。

source: When creating a mount point for swap on Btrfs, specify the mount point as `swap`.
tr: Btrfs üzerinde takas için bir bağlama noktası oluştururken, bağlama noktasını `swap` olarak belirtin.
zh_hans: 当在Btrfs上创建一个交换分区挂载点时，需要指定挂载点类型为“swap”。

source: Once the mount point is created, select the newly created mount point in the left pane, and configure it further in the right pane. When finished, click `Update Settings` in the bottom right corner of the screen.
tr: Bağlama noktası oluşturulduktan sonra, sol bölmede yeni oluşturulan bağlama noktasını seçin ve bunu sağ bölmede daha da yapılandırın. Bitirdiğinizde, ekranın sağ alt köşesindeki `Ayarları Güncelle` düğmesine tıklayın.
zh_hans: 一旦挂载点被创建，选择左侧面板上的、新创建的挂载点，然后在右侧面板上深入配置这个挂载点。在配置完成后，点击屏幕右下角的“更新设置”按钮。

source: In the `Volume` area, you can see that the mount point's subvolume has been assigned to an automatically created volume. Click the `Modify` button under the drop-down menu to access the configure volume settings.
tr: `Birim` alanında, bağlama noktasının alt biriminin otomatik olarak oluşturulan bir birime atandığını görebilirsiniz. Birim yapılandırma ayarlarına erişmek için açılır menünün altındaki `Değiştir` düğmesine tıklayın.
zh_hans: 在“卷”区域，你可以看到挂载点的子卷已经被配置给了自动创建的卷。点击下拉菜单下方的“修改”按钮来配置卷设置。

source: In the `Configure Volume` dialog, you can change the volume's name, whether it's encrypted, its `RAID level` (see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types] for information about available RAID types), and you can also specify which physical devices (disks) this volume should reside on. You can select one or more disks which will be used to hold this volume by holding down kbd:[Ctrl] and clicking each disk in the list.
tr: `Birim Yapılandır` iletişim kutusunda birimin adını, şifreli olup olmadığını, `RAID seviyesini` (kullanılabilir RAID türleri hakkında bilgi için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Aygıt, Dosya Sistemi ve RAID Türleri] bölümüne bakın) değiştirebilir ve ayrıca bu birimin hangi fiziksel aygıtların (disklerin) üzerinde bulunması gerektiğini belirtebilirsiniz. Bu birimi tutmak için kullanılacak bir veya daha fazla diski kbd:[Ctrl] tuşuna basılı tutup listedeki her diski tıklayarak seçebilirsiniz.
zh_hans: 在“配置卷”对话框中，你可以修改卷标。无论卷是否被加密过，或者卷的“RAID级别”是什么（可用RAID类型详见xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[设备、文件系统和RAID类型]），然后你也可以指定这个卷应该放在哪些物理设备（磁盘）之上。你可以通过按kbd:[Ctrl]键并点击鼠标左键的方式来选择一块或多块磁盘来容纳这个卷。

source: The installer supports LUKS encryption of entire Btrfs volumes. To enable, click on the Modify button under Volume. Then check Encrypt. See the [citetitle]_{PRODUCT} Security Guide_, available at link:++https://docs.fedoraproject.org/++[], for information about LUKS disk encryption.
tr: Kurucu, Btrfs birimlerinin tamamının LUKS ile şifrelenmesini desteklemektedir. Etkinleştirmek için Birim altındaki Değiştir düğmesine tıklayın. Ardından Şifrele seçeneğini işaretleyin. LUKS ile disk şifreleme hakkında bilgi için link:++https://docs.fedoraproject.org/++[] adresindeki [citetitle]_{PRODUCT} Güvenlik Kılavuzuna_ bakın.
zh_hans: 安装器支持对整个Btrfs卷进行LUKS加密。要开启加密，你需要点击卷下方的修改按钮，然后检查加密项。LUKS磁盘加密的信息详见[citetitle]_{PRODUCT} 安全指导书_, available at link:++https://docs.fedoraproject.org/++[]。

source: Additionally, you can set a fixed size for the volume by selecting the `Fixed` option from the `Size policy` menu and entering a size for the volume group.
tr: Ek olarak, `Boyut politikası` menüsünden `Sabit` seçeneğini seçerek ve birim grubu için bir boyut girerek birim için sabit bir boyut ayarlayabilirsiniz.
zh_hans: 此外，你可以通过选择“大小策略”中的“固定大小”的选项、然后对一个卷组输入一个大小参数的方式，来设置卷为一个固定的大小。

source: After you finish configuring the Btrfs volume settings, click `Save` to return to the main `Manual Partitioning` screen.
tr: Btrfs birim ayarlarını yapılandırmayı bitirdikten sonra, ana `Elle Bölümlendirme` ekranına dönmek için `Kaydet` düğmesine tıklayın.
zh_hans: 在你配置完Btrfs卷的设置之后，点击“保存”来返回主“手动分区”屏幕。

source: If you need to create more than one Btrfs volume, open the `Volume` drop-down menu and select the `Create a new volume` option. A new dialog window will open, identical to the one described in the previous step. Again, select a name, storage devices, encryption settings, RAID level and size policy for the new volume, and click `Save`. The new volume will then become available in the `Volume` drop-down menu; you can then go through your existing mount points and change this setting to assign them to a different volume.
tr: Birden fazla Btrfs birimi oluşturmanız gerekiyorsa, `Birim` açılır menüsünü açın ve `Yeni bir birim oluştur` seçeneğini seçin. Önceki adımda açıklananla aynı olan yeni bir iletişim penceresi açılacaktır. Aynı şekilde, yeni birim için bir ad, depolama aygıtları, şifreleme ayarları, RAID seviyesi ve boyut politikası seçin ve `Kaydet` düğmesine tıklayın. Yeni birim daha sonra `Birim` açılır menüsünde kullanılabilir hale gelecektir; daha sonra mevcut bağlama noktalarınızın üzerinden geçebilir ve bunları farklı bir birime atamak için bu ayarı değiştirebilirsiniz.
zh_hans: 如果你需要创建多个Btrfs卷，则需要点开“卷”下拉菜单，然后选择“添加新卷”选项。然后，一个新的对话框将会弹出，之后的操作和上面的步骤中描述的相同：为新卷再次选择卷标、存储设备、加密设置、RAID级别和尺寸策略，最后点击“保存”。新卷随后将在“卷”下拉菜单中可用。此外，你也可以进入先前的挂载点、修改这个设置来将挂载点分配到另一个卷上。

source: Configure other settings specific to the subvolume - its `Mount Point`, `Device Type`, and `Name`. Press `Update Settings` to apply any changes to the configuration.
tr: Alt birime özgü diğer ayarları yapılandırın - `Bağlama Noktası`, `Aygıt Türü` ve `Ad`. Değişiklikleri yapılandırmaya uygulamak için `Ayarları Güncelle` düğmesine basın.
zh_hans: 配置其他专属于子卷的设置——子卷的“挂载点”、“设备类型”和“卷标”。按下“更新设置”按钮来应用设置中的修改。

source: Repeat this procedure for any additional Btrfs subvolumes you want to create. Note that when creating additional subvolumes, a new volume is not automatically created each time; instead, any additional subvolumes are assigned to an existing volume.
tr: Oluşturmak istediğiniz ek Btrfs alt birimleri için bu adımları tekrarlayın. Ek alt birimler oluştururken, her seferinde otomatik olarak yeni bir birim oluşturulmadığını unutmayın; bunun yerine, ek alt birimler var olan bir birime atanır.
zh_hans: 对于你想创建的所有Btrfs子卷，你都要重复这个流程。注意：当创建其他的子卷时，不会每次都创建一个新的卷；相反地，新创建的子卷都会默认分配到已有的卷之下。

source: For each mount point you create, review its settings and make sure that it is assigned to the correct volume, that it has sufficient capacity, and that it has a descriptive name so you can identify the subvolume.
tr: Oluşturduğunuz her bağlama noktası için ayarlarını gözden geçirin ve doğru birime atandığından, yeterli kapasiteye sahip olduğundan ve alt birimi tanımlayabilmeniz için açıklayıcı bir ada sahip olduğundan emin olun.
zh_hans: 对于每个你创建的挂载点而言，你需要检查这些挂载点的设置。检查的项目包括：确保挂载点都分配到正确的卷之下；挂载点要有足够的容量；挂载点要有一个描述性的名称，以便您可以识别子卷。
