Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/_partials/install/FilterSpoke_AddFCoE.po
Languages: fi

source: Add FCoE SAN
fi: Lisää FCoE SAN

source: The following procedure explains how to add _Fibre Channel over Ethernet_ (FCoE) storage devices and make them available during the installation:
fi: Seuraava menettelytapa selittää, kuinka _Fibre Channel over Ethernet_ (FCoE) -tallennuslaitteita lisätään ja miten ne ovat käytettävissä asennuksen aikana:

source: Add FCoE Target
fi: Lisää FCoE-kohde

source: Click the `Add FCoE SAN` button in the bottom right corner of xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks]. A new dialog window will open.
fi: Napsauta `Lisää FCoE SAN` -painiketta sivun xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Asennuskohde - Specialized & Network Disks] oikeassa alakulmassa. Uusi valintaikkuna avautuu.

source: Select the network interface (`NIC`) which is connected to your FCoE switch from the drop-down menu. Note that this network interface must be configured and connected - see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Network & Hostname].
fi: Valitse pudotusvalikosta verkkoliitäntä (`NIC`), joka on yhdistetty FCoE-kytkimeen. Huomaa, että tämä verkkoliitäntä on määritettävä ja liitettävä - katso xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Verkko ja isäntänimi].

source: Below the `NIC` drop-down menu are two choices:
fi: NIC-pudotusvalikon alla on kaksi vaihtoehtoa:

source: `Use DCB`
fi: `Käytä DCB:tä`

source: _Data Center Bridging_ (DCB) is a set of enhancements to the Ethernet protocols designed to increase the efficiency of Ethernet connections in storage networks and clusters. This option should only be enabled for network interfaces that require a host-based DCBX client. Configurations on interfaces that implement a hardware DCBX client should leave this check box empty.
fi: _Data Center Bridging_ (DCB) on joukko parannuksia Ethernet-protokolliin, jotka on suunniteltu lisäämään Ethernet-yhteyksien tehokkuutta tallennusverkoissa ja klustereissa. Tämä vaihtoehto tulisi ottaa käyttöön vain verkkoliitännöissä, jotka vaativat isäntäpohjaisen DCBX-asiakkaan. Laitteiston DCBX-asiakasohjelman toteuttavien liitäntöjen konfiguraatioiden tulee jättää tämä valintaruutu tyhjäksi.

source: `Use auto vlan`
fi: `Käytä auto vlania`

source: This option indicates whether VLAN discovery should be performed. If this box is checked, then the _FCoE Initiation Protocol_ (FIP) VLAN discovery protocol will run on the Ethernet interface once the link configuration has been validated. If they are not already configured, network interfaces for any discovered FCoE VLANs will be automatically created and FCoE instances will be created on the VLAN interfaces. This option is enabled by default.
fi: Tämä vaihtoehto osoittaa, tuleeko VLAN-etsintä suorittaa. Jos tämä ruutu on valittuna, _FCoE Initiation Protocol_ (FIP) VLAN-etsintäprotokolla toimii Ethernet-liitännässä, kun linkin konfiguraatio on vahvistettu. Jos niitä ei ole vielä määritetty, löydetyille FCoE-VLAN-verkoille luodaan automaattisesti verkkoliitännät ja VLAN-liitäntöihin luodaan FCoE-instanssit. Tämä vaihtoehto on oletuksena käytössä.

source: After you select which interface and options to use, click `Add FCoE Disk(s)`. Discovered FCoE storage devices will be displayed under the `Other SAN Devices` tab in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks].
fi: Kun olet valinnut käytettävän liitännän ja asetukset, napsauta `Lisää FCoE-levy(t)'. Löydetyt FCoE-tallennuslaitteet näkyvät Muut SAN-laitteet -välilehdellä kohdassa xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Asennuskohde - Specialized & Network Disks].
