Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f35/pages/_partials/install/SourceSpoke.po
Languages: es

source: Installation Source
es: Fuente de la Instalación

source: The `Installation Source` screen allows you to specify a location (local or on the network) from which packages will be downloaded and installed on your system. This screen will be configured automatically in most cases, but you can change your settings or add additional sources.
es: La pantalla `Fuente de la Instalación` le permite especificar una localización (local o en la red) desde la que serán descargados los paquetes e instalados en su sistema. Esta pantalla será configurada automáticamente en la mayoría de los casos, pero puede cambiar sus ajustes o añadir fuentes adicionales.

source: Normally, when you first enter the `Installation Summary` screen, the installer will attempt to configure an installation source based on the type of media you used to boot. The full {PRODUCT} Server DVD will configure the source as local media, the netinst ISO image will configure the closest network mirror, etc. This process takes some time, especially if the default source is a network mirror. If you plan to use a custom installation source, use the [option]#inst.askmethod# boot option to skip the initial configuration; this will allow you to enter this screen immediately. See xref:advanced/Boot_Options.adoc#sect-boot-options-sources[Specifying the Installation Source] for information about boot options.
es: Normalmente, cuando entra por primera vez en la pantalla `Fuente de la Instalación`, el instalador intentará configurar una fuente de instalación en base al tipo de medio que haya usado para arrancar. El DVD completo {PRODUCT} Server configurará la fuente como medio local, la imagen netinst ISO configurará el espejo de red más cercano, etc. Este proceso lleva algún tiempo, especialmente si la fuente predeterminada es un espejo en red. Si planea usar una fuente de instalación personalizada, use la opción de arranque [option]#inst.askmethod# para saltar la configuración inicial; esto permitirá entrar en esta pantalla inmediatamente. Vea en xref:advanced/Boot_Options.adoc#sect-boot-options-sources[Especificando la Fuente de Instalación] más información sobre las opciones de arranque.

source: The Installation Source screen
es: La pantalla Fuente de la Instalación

source: anaconda/SourceSpoke.png
es: anaconda/StorageSpoke.png

source: The following options are available. Note that not all of them may be displayed.
es: Están disponibles las siguientes opciones. Advierta que no todas ellas pueden ser mostradas.

source: Auto-detected installation media
es: Medio de instalación detectado automáticamente

source: This is the option selected by default if you started the installer from media containing an installation source, such as a live DVD. No additional configuration is necessary. You can click the `Verify` button check the media integrity.
es: Esta es la opción seleccionada automáticamente si usted arranca el instalador desde un medio que contenga una fuente de instalación, como un DVD vivo. No es necesaria configuración adicional. Puede pulsar el botón `Verificar` para comprobar la integridad del medio.

source: ISO file
es: Archivo ISO

source: On the network
es: Sobre la red

source: To configure a proxy for an HTTP or HTTPS source, click the btn:[Proxy setup] button. Check `Enable HTTP proxy` and type the URL into the `Proxy URL` box. If the proxy server requires authentication, check `Use Authentication` and enter your user name and password. Click btn:[OK] to finish the configuration.
es: Para configurar un proxy para una fuente HTTP o HTTPS, pulse el botón btn:[Ajuste de proxy]. Confirme `Habilitar proxy HTTP` y teclee la URL en la caja `URL del proxy`. Si el servidor proxy requiere autenticación, confirme `Usar Autenticación` e introduzca su nombre de usuario y contraseña. Pulse btn:[OK] para terminar la configuración.

source: If your HTTP or HTTPS URL refers to a repository mirror list, mark the check box under the address field.
es: Si sus URL de HTTP o HTTPS se refiere a una lista de repositorios espejo, marque la caja de confirmación bajo el campo dirección.

source: You can also specify additional repositories in the `Additional repositories` section to gain access to more installation environments and software add-ons. All environments and add-ons will be available for selection in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Software Selection] once you finish configuring the sources.
es: Puede también repositorios adicionales en la sección `Repositorios adicionales` para tener acceso a más entornos de instalación y complementos software. Todos los entornos y complementos estarán disponibles para ser seleccionados en xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Selección de Software] una vez que termina de configurar la fuentes.

source: To add a repository, click the btn:[+] button. To delete a repository, select one in the list and click the btn:[-] button. Click the arrow icon to revert to the previous list of repositories, i.e. to replace current entries with those that were present at the time you entered the `Installation Source` screen. To activate or deactivate a repository, click the check box in the `Enabled` column at each entry in the list.
es: Para añadir un repositorio, pulse el botón btn:[+]. Para borrar un repositorio, seleccione uno de la lista y pulse el botón btn:[-]. Pulse el icono flecha para volver a la anterior lista de repositorios, p.ej. para reemplazar las entradas actuales con aquellas que estaban presentes en el momento en el que entró en la pantalla `Fuente de la Instalación`. Para activar o desactivar un repositorio, pulse la caja de confirmación en la columna `Habilitado` de cada entrada en la lista.

source: You can name your additional repository and configure it the same way as the primary repository on the network using the input fields on the right side of the section.
es: Usted puede denominar su repositorio adicional y configurarlo de la misma forma que el repositorio primario en la red usando los campos de entrada en el lado derecho de la sección.

source: Once you have selected your installation source, click `Done` in the top left corner to return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
es: Una vez que haya hecho sus selecciones, pulse `Hecho` en la esquina superior izquierda para volver a xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Resumen de la Instalación].
