Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f30/pages/_partials/install/CustomSpoke.po
Languages: tr

source: Manual Partitioning
tr: Elle Bölümlendirme

source: The `Manual Partitioning` screen allows you to create a storage configuration for your {PRODUCT} system manually, giving you a greater control over your system's storage.
tr: `Elle Bölümlendirme` ekranı, {PRODUCT} sisteminiz için elle bir depolama yapılandırması oluşturmanıza olanak tanır ve sisteminizin depolama alanı üzerinde size daha fazla denetim imkanı verir.

source: In most other installers for both Linux and other operating systems, disk partitioning usually takes a "bottom-up" approach. In these installers, you first create underlying devices such as LVM physical volumes, then you create a layout such as LVM on top of them, then you create file systems on top of logical volumes, and the last step is usually assigning a mount point to each volume as needed.
tr: Hem Linux hem de diğer işletim sistemleri için diğer kurucuların çoğunda, disk bölümlendirme genellikle "aşağıdan yukarıya" bir yaklaşım benimser. Bu kurucularda, önce LVM fiziksel birimleri gibi altta yatan aygıtları oluşturursunuz, ardından bunların üzerine LVM gibi bir düzen oluşturursunuz, ardından mantıksal birimlerin üzerinde dosya sistemleri oluşturursunuz ve son adım genellikle her birim için bir bağlama noktası atamaktır.

source: [application]*Anaconda* uses an opposite approach. First, you create all separate mount points you need, and everything needed to create them (creating a volume group, logical volumes inside it, and physical volumes where the volume group will reside) is performed automatically. You can then adjust the automatic settings as you require.
tr: [application]*Anaconda* tam tersi bir yaklaşım kullanır. İlk olarak, ihtiyacınız olan tüm ayrı bağlama noktalarını oluşturursunuz ve bunları oluşturmak için gereken her şey (bir birim grubu, onun içindeki mantıksal birimler ve birim grubunun yer alacağı fiziksel birimlerin oluşturulması) otomatik olarak gerçekleştirilir. Daha sonra otomatik ayarları istediğiniz gibi düzenleyebilirsiniz.

source: No permanent changes will be made to your disks during the actual partitioning process. The configuration you have selected will only be written to your system after you press the `Begin installation` button in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
tr: Gerçek bölümlendirme işlemi sırasında disklerinizde kalıcı değişiklikler yapılmayacaktır. Seçtiğiniz yapılandırma, yalnızca xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Kurulum Özeti] ekranındaki `Kuruluma başla` düğmesine bastıktan sonra sisteminize yazılacaktır.

source: The Manual Partitioning screen. At this point
tr: Elle Bölümlendirme ekranı. Bu noktada

source: When you first open the `Manual Partitioning` screen, the column on the left side will display all previously existing partitions on all drives which you selected as installation targers in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]. If none of the selected drives contain any existing partitions, then a message informing you that no mount points currently exist will appear.
tr: `Elle Bölümlendirme` ekranını ilk açtığınızda sol taraftaki sütun, xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Kurulum Hedefi] bölümünde kurulum hedefleri olarak seçtiğiniz tüm disklerde önceden var olan tüm bölümleri görüntüleyecektir. Seçilen disklerin hiçbiri bir bölüm içermiyorsa, size şu anda hiçbir bağlama noktasının olmadığını bildiren bir mesaj görünecektir.

source: Here, you can choose a partitioning scheme such as `LVM` or `BTRFS` and click the `Click here to create them automatically` to prompt the installer to create a basic partitioning layout; this layout follows the guidelines described in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme]. The created layout is a basic layout where partition/volume sizes are determined automatically based on the total amount of available space.
tr: Burada, `LVM` veya `BTRFS` gibi bir bölümlendirme şeması seçebilir ve kurucudan basit bir bölümlendirme düzeni oluşturmasını istemek için `Otomatik olarak oluşturmak için buraya tıklayın` seçeneğine tıklayabilirsiniz; bu düzen xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümünde açıklanan yönergeleri izler. Oluşturulan düzen, bölüm/birim boyutlarının toplam kullanılabilir alan miktarına göre otomatik olarak belirlendiği basit bir düzendir.

source: Click the `+` button to add a mount point. In the dialog window that opens, choose a mount point such as `/` or `/home`, and the desired capacity for the mount point (such as `10GB` or `500MB`). Note that specifying the mount point is mandatory, but you do not have to specify the capacity at this point; this is useful when adding a mount point which you want to make larger than the current available space permits. Then, click `Add mount point` to add it to the list using the default settings, which means it will be created as a logical volume, and a new volume group will be created for it unless one already exists.
tr: Bir bağlama noktası eklemek için `+` düğmesine tıklayın. Açılan iletişim penceresinde, `/` veya `/home` gibi bir bağlama noktası ve bağlama noktası için istenen kapasiteyi (`10GB` veya `500MB` gibi) seçin. Bağlama noktasını belirtmenin zorunlu olduğunu, ancak bu noktada kapasiteyi belirtmenin gerekli olmadığını unutmayın; bu, o anda kullanılabilir alanın izin verdiğinden daha büyük olmasını istediğiniz bir bağlama noktası eklerken faydalıdır. Ardından, öntanımlı ayarları kullanarak (yani mantıksal birim olarak oluşturulacak ve zaten mevcut değilse yeni bir birim grubu oluşturulacaktır) listeye eklemek için `Bağlama noktası ekle` düğmesine tıklayın.

source: Then, select the newly created mount point in the list on the left side. A set of controls will display on the right side of the screen, allowing you to change its mount point, the device on which it will physically reside, its capacity, file system, etc. When you change any settings, press `Update Settings` on the bottom right. This will save the adjusted configuration; you can now create another mount point, or select a different existing one and adjust its settings as well.
tr: Ardından, sol taraftaki listeden yeni oluşturulan bağlama noktasını seçin. Ekranın sağ tarafında bağlama noktasını, fiziksel olarak bulunacağı aygıtı, kapasitesini, dosya sistemini vb. değiştirmenize olanak tanıyan bir dizi denetim görüntülenecektir. Herhangi bir ayarı değiştirdiğinizde, `Ayarları Güncelle` düğmesine basın. sağ altta. Bu, değiştirilen yapılandırmayı kaydedecektir; ardından başka bir bağlama noktası oluşturabilir veya mevcut farklı bir noktayı seçip ayarlarını düzenleyebilirsiniz.

source: For a description of available device and file system types, see xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Device, File System and RAID Types].
tr: Kullanılabilir aygıt ve dosya sistemi türlerinin açıklaması için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-filesystems[Aygıt, Dosya Sistemi ve RAID Türleri] bölümüne bakın.

source: To remove a mount point, select it in the list and press the `-` button below.
tr: Bir bağlama noktasını kaldırmak için listeden seçin ve aşağıdaki `-` düğmesine basın.

source: The exact steps for configuring your storage depend on your specific needs and your system configuration. Procedures for creating specific layouts are described further in this chapter. Before you start, you should also review xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] and xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-advice[Advice on Partitions] for a list of requirements and tips for partitioning your disks for {PRODUCT}.
tr: Depolamanızı yapılandırmanın tam adımları, özel ihtiyaçlarınıza ve sistem yapılandırmanıza bağlıdır. Özel düzenler oluşturma adımları bu bölümün ilerisinde daha ayrıntılı olarak açıklanmaktadır. Başlamadan önce, disklerinizi {PRODUCT} için bölümlendirmeye yönelik gereksinimler ve ipuçlarının bir listesi için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] ve xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-advice[Bölümlerle İlgili Tavsiyeler] bölümlerini de incelemelisiniz.

source: Below the list of existing mount points are two fields, showing you how much free space is left on your storage devices and how much total space they have.
tr: Mevcut bağlama noktaları listesinin altında, depolama aygıtlarınızda ne kadar boş alan kaldığını ve toplam ne kadar alana sahip olduklarını gösteren iki alan vardır.

source: Click the `pass:attributes[{blank}]_X_ storage devices selected` to view a summary of currently selected storage devices; this may help you with orientation in more complicated storage schemas. Devices displayed here are the ones you have selected in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]. If you want to add or remove any storage devices from your configuration, return to that screen and change your selection.
tr: Seçili olan depolama aygıtlarının bir özetini görüntülemek için `pass:attributes[{blank}]_X_ depolama aygıtı seçildi` seçeneğine tıklayın; bu, daha karmaşık depolama düzenlerinde yönlendirme konusunda size yardımcı olabilir. Burada görüntülenen aygıtlar, xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Kurulum Hedefi] bölümünde seçmiş olduğunuz aygıtlardır. Yapılandırmanıza herhangi bir depolama aygıtı eklemek veya çıkarmak isterseniz, o ekrana dönün ve seçiminizi değiştirin.

source: You can press the `Reset All` button in the bottom right corner at any time to reset the storage configuration to the state it was in when you last opened the `Manual Partitioning` screen. This means that if you modify the storage configuration, leave the screen, and then come back, the Reset button will reset the configuration back to the already modified state, discarding only the changes you have made recently, not all changes to the storage configuration since you booted the installer.
tr: Depolama yapılandırmasını `Elle Bölümlendirme` ekranını en son açtığınız zamanki durumuna sıfırlamak için istediğiniz zaman sağ alt köşedeki `Tümünü Sıfırla` düğmesine basabilirsiniz. Bu, depolama yapılandırmasını değiştirirseniz, ekrandan ayrılırsanız ve ardından geri gelirseniz, Sıfırla düğmesinin yapılandırmayı zaten değiştirilmiş olan durumuna sıfırlayacağı ve yalnızca son zamanlarda yaptığınız değişiklikleri atacağı, kurucuyu önyükledikten sonra depolama yapılandırmasında yapılan tüm değişiklikleri atmayacağı anlamına gelir.

source: To discard all changes, and to also detect any new drives which have not been detected when the installer started (usually when you attached a new drive after you started), press the button marked by a circular arrow in the set of controls below the list of mount points on the left side of the screen. In the dialog window that opens, press `Rescan Disks` and wait until the scanning process completes. Then, press `OK` to return to xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Installation Destination]; all detected disks including any new ones will be displayed in the `Local Standard Disks` section.
tr: Tüm değişiklikleri iptal etmek ve ayrıca kurucu başladığında algılanmayan yeni diskleri tespit etmek için (bu, genellikle başlattıktan sonra yeni bir disk taktığınızda olur), ekranın sol tarafında bağlama noktaları listesinin altındaki denetimler kümesinde dairesel bir okla işaretlenen düğmeye basın. Açılan iletişim penceresinde `Diskleri Yeniden Tara` düğmesine basın ve tarama işlemi tamamlanana kadar bekleyin. Ardından, xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-storage-partitioning[Kurulum Hedefi] bölümüne dönmek için `Tamam` düğmesine basın; yenileri de dahil olmak üzere algılanan tüm diskler `Yerel Standart Diskler` bölümünde görüntülenecektir.

source: Rescan Disks
tr: Diskleri Yeniden Tara

source: The Rescan Disks dialog
tr: Diskleri Yeniden Tara iletişim kutusu

source: After you finish configuring your system storage, press `Done` in the top left corner to save the configuration and return to the `Installation Summary` screen. At this point, the installer will check if your storage configuration is valid. If an error was detected, a message will be displayed at the bottom of the screen. Click the message to open a dialog window explaining what kind of error has been detected (for example, you put `/boot` on a Btrfs subvolume, or you did not create a BIOS Boot partition when your system requires one).
tr: Sistem depolama alanınızı yapılandırmayı bitirdikten sonra, yapılandırmayı kaydetmek ve `Kurulum Özeti` ekranına dönmek için sol üst köşedeki `Bitti` düğmesine basın. Bu noktada kurucu, depolama yapılandırmanızın geçerli olup olmadığını denetleyecektir. Bir hata tespit edilirse, ekranın altında bir mesaj görüntülenecektir. Ne tür bir hatanın tespit edildiğini açıklayan bir iletişim penceresi açmak için mesaja tıklayın (örneğin, `/ boot` dizinini bir Btrfs alt birimine koydunuz veya sisteminiz gerektirdiği halde bir BIOS Önyükleme bölümü oluşturmadınız).

source: If such a message is displayed, go back and fix any issues found by the installer; otherwise you will not be able to proceed with the installation. You can also press `Done` again to return to the `Installation Summary` anyway, but a storage configuration error will prevent you from starting the actual installation process.
tr: Böyle bir mesaj görüntülenirse, geri dönün ve kurucu tarafından bulunan sorunları düzeltin; aksi takdirde kuruluma devam edemezsiniz. Yine de `Kurulum Özeti` ekranına dönmek için tekrar `Bitti` düğmesine basabilirsiniz, ancak depolama yapılandırma hatası gerçek kurulum sürecini başlatmanızı engelleyecektir.

source: If no error message is displayed and if you made any changes since the last time you have visited this screen, a summary dialog will appear, displaying a detailed list of the changes you made. Review the list and click `Accept Changes` to proceed with xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary], or click `Cancel & Return to Custom Partitioning` if you want to make any more changes.
tr: Herhangi bir hata mesajı görüntülenmezse ve bu ekranı son ziyaretinizden bu yana herhangi bir değişiklik yaptıysanız, yaptığınız değişikliklerin ayrıntılı bir listesini görüntüleyen bir özet iletişim kutusu görünecektir. Listeyi gözden geçirin ve xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Kurulum Özeti] ekranına ilerlemek için `Değişiklikleri Kabul Et`, daha fazla değişiklik yapmak istiyorsanız `İptal Et ve Özel Bölümlendirmeye Dön` düğmesine tıklayın.
