Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f30/pages/_partials/install/CustomSpoke_PartitioningAdvice.po
Languages: tr

source: Advice on Partitions
tr: Bölümlerle İlgili Tavsiyeler

source: There is no best way to partition every system; the optimal setup depends on how you plan to use the system being installed. However, the following tips may help you find the optimal layout for your needs:
tr: Her sistemi bölümlendirmenin en iyi bir yolu yoktur; en iyi kurulum, kurulmakta olan sistemi nasıl kullanmayı düşündüğünüze bağlıdır. Bununla birlikte, aşağıdaki ipuçları ihtiyaçlarınız için en uygun düzeni bulmanıza yardımcı olabilir:

source: Consider encrypting any partitions and volumes which might contain sensitive data. Encryption prevents unauthorized people from accessing the data on the partitions, even if they have access to the physical storage device. In most cases, you should at least encrypt the `/home` partition, which contains user data.
tr: Hassas veriler içerebilecek tüm bölümleri ve birimleri şifrelemeyi düşünün. Şifreleme, fiziksel depolama aygıtına erişimleri olsa bile, yetkisiz kişilerin bölümlerdeki verilere erişmesini engeller. Çoğu durumda, en azından kullanıcı verilerini içeren `/home` bölümünü şifrelemelisiniz.

source: In some cases, creating separate mount points for directories other than `/`, `/boot` and `/home` may be useful; for example, on a server running a [application]*MySQL* database, having a separate mount point for `/var/lib/mysql` will allow you to preserve the database during a reinstallation without having to restore it from backup afterwards. However, having unnecessary separate mount points will make storage administration more difficult.
tr: Bazı durumlarda `/`, `/boot` ve `/home` dışındaki dizinler için ayrı bağlama noktaları oluşturmak yararlı olabilir; örneğin, [application]*MySQL* veri tabanı çalıştıran bir sunucuda `/var/lib/mysql` için ayrı bir bağlama noktasına sahip olmak, yeniden kurulum sırasında kurulumu tamamladıktan sonra yedekten geri yüklemek zorunda kalmadan veri tabanını korumanıza olanak tanır. Ancak, gereksiz ayrı bağlama noktalarına sahip olmak, depolama yönetimini daha zor hale getirecektir.

source: Some special restrictions apply to certain directories with regards on which partitioning layouts can they be placed. Notably, the `/boot` directory must always be on a physical partition (not on an LVM volume or a Btrfs subvolume), and `/usr` can not be on a Btrfs subvolume.
tr: Hangi bölümlendirme düzenleri üzerinde bulunabilecekleriyle ilgili belirli dizinlere bazı özel kısıtlamalar uygulanır. Özellikle `/boot` dizini her zaman fiziksel bir bölümde olmalıdır (bir LVM biriminde veya bir Btrfs alt biriminde değil) ve `/usr` bir Btrfs alt biriminde olamaz.

source: If you are new to Linux, consider reviewing the [citetitle]_Linux Filesystem Hierarchy Standard_ at link:++https://refspecs.linuxfoundation.org/FHS_2.3/fhs-2.3.html++[] for information about various system directories and their contents.
tr: Linux konusunda yeniyseniz, çeşitli sistem dizinleri ve içerikleri hakkında bilgi için link:++https://refspecs.linuxfoundation.org/FHS_2.3/fhs-2.3.html++[] adresinde bulunan [citetitle]_Linux Dosya Sistemi Hiyerarşisi Standardını_ gözden geçirmeyi düşünün.

source: Each kernel installed on your system requires approximately 20 MB on the `/boot` partition. The default partition size of 500 MB for `/boot` should suffice for most common uses; increase the size of this partition if you plan to keep many kernels installed at the same time.
tr: Sisteminize kurulan her çekirdek, `/boot` bölümünde yaklaşık 20 MB gerektirir. `/boot` için 500 MB'lık öntanımlı bölüm boyutu en yaygın kullanımlar için yeterli olacaktır; aynı anda birçok çekirdeğin kurulu olmasını planlıyorsanız, bu bölümün boyutunu arttırın.

source: The `/var` directory holds content for a number of applications, including the [application]*Apache* web server, and is used by the [application]*DNF* package manager to temporarily store downloaded package updates. Make sure that the partition or volume containing `/var` has at least 3 GB.
tr: `/var` dizini, [application]*Apache* web sunucusu dahil olmak üzere bir dizi uygulamanın içeriklerini barındırır ve indirilen paket güncellemelerini geçici olarak depolamak için [application]*DNF* paket yöneticisi tarafından kullanılır. `/var` dizinini içeren bölümün veya birimin en az 3 GB olduğundan emin olun.

source: The contents of the `/var` directory usually change very often. This may cause problems with older solid state drives (SSDs), as they can handle a lower number of read/write cycles before becoming unusable. If your system root is on an SSD, consider creating a separate mount point for `/var` on a classic (platter) HDD.
tr: `/var` dizininin içeriği genellikle çok sık değişir. Bu, kullanılamaz hale gelmeden önce daha az sayıda okuma/yazma döngüsüne sahip oldukları için eski katı hal sürücülerinde (solid state drive - SSD) sorunlara neden olabilir. Sistem kökünüz bir SSD üzerindeyse, bir sabit disk (HDD) üzerinde `/var` için ayrı bir bağlama noktası oluşturmayı düşünün.

source: The `/usr` directory holds the majority of software on a typical {PRODUCT} installation. The partition or volume containing this directory should therefore be at least 5 GB for minimal installations, and at least 10 GB for installations with a graphical environment.
tr: `/usr` dizini, normal bir {PRODUCT} kurulumdaki yazılımların çoğunu barındırır. Bu dizini içeren bölüm veya birim bu nedenle asgari kurulumlar için en az 5 GB ve grafiksel ortamlı kurulumlar için en az 10 GB olmalıdır.

source: If `/usr` or `/var` is partitioned separately from the rest of the root volume, the boot process becomes much more complex because these directories contain boot-critical components. In some situations, such as when these directories are placed on an iSCSI drive or an FCoE location, the system may either be unable to boot, or it may hang with a `Device is busy` error when powering off or rebooting.
tr: `/usr` veya `/var`, kök birimin geri kalanından ayrı olarak bölümlendirilirse, bu dizinler önyükleme açısından önemli bileşenler içerdiğinden, önyükleme işlemi çok daha karmaşık hale gelir. Bu dizinlerin bir iSCSI sürücüsüne veya FCoE konumuna yerleştirilmesi gibi durumlarda, sistem ya önyükleme yapamayabilir ya da kapatırken veya yeniden başlatırken bir `Aygıt meşgul` hatasıyla kilitlenebilir.

source: This limitation only applies to `/usr` or `/var`, not to directories below them. For example, a separate partition for `/var/www` will work without issues.
tr: Bu sınırlama yalnızca `/usr` veya `/var` için geçerlidir, bunların altındaki dizinlere uygulanmaz. Örneğin, `/var/www` için ayrı bir bölüm sorunsuz çalışacaktır.

source: Consider leaving a portion of the space in an LVM volume group unallocated. This unallocated space gives you flexibility if your space requirements change but you do not wish to remove data from other volumes. You can also select the `Thin provisioning` device type for the partition to have the unused space handled automatically by the volume.
tr: Bir LVM birim grubunun bir kısmını ayrılmamış alan olarak bırakmayı düşünün. Bu ayrılmamış alan, gereksinimleriniz değişirse ancak diğer birimlerden verileri kaldırmak istemiyorsanız size esneklik sağlar. Kullanılmayan alanın birim tarafından otomatik olarak ele alınması için bölüm için "İnce dağıtım" aygıt türünü de seçebilirsiniz.

source: The size of an `XFS` file system can not be reduced - if you need to make a partition or volume with this file system smaller, you must back up your data, destroy the file system, and create a new, smaller one in its place. Therefore, if you expect needing to manipulate your partitioning layout later, you should use the `ext4` file system instead.
tr: Bir `XFS` dosya sisteminin boyutu küçültülemez - bu dosya sistemine sahip bir bölümü veya birimi küçültmeniz gerekiyorsa, verilerinizi yedeklemeli, dosya sistemini yok etmeli ve onun yerine yeni, daha küçük bir tane oluşturmalısınız. Bu nedenle, bölümlendirme düzeninizi daha sonra değiştirmeniz gerekeceğini düşünüyorsanız, onun yerine `ext4` dosya sistemini kullanmalısınız.

source: Use Logical Volume Management (LVM) if you anticipate expanding your storage by adding more hard drives after the installation. With LVM, you can create physical volumes on the new drives, and then assign them to any volume group and logical volume as you see fit - for example, you can easily expand your system's `/home` (or any other directory residing on a logical volume).
tr: Kurulumdan sonra daha fazla sabit disk ekleyerek depolama alanınızı genişletmeyi düşünüyorsanız Mantıksal Birim Yönetimi (LVM) kullanın. LVM ile, yeni diskler üzerinde fiziksel birimler oluşturabilir ve ardından bunları uygun gördüğünüz herhangi bir birim grubuna ve mantıksal birime atayabilirsiniz - örneğin, sisteminizin `/home` dizinini (veya bir mantıksal birim üzerinde bulunan herhangi bir dizini) kolayca genişletebilirsiniz.

source: Creating a BIOS Boot partition or an EFI System Partition may be necessary, depending on your system's firmware, boot drive size, and boot drive disk label. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for information about these partitions. Note that the graphical installer will not let you create a BIOS Boot or EFI System Partition if your system does *not* require one - in that case, they will be hidden from the menu.
tr: Sisteminizin ürün yazılımına, önyükleme sürücüsü boyutuna ve önyükleme sürücüsü disk etiketine bağlı olarak bir BIOS Önyükleme bölümü veya bir EFI Sistem Bölümü oluşturmak gerekebilir. Bu bölümler hakkında bilgi için xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Tavsiye Edilen Bölümlendirme Düzeni] bölümüne bakın. Grafiksel kurucunun, sisteminiz *gerektirmiyorsa* BIOS Önyükleme veya EFI Sistem Bölümü oluşturmanıza izin vermeyeceğini unutmayın - bu durumda, bunlar menüden gizlenecektir.

source: If you need to make any changes to your storage configuration after the installation, {PRODUCT} repositories offer several different tools which can help you do this. If you prefer a command line tool, try [package]*system-storage-manager*.
tr: Kurulumdan sonra depolama yapılandırmanızda herhangi bir değişiklik yapmanız gerekirse, {PRODUCT} depoları bunu yapmanıza yardımcı olabilecek birkaç farklı araç sunmaktadır. Bir komut satırı aracını tercih ediyorsanız, [package]*system-storage-manager* programını deneyin.
