Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f30/pages/_partials/install/DateTimeSpoke.po
Languages: pt_br, zh_hans

source: Date & Time
pt_br: Data & hora
zh_hans: 日期时间

source: The `Date & Time` screen allows you to configure time and date-related settings for your system. This screen is automatically configured based on the settings you selected in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Welcome Screen and Language Selection], but you can change your date, time and location settings before you begin the installation.
pt_br: A tela `Hora & data` permite que você defina as configurações relacionadas à data e hora para o seu sistema. Esta tela é configurada automaticamente com base nas configurações que você selecionou em xref:Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Tela de boas-vindas e seleção de idioma], mas você pode alterar suas configurações de data, hora e local antes de iniciar a instalação.
zh_hans: 日期与时间页面允许你对日期和时间进行设定。我们会基于你在 xref:Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[欢迎屏幕] 的设定为此屏幕给定一系列的默认值，但在开始安装之前，你可以随时对这些设置进行调整。

source: Screenshot of the Date & Time screen
pt_br: Captura de tela da tela de Hora & data
zh_hans: 日期时间页面的屏幕截图

source: anaconda/DateTimeSpoke.png
zh_hans: anaconda文件夹下的DateTimeSpoke.png

source: First, select your `Region` using the drop-down menu in the top left corner of the screen. Then, select your `City`, or the city closest to your location in the same time zone. Selecting a specific location helps {PRODUCT} ensure that your time is always set correctly including automatic time changes for daylight savings time if applicable.
pt_br: Primeiro, selecione sua `Região` usando o menu suspenso no canto superior esquerdo da tela. Em seguida, selecione sua `Cidade`, ou a cidade mais próxima de sua localização no mesmo fuso horário. Selecionar um local específico ajuda o {PRODUCT} a garantir que seu horário seja sempre definido corretamente, incluindo mudanças automáticas de horário de verão, se aplicável.
zh_hans: 首先，点击屏幕的左上角的下拉菜单来选择你的“地区”。然后，选择你的“城市”，或者最接近你目前所在地点的、在同一时区下的城市。选择一个特定的地点将帮助{PRODUCT}确保你的时间总会被设置正确；如果夏令时可用，那么为夏令时而自动做出的时间修改也会被设置正确。

source: You can also select a time zone relative to Greenwich Mean Time (GMT) without setting your location to a specific region. To do so, select `Etc` as your region.
pt_br: Você também pode selecionar um fuso horário relativo ao Horário de Greenwich (GMT) sem definir sua localização para uma região específica. Para fazer isso, selecione `Etc` como sua região.
zh_hans: 你也可以只选择一个相对于格林尼治时间的时区而不设置到某个特定区域的地点。如果你想这样做，就选择“Etc”作为你的区域。

source: The list of cities and regions comes from the Time Zone Database ([package]*tzdata*) public domain, which is maintained by the Internet Assigned Numbers Authority (IANA). The Fedora Project can not add cities or regions into this database. You can find more information at the link:++https://www.iana.org//time-zones++[IANA official website].
pt_br: A lista de cidades e regiões vem do domínio público do banco de dados de fuso horário ([package]*tzdata*), que é mantido pelo Internet Assigned Numbers Authority (IANA). O Projeto Fedora não pode adicionar cidades ou regiões a este banco de dados. Você pode encontrar mais informações no link:++https://www.iana.org//time-zones++[site oficial do IANA].
zh_hans: 地区与城市列表基于 [package]*tzdata* 日期时间数据库生成，这个数据库由 IANA 维护。Fedora 项目没有修改这个数据库内容的权利，你可以在 link:++https://www.iana.org//time-zones++[IANA 官方网站] 了解有关这个数据库的更多信息。

source: The switch labeled `Network Time` in the top right corner of the screen can be used to enable or disable network time synchronization using the Network Time Protocol (NTP). Enabling this option will keep your system time correct as long as the system can access the internet. By default, four NTP _pools_ are configured; you can add others and disable or remove the default ones by clicking the gear wheel button next to the switch.
pt_br: A chave chamada `Horário da Rede` no canto superior direito da tela pode ser usada para habilitar ou desabilitar a sincronização de hora da rede usando o Network Time Protocol (NTP). Ativar esta opção manterá a hora do sistema correta, desde que o sistema possa acessar a Internet. Por padrão, quatro _pools_ NTP são configurados; você pode adicionar outros e desativar ou remover os padrão clicando no botão de roda dentada ao lado do botão.
zh_hans: 在屏幕右上角的拨动开关所示的“网络时间”可以通过使用网络时间协议（NTP）的方式，被用来开启或关闭网络时间同步。只要你的操作系统连上了互联网，开启此功能就会保持你的操作系统的时间正确。默认地，4个NTP_池_会被配置好；此外你也可以通过按下鼠标左键和右键旁边的中键来添加其他的NTP_池_，或者删除默认的NTP_池_。

source: The Add and mark for usage NTP servers dialog
pt_br: A caixa de diálogo Adicionar e marcar servidores NTP para uso
zh_hans: NTP服务器对话框的添加和标记用法

source: A dialog window allowing you to add or remove NTP pools from your system configuration
pt_br: Uma janela de diálogo que lhe permite adicionar ou remover pools NTP da configuração do seu sistema
zh_hans: 允许你从系统设置中添加或删除NTP池的对话框

source: anaconda/DateTimeSpoke_AddNTP.png
zh_hans: anaconda文件夹下的DateTimeSpoke_AddNTP.png

source: If you disable network time synchronization, the controls at the bottom of the screen will become active, and you will be able to set the current time and date manually.
pt_br: Se você desativar a sincronização de horário da rede, os controles na parte inferior da tela ficarão ativos e você poderá definir a hora e a data atuais manualmente.
zh_hans: 如果你禁用了网络时间同步，屏幕下方的控件将变得可用，然后你就可以手动设置当前时间和日期了。

source: After configuring your time and date settings, press the `Done` button in the top left corner to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
pt_br: Depois de definir as configurações de data e hora, pressione o botão `Pronto` no canto superior esquerdo para retornar a xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Resumo da Instalação].
zh_hans: 在配置完你的时间和日期设置之后，按下屏幕左上角的“Done”按键即可返回xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[安装概要]。
