Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f30/pages/_partials/install/KeyboardSpoke.po
Languages: pt_br

source: Keyboard Layout
pt_br: Layout de Teclado

source: The `Keyboard Layout` screen allows you to set up one or more keyboard layouts for your system and a way to switch between them. One keyboard layout is configured automatically based on your selection in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Welcome Screen and Language Selection], but you can change this layout and add additional ones before you begin the installation.
pt_br: A tela `Layout do teclado` permite que você configure um ou mais layouts de teclado para o seu sistema e uma forma de alternar entre eles. Um layout de teclado é configurado automaticamente com base em sua seleção em xref:Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Tela de boas-vindas e seleção de idioma], mas você pode alterar esse layout e adicionar outros antes de iniciar a instalação.

source: Keyboard layouts are a separate setting from system languages, and these two settings can be mixed as you see fit.
pt_br: Os layouts de teclado são uma configuração separada dos idiomas do sistema e essas duas configurações podem ser combinadas conforme você achar necessário.

source: All settings configured in this screen will be available on the installed system, and they will also become immediately available inside the installer. You can use the keyboard icon in the top right corner of any screen, or the keyboard switch you configured in this screen, to cycle between your configured layouts.
pt_br: Todas as configurações definidas nesta tela estarão disponíveis no sistema instalado e também estarão disponíveis imediatamente dentro do instalador. Você pode usar o ícone do teclado no canto superior direito de qualquer tela ou a chave do teclado configurada nesta tela para alternar entre os layouts configurados.

source: The keyboard layout configuration screen
pt_br: A tela de configuração do layout do teclado

source: The left half of the screen contains a window listing all currently configured layouts. The order in which the layouts are displayed is important - the same order will be used when switching between layouts, and the first listed layout will be the default on your system.
pt_br: A metade esquerda da tela contém uma janela listando todos os layouts configurados atualmente. A ordem em que os layouts são exibidos é importante - a mesma ordem será usada ao alternar entre os layouts, e o primeiro layout listado será o padrão em seu sistema.

source: The text field on the right side of the screen can be used to test the currently selected layout.
pt_br: O campo de texto no lado direito da tela pode ser usado para testar o layout atualmente selecionado.

source: You can click a layout in the list to highlight it. At the bottom of the list, there is a set of buttons:
pt_br: Você pode clicar em um layout na lista para realçá-lo. No final da lista, há um conjunto de botões:

source: The `+` button adds a new layout. When you press this button, a new window opens with a list of all available layouts, grouped by language. You can find a layout by browsing the list, or you can use the search bar at the bottom of this window. When you find the layout you want to add, highlight it and press `Add`.
pt_br: O botão `+` adiciona um novo layout. Ao pressionar este botão, uma nova janela é aberta com uma lista de todos os layouts disponíveis, agrupados por idioma. Você pode encontrar um layout navegando na lista ou pode usar a barra de pesquisa na parte inferior desta janela. Quando encontrar o layout que deseja adicionar, realce-o e pressione `Add`.

source: The `-` button removes the currently highlighted layout.
pt_br: O botão `-` remove o layout atualmente destacado.

source: The up and down buttons can be used to move the highlighted layout up or down in the list.
pt_br: Os botões para cima e para baixo podem ser usados para mover o layout destacado para cima ou para baixo na lista.

source: The keyboard button opens a new window which offers a visual representation of the highlighted layout.
pt_br: O botão do teclado abre uma nova janela que oferece uma representação visual do layout destacado.

source: If you use a layout that cannot accept Latin characters, such as `Russian`, you are advised to also add the `English (United States)` layout and configure a keyboard combination to switch between the two layouts. If you only select a layout without Latin characters, you may be unable to enter a valid `root` password and user credentials later in the installation process. This may prevent you from completing the installation.
pt_br: Se você usar um layout que não aceita caracteres latinos, como `Russo`, é aconselhável adicionar também o layout `Inglês (Estados Unidos)` e configurar uma combinação de teclado para alternar entre os dois layouts. Se você selecionar apenas um layout sem caracteres latinos, poderá não conseguir inserir uma senha `root` válida e credenciais de usuário posteriormente no processo de instalação. Isso pode impedir que você conclua a instalação.

source: You can also optionally configure a keyboard switch which can be used to cycle between available layouts. To do so, click the `Options` button on the right side of the screen. The `Layout Switching Options` dialog will open, allowing you to configure one or more keys or key combinations for switching. Select one or more key combinations using the check boxes next to them, and click `OK` to confirm your selection.
pt_br: Você também pode configurar opcionalmente um alternador de teclado que pode ser usado para alternar entre os layouts disponíveis. Para fazer isso, clique no botão `Opções` no lado direito da tela. A caixa de diálogo `Opções de Alteração de Layout` abrirá, permitindo que você configure uma ou mais teclas ou combinações de teclas para a troca. Selecione uma ou mais combinações de teclas usando as caixas de seleção ao lado delas e clique em `OK` para confirmar sua seleção.

source: After you finish configuring keyboard layouts and switches, click `Done` in the top left corner to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
pt_br: Depois de terminar de configurar os layouts de teclado e opções, clique em `Pronto` no canto superior esquerdo para retornar ao xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Resumo da Instalação].
