Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f30/pages/_partials/install/PasswordSpoke.po
Languages: es

source: Root Password
es: Contraseña del usuario root

source: The `Root Password` screen is used to configure the `root` password for your system. This password will be used to log into the administrator (also known as superuser) account, which is used for system administration tasks such as installing and updating software packages and changing system-wide configuration such as network and firewall settings, storage options and adding or modifying users, groups and file permissions.
es: La pantalla `Contraseña de Root` se usa para configurar la contraseña de `root` para su sistema. Esta contraseña será usada para acceder como cuenta de administrador (también conocido como superusuario), que se usa para tareas de administración del sistema como la instalación y actualización de paquetes de software y los cambios de configuración en todo el sistema como los ajustes de red y cortafuegos, las opciones de almacenamiento y la adicción o modificación usuarios, grupos y permisos de archivos.

source: The `root` account will always be created during the installation. However, you should always also create a normal user accont in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-create-user[Create User] and use that account to log in to the system. Only switch to the administrator account only when you need to perform a task which requires administrator access.
es: Durante la instalación siempre se creará la cuente `root`. Sin embargo, siempre se debería crear también una cuenta de usuario normal en xref:Installing_Using_Anaconda.adoc#sect-installation-gui-create-user[Crear Usuario] y usar esta cuenta para acceder al sistema. Utilizar solo la cuenta de administrador cuando necesite llevar a cabo tareas que requieran acceso de administrador.

source: The `root` account has complete control over the system. If an unauthorized person gains access to this account, they can access or delete all users' personal files or otherwise exploit the machine for their own nefarious purposes. See the [citetitle]_{PRODUCT} Security Guide_, available at link:++https://docs.fedoraproject.org/++[], for detailed documentation about account security and guidelines for choosing a strong password.
es: La cuenta `root` tiene control completo sobre el sistema. Si un usuario no autorizado obtiene acceso a esta cuenta, puede acceder o borrar todos los archivos personales de los usuarios If an unauthorized person gains access to this account, they can access or delete all users' personal files o de lo contrario explotar la máquina para sus propios nefastos propósitos. Vea la [citetitle]_{PRODUCT} Guía de Seguridad_, disponible en link:++https://docs.fedoraproject.org/++[], para documentación detallada sobre la seguridad de la cuenta y directrices para elegir una contraseña fuerte.

source: The Root Password screen. Use the text input fields to provide your root password.
es: Pantalla Contraseña de Root. Use los campos de entrada texto para suministrar su contraseña de root.

source: Once you choose a strong password, enter it in the `Root Password` field. The characters you write will be displayed as dots for security. Then, type the same password into the `Confirm` field to ensure you entered it properly. Both entered passwords must be the same.
es: Una vez que haya elegido una contraseña fuerte, introducirla en el campo `Contraseña de Root`. Los caracteres que escriba se mostrarán como puntos por seguridad. Después, teclee la misma contraseña en el campo `Confirmar` para asegurar que la ha introducido correctamente. Ambas contraseñas tecleadas debe ser la misma.

source: As you enter the password, it will be evaluated and the installer will determine the password's strength. If the installer considers your password weak, a message will appear at the bottom of the screen, explaining which aspect of your chosen password is considered insuficient. For example:
es: Según introduzca la contraseña será evaluada y el instalador determinará su fortaleza. Si el instalador considera que la contraseña es débil aparecerá un mensaje en la parte inferior de la pantalla, explicando que aspecto de la contraseña que ha elegido es considerado insuficiente. Por ejemplo:

source: `The password you have provided is weak:` `The password is shorter than 5 characters.`
es: `La contraseña que ha suministrado es débil:` `La contraseña tiene menos de 5 caracteres.`

source: If a message similar to the above appears, it is highly recommended to choose a different, stronger password.
es: Si aparece un mensaje similar al de arriba, es altamente recomendable que elija una contraseña diferente, más fuerte.

source: Once you configure the superuser password, click `Done` in the top left corner to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Configuration and Installation Progress]. If you selected a weak password, you must press the button twice.
es: Una vez que ha configurado la contraseña de superusuario, pulse `Hecho` en la esquina superior izquierda para volver a xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Configuración y Progreso de la Instalación]. Si selecciona una contraseña débil, debe apretar el botón dos veces.
