Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f30/pages/_partials/install/SourceSpoke.po
Languages: tr

source: Installation Source
tr: Kurulum Kaynağı

source: The `Installation Source` screen allows you to specify a location (local or on the network) from which packages will be downloaded and installed on your system. This screen will be configured automatically in most cases, but you can change your settings or add additional sources.
tr: `Kurulum Kaynağı` ekranı, paketlerin sisteminize indirilip kurulacağı bir konum (yerel veya ağ üzerinde) belirtmenize olanak tanımaktadır. Bu ekran çoğu durumda otomatik olarak yapılandırılacaktır, ancak ayarlarınızı değiştirebilir veya ek kaynaklar ekleyebilirsiniz.

source: Normally, when you first enter the `Installation Summary` screen, the installer will attempt to configure an installation source based on the type of media you used to boot. The full {PRODUCT} Server DVD will configure the source as local media, the netinst ISO image will configure the closest network mirror, etc. This process takes some time, especially if the default source is a network mirror. If you plan to use a custom installation source, use the [option]#inst.askmethod# boot option to skip the initial configuration; this will allow you to enter this screen immediately. See xref:advanced/Boot_Options.adoc#sect-boot-options-sources[Specifying the Installation Source] for information about boot options.
tr: Normalde, `Kurulum Özeti` ekranına ilk kez girdiğinizde, önyükleme için kullandığınız ortam türüne göre kurucu bir kurulum kaynağı yapılandırmaya çalışacaktır. Tam {PRODUCT} Server DVD'si kaynağı yerel ortam olarak, ağ üzerinden kurulum ISO kalıbı ise en yakın ağ yansısı olarak vs. yapılandıracaktır. Bu işlem, özellikle öntanımlı kaynak bir ağ yansısı ise biraz zaman alır. Özel bir kurulum kaynağı kullanmayı planlıyorsanız, başlangıç yapılandırmasını atlamak için [option]#inst.askmethod# önyükleme seçeneğini kullanın; bu seçenek, bu ekrana hemen girmenizi sağlayacaktır. Önyükleme seçenekleri hakkında bilgi için xref:advanced/Boot_Options.adoc#sect-boot-options-sources[Kurulum Kaynağını Belirtme] bölümüne bakın.

source: The Installation Source screen
tr: Kurulum Kaynağı ekranı

source: The following options are available. Note that not all of them may be displayed.
tr: Aşağıdaki seçenekler kullanılabilir. Hepsinin görüntülenmeyebileceğini unutmayın.

source: Auto-detected installation media
tr: Otomatik algılanan kurulum ortamı

source: This is the option selected by default if you started the installer from media containing an installation source, such as a live DVD. No additional configuration is necessary. You can click the `Verify` button check the media integrity.
tr: Bu, kurucuyu canlı DVD gibi bir kurulum kaynağı içeren ortamdan başlattıysanız öntanımlı olarak seçilen seçenektir. Ek yapılandırma gerekmez. Ortam bütünlüğünü denetlemek için `Doğrula` düğmesine tıklayabilirsiniz.

source: ISO file
tr: ISO dosyası

source: This option will appear if the installation program detected a partitioned hard drive with mountable file systems during boot. Select this option, click the btn:[Choose an ISO] button, and browse to the installation ISO file's location on your system. You can click the `Verify` button to check the file's integrity.
tr: Bu seçenek, kurulum programı önyükleme sırasında bağlanabilir dosya sistemlerine sahip bölümlendirilmiş bir sabit sürücü algıladığında görünecektir. Bu seçeneği seçin, btn:[Bir ISO seç] düğmesine tıklayın ve kurulum ISO dosyasının sisteminizdeki konumuna gidin. Dosyanın bütünlüğünü denetlemek için `Doğrula` düğmesine tıklayabilirsiniz.

source: On the network
tr: Ağ üzerinde

source: Use this option to download packages to be installed from a network location instead of local media. This is the default selection on network installation media.
tr: Kurulacak paketleri yerel ortam yerine bir ağ konumundan indirmek için bu seçeneği kullanın. Bu, ağ üzerinden kurulum ortamında öntanımlı seçimdir.

source: In most cases, the `Closest mirror` option available from the protocol selection drop-down menu is preferable. If this option is selected, packages for your system will be downloaded from the most suitable location (mirror).
tr: Çoğu durumda, protokol seçimi açılır menüsünde bulunan `En yakın yansı` seçeneği tercih edilmektedir. Bu seçenek seçilmişse, sisteminiz için paketler en uygun konumdan (yansı) indirilecektir.

source: To manually configure a network-based installation source, use the drop-down menu to specify the protocol to be used when downloading packages. This setting depends on the server you want to use. Then, type the server address (without the protocol) into the address field. If you choose NFS, a second input field will appear where you can specify custom `NFS mount options`.
tr: Ağ tabanlı bir kurulum kaynağını elle yapılandırmak için, paketleri indirirken kullanılacak protokolü belirtmek üzere açılır menüyü kullanın. Bu ayar, kullanmak istediğiniz sunucuya bağlıdır. Ardından, adres alanına sunucu adresini (protokol olmadan) yazın. NFS'yi seçerseniz, özel `NFS bağlama seçenekleri` belirtebileceğiniz ikinci bir giriş alanı görünecektir.

source: When selecting an NFS installation source, you must specify the address with a colon (`:`) character separating the host name from the path. For example:
tr: Bir NFS kurulum kaynağı seçerken, sunucu adı ile yolu iki nokta karakteri (`:`) ile ayıracak şekilde adres belirtmeniz gerekmektedir. Örneğin:

source: `pass:attributes[{blank}]_server.example.com_:pass:attributes[{blank}]_/path/to/directory_pass:attributes[{blank}]`
tr: `pass:attributes[{blank}]_sunucu.example.com_:pass:attributes[{blank}]_/dizinin/yolu_pass:attributes[{blank}]`

source: To configure a proxy for an HTTP or HTTPS source, click the btn:[Proxy setup] button. Check `Enable HTTP proxy` and type the URL into the `Proxy URL` box. If the proxy server requires authentication, check `Use Authentication` and enter your user name and password. Click btn:[OK] to finish the configuration.
tr: HTTP veya HTTPS kaynağı için bir vekil sunucu yapılandırmak için btn:[Vekil kurulumu] düğmesine tıklayın. `HTTP vekilini etkinleştir` seçeneğini işaretleyin ve URL'yi `Vekil URL'si` kutusuna yazın. Vekil sunucusu yetkilendirme gerektiriyorsa, `Yetkilendirme Kullan` seçeneğini işaretleyin ve kullanıcı adınızı ve parolanızı girin. Yapılandırmayı bitirmek için btn:[Tamam] düğmesine tıklayın.

source: If your HTTP or HTTPS URL refers to a repository mirror list, mark the check box under the address field.
tr: HTTP veya HTTPS URL'niz bir depo yansı listesini adres gösteriyorsa, adres alanının altındaki onay kutusunu işaretleyin.

source: You can also specify additional repositories in the `Additional repositories` section to gain access to more installation environments and software add-ons. All environments and add-ons will be available for selection in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Software Selection] once you finish configuring the sources.
tr: Ayrıca, daha fazla kurulum ortamına ve yazılım eklentisine erişmek için `Ek depolar` bölümünde ilave depolar belirtebilirsiniz. Kaynakları yapılandırmayı tamamladığınızda, tüm ortamlar ve eklentiler xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Yazılım Seçimi] bölümünde seçilebilecektir.

source: To add a repository, click the btn:[+] button. To delete a repository, select one in the list and click the btn:[-] button. Click the arrow icon to revert to the previous list of repositories, i.e. to replace current entries with those that were present at the time you entered the `Installation Source` screen. To activate or deactivate a repository, click the check box in the `Enabled` column at each entry in the list.
tr: Bir depo eklemek için btn:[+] düğmesine tıklayın. Bir depoyu silmek için listeden birini seçin ve btn:[-] düğmesine tıklayın. Önceki depo listesini geri getirmek (örneğin geçerli ögeleri `Kurulum Kaynağı` ekranına girdiğiniz sırada mevcut olanlarla değiştirmek) için ok simgesine tıklayın. Bir depoyu etkinleştirmek veya devre dışı bırakmak için, listedeki her ögede bulunan `Etkin` sütunundaki onay kutusuna tıklayın.

source: You can name your additional repository and configure it the same way as the primary repository on the network using the input fields on the right side of the section.
tr: Ek deponuzu adlandırabilir ve bölümün sağ tarafındaki giriş alanlarını kullanarak ağ üzerindeki birincil depoyla aynı şekilde yapılandırabilirsiniz.

source: Once you have selected your installation source, click `Done` in the top left corner to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
tr: Kurulum kaynağınızı seçtikten sonra, xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Kurulum Özetine] dönmek için sol üst köşedeki `Bitti` düğmesine tıklayın.
