Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f29/nav.po
Languages: cs, fr

source: xref:index.adoc[Installation Guide]
cs: xref:index.adoc[Instalační příručka]
fr: xref:index.adoc[Guide d’installation]

source: xref:Preface.adoc[Preface]
cs: xref:Preface.adoc[Předmluva]
fr: xref:Preface.adoc[Préface]

source: xref:Introduction.adoc[Introduction]
cs: xref:Introduction.adoc[Úvod]

source: xref:Downloading_Fedora.adoc[Downloading Fedora]
cs: xref:Downloading_Fedora.adoc[Stažení Fedory]
fr: xref:Downloading_Fedora.adoc[Télécharger Fedora]

source: Installing Fedora
cs: Instalování Fedory
fr: Installation de Fedora

source: xref:install/Preparing_for_Installation.adoc[Preparing for Installation]
cs: xref:install/Preparing_for_Installation.adoc[Příprava na instalaci]
fr: xref:install/Preparing_for_Installation.adoc[Se préparer pour l’installation]

source: xref:install/Booting_the_Installation.adoc[Booting the Installation]
cs: xref:install/Booting_the_Installation.adoc[Zavedení instalace]
fr: xref:install/Booting_the_Installation.adoc[Démarrer l’installation]

source: xref:install/Installing_Using_Anaconda.adoc[Installing Using Anaconda]
cs: xref:install/Installing_Using_Anaconda.adoc[Instalace pomocí Anacondy]
fr: xref:install/Installing_Using_Anaconda.adoc[Installer en utilisant Anaconda]

source: xref:install/After_Installation.adoc[After the Installation]
cs: xref:install/After_Installation.adoc[Po instalaci]
fr: xref:install/After_Installation.adoc[Après l’installation]

source: xref:install/Troubleshooting.adoc[Troubleshooting]
cs: xref:install/Troubleshooting.adoc[Řešení problémů]
fr: xref:install/Troubleshooting.adoc[Résolution des problèmes]

source: Advanced Installation Options
cs: Pokročilé možnosti instalace
fr: Options d’installation avancées

source: xref:advanced/Boot_Options.adoc[Boot Options]
cs: xref:advanced/Boot_Options.adoc[Volby zavedení]
fr: xref:advanced/Boot_Options.adoc[Options de démarrage]

source: xref:advanced/Kickstart_Installations.adoc[Automating the Installation with Kickstart]
cs: xref:advanced/Kickstart_Installations.adoc[Automatizace instalace souborem Kickstart]
fr: xref:advanced/Kickstart_Installations.adoc[Automatiser l’installation avec Kickstart]

source: xref:advanced/Network_based_Installations.adoc[Setting Up an Installation Server]
cs: xref:advanced/Network_based_Installations.adoc[Nastavení instalačního serveru]
fr: xref:advanced/Network_based_Installations.adoc[Mettre en place un serveur d’installation]

source: xref:advanced/VNC_Installations.adoc[Installing Using VNC]
cs: xref:advanced/VNC_Installations.adoc[Instalace pomocí VNC]
fr: xref:advanced/VNC_Installations.adoc[Installer en utilisant VNC]

source: xref:advanced/Upgrading_Your_Current_System.adoc[Upgrading Your Current System]
cs: xref:advanced/Upgrading_Your_Current_System.adoc[Přechod systému na vyšší verzi]
fr: xref:advanced/Upgrading_Your_Current_System.adoc[Mettre à jour votre système actuel]

source: Technical Appendixes
cs: Technické přílohy
fr: Annexes techniques

source: xref:appendixes/Kickstart_Syntax_Reference.adoc[Kickstart Syntax Reference]
cs: xref:appendixes/Kickstart_Syntax_Reference.adoc[Referenční syntaxe Kickstartu]
fr: xref:appendixes/Kickstart_Syntax_Reference.adoc[Référence syntaxique de Kickstart]

source: xref:appendixes/Disk_Partitions.adoc[An Introduction to Disk Partitions]
cs: xref:appendixes/Disk_Partitions.adoc[Úvod do dělení disků]
fr: xref:appendixes/Disk_Partitions.adoc[Introduction aux partitions des disques]

source: xref:appendixes/Understanding_LVM.adoc[Understanding LVM]
cs: xref:appendixes/Understanding_LVM.adoc[Vysvětlení LVM]
fr: xref:appendixes/Understanding_LVM.adoc[Comprendre LVM]

source: xref:Revision_History.adoc[Revision History]
cs: xref:Revision_History.adoc[Historie změn]
fr: xref:Revision_History.adoc[Historique des modifications]
