Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f30/pages/install/After_Installation.po
Languages: tr

source: After the Installation
tr: Kurulumdan Sonra

source: This chapter describes the initial setup tools which open after you finish the installation, reboot the system, and log in for the first time.
tr: Bu bölüm kurulumu tamamladıktan, sistemi yeniden başlattıktan ve ilk kez oturum açtıktan sonra açılan ilk kurulum araçlarını açıklamaktadır.

source: Two separate configuration tools are part of {PRODUCT}. If you installed the [application]*GNOME* desktop environment (the default {PRODUCT} environment, installed for example as part of the {PRODUCT} Workstation Edition), the [application]*GNOME Initial Setup* utility will open; for all other graphical environments, the [application]*Initial Setup* tool serves the same purpose.
tr: İki ayrı yapılandırma aracı {PRODUCT}'nın bir parçasıdır. [application]*GNOME* masaüstü ortamını kurduysanız (öntanımlı {PRODUCT} ortamı, örneğin {PRODUCT} Workstation sürümünün bir parçası olarak kurulur), [application]*GNOME İlk Kurulum* yardımcı programı açılacaktır; diğer tüm grafiksel ortamlar için [application]*İlk Kurulum* aracı aynı amaca hizmet etmektedir.

source: Both of these tools will allow you to configure user-specific settings which have not been configured during the installation. Some of the settings are available both in the graphical installer (or as Kickstart commands) as well as in the initial-setup utilities; in that case, they will only be displayed after the first reboot if you skipped them during the installation. This means that, for example, if you configured a user account before the installation finished, you will not be prompted to do so again after the installation completes.
tr: Bu araçların her ikisi de, kurulum sırasında yapılandırılmayan kullanıcıya özel ayarları yapılandırmanıza izin verecektir. Ayarlardan bazıları hem grafiksel kurucuda (veya Kickstart komutları olarak) hem de ilk kurulum yardımcı programlarında bulunur; bu durumda yalnızca kurulum sırasında atladıysanız ilk yeniden başlatmanın ardından görüntülenecektir. Bu, örneğin, kurulum tamamlanmadan önce bir kullanıcı hesabı yapılandırdıysanız, kurulum tamamlandıktan sonra bunu tekrar yapmanız istenmeyeceği anlamına gelir.

source: GNOME Initial Setup
tr: GNOME İlk Kurulum

source: The [application]*GNOME Initial Setup* utility will be displayed after you log in for the first time with any user account, as long as your first login is in the [application]*GNOME* desktop environment.
tr: İlk oturumunuz [application]*GNOME* masaüstü ortamında olduğu sürece, herhangi bir kullanıcı hesabıyla ilk kez oturum açtıktan sonra [application]*GNOME İlk Kurulum* yardımcı programı görüntülenecektir.

source: GNOME Initial Setup with language selection displayed.
tr: GNOME İlk Kurulum dil seçimi görüntülenirken.

source: This utility allows you to configure several user-specific settings, such as system language or the default keyboard layout. Use the `Next` and `Previous` buttons at the top of the window to navigate between screens. Some screens (`Configure online accounts` in particular) are optional and can be skipped using the `Skip` button in the top right corner.
tr: Bu yardımcı program, sistem dili veya öntanımlı klavye düzeni gibi kullanıcıya özel birkaç ayarı yapılandırmanıza olanak tanır. Ekranlar arasında gezinmek için pencerenin üst kısmındaki `İleri` ve `Geri` düğmelerini kullanın. Bazı ekranlar (özellikle `Çevrim içi hesapları yapılandır`) isteğe bağlıdır ve sağ üst köşedeki `Geç` düğmesi kullanılarak atlanabilir.

source: After you finish configuring all screens, click `Start using Fedora` to exit the utility. After that, the `Getting Started` page from GNOME help will be displayed, and you can either browse the help content, or close it and start using your desktop.
tr: Tüm ekranları yapılandırmayı bitirdikten sonra, yardımcı programdan çıkmak için `Fedora Kullanmaya Başla` düğmesine tıklayın. Bundan sonra GNOME yardımındaki `Başlarken` sayfası görüntülenecektir, yardım içeriğine göz atabilir veya kapatabilir ve masaüstünüzü kullanmaya başlayabilirsiniz.

source: Common Post-installation Tasks
tr: Yaygın Kurulum Sonrası Görevleri

source: After you finish the installation and go through one of the initial setup utilities described above, your system is ready for use. However, other administrative tasks not covered by the installer or the initial setup utilities may still be necessary, depending on how you plan to use your system. The list below describes some of the more common tasks usually performed immediately after a new installation.
tr: Kurulumu tamamladıktan ve yukarıda açıklanan ilk kurulum yardımcı programlarından birini geçtikten sonra sisteminiz kullanıma hazırdır. Ancak, sisteminizi nasıl kullanmayı planladığınıza bağlı olarak, kurucu veya ilk kurulum yardımcı programları tarafından kapsanmayan diğer yönetim görevleri yine de gerekli olabilir. Aşağıdaki liste, genellikle yeni bir kurulumdan hemen sonra gerçekleştirilen yaygın görevlerden bazılarını açıklamaktadır.

source: Recover a lost `root` password
tr: Kayıp `root` parolasını kurtarın

source: The `root` password, which is configured during the installation, is required for accessing the system as the `root` user. Without this password you will not be able to configure your system or install additional software. If you lost or forgot your `root` password, you can reset it by following the steps described in xref:install/Troubleshooting.adoc#sect-trouble-after-reset-root-password[Resetting the Root Password].
tr: Kurulum sırasında yapılandırılan `root` parolası, sisteme `root` kullanıcısı olarak erişmek için gereklidir. Bu parola olmadan sisteminizi yapılandıramaz veya ek yazılım kuramazsınız. `root` parolanızı kaybettiyseniz veya unuttuysanız, xref:install/Troubleshooting.adoc#sect-trouble-after-reset-root-password[Root Parolasını Sıfırlama] bölümünde açıklanan adımları izleyerek parolanızı sıfırlayabilirsiniz.

source: Configure the network
tr: Ağı yapılandırın

source: In most cases, network access is configured during the installation process, either in the [application]*Anaconda* installation program (see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Network & Hostname]) or in a Kickstart file (see xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-network[network (optional) - Configure Network Interfaces]). For information on configuring the network after the installation, see the [citetitle]_{PRODUCT} Networking Guide_, available at link:++https://docs.fedoraproject.org/++[].
tr: Çoğu durumda ağ erişimi, ya [application]*Anaconda* kurulum programında (xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Ağ & Ana Makine Adı] bölümüne bakın) ya da bir Kickstart dosyasında (xref:appendixes/Kickstart_Syntax_Reference.adoc#sect-kickstart-commands-network[network (isteğe bağlı) - Ağ Arayüzlerini Yapılandır] bölümüne bakın) kurulum işlemi sırasında yapılandırılır. Kurulumdan sonra ağı yapılandırma hakkında bilgi için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Ağ Kılavuzuna_ bakın.

source: Perform an initial system update
tr: İlk sistem güncellemesini gerçekleştirin

source: If you installed {PRODUCT} from a full installation ISO image (such as the Workstation live image or full Server DVD), it is recommended to perform an initial system update, because your installation media likely contained older versions of software packages. During the initial update, all installed packages are updated to their latest available versions. Updates to packages provide security fixes, bug fixes and enhancements.
tr: {PRODUCT}'yı bir tam kurulum ISO kalıbından (Workstation canlı kalıbı veya tam Server DVD'si gibi) kurduysanız, kurulum ortamınız muhtemelen yazılım paketlerinin eski sürümlerini içerdiği için bir ilk sistem güncellemesi yapmanız tavsiye edilir. İlk güncelleme sırasında, kurulu tüm paketler kullanılabilir en son sürümlerine güncellenir. Paketlerde yapılan güncellemeler güvenlik düzeltmeleri, hata düzeltmeleri ve iyileştirmeler sağlar.

source: The [application]*DNF* package manager is used for updating installed packages. For more information about updating your system with [application]*DNF*, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
tr: [application]*DNF* paket yöneticisi, kurulu paketleri güncellemek için kullanılır. Sisteminizi [application]*DNF* ile güncelleme hakkında daha fazla bilgi için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Sistem Yöneticisi Kılavuzuna_ bakın.

source: Install driver updates
tr: Sürücü güncellemelerini kurun

source: Usually, drivers for system devices are already supported in the kernel provided by Red{nbsp}Hat Enterprise{nbsp}Linux. However, occasionally, support for devices that have been released recently could be missing. In these cases, a driver update enabling your device may be available.
tr: Sistem aygıtlarının sürücüleri, genellikle Red{nbsp}Hat Enterprise{nbsp}Linux tarafından sağlanan çekirdekte zaten desteklenmektedir. Ancak, bazen yakın zamanda piyasaya sürülen aygıtlar için destek eksik olabilir. Bu durumlarda, aygıtınızı etkinleştiren bir sürücü güncellemesi bulunabilir.

source: Devices necessary to complete the installation can have driver updates provided before the installation begins. If a device is missing a driver, but it is not essential during the installation, it is recommended to wait until after the installation completes, and install additional drivers afterwards. For instructions on installing and enabling additional drivers on the installed system using [application]*RPM* and [application]*DNF*, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
tr: Kurulumu tamamlamak için gerekli aygıtlar için, kurulum başlamadan önce sürücü güncellemeleri sağlanabilir. Bir aygıtın sürücüsü eksikse, ancak kurulum sırasında gerekli değilse, kurulumun tamamlanmasını beklemeniz ve ek sürücüleri daha sonra kurmanız tavsiye edilir. [application]*RPM* ve [application]*DNF* kullanarak kurulan sisteme ek sürücülerin kurulması ve etkinleştirilmesine ilişkin talimatlar için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Sistem Yöneticisi Kılavuzuna_ bakın.

source: Configure additional repositories
tr: Ek depoları yapılandırın

source: New software is installed from _package repositories_. Package repositories are organized sets of software and metadata that can be accessed by the [application]*DNF* package manager. By default, several update repositories provided by {PRODUCT} are configured automatically and you can install updates and additional software from those. However, if you want to set up additional repositories, for example ones containing your own software, some extra steps are needed.
tr: Yeni yazılımlar _paket depolarından_ kurulmaktadır. Paket depoları, [application]*DNF* paket yöneticisi tarafından erişilebilen düzenli yazılım ve üst veri kümeleridir. Öntanımlı olarak, {PRODUCT} tarafından sağlanan çeşitli güncelleme depoları otomatik olarak yapılandırılır ve bunlardan güncellemeleri ve ek yazılımları kurabilirsiniz. Bununla birlikte, örneğin kendi yazılımınızı içerenler gibi ek depolar kurmak istiyorsanız bazı ek adımlar gerekmektedir.

source: For information about configuring additional software repositories, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[].
tr: Ek yazılım depoları yapılandırma hakkında bilgi için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Sistem Yöneticisi Kılavuzuna_ bakın.

source: Install additional packages
tr: Ek paketler kurun

source: You can control which packages will be installed by selecting an environment in the `Software Selection` dialog in the graphical installation (see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Software Selection]). This dialog does not provide a way to choose individual packages, only predefined sets. However, you can use the [application]*DNF* package manager to install additional packages after the installation. See the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[], for more information.
tr: Grafiksel kurulumdaki `Yazılım Seçimi` iletişim kutusunda bir ortam seçerek hangi paketlerin kurulacağını denetleyebilirsiniz (xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-software-selection[Yazılım Seçimi] bölümüne bakın). Bu iletişim kutusu, tek tek paketleri seçmenize izin vermez, yalnızca önceden tanımlanmış kümeler sağlar. Ancak, kurulumdan sonra ek paketler kurmak için [application]*DNF* paket yöneticisini kullanabilirsiniz. Daha fazla bilgi için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Sistem Yöneticisi Kılavuzuna_ bakın.

source: Switch to a graphical login
tr: Grafiksel oturuma geçiş yapın

source: Depending on the options you chose during the installation process, it is possible that your system does not have a graphical interface, instead offering only a text-based prompt. If this is the case and you wish to enable a graphical desktop after the installation, you must install the [application]*X Window System* and your preferred desktop environment (either [application]*GNOME* or [application]*KDE*).
tr: Kurulum işlemi sırasında seçtiğiniz seçeneklere bağlı olarak, sisteminizin grafiksel bir arayüze sahip olmaması, bunun yerine yalnızca metin tabanlı bir komut istemi sunması mümkündür. Eğer öyleyse ve kurulumdan sonra bir grafiksel masaüstünü etkinleştirmek istiyorsanız, [application]*X Pencere Sistemini* ve tercih ettiğiniz masaüstü ortamını ([application]*GNOME* ya da [application]*KDE*) kurmanız gerekir.

source: As with all other software, these packages can be installed using the [application]*DNF* package manager. For information about using [application]*DNF* to install new packages, see the [citetitle]_{PRODUCT} System Administrator's Guide_, available at link:++https://docs.fedoraproject.org/++[]. For information on how to enable graphical login by default, see xref:install/Troubleshooting.adoc#sect-trouble-after-graphical-login[Booting into a Graphical Environment].
tr: Diğer tüm yazılımlarda olduğu gibi, bu paketler [application]*DNF* paket yöneticisi kullanılarak kurulabilir. Yeni paketleri kurmak için [application]*DNF* kullanmak hakkında bilgi için link:++https://docs.fedoraproject.org/++[] adresinde bulunan [citetitle]_{PRODUCT} Sistem Yöneticisi Kılavuzuna_ bakın. Öntanımlı olarak grafiksel oturum açmanın nasıl etkinleştirileceği hakkında bilgi için xref:install/Troubleshooting.adoc#sect-trouble-after-graphical-login[Grafiksel Ortama Önyükleme] bölümüne bakın.
