Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f31/pages/_partials/Feedback.po
Languages: id

source: We want feedback
id: Kami ingin umpan balik

source: indexterm:[feedback,contact information for this manual] If you find errors or have suggestions for improvement, we want your advice. Open an issue at {BZURL}.
id: indexterm:[umpan balik,informasi kontak untuk manual ini] Bila Anda menemukan kesalahan atau punya saran untuk perbaikan, kami ingin advis Anda. Buka masalah pada {BZURL}.

source: In the issue:
id: Dalam kasus ini:

source: Provide a short summary of the error or your suggestion in the `Issue Title` field.
id: Berikan ringkasan pendek dari kesalahan atau saran Anda dalam ruas `Judul Masalah`.

source: Copy the following template into the `Comment` field and give us the details of the error or suggestion as specifically as you can. If possible, include some surrounding text so we know where the error occurs or the suggestion fits.
id: Salin templat berikut ke dalam ruas `Komentar` dan berikan kami rincian dari kesalahan atau saran sespesifik mungkin. Bila mungkin, sertakan sebagian teks di sekeliling sehingga kami tahu di mana kesalahan terjadi atau saran ditempatkan.

source: Document URL:
id: URL Dokumen:

source: Section name:
id: Nama seksi:

source: Error or suggestion:
id: Kesalahan atau saran:

source: Additional information:
id: Informasi tambahan:

source: Click the btn:[Create Issue] button.
id: Klik tombol btn:[Buat Masalah].
