Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f26/pages/_partials/Feedback.po
Languages: tr

source: We want feedback
tr: Geri bildirim istiyoruz

source: indexterm:[feedback,contact information for this manual] If you find errors or have suggestions for improvement, we want your advice. Submit a report in Bugzilla against the product `{PRODUCT}` and the component `{BOOKID}`. The following link automatically loads this information for you: {BZURL}.
tr: indexterm:[bu kılavuz için geri bildirim, iletişim bilgileri] Herhangi bir hata bulursanız veya iyileştirme önerileriniz varsa, tavsiyelerinizi bekliyoruz. Bugzilla'da `{PRODUCT}` ürününe ve `{BOOKID}` bileşenine ilişkin bir rapor gönderin. {BZURL} adresinde bu bilgiler sizin için otomatik olarak yüklenecektir.

source: In Bugzilla:
tr: Bugzilla'da:

source: Provide a short summary of the error or your suggestion in the `Summary` field.
tr: `Summary ` alanında hatanın kısa bir özetini veya önerinizi belirtin.

source: Copy the following template into the `Description` field and give us the details of the error or suggestion as specifically as you can. If possible, include some surrounding text so we know where the error occurs or the suggestion fits.
tr: Aşağıdaki şablonu `Description` alanına kopyalayın ve hata veya öneri hakkında bize mümkün olduğunca fazla ayrıntı verin. Mümkünse, hatanın nerede olduğunu veya öneriyi nereye ekleyeceğimizi bilmemiz için açıklayıcı metin ekleyin.

source: Document URL:
tr: Belge URL'si (Document URL):

source: Section number and name:
tr: Bölüm numarası ve adı:

source: Error or suggestion:
tr: Hata veya öneri (Error or suggestion):

source: Additional information:
tr: Ek bilgiler (Additional information):

source: Click the btn:[Submit Bug] button.
tr: btn:[Submit Bug] düğmesine tıklayın.
