Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f30/pages/_partials/Feedback.po
Languages: fr

source: We want feedback
fr: Nous voulons des commentaires

source: indexterm:[feedback,contact information for this manual] If you find errors or have suggestions for improvement, we want your advice. Open an issue at {BZURL}.
fr: indexterm:[commentaires,informations de contact pour ce manuel] Si vous trouvez des erreurs ou avez des suggestions d’amélioration, nous voulons votre avis. Ouvrez un ticket à {BZURL}.

source: In the issue:
fr: Dans le ticket :

source: Provide a short summary of the error or your suggestion in the `Issue Title` field.
fr: Renseignez une description courte de l’erreur ou de votre suggestion dans le champ `Issue Title`.

source: Copy the following template into the `Comment` field and give us the details of the error or suggestion as specifically as you can. If possible, include some surrounding text so we know where the error occurs or the suggestion fits.
fr: Copiez le modèle suivant dans le champ `Comment`et donnez-nous le plus de détails possible de l’erreur ou de la suggestion. Si possible, incluez du texte explicatif afin que nous sachions où est l’erreur ou l’endroit où ajouter la suggestion.

source: Document URL:
fr: Adresse du document :

source: Section name:
fr: Nom de section :

source: Error or suggestion:
fr: Erreur ou suggestion :

source: Additional information:
fr: Informations supplémentaires :

source: Click the btn:[Create Issue] button.
fr: Cliquez sur le bouton btn:[Create Issue].
