Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/install/Booting_the_Installation.po
Languages: id, tr

source: Booting the Installation
id: Mem-boot Instalasi
tr: Kurulumu Önyükleme

source: This chapter will explain how to boot the installer from local media or a network server as well as how to navigate the boot menu and use custom options.
id: Bab ini akan menjelaskan bagaimana untuk mem-boot installer dari media lokal atau server jaringan serta bagaimana untuk menavigasi menu boot dan menggunakan pilihan ubahan.
tr: Bu bölümde, kurucunun yerel ortamdan veya bir ağ sunucusundan nasıl önyükleneceği ile önyükleme menüsünde nasıl gezinileceği ve özel seçeneklerin nasıl kullanılacağı açıklanacaktır.

source: Preparing to Boot
id: Bersiap untuk Boot
tr: Önyüklemeye Hazırlama

source: After you have made a bootable USB flash drive or a CD or DVD using the steps described in xref:Preparing_for_Installation.adoc#sect-preparing-boot-media[Preparing Boot Media], you are ready to boot the installation. Note that the steps described below are generic and the exact steps will vary somewhat depending on your system - particularly on your motherboard manufacturer.
tr: xref:Preparing_for_Installation.adoc#sect-preparing-boot-media[Önyükleme Ortamını Hazırlama] bölümünde açıklanan adımları kullanarak önyüklenebilir bir USB flash sürücü veya CD veya DVD oluşturduktan sonra, kurulumu önyüklemeye hazırsınız. Aşağıda açıklanan adımların genel olduğunu ve tam olarak yapılacakların sisteminize, özellikle de anakart üreticinize bağlı olarak biraz değişeceğini unutmayın.

source: There are no separate media provided for BIOS and UEFI systems; all of them can boot from the same ISO image. However, once you install {PRODUCT}, you can not switch between UEFI and BIOS. The system must run on the same firmware it was installed on; if you, for example, perform the installation on an UEFI system in UEFI mode, and then switch it to BIOS compatibility mode, {PRODUCT} will no longer boot and will require a reinstallation.
id: Tidak ada media terpisah yang disediakan untuk sistem BIOS dan UEFI; mereka semua dapat di-boot dari image ISO yang sama. Namun, setelah Anda menginstal {PRODUCT}, Anda tidak dapat beralih antara UEFI dan BIOS. Sistem harus dijalankan pada firmware yang sama dengan tempatnya diinstal; jika Anda, misalnya, melakukan instalasi pada sistem UEFI dalam mode UEFI, dan kemudian beralih ke mode kompatibilitas BIOS, {PRODUCT} tidak akan boot lagi dan akan memerlukan penginstalan ulang.
tr: BIOS ve UEFI sistemleri için ayrı olarak sağlanan ortamlar yoktur; hepsi aynı ISO kalıbından önyüklenebilir. Ancak, {PRODUCT}'yı kurduktan sonra UEFI ve BIOS arasında geçiş yapamazsınız. Sistem, hangisi için kurulduysa onun üzerinde çalışmalıdır; örneğin, kurulumu UEFI modunda bir UEFI sisteminde gerçekleştirir ve ardından BIOS uyumluluk moduna geçirirseniz, {PRODUCT} artık önyükleme yapmayacak ve yeniden kurulum gerektirecektir.

source: {PRODUCT} does not support UEFI booting for 32-bit x86 systems. Only BIOS boot is supported on these systems.
id: {PRODUCT} tidak mendukung boot UEFI untuk sistem x86 32-bit. Hanya boot BIOS yang didukung pada sistem ini.
tr: {PRODUCT}, 32 bit x86 sistemleri için UEFI önyüklemesini desteklemez. Bu sistemlerde sadece BIOS önyüklemesi desteklenmektedir.

source: Also note that {PRODUCT} only fully supports version 2.2 of the UEFI specification. Hardware that supports version 2.3 or later will boot and work normally, but the additional functionality defined by these later specifications will not be available. The UEFI specifications are available from link:++http://www.uefi.org/specs/agreement/++[].
tr: Ayrıca {PRODUCT}'nın UEFI tanımlamasının sadece 2.2 sürümünü tam olarak desteklediğini unutmayın. 2.3 sürümü veya üstünü destekleyen donanımlar normal şekilde önyükleme yapacak ve çalışacaktır, ancak sonraki tanımlamalar tarafından belirtilen ek işlevler kullanılamayacaktır. UEFI tanımlamalarına link:++https://www.uefi.org/specs/agreement/++[] adresinden ulaşabilirsiniz.

source: To boot the {PRODUCT} installer, follow these steps:
id: Untuk mem-boot installer {PRODUCT}, ikuti langkah-langkah berikut:
tr: {PRODUCT} kurucuyu önyüklemek için aşağıdaki adımları izleyin:

source: Booting the {PRODUCT} Installer
id: Mem-boot Installer {PRODUCT}
tr: {PRODUCT} Kurucuyu Önyükleme

source: Plug in the boot USB drive, or insert the boot CD or DVD into your computer's optical disc drive. Alternatively, if you plan on booting from a network boot (PXE) server, make sure that the network cable is plugged in.
id: Tancapkan drive USB boot, atau masukkan CD atau DVD boot ke drive disk optik komputer Anda. Selain itu, jika Anda berencana untuk boot dari server boot jaringan (PXE), pastikan bahwa kabel jaringan dicolokkan.
tr: Önyükleme USB sürücüsünü takın, ya da önyükleme CD'sini veya DVD'sini bilgisayarınızın optik disk sürücüsüne yerleştirin. Alternatif olarak, bir ağ önyükleme (PXE) sunucusundan önyükleme yapmayı planlıyorsanız, ağ kablosunun takılı olduğundan emin olun.

source: Restart the system. Once it starts rebooting, it should display a prompt similar to the following (usually at the bottom of the screen):
id: Mulai ulang sistem. Setelah memulai reboot, itu harus menampilkan prompt mirip dengan berikut (biasanya di bagian bawah layar):
tr: Sistemi yeniden başlatın. Yeniden önyüklemeye başladığında, aşağıdakine benzer bir komut istemi göstermelidir (genellikle ekranın altında):

source: Follow the on-screen instructions to access the boot menu. If no instructions are displayed (some systems only display a graphical logo during early stages of boot), try pressing kbd:[F12], kbd:[F11], kbd:[F10] or kbd:[Del] several times; these are most commonly used keys. Note that there is usually a very short time window provided to access the menu; once it passes, you need to restart the system and try again.
id: Ikuti petunjuk di layar untuk mengakses menu boot. Jika tidak ada instruksi yang ditampilkan (beberapa sistem hanya menampilkan logo grafis selama tahap awal boot), coba tekan kbd:[F12], kbd:[F11], kbd:[F10], atau kbd:[Del] beberapa kali; ini adalah tombol yang paling umum digunakan. Perhatikan bahwa biasanya ada selang waktu yang sangat singkat yang disediakan untuk mengakses menu; setelah itu berlalu, Anda perlu me-restart sistem dan mencoba lagi.
tr: Önyükleme menüsüne erişmek için ekrandaki talimatları izleyin. Hiçbir talimat görüntülenmezse (bazı sistemler önyüklemenin ilk aşamalarında yalnızca grafiksel bir logo görüntüler), kbd:[F12], kbd:[F11], kbd:[F10] veya kbd:[Del] tuşlarına birkaç kez basmayı deneyin; bunlar en sık kullanılan tuşlardır. Menüye erişmek için genellikle çok kısa bir zaman aralığı olduğunu unutmayın; kaçırırsanız, sistemi yeniden başlatmanız ve tekrar denemeniz gerekir.

source: Some older systems may not support choosing a boot device at startup. In that case, enter the system's SETUP (BIOS), and change the default boot order so that your boot media (CD, DVD, USB or network) has higher priority than internal hard drives.
id: Beberapa sistem yang lebih tua mungkin tidak mendukung pemilihan perangkat boot saat startup. Dalam hal ini, masuklah ke sistem SETUP (BIOS), dan ubah urutan boot default sehingga media boot (CD, DVD, USB, atau jaringan) memiliki prioritas yang lebih tinggi daripada hard drive internal.
tr: Bazı eski sistemler başlangıçta bir önyükleme aygıtı seçmeyi desteklemeyebilir. Bu durumda, sistemin SETUP (BIOS) menüsüne girin ve önyükleme ortamınızın (CD, DVD, USB veya ağ) dahili sabit sürücülerden daha yüksek önceliğe sahip olması için öntanımlı önyükleme sırasını değiştirin.

source: On Mac hardware, hold down the kbd:[Option] key to enter the boot media selection menu.
id: Pada perangkat keras Mac, tahan tombol kbd:[Option] untuk masuk ke menu pemilihan media boot.
tr: Mac bilgisayarlarda, önyükleme ortamı seçim menüsüne girmek için kbd:[Alt] tuşuna basılı tutun.

source: When your system's boot menu opens, select an entry such as `Boot from USB` if you created a bootable USB drive, `Boot from CD/DVD` if you are using an optical disc to install {PRODUCT}, or `Boot from PXE` if you want to boot from a network location.
id: Ketika menu boot sistem Anda terbuka, pilih entri seperti `Boot dari USB` jika Anda membuat USB drive yang dapat di-boot, `Boot dari CD/DVD` jika Anda menggunakan disk optik untuk menginstal {PRODUCT}, atau `Boot dari PXE` jika Anda ingin boot dari lokasi jaringan.
tr: Sisteminizin önyükleme menüsü açıldığında, önyüklenebilir bir USB sürücü oluşturduysanız `USB'den önyükleme`, {PRODUCT} kurmak için bir optik disk kullanıyorsanız `CD/DVD'den önyükleme` veya bir ağ konumundan önyükleme yapmak istiyorsanız `PXE'den önyükleme` gibi bir seçeneği seçin.

source: Wait until the boot menu is displayed. The boot menu is described further in this chapter.
id: Tunggu sampai menu boot ditampilkan. Menu boot dijelaskan lebih lanjut dalam bab ini.
tr: Önyükleme menüsü görüntülenene kadar bekleyin. Önyükleme menüsü bu bölümün ilerisinde daha ayrıntılı olarak açıklanmaktadır.

source: The Boot Menu
id: Menu Boot
tr: Önyükleme Menüsü

source: In most cases, when you boot the {PRODUCT} installer from your prepared boot media or server, the boot menu will be the first thing that appears. From this menu, you can either start the actual installation, or you can use the boot media to rescue an existing system.
id: Dalam kebanyakan kasus, ketika Anda mem-boot installer {PRODUCT} dari media boot yang Anda siapkan atau server, menu boot akan menjadi hal pertama yang muncul. Dari menu ini, Anda dapat memulai instalasi aktual, atau Anda dapat menggunakan media boot untuk menyelamatkan sistem yang sudah ada.
tr: Çoğu durumda, {PRODUCT} kurucuyu hazırladığınız önyükleme ortamından veya sunucusundan önyüklediğinizde, önyükleme menüsü ilk görünen şey olacaktır. Bu menüden, gerçek kurulumu başlatabilir veya varolan bir sistemi kurtarmak için önyükleme ortamını kullanabilirsiniz.

source: The way the boot menu will look and function will vary somewhat depending on your system's firmware - BIOS systems use the [application]*SYSLINUX* boot loader, and UEFI systems use [application]*GRUB2*. However, both of the menus described below function very similarly from a user's point of view.
id: Cara menu boot akan terlihat dan berfungsi akan bervariasi tergantung pada firmware sistem Anda - sistem BIOS menggunakan boot loader [application]*SYSLINUX*, dan sistem UEFI menggunakan [application]*GRUB2*. Namun, kedua menu yang dijelaskan di bawah ini berfungsi sangat mirip dari sudut pandang pengguna.
tr: Önyükleme menüsünün görünümü ve işlevi, sisteminizin ürün yazılımına bağlı olarak biraz değişecektir - BIOS sistemleri [application]*SYSLINUX*, UEFI sistemleri [application]*GRUB2* önyükleyicisini kullanmaktadır. Bununla birlikte, aşağıda açıklanan menülerin her ikisi de kullanıcının bakış açısından çok benzer şekilde çalışmaktadır.

source: Use arrow keys to select an entry in the menu, and kbd:[Enter] to confirm your selection. The first two entries in the list will both proceed with the installation; the first one will start the installer directly, and the second one will verify the integrity of the boot media before starting the installation.
id: Gunakan tombol panah untuk memilih entri dalam menu, dan kbd:[Enter] untuk mengkonfirmasi pilihan Anda. Dua entri pertama dalam daftar akan melanjutkan dengan instalasi; yang pertama akan memulai installer secara langsung, dan yang kedua akan memverifikasi integritas media boot sebelum memulai instalasi.
tr: Menüden bir seçenek seçmek için ok tuşlarını kullanın ve seçiminizi onaylamak için kbd:[Enter] tuşuna basın. Listedeki ilk iki seçeneğin her ikisi de kurulum işlemine devam edecektir; birincisi kurucuyu doğrudan başlatacak, ikincisi kuruluma başlamadan önce önyükleme ortamının bütünlüğünü doğrulayacaktır.

source: The final entry in the list is `Troubleshooting`pass:attributes[{blank}]; this is a submenu. Selecting this entry and pressing kbd:[Enter] will display a new set of selections, where you can choose to install in basic graphics mode (useful if you want to do a manual graphical installation but your system has issues with the default graphical installer), rescue an existing system, or test your system's memory modules for errors (on BIOS systems only). The troubleshooting menu also allows you to exit the boot menu and boot normally from your system's hard drive via the `Boot from local drive` option.
id: Entri terakhir dalam daftar adalah `Troubleshooting`pass:attributes[{blank}]; ini adalah sub menu. Memilih entri ini dan menekan kbd:[Enter] akan menampilkan serangkaian pilihan baru, dimana Anda dapat memilih untuk menginstal dalam mode grafis dasar (berguna jika Anda ingin melakukan instalasi grafis manual tetapi sistem Anda memiliki masalah dengan installer grafis default), menyelamatkan sistem yang ada, atau menguji modul memori sistem Anda untuk kesalahan (pada sistem BIOS saja). Menu pemecahan masalah juga memungkinkan Anda untuk keluar dari menu boot dan boot normal dari hard drive sistem Anda melalui opsi `Boot dari drive lokal`.
tr: Listedeki son seçenek `Sorun Giderme`pass:attributes[{blank}] alt menüsüdür. Bu seçeneği seçtiğinizde ve kbd:[Enter] tuşuna bastığınızda, temel grafiksel mod kurulumunu (elle grafiksel kurulum yapmak istiyorsanız, ancak sisteminizde öntanımlı grafiksel kurucuyla ilgili sorunlar varsa), var olan bir sistemi kurtarmayı veya sisteminizin bellek modüllerini hatalara karşı test etmeyi (sadece BIOS sistemlerinde) seçebileceğiniz yeni bir seçim kümesi görüntülenecektir. Sorun giderme menüsü ayrıca, önyükleme menüsünden çıkmanıza ve `Yerel sürücüden önyükleme yap` seçeneği aracılığıyla sisteminizin sabit diskinden normal olarak önyükleme yapmanıza olanak tanımaktadır.

source: Every menu entry in the list is a predefined set of boot options, and these options can be customized to change some aspects of the installer's behavior. To edit the default set of boot options, press kbd:[Tab] on BIOS systems, or kbd:[e] on UEFI systems. The key to use is also displayed at the bottom of the screen.
id: Setiap entri menu dalam daftar adalah suatu set standar opsi booting, dan opsi ini dapat disesuaikan untuk mengubah beberapa aspek perilaku penginstal. Untuk menyunting set default opsi boot, tekan kbd:[Tab] pada sistem BIOS, atau kbd:[e] pada sistem UEFI. Tombol yang digunakan juga ditampilkan di bagian bawah layar.
tr: Listedeki her menü ögesi, önceden tanımlanmış bir önyükleme seçenekleri kümesidir ve bu seçenekler, kurucunun davranışının bazı yönlerini değiştirmek için özelleştirilebilir. Öntanımlı önyükleme seçeneklerini ayarlamak için, BIOS sistemlerinde kbd:[Tab] tuşuna veya UEFI sistemlerinde kbd:[e] tuşuna basın. Kullanılacak tuş ayrıca ekranın altında görüntülenir.

source: Editing boot options in [application]*GRUB2* (on UEFI systems) will display the entire configuration for the selected entry. Actual boot options are configured on the line which starts with the `linux` (or `linux16` or `linuxefi`) keyword. Do not modify any other lines in the configuration.
id: Menyunting opsi boot di [application]*GRUB2* (pada sistem UEFI) akan menampilkan seluruh konfigurasi untuk entri yang dipilih. Opsi boot aktual dikonfigurasi pada baris yang diawali dengan kata kunci `linux` (atau `linux16` atau `linuxefi`). Jangan mengubah baris lain dalam konfigurasi.
tr: [application]*GRUB2*'deki (UEFI sistemlerinde) önyükleme seçeneklerini düzenlemek, seçilen öge için tüm yapılandırmayı görüntüleyecektir. Gerçek önyükleme seçenekleri, `linux` (ya da `linux16` veya `linuxefi`) anahtar kelimesiyle başlayan satırda yapılandırılmaktadır. Yapılandırmadaki diğer satırlarda değişiklik yapmayın.

source: On systems with BIOS firmware, only the actual boot options are displayed when you press kbd:[Tab].
id: Pada sistem dengan firmware BIOS, hanya opsi boot aktual yang ditampilkan saat Anda menekan kbd:[Tab].
tr: BIOS ürün yazılımına sahip sistemlerde, kbd:[Tab] tuşuna bastığınızda sadece gerçek önyükleme seçenekleri görüntülenir.

source: When editing the default set of options, you can change the existing ones as well as append additional ones. Once you finish, press kbd:[Enter] on BIOS or kbd:[Ctrl + X] on UEFI to boot the installer using your customized options.
id: Ketika menyunting set default pilihan, Anda dapat mengubah yang sudah ada serta menambahkan yang lain. Setelah Anda selesai, tekan kbd:[Enter] pada BIOS atau kbd:[Ctrl + X] pada UEFI untuk mem-boot installer menggunakan opsi ubahan Anda.
tr: Öntanımlı seçenekleri düzenlerken, var olan seçenekleri değiştirmenin yanı sıra başka seçenekler ekleyebilirsiniz. İşiniz bittiğinde, özelleştirilmiş seçeneklerinizi kullanarak kurucuyu önyüklemek için BIOS sistemlerde kbd:[Enter], UEFI sistemlerde kbd:[Ctrl + X] tuşlarına basın.

source: Editing boot options on a system with BIOS firmware
id: Menyunting opsi boot pada sistem dengan firmware BIOS
tr: BIOS ürün yazılımına sahip bir sistemdeki önyükleme seçeneklerini düzenleme

source: The boot menu.
id: Menu boot.
tr: Önyükleme menüsü.

source: All available [application]*Anaconda* boot options are described in xref:../advanced/Boot_Options.adoc#sect-boot-options-available[Available Boot Options].
tr: Kullanılabilir tüm [application]*Anaconda* önyükleme seçenekleri xref:../advanced/Boot_Options.adoc#sect-boot-options-available[Kullanılabilir Önyükleme Seçenekleri] bölümünde açıklanmaktadır.

source: Press F12 to select boot device, or Del to enter SETUP
id: Tekan F12 untuk memilih perangkat boot, atau Del untuk masuk ke SETUP
