Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/install/Installing_Using_Anaconda.po
Languages: id

source: Installing Using Anaconda
id: Instalasi Menggunakan Anaconda

source: This chapter provides step-by-step instructions for installing {PRODUCT} using the [application]*Anaconda* installer. The bulk of this chapter describes installation using the graphical user interface. A text mode is also available for systems with no graphical display, but this mode is limited in certain aspects (for example, custom partitioning is not possible in text mode).
id: Bab ini memberikan petunjuk langkah demi langkah untuk menginstal {PRODUCT} menggunakan penginstal [application]*Anaconda*. Sebagian besar bab ini menjelaskan instalasi menggunakan antarmuka pengguna grafis. Mode teks juga tersedia untuk sistem tanpa tampilan grafis, tetapi mode ini terbatas pada aspek tertentu (misalnya, partisi kustom tidak mungkin dalam mode teks).

source: If your system does not have the ability to use the graphical mode, you can:
id: Jika sistem Anda tidak memiliki kemampuan untuk menggunakan mode grafis, Anda dapat:

source: Introduction to Anaconda
id: Pengantar Anaconda

source: The {PRODUCT} installer, [application]*Anaconda*, is different from most other operating system installation programs due to its parallel nature. Most installers follow a fixed path: you must choose your language first, then you configure network, then installation type, then partitioning, etc. There is usually only one way to proceed at any given time.
id: Installer {PRODUCT}, [application]*Anaconda*, berbeda dari kebanyakan program instalasi sistem operasi lain karena sifatnya yang paralel. Kebanyakan installer mengikuti jalur tetap: Anda harus memilih bahasa Anda terlebih dahulu, kemudian Anda mengkonfigurasi jaringan, kemudian jenis instalasi, kemudian partisi, dll. Biasanya hanya ada satu cara untuk melanjutkan pada waktu tertentu.

source: In [application]*Anaconda* you are only required to select your language and locale first, and then you are presented with a central screen, where you can configure most aspects of the installation in any order you like. This does not apply to all parts of the installation process, however - for example, when installing from a network location, you must configure the network before you can select which packages to install.
id: Dalam [application]*Anaconda* Anda pertama hanya diminta untuk memilih bahasa dan lokal, dan kemudian Anda disajikan dengan layar utama, di mana Anda dapat mengkonfigurasi sebagian besar aspek instalasi dalam urutan apapun yang Anda suka. Hal ini tidak berlaku untuk semua bagian dari proses instalasi, namun - misalnya, ketika menginstal dari lokasi jaringan, Anda harus mengkonfigurasi jaringan sebelum Anda dapat memilih paket untuk menginstal.

source: Some screens will be automatically configured depending on your hardware and the type of media you used to start the installation. You can still change the detected settings in any screen. Screens which have not been automatically configured, and therefore require your attention before you begin the installation, are marked by an exclamation mark. You can not start the actual installation process before you finish configuring these settings.
id: Beberapa layar akan dikonfigurasi secara otomatis tergantung pada perangkat keras Anda dan jenis media yang Anda gunakan untuk memulai penginstalan. Anda masih dapat mengubah setelan yang terdeteksi di layar apa pun. Layar yang belum dikonfigurasi secara otomatis, dan karena itu memerlukan perhatian Anda sebelum Anda memulai instalasi, ditandai dengan tanda seru. Anda tidak dapat memulai proses instalasi aktual sebelum Anda selesai mengkonfigurasi pengaturan ini.

source: Additional differences appear in certain screens; notably the custom partitioning process is very different from other Linux distributions. These differences are described in each screen's subsection.
id: Perbedaan tambahan muncul di layar tertentu; terutama proses partisi kustom sangat berbeda dari distribusi Linux lainnya. Perbedaan ini dijelaskan dalam sub bagian layar.

source: Consoles and Logging During the Installation
id: Konsol dan Pencatatan Log selama Instalasi

source: The following sections describe how to access logs and an interactive shell during the installation. This is useful when troubleshooting problems, but should not be necessary in most cases.
id: Bagian berikut ini menjelaskan cara mengakses log dan shell interaktif selama penginstalan. Hal ini berguna ketika memecahkan masalah, tetapi seharusnya tidak diperlukan dalam banyak kasus.

source: Accessing Consoles
id: Mengakses Konsol

source: The {PRODUCT} installer uses the [application]*tmux* terminal multiplexer to display and control several windows you can use in addition to the main interface. Each of these windows serves a different purpose - they display several different logs, which can be used to troubleshoot any issues during the installation, and one of the windows provides an interactive shell prompt with `root` privileges, unless this prompt was specifically disabled using a boot option or a Kickstart command.
id: Installer {PRODUCT} menggunakan terminal multiplexer [application]*tmux* untuk menampilkan dan mengontrol beberapa jendela yang dapat Anda gunakan selain antarmuka utama. Setiap jendela ini melayani tujuan yang berbeda - mereka menampilkan beberapa log yang berbeda, yang dapat digunakan untuk memecahkan masalah apapun selama instalasi, dan salah satu jendela menyediakan prompt shell interaktif dengan hak `root`, kecuali prompt ini secara khusus dinonaktifkan dengan menggunakan suatu opsi boot atau suatu perintah Kickstart.

source: In general, there is no reason to leave the default graphical installation environment unless you need to diagnose an installation problem.
id: Secara umum, tidak ada alasan untuk meninggalkan lingkungan instalasi grafis default kecuali jika Anda perlu untuk mendiagnosa masalah instalasi.

source: The terminal multiplexer is running in virtual console 1. To switch from the actual installation environment to [application]*tmux*, press kbd:[Ctrl + Alt + F1]. To go back to the main installation interface which runs in virtual console 6, press kbd:[Ctrl + Alt + F6].
id: Terminal multiplexer berjalan di konsol virtual 1. Untuk beralih dari lingkungan instalasi aktual ke [application]*tmux*, tekan kbd:[Ctrl + Alt + F1]. Untuk kembali ke antarmuka instalasi utama yang berjalan di konsol virtual 6, tekan kbd:[Ctrl + Alt + F6].

source: If you choose text mode installation, you will start in virtual console 1 ([application]*tmux*), and switching to console 6 will open a shell prompt instead of a graphical interface.
id: Jika Anda memilih instalasi mode teks, Anda akan mulai di konsol virtual 1 ([application]*tmux*), dan beralih ke konsol 6 akan membuka prompt shell bukan antarmuka grafis.

source: The console running [application]*tmux* has 5 available windows; their contents are described in the table below, along with keyboard shortcuts used to access them. Note that the keyboard shortcuts are two-part: first press kbd:[Ctrl + b], then release both keys, and press the number key for the window you want to use.
id: Konsol yang menjalankan [application]*tmux* memiliki 5 jendela yang tersedia; isinya dijelaskan dalam tabel di bawah ini, bersama dengan pintasan papan tik yang digunakan untuk mengaksesnya. Perhatikan bahwa pintasan papan tik punya dua bagian: pertama tekan kbd:[Ctrl + b], kemudian lepaskan kedua tombol, dan tekan tombol angka untuk jendela yang ingin Anda gunakan.

source: You can also use kbd:[Ctrl + b] kbd:[n] and kbd:[Ctrl + b] kbd:[p] to switch to the next or previous [application]*tmux* window, respectively.
id: Anda juga dapat menggunakan kbd:[Ctrl + b] kbd:[n] dan kbd:[Ctrl + b] kbd:[p] untuk beralih ke jendela [application]*tmux* berikutnya atau sebelumnya.

source: Available tmux Windows
id: Jendela tmux yang Tersedia

source: |Shortcut|Contents |kbd:[Ctrl + b] kbd:[1]|Main installation program window. Contains text-based prompts (during text mode installation or if you use VNC direct mode), and also some debugging information. |kbd:[Ctrl + b] kbd:[2]|Interactive shell prompt with `root` privileges. |kbd:[Ctrl + b] kbd:[3]|Installation log; displays messages stored in `/tmp/anaconda.log`. |kbd:[Ctrl + b] kbd:[4]|Storage log; displays messages related storage devices from kernel and system services, stored in `/tmp/storage.log`. |kbd:[Ctrl + b] kbd:[5]|Program log; displays messages from other system utilities, stored in `/tmp/program.log`.
id: |Pintasan|Isi |kbd:[Ctrl + b] kbd:[1]|Jendela program instalasi utama. Berisi prompt berbasis teks (selama instalasi mode teks atau jika Anda menggunakan mode langsung VNC), dan juga beberapa informasi debug. |kbd:[Ctrl + b] kbd:[2]|Prompt shell interaktif dengan hak `root`. |kbd:[Ctrl + b] kbd:[3]|Log instalasi; menampilkan pesan yang disimpan di `/tmp/anaconda.log`. |kbd:[Ctrl + b] kbd:[4]|Log penyimpanan; menampilkan pesan yang terkait perangkat penyimpanan dari kernel dan layanan sistem, disimpan dalam `/tmp/storage.log`. |kbd:[Ctrl + b] kbd:[5]|Log program; menampilkan pesan dari utilitas sistem lain, disimpan dalam `/tmp/program.log`.

source: Saving Screenshots
id: Menyimpan Tangkapan Layar

source: You can press kbd:[Shift + Print Screen] at any time during the graphical installation to capture the current screen. These screenshots are saved to `/tmp/anaconda-screenshots`.
id: Anda dapat menekan kbd:[Shift + Print Screen] setiap saat selama instalasi grafis untuk menangkap layar saat ini. Tangkapan layar ini disimpan ke `/tmp/anaconda-screenshots`.

source: Installing in Text Mode
id: Instalasi dalam Mode Teks

source: Text mode installation offers an interactive, non-graphical interface for installing {PRODUCT}. This may be useful on systems with no graphical capabilities; however, you should always consider the available alternatives before starting a text-based installation. Text mode is limited in the amount of choices you can make during the installation.
id: Penginstalan mode teks menawarkan antarmuka interaktif dan non-grafis untuk menginstal {PRODUCT}. Ini mungkin berguna pada sistem tanpa kemampuan grafis; namun, Anda harus selalu mempertimbangkan alternatif yang tersedia sebelum memulai instalasi berbasis teks. Mode teks terbatas dalam jumlah pilihan yang dapat Anda buat selama instalasi.

source: Text Mode Installation
id: Instalasi Mode Teks

source: The main menu in during a text-based installation.
id: Menu utama selama instalasi berbasis teks.

source: Installation in text mode follows a pattern similar to the graphical installation: There is no single fixed progression; you can configure many settings in any order you want using the main status screen. Screens which have already been configured, either automatically or by you, are marked as `[x]`, and screens which require your attention before the installation can begin are marked with `[!]`. Available commands are displayed below the list of available options.
id: Instalasi dalam mode teks mengikuti pola yang mirip dengan instalasi grafis: Tidak ada satu kemajuan yang tetap; Anda dapat mengonfigurasi banyak pengaturan dalam urutan apa pun yang Anda inginkan menggunakan layar status utama. Layar yang telah dikonfigurasi, baik secara otomatis atau oleh Anda, ditandai sebagai `[x]`, dan layar yang memerlukan perhatian Anda sebelum instalasi dapat mulai ditandai dengan `[!]`. Perintah yang tersedia ditampilkan di bawah daftar opsi yang tersedia.

source: Limits of interactive text mode installation include:
id: Batas penginstalan mode teks interaktif meliputi:

source: The installer will always use the English language and the US English keyboard layout. You can configure your language and keyboard settings, but these settings will only apply to the installed system, not to the installation.
id: Penginstal akan selalu menggunakan bahasa Inggris dan tata letak papan tik bahasa Inggris AS. Anda dapat mengonfigurasi setelan bahasa dan papan ketik, namun setelan ini hanya akan diterapkan ke sistem yang terinstal, bukan ke penginstalan.

source: You can not configure any advanced storage methods (LVM, software RAID, FCoE, zFCP and iSCSI).
id: Anda tidak dapat mengkonfigurasi metode penyimpanan canggih (LVM, perangkat lunak RAID, FCoE, zFCP, dan iSCSI).

source: It is not possible to configure custom partitioning; you must use one of the automatic partitioning settings. You also cannot configure where the boot loader will be installed.
id: Tidak mungkin untuk mengkonfigurasi partisi kustom; Anda harus menggunakan salah satu pengaturan partisi otomatis. Anda juga tidak dapat mengkonfigurasi dimana boot loader akan diinstal.

source: Installing in the Graphical User Interface
id: Instalasi di Antarmuka Pengguna Grafis

source: The graphical installation interface is the preferred method of manually installing {PRODUCT}. It allows you full control over all available settings, including custom partitioning and advanced storage configuration, and it is also localized to many languages other than English, allowing you to perform the entire installation in a different language. The graphical mode is used by default when you boot the system from local media (a CD, DVD or a USB flash drive).
id: Antarmuka instalasi grafis adalah metode yang disukai secara manual menginstal {PRODUCT}. Hal ini memungkinkan Anda kontrol penuh atas semua pengaturan yang tersedia, termasuk partisi kustom dan konfigurasi penyimpanan canggih, dan juga dilokalkan untuk banyak bahasa selain bahasa Inggris, memungkinkan Anda untuk melakukan seluruh instalasi dalam bahasa yang berbeda. Mode grafis digunakan secara default ketika Anda boot sistem dari media lokal (CD, DVD, atau USB flash drive).

source: The sections below discuss each screen available in the installation process. Note that due to the installer's parallel nature, most of the screens do not have to be completed in the order in which they are described here.
id: Bagian di bawah ini mendiskusikan setiap layar yang tersedia dalam proses instalasi. Catatan bahwa karena paralelnya installer, sebagian besar layar tidak harus diselesaikan dalam urutan yang dijelaskan di sini.

source: Each screen in the graphical interface contains a `Help` button. This button opens the [application]*Yelp* help browser displaying the section of the _{PRODUCT} Installation Guide_ relevant to the current screen.
id: Setiap layar dalam antarmuka grafis berisi tombol `Help`. Tombol ini membuka peramban bantuan [application]*Yelp* yang menampilkan bagian dari _Panduan Instalasi {PRODUCT}_ yang relevan dengan layar saat ini.

source: You can also control the graphical installer with your keyboard. Use kbd:[Tab] and kbd:[Shift + Tab] to cycle through active control elements (buttons, check boxes, etc.) on the current screen, kbd:[Up] and kbd:[Down] arrow keys to scroll through lists, and kbd:[Left] and kbd:[Right] to scroll through horizontal toolbars or table entries. kbd:[Space] or kbd:[Enter] can be used to select or remove a highlighted item from selection and to expand and collapse drop-down menus.
id: Anda juga dapat mengontrol penginstal grafis dengan papan tik. Gunakan kbd:[Tab] dan kbd:[Shift + Tab] untuk siklus melalui elemen kontrol aktif (tombol, kotak centang, dll) pada layar saat ini, tombol panah kbd:[Up] dan kbd:[Down] untuk menggulir daftar, dan kbd:[Left] dan kbd:[Right] untuk menggulir melalui bilah alat horisontal atau entri tabel. kbd:[Space] atau kbd:[Enter] dapat digunakan untuk memilih atau menghapus butir yang disorot dari pilihan dan untuk mengembang dan menguncupkan menu drop-down.

source: Additionally, elements in each screen can be toggled using their respective shortcuts. These shortcuts are highlighted (underlined) when you hold down the kbd:[Alt] key; to toggle that element, press kbd:[Alt + _X_pass:attributes[{blank}]], where _X_ is the highlighted letter.
id: Selain itu, elemen di setiap layar dapat dijungkitkan menggunakan pintasan masing-masing. Pintasan ini disorot (digarisbawahi) saat Anda menekan tombol kbd:[Alt]; untuk menjungkit elemen tersebut, tekan kbd:[Alt + _X_pass:attributes[{blank}]], dimana _X_ adalah huruf yang disorot.

source: Your current keyboard layout is displayed in the top right hand corner. Only one layout is configured by default; if you configure more than layout in the `Keyboard Layout` screen (xref:Installing_Using_Anaconda.adoc#sect-installation-gui-keyboard-layout[Keyboard Layout]), you can switch between them by clicking the layout indicator.
id: Tata letak papan tik Anda saat ini ditampilkan di sudut kanan atas. Hanya satu tata letak yang dikonfigurasi secara default; jika Anda mengkonfigurasi lebih dari tata letak di layar `Tata Letak Papan Tik` (xref:sect-installation-gui-keyboard-layout[Tata Letak Papan Tik]), Anda dapat beralih di antara mereka dengan mengklik indikator tata letak.
