Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/install/Troubleshooting.po
Languages: id

source: Troubleshooting
id: Penyelesaian Masalah

source: This chapter offers some pointers on how to get help when something goes wrong. It also discusses some common installation problems and their solutions.
id: Bab ini menawarkan beberapa petunjuk tentang cara mendapatkan bantuan ketika sesuatu bermasalah. Hal ini juga membahas beberapa masalah umum instalasi dan solusi mereka.

source: Getting Help
id: Mendapatkan Bantuan

source: There are many places on the internet which can help you when you encounter a problem not described in this chapter: discussion boards, blogs, IRC, and more. Some of the more popular places where you can find help include:
id: Ada banyak tempat di internet yang dapat membantu Anda ketika Anda menghadapi masalah yang tidak dijelaskan dalam bab ini: papan diskusi, blog, IRC, dan banyak lagi. Beberapa tempat yang lebih populer di mana Anda dapat menemukan bantuan termasuk:

source: link:++https://ask.fedoraproject.org/en/questions/++[Ask Fedora] - Fedora's knowledge base, available in multiple languages
id: link:++https://ask.fedoraproject.org/en/questions/++[Tanya Fedora] - basis pengetahuan Fedora, tersedia dalam berbagai bahasa

source: link:++https://fedoraproject.org/wiki/++[Fedora Project Wiki] - the official wiki for Fedora Project
id: link:++https://fedoraproject.org/wiki/++[Wiki Proyek Fedora] - wiki resmi untuk Proyek Fedora

source: The above list is by no means complete - you can find help in many other places as well. Additional information about available resources such as IRC channels and mailing lists is available at link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[].
id: Daftar di atas tidak lengkap - Anda dapat menemukan bantuan di banyak tempat lain juga. Informasi tambahan tentang sumber daya yang tersedia seperti saluran IRC dan milis tersedia di link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[].

source: Before you open a new discussion or ask anyone for help on IRC, you should always do some research on your own. If you are encountering an issue, there is usually a good chance that someone else ran into the same problem before you and published a solution somewhere. Opening a discussion about something already explained elsewhere, or asking a common question which has been answered many times before, is not likely to result in a friendly, constructive response.
id: Sebelum Anda membuka diskusi baru atau meminta siapa pun untuk bantuan di IRC, Anda harus selalu melakukan penelitian sendiri. Jika Anda mengalami masalah, biasanya ada kemungkinan besar bahwa orang lain juga mengalami masalah yang sama sebelum Anda dan menerbitkan sebuah solusi di suatu tempat. Membuka diskusi tentang sesuatu yang sudah dijelaskan di tempat lain, atau mengajukan pertanyaan umum yang telah dijawab berkali-kali sebelumnya, kurang mungkin menghasilkan respon yang ramah dan konstruktif.

source: When you ask for help troubleshooting problems related to the installation, you may be asked to provide log files generated by the installer. The sections below explain which files are generated, what their contents are, and how to transfer them from the installation system.
id: Ketika Anda meminta bantuan pemecahan masalah yang berkaitan dengan instalasi, Anda mungkin diminta untuk memberikan berkas log yang dihasilkan oleh installer. Bagian di bawah menjelaskan berkas mana yang dihasilkan, apa isinya, dan bagaimana untuk mentransfer mereka dari sistem instalasi.

source: Log Files Generated During the Installation
id: Berkas Log yang Dihasilkan Selama Instalasi

source: For debugging purposes, [application]*Anaconda* logs installation actions into files in the `/tmp` directory. These files are listed in the following table.
id: Untuk keperluan debug, [application]*Anaconda* mencatat log aksi instalasi ke berkas dalam direktori `/tmp`. Berkas-berkas ini tercantum dalam tabel berikut.

source: Log Files and Their Contents
id: Berkas Log dan Isinya

source: |Log file|Contents |`/tmp/anaconda.log`|general [application]*Anaconda* messages |`/tmp/program.log`|all external programs run during the installation |`/tmp/storage.log`|extensive storage module information |`/tmp/packaging.log`|[application]*dnf* and [application]*rpm* package installation messages |`/tmp/syslog`|hardware-related system messages
id: |Berkas log|Isi |`/tmp/anaconda.log`|pesan umum [application]*Anaconda* |`/tmp/program.log`|semua program eksternal yang dijalankan selama instalasi |`/tmp/storage.log`|informasi modul penyimpanan ekstensif |`/tmp/packaging.log`|pesan instalasi paket [application]*dnf* dan [application]*rpm* |`/tmp/syslog`|pesan sistem yang terkait dengan perangkat keras

source: If the installation fails, the messages from these files are consolidated into `/tmp/anaconda-tb-_identifier_pass:attributes[{blank}]`, where _identifier_ is a random string.
id: Jika penginstalan gagal, pesan dari berkas ini dikonsolidasikan ke `/tmp/anaconda-tb-_identifier_pass:attributes[{blank}]`, dimana _identifier_ adalah string acak.

source: Transferring Log Files from the Installation System
id: Mentransfer Berkas Log dari Sistem Instalasi

source: On the system you are installing, press kbd:[Ctrl + Alt + F2] to access a shell prompt. You will be logged into a root account and you will have access to the installation program's temporary file system.
id: Pada sistem yang sedang Anda instal, tekan kbd:[Ctrl + Alt + F2] untuk mengakses prompt shell. Anda akan login ke akun root dan Anda akan memiliki akses ke sistem berkas sementara miliki program instalasi.

source: Connect a USB flash drive to the system and execute the [command]#dmesg# command. A log detailing all recent events will be displayed. At the bottom of this log, you will see a set of messages caused by the USB flash drive you just connected. It will look like a set of lines similar to the following:
id: Hubungkan USB flash drive ke sistem dan jalankan perintah [command]#dmesg#. Log merinci semua peristiwa terbaru akan ditampilkan. Di bagian bawah log ini, Anda akan melihat sekumpulan pesan yang disebabkan oleh USB flash drive yang baru saja Anda hubungkan. Ini akan terlihat seperti serangkaian baris yang mirip dengan berikut ini:

source: Note the name of the connected device - in the above example, it is `sdb`.
id: Perhatikan nama perangkat yang terhubung - dalam contoh di atas, itu adalah `sdb`.

source: Go to the `/mnt` directory and once there, create new directory which will serve as the mount target for the USB drive. The name of the directory does not matter; this example uses the name `usb`.
id: Pergi ke direktori `/mnt` dan setelah berada di sana, buat direktori baru yang akan berfungsi sebagai target mount untuk drive USB. Nama direktori tidak penting; contoh ini menggunakan nama `usb`.

source: Mount the USB flash drive onto the newly created directory. Note that in most cases, you do not want to mount the whole drive, but a partition on it. Therefore, do not use the name `sdb` - use the name of the partition you want to write the log files to. In this example, the name `sdb1` is used.
id: Kaitkan USB flash drive ke direktori yang baru dibuat. Perhatikan bahwa dalam kebanyakan kasus, Anda tidak ingin mengait seluruh drive, tapi partisi di atasnya. Oleh karena itu, jangan gunakan nama `sdb` - gunakan nama partisi yang ingin Anda tulisi berkas log. Dalam contoh ini, nama `sdb1` digunakan.

source: You can now verify that you mounted the correct device and partition by accessing it and listing its contents - the list should match what you expect to be on the drive.
id: Anda sekarang dapat memverifikasi bahwa Anda memasang perangkat dan partisi yang benar dengan mengaksesnya dan menampilkan isinya - daftar harus sesuai dengan apa yang Anda harapkan untuk berada di drive.

source: Copy the log files to the mounted device.
id: Salin berkas log ke peranti terpasang.

source: Unmount the USB flash drive. If you get an error message saying that the target is busy, change your working directory to outside the mount (for example, `/`).
id: Lepas kait USB flash drive. Jika Anda mendapatkan pesan kesalahan yang mengatakan bahwa target sedang sibuk, ubah direktori kerja Anda ke luar kait (misalnya, `/`).

source: The log files from the installation are now saved on the USB flash drive.
id: Berkas log dari instalasi sekarang disimpan pada USB flash drive.

source: Switch to the `/tmp` directory where the log files are located:
id: Beralihlah ke direktori `/tmp` tempat berkas log terletak:

source: Copy the log files onto another system on the network using the [command]#scp# command:
id: Salin berkas log ke sistem lain pada jaringan menggunakan perintah [command]#scp#:

source: Replace _user_ with a valid user name on the target system, _address_ with the target system's address or host name, and _path_ with the path to the directory you wish to save the log files into. For example, if you want to log in as `john` to a system with an IP address of `192.168.0.122` and place the log files into the `/home/john/logs/` directory on that system, the command will have the following form:
id: Gantikan _user_ dengan nama pengguna yang valid pada sistem target, _address_ dengan alamat sistem target atau nama host, dan _path_ dengan path ke direktori tempat Anda ingin menyimpan berkas log. Misalnya, jika Anda ingin masuk sebagai `john` ke sistem dengan alamat IP `192.168.0.122` dan menempatkan berkas log ke dalam direktori `/home/john/logs/` pada sistem tersebut, perintah akan memiliki bentuk berikut:

source: When connecting to the target system for the first time, you may encounter a message similar to the following:
id: Saat menyambung ke sistem target untuk yang pertama kalinya, Anda mungkin menemui pesan yang mirip dengan berikut ini:

source: Type `yes` and press kbd:[Enter] to continue. Then, provide a valid password when prompted. The files will start transferring to the specified directory on the target system.
id: Ketik `yes` dan tekan kbd:[Enter] untuk melanjutkan. Kemudian, berikan kata sandi yang valid saat diminta. Berkas akan mulai ditransfer ke direktori yang ditentukan pada sistem target.

source: The log files from the installation are now permanently saved on the target system and available for review.
id: Berkas log dari instalasi sekarang disimpan secara permanen pada sistem target dan tersedia untuk ditinjau.

source: Trouble Beginning the Installation
id: Masalah Memulai Instalasi

source: Problems with Booting into the Graphical Installation
id: Masalah dengan Boot ke Instalasi Grafis

source: Systems with some video cards have trouble booting into the graphical installation program. If the installation program does not run using its default settings, it attempts to run in a lower resolution mode. If that still fails, the installation program attempts to run in text mode.
id: Sistem dengan beberapa kartu video mengalami kesulitan boot ke program instalasi grafis. Jika program penginstalan tidak berjalan menggunakan pengaturan default, itu mencoba untuk menjalankan dalam mode resolusi yang lebih rendah. Jika yang masih gagal, program penginstalan mencoba untuk menjalankan dalam mode teks.

source: Use the basic graphics mode
id: Menggunakan mode grafis dasar

source: You can attempt to perform the installation using the basic graphics driver. To do this, edit the installation program's boot options and append [option]#inst.xdriver=vesa# at the end of the command line.
id: Anda dapat mencoba untuk melakukan instalasi menggunakan driver grafis dasar. Untuk melakukannya, sunting opsi boot program penginstalan dan tambahkan [option]#inst.xdriver=vesa# di akhir baris perintah.

source: Specify the display resolution manually
id: Menyatakan resolusi layar secara manual

source: If the installation program fails to detect your screen resolution, you can override the automatic detection and specify it manually. To do this, append the [option]#inst.resolution=pass:attributes[{blank}]_x_pass:attributes[{blank}]# option at the boot menu, where _x_ is your display's resolution (for example, `1024x768`).
id: Jika program penginstalan gagal mendeteksi resolusi layar, Anda dapat menimpa deteksi otomatis dan menentukan secara manual. Untuk melakukannya, tambahkan opsi [option]#inst.resolution=pass:attributes[{blank}]_x_pass:attributes[{blank}]# pada menu boot, dimana _x_ adalah resolusi layar Anda (misalnya, `1024x768`).

source: Use an alternate video driver
id: Menggunakan driver video alternatif

source: You can also attempt to specify a custom video driver, overriding the installation program's automatic detection. To specify a driver, use the [option]#inst.xdriver=pass:attributes[{blank}]_x_pass:attributes[{blank}]# option, where _x_ is the device driver you want to use (for example, `nouveau`).
id: Anda juga dapat mencoba untuk menentukan driver video ubahan, menimpa deteksi otomatis program instalasi. Untuk menentukan driver, gunakan opsi [option]#inst.xdriver=pass:attributes[{blank}]_x_pass:attributes[{blank}]#, dimana _x_ adalah driver perangkat yang ingin Anda gunakan (misalnya, `nouveau`).

source: If specifying a custom video driver solves your problem, you should report it as a bug at link:++https://bugzilla.redhat.com++[] under the `anaconda` component. [application]*Anaconda* should be able to detect your hardware automatically and use the appropriate driver without your intervention.
id: Jika menentukan driver video ubahan memecahkan masalah Anda, Anda harus melaporkannya sebagai bug di link:++https://bugzilla.redhat.com++[] di bawah komponen `anaconda`. [application]*Anaconda* harus dapat mendeteksi perangkat keras Anda secara otomatis dan menggunakan driver yang sesuai tanpa intervensi Anda.

source: Perform the installation using VNC
id: Melakukan instalasi menggunakan VNC

source: Serial Console Not Detected
id: Konsol Serial Tidak Terdeteksi

source: In some cases, attempting to install in text mode using a serial console will result in no output on the console. This happens on systems which have a graphics card, but no monitor connected. If [application]*Anaconda* detects a graphics card, it will attempt to use it for a display, even if no display is connected.
id: Dalam beberapa kasus, mencoba untuk menginstal dalam mode teks menggunakan konsol serial akan menghasilkan tidak ada keluaran pada konsol. Hal ini terjadi pada sistem yang memiliki kartu grafis, tapi tidak ada monitor yang terhubung. Jika [application]*Anaconda* mendeteksi kartu grafis, itu akan mencoba untuk menggunakannya untuk tampilan, bahkan jika tidak ada layar terhubung.

source: Trouble During the Installation
id: Masalah Selama Instalasi

source: No Disks Detected
id: Tidak Ada Disk Terdeteksi

source: In the `Installation Destination` screen, the following error message may appear at the bottom: `No disks detected. Please shut down the computer, connect at least one disk, and restart to complete installation`.
id: Di layar `Tujuan Instalasi`, pesan galat berikut mungkin muncul di bagian bawah: `Tidak ada disk terdeteksi. Silakan matikan komputer, hubungkan setidaknya satu disk, dan restart untuk menyelesaikan instalasi`.

source: The message indicates that [application]*Anaconda* did not find any writable storage devices to install to. In that case, first make sure that your system does have at least one storage device attached.
id: Pesan menunjukkan bahwa [application]*Anaconda* tidak menemukan perangkat penyimpanan yang dapat ditulis untuk menginstal. Dalam hal ini, pertama-tama pastikan bahwa sistem Anda memiliki setidaknya satu perangkat penyimpanan terpasang.

source: If your system uses a hardware RAID controller, verify that the controller is properly configured and working. See your controller's documentation for instructions.
id: Jika sistem Anda menggunakan pengontrol RAID perangkat keras, verifikasikan bahwa pengontrol dikonfigurasi dengan benar dan berfungsi. Lihat dokumentasi pengontrol Anda untuk mendapatkan petunjuk.

source: If you are installing into one or more iSCSI devices and there is no local storage present on the system, make sure that all required LUNs (_Logical Unit Numbers_) are being presented to the appropriate HBA (_Host Bus Adapter_).
id: Jika Anda menginstal ke satu atau lebih perangkat iSCSI dan tidak ada penyimpanan lokal yang ada pada sistem, pastikan bahwa semua LUN (_Logical Unit Numbers_) yang diperlukan disajikan ke HBA (_Host Bus Adapter_) yang sesuai.

source: If you made sure you have a connected and properly configured storage device and the message still appears after you reboot the system and start the installation again, it means that the installation program failed to detect the storage. In most cases this message appears when you attempt to install on an SCSI device which has not been recognized by the installation program.
id: Jika Anda memastikan bahwa perangkat penyimpanan Anda telah terhubung dan dikonfigurasi dengan benar dan pesan masih muncul setelah Anda reboot sistem dan memulai instalasi lagi, itu berarti bahwa program instalasi gagal untuk mendeteksi penyimpanan. Dalam kebanyakan kasus pesan ini muncul ketika Anda mencoba untuk menginstal pada perangkat SCSI yang belum dikenali oleh program penginstalan.

source: Problems After Installation
id: Masalah Setelah Instalasi

source: Resetting the Root Password
id: Mereset Kata Sandi Root

source: If you lost the root password to the system and you have access to the boot loader, you can reset the password by editing the GRUB2 configuration.
id: Jika Anda kehilangan kata sandi root untuk sistem dan Anda memiliki akses ke boot loader, Anda dapat me-reset kata sandi dengan menyunting konfigurasi GRUB2.

source: Boot your system and wait until the GRUB2 menu appears.
id: Boot sistem Anda dan tunggu sampai menu GRUB2 muncul.

source: In the boot loader menu, highlight any entry and press kbd:[e] to edit it.
id: Dalam menu boot loader, sorot sebarang entri dan tekan kbd:[e] untuk menyuntingnya.

source: Find the line beginning with `linux`. At the end of this line, append the following:
id: Cari baris yang diawali dengan `linux`. Pada akhir baris ini, tambahkan yang berikut ini:

source: Press kbd:[F10] or kbd:[Ctrl + X] to boot the system using the options you just edited.
id: Tekan kbd:[F10] atau kbd:[Ctrl + X] untuk mem-boot sistem menggunakan opsi yang baru saja Anda sunting.

source: Once the system boots, you will be presented with a shell prompt without having to enter any user name or password:
id: Setelah sistem boot, Anda akan disajikan dengan prompt shell tanpa harus memasukkan nama pengguna atau kata sandi:

source: Load the installed SELinux policy:
id: Memuat kebijakan SELinux yang terinstal:

source: Execute the following command to remount your root partition:
id: Jalankan perintah berikut untuk mengait ulang partisi root Anda:

source: Reset the root password:
id: Mereset kata sandi root:

source: When prompted to, enter your new root password and confirm by pressing the kbd:[Enter] key. Enter the password for the second time to make sure you typed it correctly and confirm with kbd:[Enter] again. If both passwords match, a message informing you of a successful root password change will appear.
id: Saat diminta, masukkan kata sandi root baru Anda dan konfirmasikan dengan menekan tombol kbd:[Enter]. Masukkan kata sandi untuk kedua kalinya untuk memastikan Anda mengetiknya dengan benar dan konfirmasikan dengan kbd:[Enter] lagi. Jika kedua kata sandi cocok, pesan yang memberitahukan Anda tentang perubahan kata sandi root yang berhasil akan muncul.

source: Remount the root partition again, this time as read-only:
id: Kaitkan ulang partisi root lagi, kali ini hanya-baca:

source: Reboot the system. From now on, you will be able to log in as the root user using the new password set up during this procedure.
id: Reboot sistem. Mulai sekarang, Anda akan dapat login sebagai pengguna root menggunakan kata sandi baru yang diatur selama prosedur ini.

source: Are You Unable to Boot With Your RAID Card?
id: Anda Tidak Bisa Boot dengan Kartu RAID Anda?

source: If you have performed an installation and cannot boot your system properly, you may need to reinstall and partition your system's storage differently.
id: Jika Anda telah melakukan instalasi dan tidak dapat mem-boot sistem Anda dengan benar, Anda mungkin perlu menginstal ulang dan mempartisi penyimpanan sistem Anda secara berbeda.

source: Some BIOS types do not support booting from RAID cards. After you finish the installation and reboot the system for the first time, a text-based screen showing the boot loader prompt (for example, `grub>`) and a flashing cursor may be all that appears. If this is the case, you must repartition your system and move your `/boot` partition and the boot loader outside the RAID array. The `/boot` partition and the boot loader must be on the same drive.
id: Beberapa jenis BIOS tidak mendukung boot dari kartu RAID. Setelah Anda menyelesaikan instalasi dan reboot sistem untuk pertama kalinya, layar berbasis teks yang menunjukkan prompt boot loader (misalnya, `grub>`) dan mungkin yang muncul hanya kursor berkedip. Jika demikian, Anda harus mempartisi ulang sistem dan memindahkan partisi `/boot` dan boot loader di luar larik RAID. Partisi `/boot` dan boot loader harus pada drive yang sama.

source: Trouble With the Graphical Boot Sequence
id: Masalah Dengan Urutan Boot Grafis

source: After you finish the installation and reboot your system for the first time, it is possible that the system stops responding during the graphical boot sequence, requiring a reset. In this case, the boot loader is displayed successfully, but selecting any entry and attempting to boot the system results in a halt. This usually means a problem with the graphical boot sequence; to solve this issue, you must disable graphical boot. To do this, temporarily alter the setting at boot time before changing it permanently.
id: Setelah Anda menyelesaikan instalasi dan reboot sistem Anda untuk pertama kalinya, ada kemungkinan bahwa sistem berhenti merespons selama urutan boot grafis, memerlukan reset. Dalam hal ini, boot loader berhasil ditampilkan, tetapi memilih entri apa pun dan mencoba untuk boot membuat sistem berhenti. Ini biasanya berarti masalah dengan urutan boot grafis; untuk memecahkan masalah ini, Anda harus menonaktifkan boot grafis. Untuk melakukan ini, sementara ubah pengaturan pada saat boot sebelum mengubahnya secara permanen.

source: Disabling Graphical Boot Temporarily
id: Menonaktifkan Boot Grafis Untuk Sementara

source: Start your computer and wait until the boot loader menu appears. If you set your boot loader timeout period to 0, hold down the kbd:[Esc] key to access it.
id: Mulai komputer Anda dan tunggu hingga menu boot loader muncul. Jika Anda menetapkan periode waktu habis boot loader Anda ke 0, tahan tombol kbd:[Esc] untuk mengaksesnya.

source: When the boot loader menu appears, use your cursor keys to highlight the entry you want to boot and press the kbd:[e] key to edit this entry's options.
id: Ketika menu boot loader muncul, gunakan tombol kursor Anda untuk menyorot entri yang ingin Anda boot dan tekan tombol kbd:[e] untuk menyunting opsi entri ini.

source: In the list of options, find the kernel line - that is, the line beginning with the keyword `linux` (or, in some cases, `linux16` or `linuxefi`). On this line, locate the `rhgb` option and delete it. The option may not be immediately visible; use the cursor keys to scroll up and down.
id: Dalam daftar pilihan, cari baris kernel - yaitu, baris yang diawali dengan kata kunci `linux` (atau, dalam beberapa kasus, `linux16` atau `linuxefi`). Pada baris ini, Cari opsi `rhgb` dan hapus itu. Opsi ini mungkin tidak langsung terlihat; gunakan tombol kursor untuk menggulir ke atas dan ke bawah.
