Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/install/Troubleshooting.po
Languages: id

source: Press kbd:[F10] or kbd:[Ctrl + X] to boot your system with the edited options.
id: Tekan kbd:[F10] atau kbd:[Ctrl + X] untuk mem-boot sistem Anda dengan opsi yang disunting.

source: If the system started successfully, you can log in normally. Then you will need to disable the graphical boot permanently - otherwise you will have to perform the previous procedure every time the system boots. To permanently change boot options, do the following.
id: Jika sistem berhasil dimulai, Anda dapat masuk secara normal. Kemudian Anda akan perlu untuk menonaktifkan boot grafis secara permanen - jika tidak, Anda akan harus melakukan prosedur sebelumnya setiap kali sistem boot. Untuk secara permanen mengubah opsi boot, lakukan hal berikut.

source: Disabling Graphical Boot Permanently
id: Menonaktifkan Boot Grafis Secara Permanen

source: Log in to the `root` account using the [command]#su -# command:
id: Masuk ke akun `root` menggunakan perintah [command]#su-#:

source: Open the `/etc/default/grub` configuration file using a plain text editor such as [application]*vim*.
id: Buka berkas konfigurasi `/etc/default/grub` menggunakan penyunting teks biasa seperti [application]*vim*.

source: Within the `grub` file, locate the line beginning with `GRUB_CMDLINE_LINUX`. The line should look similar to the following:
id: Dalam berkas `grub`, cari baris yang diawali dengan `GRUB_CMDLINE_LINUX`. Baris akan terlihat mirip dengan berikut ini:

source: On this line, delete the `rhgb` option.
id: Pada baris ini, hapus opsi `rhgb`.

source: Save the edited configuration file.
id: Simpan berkas konfigurasi yang disunting.

source: Refresh the boot loader configuration by executing the following command:
id: Segarkan konfigurasi boot loader dengan mengeksekusi perintah berikut:

source: After you finish this procedure, you can reboot your computer. {PRODUCT} will not use the graphical boot sequence any more. If you wish to enable graphical boot, follow the same procedure, add the `rhgb` option to the `GRUB_CMDLINE_LINUX` line in the `/etc/default/grub` file and refresh the boot loader configuration again using the [command]#grub2-mkconfig# command.
id: Setelah Anda menyelesaikan prosedur ini, Anda dapat me-reboot komputer Anda. {PRODUCT} tidak akan menggunakan urutan boot grafis lagi. Jika Anda ingin mengaktifkan boot grafis, ikuti prosedur yang sama, tambahkan opsi `rhgb` ke baris `GRUB_CMDLINE_LINUX` di berkas `/etc/default/grub` dan segarkan konfigurasi boot loader lagi menggunakan perintah [command]#grub2-mkconfig#.

source: Booting into a Graphical Environment
id: Boot ke Lingkungan Grafis

source: If you have installed the [application]*X Window System* and a desktop environment such as [application]*GNOME*, but are not seeing a graphical desktop environment once you log into your system, you can start it manually using the [command]#startx# command. Note, however, that this is just a one-time fix and does not change the log in process for future log ins.
id: Jika Anda telah menginstal [application]*X Window System* dan lingkungan desktop seperti [application]*GNOME*, tetapi tidak melihat lingkungan desktop grafis setelah Anda masuk ke sistem Anda, Anda dapat memulainya secara manual menggunakan perintah [command]#startx#. Namun, perhatikan bahwa ini hanyalah perbaikan satu kali dan tidak mengubah login dalam proses untuk login mendatang.

source: To set up your system so that you can log in at a graphical login screen, you must change the default [application]*systemd* target to `graphical.target`. When you are finished, reboot the computer. You will presented with a graphical login prompt after the system restarts.
id: Untuk mengatur sistem Anda sehingga Anda dapat log in pada layar grafis login, Anda harus mengubah target baku [application]*systemd* ke `graphical.target`. Ketika Anda selesai, reboot komputer. Anda akan disajikan dengan prompt login grafis setelah sistem restart.

source: Setting Graphical Login as Default
id: Menata Login Grafis sebagai Baku

source: Open a shell prompt. If you are in your user account, become root by typing the [command]#su -# command.
id: Buka prompt shell. Jika Anda berada di akun pengguna Anda, jadilah root dengan mengetikkan perintah [command]#su -#.

source: Change the default target to `graphical.target`. To do this, execute the following command:
id: Ubah target baku ke `graphical.target`. Untuk melakukannya, jalankan perintah berikut ini:

source: Graphical login is now enabled by default - you will be presented with a graphical login prompt after the next reboot. If you want to reverse this change and keep using the text-based login prompt, execute the following command as `root`:
id: Login grafis sekarang diaktifkan secara baku - Anda akan disajikan dengan prompt login grafis setelah reboot berikutnya. Jika Anda ingin membalikkan perubahan ini dan tetap menggunakan prompt login berbasis teks, jalankan perintah berikut sebagai `root`:

source: No Graphical User Interface Present
id: Tidak Ada Antarmuka Pengguna Grafis

source: If you are having trouble getting [application]*X* (the [application]*X Window System*) to start, it is possible that it has not been installed. Some of the pre-set base environments you can select during the installation, such as `Minimal install` or `Web Server`, do not include a graphical interface - it has to be installed manually.
id: Jika Anda mengalami kesulitan memulai [application]*X* ([application]*X Window System*), mungkin bahwa itu belum terinstal. Beberapa lingkungan dasar preset yang dapat Anda pilih selama instalasi, seperti `Instalasi minimal` atau `Server Web`, tidak termasuk antarmuka grafis - itu harus diinstal secara manual.

source: If you want [application]*X*, you can install the necessary packages after the installation using the [application]*DNF* package manager. For example, to install [application]*GNOME*, use [command]#dnf install gnome-shell# as `root`.
id: Jika Anda ingin [application]*X*, Anda dapat menginstal paket yang diperlukan setelah instalasi menggunakan manajer paket [application]*DNF*. Misalnya, untuk memasang [application]*GNOME*, gunakan [command]#dnf install gnome-shell# sebagai `root`.

source: X Server Crashing After User Logs In
id: Server X Crash Setelah Pengguna Log In

source: If you are having trouble with the [application]*X* server crashing when a user logs in, one or more of your file systems may be full (or nearly full). To verify that this is the problem you are experiencing, execute the following command:
id: Jika Anda mengalami masalah server [application]*X* crash ketika pengguna log in, satu atau lebih dari sistem berkas Anda mungkin penuh (atau hampir penuh). Untuk memverifikasi bahwa ini adalah masalah yang Anda alami, jalankan perintah berikut ini:

source: The output will help you diagnose which partition is full - in most cases, the problem will be on the `/home` partition. A sample output of the [command]#df# command may look similar to the following:
id: Keluaran akan membantu Anda mendiagnosis partisi yang penuh - dalam kebanyakan kasus, masalahnya akan berada di partisi `/home`. Contoh keluaran perintah [command]#df# mungkin terlihat seperti berikut ini:

source: Filesystem Size Used Avail Use% Mounted on /dev/mapper/vg_rhel-root 20G 6.0G 13G 32% / devtmpfs 1.8G 0 1.8G 0% /dev tmpfs 1.8G 2.7M 1.8G 1% /dev/shm tmpfs 1.8G 1012K 1.8G 1% /run tmpfs 1.8G 0 1.8G 0% /sys/fs/cgroup tmpfs 1.8G 2.6M 1.8G 1% /tmp /dev/sda1 976M 150M 760M 17% /boot /dev/dm-4 90G 90G 0 100% /home
id: Sistem berkas Ukuran Pakai Sisa Guna% Dikait pada /dev/mapper/vg_rhel-root 20G 6.0G 13G 32% / devtmpfs 1.8G 0 1.8G 0% /dev tmpfs 1.8G 2.7M 1.8G 1% /dev/shm tmpfs 1.8G 1012K 1.8G 1% /run tmpfs 1.8G 0 1.8G 0% /sys/fs/cgroup tmpfs 1.8G 2.6M 1.8G 1% /tmp /dev/sda1 976M 150M 760M 17% /boot /dev/dm-4 90G 90G 0 100% /home

source: In the above example, you can see that the `/home` partition is full, which causes the crash. You can make some room on the partition by removing unneeded files. After you free up some disk space, start [application]*X* using the [command]#startx# command.
id: Dalam contoh di atas, Anda dapat melihat bahwa partisi `/home` penuh, yang menyebabkan crash. Anda dapat membuat sebagian ruang pada partisi dengan menghapus berkas-berkas yang tidak dibutuhkan. Setelah Anda mengosongkan sebagian ruang disk, jalankan [application]*X* menggunakan perintah [command]#startx#.

source: For additional information about [command]#df# and an explanation of the options available (such as the [option]#-h# option used in this example), see the `df(1)` man page.
id: Untuk informasi tambahan tentang [command]#df# dan penjelasan tentang pilihan yang tersedia (seperti opsi [option]#-h# yang digunakan dalam contoh ini), lihat halaman manual `df(1)`.

source: Is Your RAM Not Being Recognized?
id: Apakah RAM Anda Tidak Dikenali?

source: If you have 4GB or more memory installed, but {PRODUCT} only shows around 3.5GB or 3.7GB, you have probably installed a 32-bit version of {PRODUCT} on a 64bit kernel. For modern systems, use the 64-bit (x86_64) version.
id: Jika Anda memiliki memori 4GB atau lebih terinstal, tapi {PRODUCT} hanya menampilkan sekitar 3,5 GB atau 3,7 GB, Anda mungkin telah menginstal versi 32-bit dari {PRODUCT} pada kernel 64bit. Untuk sistem modern, gunakan versi 64-bit (x86_64).

source: Some hardware configurations have a part of the system's RAM reserved and unavailable to the main system. Notably, laptop computers with integrated graphics cards will reserve some memory for the GPU. For example, a laptop with 4{nbsp}GB of RAM and an integrated Intel graphics card will show only roughly 3.7{nbsp}GB of available memory, even with a 64-bit system.
id: Beberapa konfigurasi perangkat keras memiliki bagian dari RAM sistem yang dicadangkan dan tidak tersedia untuk sistem utama. Terutama, komputer laptop dengan kartu grafis terintegrasi akan mencadangkan beberapa memori untuk GPU. Sebagai contoh, sebuah laptop dengan RAM 4{nbsp}GB dan kartu grafis Intel terintegrasi hanya akan menampilkan sekitar 3,7{nbsp}GB memori yang tersedia, bahkan dengan sistem 64-bit.

source: If you made sure that your memory does not have any issues, you can try and set the amount of memory manually using the [option]#mem=# kernel option.
id: Jika Anda memastikan bahwa memori Anda tidak memiliki masalah, Anda dapat mencoba dan mengatur jumlah memori secara manual menggunakan opsi kernel [option]#mem=#.

source: Configuring the Memory Manually
id: Mengonfigurasi Memori Secara Manual

source: In the list of options, find the kernel line - that is, the line beginning with the keyword `linux` (or, in some cases, `linux16`). Append the following option to the end of this line:
id: Dalam daftar pilihan, cari baris kernel - yaitu, baris yang diawali dengan kata kunci `linux` (atau, dalam beberapa kasus, `linux16`). Tambahkan opsi berikut ke akhir baris ini:

source: Replace _xx_ with the amount of RAM you have in megabytes.
id: Ganti _xx_ dengan jumlah RAM yang Anda miliki dalam megabyte.

source: Wait for the system to boot and log in. Then, open a command line and execute the [command]#free -m# command again. If total amount of RAM displayed by the command matches your expectations, append the following to the line beginning with `GRUB_CMDLINE_LINUX` in the `/etc/default/grub` file to make the change permanent:
id: Tunggu hingga sistem boot dan masuk. Kemudian, buka baris perintah dan jalankan perintah [command]#free -m# lagi. Jika jumlah total RAM yang ditampilkan oleh perintah sesuai dengan harapan Anda, tambahkan yang berikut ke baris yang diawali dengan `GRUB_CMDLINE_LINUX` dalam berkas `/etc/default/grub` untuk membuat perubahan permanen:

source: After you updated the file and saved it, refresh the boot loader configuration so that the change will take effect. Run the following command with root privileges:
id: Setelah Anda memperbarui berkas dan menyimpannya, segarkan konfigurasi boot loader sehingga perubahan akan berlaku. Jalankan perintah berikut dengan hak akses root:

source: In `/etc/default/grub`, the above example would look similar to the following:
id: Dalam `/etc/default/grub`, contoh di atas akan terlihat seperti berikut:
