Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/Downloading_Fedora.po
Languages: fr

source: Downloading Fedora
fr: Télécharger Fedora

source: Fedora Editions
fr: Éditions de Fedora

source: Fedora provides three primary Editions tailored for some specific use cases. link:++https://getfedora.org++[] offers Fedora Cloud for scalable infrastructure, Fedora Server for organizational infrastructure, and Fedora Workstation for the developer and desktop user.
fr: Fedora fournit trois éditions principales taillées pour certains cas d’usages. link:++https://getfedora.org++[] offre Fedora Cloud pour les infrastructures évolutives, Fedora Server pour l’infrastructure organisationnelle et Fedora Workstation pour les développeurs et utilisateurs d’ordinateurs de bureau.

source: For alternative desktop environments or media built for more niche purposes, check out link:++https://spins.fedoraproject.org++[Fedora Spins].
fr: Pour les environnements de bureau alternatifs ou les médias construits pour des besoins de niche, consultez les link:++https://spins.fedoraproject.org++[Fedora Spins].

source: Each of these downloads provides a different set of default packages, but you can add to your system after the initial installation to customize it for your needs. The installation process is the same for all spins and Editions, so you can use this guide for any choice you make.
fr: Chacun de ces téléchargements offre un ensemble différent de paquets par défaut, mais vous pouvez en ajouter à votre système après l’installation initiale pour le personnaliser à vos besoins. Le processus d’installation est le même pour tous les spins et éditions afin que vous puissiez utiliser ce guide pour tout choix que vous ferez.

source: Which Architecture Is My Computer?
fr: Quelle est l’architecture de mon ordinateur ?

source: Most modern systems are 64{nbsp}bit x86 architecture. If your computer was manufactured after 2007, or you aren't sure, you probably have a `x86_64` system.
fr: La majorité des systèmes modernes sont des architectures x86 64{nbsp}bits. Si votre ordinateur a été conçu après 2007, ou si vous n’êtes pas sûr, vous avez probablement un système ` x86_64`.

source: Processor and architecture types
fr: Types de processeurs et d’architecture

source: Media Types
fr: Types de médias

source: Several media types are available. Choose the one that best suits your requirements.
fr: Plusieurs types de médias sont disponibles. Choisissez celui qui correspond le mieux à vos besoins.

source: Live Image
fr: Image live

source: Live images allow you to preview Fedora before installing it. Instead of booting directly into the installer, a live image loads the same environment you'll get after installation. Fedora Workstation and Fedora Spins are live images.
fr: Les images live vous permettent de prévisualiser Fedora avant de l’installer. Au lieu de démarrer directement dans l’installateur, une image live charge le même environnement que celui que vous obtiendrez après l’installation. Fedora Workstation et Fedora Spins sont des images live.

source: Use a live image to install your favorite system, test Fedora on new hardware, troubleshoot, or share with friends.
fr: Utilisez une image live pour installer votre système préféré, tester Fedora sur du nouveau matériel, dépanner ou partager avec des amis.

source: DVD Image
fr: Image DVD

source: DVD images boot directly into the installation enviroment, and allow you to choose from a variety of packages that are provided with it. In Fedora 21, the DVD option is only available in the *Fedora Server* Edition.
fr: Les images DVD s’amorcent directement dans l’environnement d’installation et vous permettent de choisir parmi une variété de paquets qui sont fournis avec celui-ci. Dans Fedora 21, l’option DVD n’est disponible que dans l’édition *Fedora Server*.

source: Use the Fedora Server DVD image when you want customized Fedora Server installations using an offline installation source.
fr: Utilisez l’image DVD de Fedora Server lorsque vous souhaitez des installations personnalisées de Fedora Server en utilisant une source d’installation hors ligne.

source: netinstall Image
fr: Image netinstall

source: The netinstall image boots directly into the installation environment, and uses the online Fedora package repositories as the installation source. With a netinstall image, you can select a wide variety of packages to create a customized installation of Fedora.
fr: L’image netinstall démarre directement dans l’environnement d’installation, et utilise les dépôts de paquets Fedora en ligne comme source d’installation. Avec une image netinstall, vous pouvez sélectionner une grande variété de paquets pour créer une installation personnalisée de Fedora.

source: The Fedora Server netinstall image is a universal one, and can be used to install any Fedora Edition or your own set of favorite packages.
fr: L’image netinstall de Fedora Server est universelle et peut être utilisée pour installer n’importe quelle édition de Fedora ou votre propre ensemble de paquets favoris.

source: ARM images
fr: Images ARM

source: For many ARM systems, Fedora provides preconfigured filesystem images. Write the image to removable media and boot directly into a Fedora installation that's ready to use.
fr: Pour de nombreux systèmes ARM, Fedora fournit des images de systèmes de fichiers préconfigurés. Écrivez l’image sur un support amovible et démarrez directement dans une installation Fedora prête à l’emploi.

source: ARM devices often require special setup procedures that aren't covered in this guide. Start learning about Fedora ARM at link:++https://fedoraproject.org/wiki/Architectures/ARM++[]
fr: Les appareils ARM nécessitent souvent des procédures de configuration spéciales qui ne sont pas abordées dans ce guide. Pour en savoir plus sur Fedora ARM, référez vous à : link:++https://fedoraproject.org/wiki/Architectures/ARM++[]

source: Cloud Images
fr: Images Cloud

source: Fedora Cloud images are preconfigured filesystem images with very few packages installed by default. They include special tools for interacting with cloud platforms, and are not intended to be used outside of cloud environments.
fr: Les images Fedora Cloud sont des images de systèmes de fichiers préconfigurés avec très peu de paquets installés par défaut. Elles comprennent des outils spéciaux pour interagir avec les plateformes Cloud et ne sont pas destinées à être utilisées en dehors des environnements Cloud.

source: Boot Images
fr: Images d’amorçage

source: The tiny images at link:++https://boot.fedoraproject.org/++[] are written to CDs, USB drives, or even floppy disks. The BFO image loads installation media from Fedora's servers and directly loads an installation environment, like the netinstall ISO.
fr: Les petites images de link:++https://boot.fedoraproject.org/++[] sont gravées sur des CD, des clés USB ou même des disquettes. L’image BFO charge le média d’installation depuis les serveurs de Fedora et charge directement un environnement d’installation, comme l’ISO netinstall.

source: BFO images work like PXE deployments, without having to set up a server.
fr: Les images BFO fonctionnent comme les déploiements PXE, sans avoir à mettre en place de serveur.
