Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f27/pages/Introduction.po
Languages: tr, uk

source: Introduction
tr: Giriş
uk: Вступ

source: This guide covers installation of Fedora, a Linux distribution built on free and open source software. This manual helps you install Fedora on desktops, laptops, and servers. The installation system is easy to use even if you lack previous knowledge of Linux or computer networks. If you select default options, Fedora provides a complete desktop operating system, including productivity applications, Internet utilities, and desktop tools.
tr: Bu kılavuz, özgür ve açık kaynaklı yazılım üzerine kurulmuş bir Linux dağıtımı olan Fedora'nın kurulumunu kapsamaktadır. Bu kılavuz Fedora'yı masaüstlerine, dizüstü bilgisayarlara ve sunuculara kurmanıza yardımcı olur. Linux veya bilgisayar ağları hakkında önceden bilgi sahibi olmasanız bile, kurulum sisteminin kullanımı kolaydır. Ön tanımlı seçenekleri seçerseniz Fedora, verimlilik uygulamaları, internet programları ve masaüstü araçları dahil eksiksiz bir masaüstü işletim sistemi sağlamaktadır.
uk: У цьому керівництві розглядається встановлення Fedora, дистрибутива Linux, створеного на основі безкоштовного програмного забезпечення з відкритим вихідним кодом. Цей посібник допоможе вам встановити Fedora на настільні комп'ютери, ноутбуки та сервери. Система встановлення проста у використанні, навіть якщо вам не вистачає знань про Linux або комп'ютерні мережі. Якщо ви оберете параметри за замовчуванням, Fedora надасть повноцінну настільну операційну систему, включаючи програми для підвищення продуктивності, інтернет-утиліти та настільні інструменти.

source: This document details the full range of installation options, including those that apply only in limited or unusual circumstances. Understanding of all topics described in this document is not necessary to successfully perform the installation in most cases.
tr: Bu belge, yalnızca sınırlı veya olağandışı durumlarda geçerli olanlar da dahil olmak üzere tüm kurulum seçeneklerini ayrıntılı olarak açıklamaktadır. Çoğu durumda kurulumu başarıyla gerçekleştirmek için bu belgede açıklanan tüm konuların anlaşılması gerekli değildir.
uk: У цьому документі детально описаний весь спектр варіантів установки, включаючи ті, що застосовуються лише в обмежених або незвичайних обставинах. Розуміння всіх тем, описаних у цьому документі, в більшості випадків не є обов'язковим для успішного виконання установки.

source: Background
tr: Arka Plan
uk: Тло

source: About Fedora
tr: Fedora Hakkında
uk: Про Fedora

source: To find out more about {PRODUCT}, visit the link:++http://fedoraproject.org/++[{PRODUCT} Project Website]. Other documentation describing additional topics related to {PRODUCT} is available at link:++http://docs.fedoraproject.org/++[{PRODUCT} Documentation]. Also see the link:++https://fedoraproject.org/wiki/Fedora_Project_Wiki++[{PRODUCT} Project Wiki].
tr: {PRODUCT} hakkında daha fazla bilgi edinmek için link:++https://fedoraproject.org/++[{PRODUCT} Projesi Web Sitesini] ziyaret edin. {PRODUCT} ile ilgili ilave konuları açıklayan diğer belgeleri link:++https://docs.fedoraproject.org/++[{PRODUCT} Dokümantasyonu] sayfasında bulabilirsiniz. Ayrıca link:++https://fedoraproject.org/wiki/Fedora_Project_Wiki++[{PRODUCT} Projesi Wiki] sayfasına bakın.

source: Getting Additional Help
tr: Daha Fazla Yardım Alma
uk: Отримання додаткової допомоги

source: If you encounter any problems which are not described in documentation, you might get help from members of the community - developers, users, and others. There are many ways to get help: the Ask Fedora website, mailing lists, forums, or IRC. For a summary of available resources, see the link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Communicating and Getting Help] page on the {PRODUCT} wiki.
tr: Dokümantasyonda açıklanmayan herhangi bir sorunla karşılaşırsanız, topluluk üyelerinden - geliştiriciler, kullanıcılar ve diğerleri - yardım alabilirsiniz. Yardım almanın birçok yolu vardır: 'Fedora'ya Sorun' web sitesi, e-posta listeleri, forumlar, veya IRC. Mevcut kaynakların bir özeti için, {PRODUCT} wiki adresinde link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[İletişim ve Yardım Alma] sayfasına bakın.
uk: Якщо ви зіткнетеся з проблемами, не описаними в документації, ви можете отримати допомогу від членів спільноти - розробників, користувачів та інших. Існує багато способів отримати допомогу: веб-сайт Ask Fedora, списки розсилки, форуми чи IRC. Щоб отримати повну кількість доступних ресурсів, перегляньте сторінку:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Спілкування та отримання довідки] на вікі {PRODUCT}.

source: About This Document
tr: Bu Belge Hakkında
uk: Про цей документ

source: Goals
tr: Hedefler
uk: Цілі

source: This guide helps a reader:
tr: Bu kılavuz okuyucuya aşağıdaki konularda yardımcı olur:
uk: Це керівництво допоможе читачу:

source: Understand how to locate the {PRODUCT} distribution online
tr: {PRODUCT} dağıtımının çevrim içi olarak nasıl bulunacağını anlamak
uk: Зрозуміти, як знайти дистрибутив {PRODUCT} в Інтернеті

source: Create configuration data that allows a computer to boot {PRODUCT}
tr: Bir bilgisayarın {PRODUCT} önyüklemesi gerçekleştirmesini sağlayan yapılandırma verilerini oluşturmak
uk: Створювати конфігураційні дані, які дозволять комп’ютеру завантажувати {PRODUCT}

source: Understand and interact with the {PRODUCT} installation program
tr: {PRODUCT} kurulum programını anlamak ve etkileşim kurmak
uk: Розуміти та взаємодіяти з програмою встановлення {PRODUCT}

source: Complete basic post-installation configuration of a {PRODUCT} system
tr: Bir {PRODUCT} sisteminin temel kurulum sonrası yapılandırmasını tamamlamak
uk: Виконувати базову конфігурацію системи {PRODUCT} після інсталяції

source: This guide does not cover *use* of {PRODUCT}. To learn how to use an installed {PRODUCT} system, see the other manuals available at link:++http://docs.fedoraproject.org/++[Fedora Documentation].
tr: Bu kılavuz {PRODUCT} *kullanımını* kapsamamaktadır. Kurulu bir {PRODUCT} sisteminin nasıl kullanılacağını öğrenmek için, link:++https://docs.fedoraproject.org/++[Fedora Dokümantasyonu] adresinde bulunan diğer kılavuzlara bakın.

source: Target Audience
tr: Hedef Kitle
uk: Цільова аудиторія

source: This guide is intended for {PRODUCT} users of all levels of experience. However, it describes the installation process and its many options in far greater detail than most users are likely to require. You do not need to read and understand this entire document to install {PRODUCT} on a computer. This document is most likely to help experienced users perform advanced and unusual installations.
tr: Bu kılavuz, tüm deneyim seviyelerinden {PRODUCT} kullanıcılarına yöneliktir. Bununla birlikte, kurulum işlemini ve birçok seçeneğini çoğu kullanıcının ihtiyaç duyabileceğinden çok daha ayrıntılı olarak açıklamaktadır. {PRODUCT} ürününü bir bilgisayara kurmak için bu belgenin tamamını okumanız ve anlamanız gerekmez. Bu belgenin deneyimli kullanıcıların gelişmiş ve olağan dışı kurulumlar yapmalarına yardımcı olması muhtemeldir.
uk: Цей посібник призначено для користувачів {PRODUCT} із будь-яким рівнем досвіду. Однак у ньому описано процес інсталяції та його численні параметри набагато детальніше, ніж більшість користувачів, ймовірно, потребуватимуть. Вам не потрібно читати та розуміти весь цей документ, щоб установити {PRODUCT} на комп’ютері. Цей документ, швидше за все, допоможе досвідченим користувачам виконувати розширені та незвичайні інсталяції.
