Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f29/pages/Introduction.po
Languages: pt_br

source: Introduction
pt_br: Introdução

source: This guide covers installation of Fedora, a Linux distribution built on free and open source software. This manual helps you install Fedora on desktops, laptops, and servers. The installation system is easy to use even if you lack previous knowledge of Linux or computer networks. If you select default options, Fedora provides a complete desktop operating system, including productivity applications, Internet utilities, and desktop tools.
pt_br: Este guia cobre a instalação do Fedora, uma distribuição Linux construída em software livre e de código aberto. Este manual ajuda a instalar o Fedora em desktops, laptops e servidores. O sistema de instalação é fácil de usar, mesmo se você não tiver conhecimento prévio de Linux ou redes de computadores. Se você selecionar opções padrão, o Fedora fornece um sistema operacional completo para desktop, incluindo aplicativos de produtividade, utilitários da Internet e ferramentas de desktop.

source: This document details the full range of installation options, including those that apply only in limited or unusual circumstances. Understanding of all topics described in this document is not necessary to successfully perform the installation in most cases.
pt_br: Este documento detalha toda a gama de opções de instalação, incluindo aquelas que se aplicam apenas em circunstâncias limitadas ou incomuns. A compreensão de todos os tópicos descritos neste documento não é necessária para executar com êxito a instalação na maioria dos casos.

source: Background
pt_br: Base

source: About Fedora
pt_br: Sobre o Fedora

source: To find out more about {PRODUCT}, visit the link:++https://fedoraproject.org/++[{PRODUCT} Project Website]. Other documentation describing additional topics related to {PRODUCT} is available at link:++https://docs.fedoraproject.org/++[{PRODUCT} Documentation]. Also see the link:++https://fedoraproject.org/wiki/Fedora_Project_Wiki++[{PRODUCT} Project Wiki].
pt_br: Para descobrir mais sobre o {PRODUCT}, visite o link:++https://fedoraproject.org/++[site do projeto {PRODUCT}]. Outra documentação que descreve tópicos adicionais relacionados ao {PRODUCT} está disponível na link:++https://docs.fedoraproject.org/++[documentação do {PRODUCT}]. Veja também a link:++https://fedoraproject.org/wiki/Fedora_Project_Wiki++[wiki do projeto {PRODUCT}].

source: Getting Additional Help
pt_br: Obtendo ajuda adicional

source: If you encounter any problems which are not described in documentation, you might get help from members of the community - developers, users, and others. There are many ways to get help: the Ask Fedora website, mailing lists, forums, or IRC. For a summary of available resources, see the link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Communicating and Getting Help] page on the {PRODUCT} wiki.
pt_br: Se você encontrar algum problema que não esteja descrito na documentação, poderá obter ajuda de membros da comunidade - desenvolvedores, usuários e outros. Existem várias maneiras de obter ajuda: o site Ask Fedora, listas de discussão, fóruns ou IRC. Para um resumo dos recursos disponíveis, consulte a página link:++https://fedoraproject.org/wiki/Communicating_and_getting_help++[Comunicando-se e obtendo ajuda] no wiki do {PRODUCT}.

source: About This Document
pt_br: Sobre este documento

source: Goals
pt_br: Objetivos

source: This guide helps a reader:
pt_br: Este guia ajuda um leitor a:

source: Understand how to locate the {PRODUCT} distribution online
pt_br: Entenda como localizar on-line a distribuição {PRODUCT}

source: Create configuration data that allows a computer to boot {PRODUCT}
pt_br: Criar dados de configuração que permitam ao computador inicializar o {PRODUCT}

source: Understand and interact with the {PRODUCT} installation program
pt_br: Entender e interagir com o programa de instalação do {PRODUCT}

source: Complete basic post-installation configuration of a {PRODUCT} system
pt_br: Concluir a configuração básica pós-instalação de um sistema {PRODUCT}

source: This guide does not cover *use* of {PRODUCT}. To learn how to use an installed {PRODUCT} system, see the other manuals available at link:++https://docs.fedoraproject.org/++[Fedora Documentation].
pt_br: Este guia não cobre o *uso* do {PRODUCT}. Para aprender como usar um sistema {PRODUCT} instalado, consulte os outros manuais disponíveis na link:++https://docs.fedoraproject.org/++[Documentação do Fedora].

source: Target Audience
pt_br: Audiência alvo

source: This guide is intended for {PRODUCT} users of all levels of experience. However, it describes the installation process and its many options in far greater detail than most users are likely to require. You do not need to read and understand this entire document to install {PRODUCT} on a computer. This document is most likely to help experienced users perform advanced and unusual installations.
pt_br: Este guia é destinado a usuários do {PRODUCT} de todos os níveis de experiência. No entanto, descreve o processo de instalação e suas muitas opções com muito mais detalhes do que a maioria dos usuários provavelmente precisará. Você não precisa ler e entender este documento inteiro para instalar o {PRODUCT} em um computador. É mais provável que este documento ajude usuários experientes a executar instalações avançadas e incomuns.
