Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f36/pages/Downloading_Fedora.po
Languages: fi

source: Downloading Fedora
fi: Ladataan Fedoraa

source: Fedora Editions
fi: Fedora-versiot

source: Fedora provides three primary Editions tailored for some specific use cases. link:++https://getfedora.org++[] offers Fedora Cloud for scalable infrastructure, Fedora Server for organizational infrastructure, and Fedora Workstation for the developer and desktop user.
fi: Fedora tarjoaa kolme ensisijaista versiota, jotka on räätälöity erilaisiin käyttötapauksiin. linkki:++https://getfedora.org++[] tarjoaa Fedora Cloudin skaalautuvaan infrastruktuuriin, Fedora Serverin organisaatioinfrastruktuuriin ja Fedora Workstationin kehittäjille ja työpöytäkäyttäjille.

source: For alternative desktop environments or media built for more niche purposes, check out link:++https://spins.fedoraproject.org++[Fedora Spins].
fi: Vaihtoehtoisia työpöytäympäristöjä tai harvinaisempiin käyttötarkoituksiin rakennettuja mediaoita löytyy linkistä:++https://spins.fedoraproject.org++[Fedora Spins].

source: Each of these downloads provides a different set of default packages, but you can add to your system after the initial installation to customize it for your needs. The installation process is the same for all spins and Editions, so you can use this guide for any choice you make.
fi: Jokainen näistä latauksista sisältää erilaiset oletuspaketit, mutta voit lisätä paketteja järjestelmääsi ensimmäisen asennuksen jälkeen mukauttaaksesi sen tarpeisiisi. Asennusprosessi on sama kaikille versioille, joten voit käyttää tätä opasta mihin tahansa niistä.

source: Which Architecture Is My Computer?
fi: Mikä on tietokoneeni arkkitehtuuri?

source: Most modern systems are 64{nbsp}bit x86 architecture. If your computer was manufactured after 2007, or you aren't sure, you probably have a `x86_64` system.
fi: Useimmat nykyaikaisista järjestelmistä käyttävät 64{nbsp}bittistä x86-arkkitehtuuria. Jos tietokoneesi on valmistettu vuoden 2007 jälkeen tai et tiedä mikä sinulla on, on se luultavasti x86_64-järjestelmä.

source: Changing a Fedora installation from one architecture to another is not supported. Use the following table to determine the architecture of your computer according to the type of processor. Consult your manufacturer's documentation for details on your processor, or resources such as link:++https://ark.intel.com/++[] or link:++https://products.amd.com/++[], if necessary.
fi: Fedora-asennuksen vaihtamista arkkitehtuurista toiseen ei tueta. Käytä seuraavaa taulukkoa määrittääksesi tietokoneesi arkkitehtuuri prosessorityypin mukaan. Katso tarpeen vaatiessa lisätietoja prosessoristasi valmistajan dokumentaatiosta tai resursseista, kuten linkistä:++https://ark.intel.com/++[] tai linkistä:++https://products.amd.com/++[ ].

source: Processor and architecture types
fi: Prosessori- ja arkkitehtuurityyppejä

source: |Processor manufacturer and model|Architecture type for Fedora |some Intel Atom, Core 2 series, Core i series and Xeon; AMD: Athlon 64, Athlon II, Sempron64, Phenom series, Fusion series, Bulldozer series and Opteron; Apple MacBook, MacBook Pro, and MacBook Air|`x86_64` |Some newer Arm SBCs, SBSA and SystemReady Arm based machines|`aarch64` |Some older 32-bit Arm SBCs|`armhfp`
fi: |Prosessorin valmistaja ja malli|Arkkitehtuurityyppi Fedoralle |jotkut Intel Atom, Core 2 -sarja, Core i -sarja ja Xeon; AMD: Athlon 64, Athlon II, Sempron64, Phenom-sarja, Fusion-sarja, Bulldozer-sarja ja Opteron; Apple MacBook, MacBook Pro ja MacBook Air|`x86_64` |Jotkut uudemmat Arm SBC-, SBSA- ja SystemReady Arm -pohjaiset koneet|`aarch64` |Jotkut vanhemmat 32-bittiset Arm SBC:t|`armhfp`

source: Media Types
fi: Mediatyyppi

source: Several media types are available. Choose the one that best suits your requirements.
fi: Saatavilla on useita mediatyyppejä. Valitse tarpeitasi parhaiten vastaava.

source: Live Image
fi: Live-levykuva

source: Live images allow you to preview Fedora before installing it. Instead of booting directly into the installer, a live image loads the same environment you'll get after installation. Fedora Workstation and Fedora Spins are live images.
fi: Live-levykuvien avulla voit esikatsella Fedoraa ennen sen asentamista. Sen sijaan, että se käynnistettäisiin suoraan asentimeen, live-levykuva lataa saman ympäristön, jonka saat asennuksen jälkeen. Fedora Workstation ja Fedora Spins ovat live-levykuvia.

source: Use a live image to install your favorite system, test Fedora on new hardware, troubleshoot, or share with friends.
fi: Asenna suosikkijärjestelmäsi live-levykuvan avulla, testaa Fedoraa uudella laitteistolla, tee vianmääritys tai jaa se ystävien kanssa.

source: DVD Image
fi: DVD levykuva

source: DVD images boot directly into the installation environment, and allow you to choose from a variety of packages that are provided with it. In Fedora 21, the DVD option is only available in the *Fedora Server* Edition.
fi: DVD-levykuvat käynnistyvät suoraan asennusympäristöön, ja voit valita useista sen mukana toimitetuista paketeista. Fedora 21:ssä DVD-vaihtoehto on saatavilla vain *Fedora Server* versiossa.

source: Use the Fedora Server DVD image when you want customized Fedora Server installations using an offline installation source.
fi: Käytä Fedora Serverin DVD-levykuvaa, kun haluat mukautettuja Fedora Server -asennuksia offline-asennuslähteen avulla.

source: netinstall Image
fi: netinstall levykuva

source: The netinstall image boots directly into the installation environment, and uses the online Fedora package repositories as the installation source. With a netinstall image, you can install any Fedora Edition or select a wide variety of packages to create a customized installation of Fedora.
fi: Netinstall-levykuva käynnistyy suoraan asennusympäristöön ja käyttää online-Fedora-pakettivarastoja asennuslähteenä. Netinstall-levykuvan avulla voit asentaa minkä tahansa Fedora version tai valita laajan valikoiman asennuspaketteja luodaksesi mukautetun Fedoran asennuksen.

source: Compared to Fedora Workstation DVD image with Fedora Workstation installation: the netinstall images do not hide the GRUB2 menu.
fi: Verrattuna Fedora työaseman DVD-levykuvaan, jossa on Fedora Workstation -asennus: netinstall-otokset eivät piilota GRUB2-valikkoa.

source: The link:++https://alt.fedoraproject.org++[netinstall images] have different default settings:
fi: link:++https://alt.fedoraproject.org++[netinstall levykuvat] on erilaiset oletusasetukset:

source: Fedora Server:
fi: Fedora-palvelin:

source: presets Fedora Server Edition
fi: esiasetukset Fedora Server Edition

source: LVM with XFS file system configuration
fi: LVM XFS-tiedostojärjestelmän kokoonpanolla

source: server firewall configuration
fi: palvelimen palomuuriasetukset

source: 15 GiB hard disk space assigned to /; remaining free space left as unpartitioned LVM space
fi: 15 Gt kiintolevytilaa varattu osiolle /; jäljellä oleva vapaa tila jätetty osioimattomaksi LVM-tilaksi

source: Everything:
fi: Kaikki:

source: presets Fedora Custom Operating System
fi: esiasetukset muokatulle Fedora-käyttöjärjestelmälle

source: BTRFS file system configuration
fi: BTRFS-tiedostojärjestelmän kokoonpano

source: client firewall configuration
fi: asiakkaan palomuuriasetukset

source: hard disk space assignment does not leave unpartitioned free space
fi: kiintolevytilan määrittäminen ei jätä osioimatonta vapaata tilaa

source: ARM images
fi: ARM-levykuvat

source: For many ARM systems, Fedora provides preconfigured filesystem images. Write the image to removable media and boot directly into a Fedora installation that's ready to use.
fi: Monille ARM-järjestelmille Fedora tarjoaa esimääritetyt tiedostojärjestelmän levykuvat. Kirjoita levykuva siirrettävälle tietovälineelle ja käynnistä se suoraan käyttövalmiiseen Fedora-asennukseen.

source: ARM devices often require special setup procedures that aren't covered in this guide. Start learning about Fedora ARM at link:++https://fedoraproject.org/wiki/Architectures/ARM++[]
fi: ARM-laitteet vaativat usein erityisiä asennustoimenpiteitä, joita ei käsitellä tässä oppaassa. Aloita Fedora ARM:n opiskelu osoitteessa link:++https://fedoraproject.org/wiki/Architectures/ARM++[]

source: Cloud Images
fi: Cloud levykuvat

source: Fedora Cloud images are preconfigured filesystem images with very few packages installed by default. They include special tools for interacting with cloud platforms, and are not intended to be used outside of cloud environments.
fi: Fedora Cloud -levykuvat ovat valmiiksi määritettyjä tiedostojärjestelmän levykuvia, joihin on oletuksena asennettu vain vähän paketteja. Ne sisältävät erikoistyökaluja vuorovaikutukseen pilvialustojen kanssa, eikä niitä ole tarkoitettu käytettäväksi pilviympäristöjen ulkopuolella.

source: Fedora Cloud comes in several varieties. The Fedora Cloud Base image is a minimal base for cloud deployments. The Fedora Cloud Atomic image is a Docker container host that uses link:++https://www.projectatomic.io/++[Project Atomic] technology for updates. A Docker base image for Fedora is also available.
fi: Fedora Cloudia on saativilla useita erilaisia. Fedora Cloud Base -levykuva on minimaalinen perusta pilvikäyttöön. Fedora Cloud Atomic -levykuva on Docker-konttien isäntä, joka käyttää päivityksiin link:++https://www.projectatomic.io/++[Project Atomic] -tekniikkaa. Löytyy myös Docker perus-levykuva Fedoralle.

source: Cloud images are preconfigured and do not require installation as described in this guide. Get started using Fedora Cloud at link:++https://fedoraproject.org/wiki/Cloud++[]
fi: Pilvikuvat on määritetty valmiiksi, eivätkä ne vaadi asennusta tässä oppaassa kuvatulla tavalla. Aloita Fedora Cloudin käyttö osoitteessa link:++https://fedoraproject.org/wiki/Cloud++[]

source: Boot Images
fi: Boot levykuvat

source: The tiny images at link:++https://boot.fedoraproject.org/++[] are written to CDs, USB drives, or even floppy disks. The BFO image loads installation media from Fedora's servers and directly loads an installation environment, like the netinstall ISO.
fi: Erittäin pienet levykuvat link:++https://boot.fedoraproject.org/++[] on kirjoitettu CD-levyille, USB-asemille tai jopa levykkeille. BFO-levykuva lataa asennusmedian Fedoran palvelimilta ja lataa suoraan asennusympäristön, kuten netinstall ISO:n.

source: BFO images work like PXE deployments, without having to set up a server.
fi: BFO-levykuvat toimivat samalla tavalla kuin PXE-asennukset, eikä vaadi palvelimen asennusta.
