Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f36/pages/Revision_History.po
Languages: fi

source: Revision History
fi: Versiohistoriikki

source: Note that revision numbers relate to the edition of this manual, not to version numbers of Fedora.
fi: Huomaa, että versionumerot liittyvät tämän oppaan painokseen, eivät Fedoran versionumeroihin.

source: Tue Oct 30 2018, Petr Bokoč (pbokoc@redhat.com)
fi: Ti 30. lokakuuta 2018, Petr Bokoč (pbokoc@redhat.com)

source: Fedora 29 Final release
fi: Fedora 29:n lopullinen julkaisu

source: All external links are now converted to HTTPS where applicable (link:++https://pagure.io/fedora-docs/install-guide/issue/3++[issue 3])
fi: Kaikki ulkoiset linkit muunnetaan nyt tarvittaessa HTTPS:ksi (linkki:++https://pagure.io/fedora-docs/install-guide/issue/3++[numero 3])

source: Removed a mention of a no longer available rescue image (link:++https://pagure.io/fedora-docs/install-guide/issue/4++[issue 4])
fi: Poistettiin maininta pelastuslevykuvasta, jota ei ole enää saatavilla (linkki: ++ https: //pagure.io/fedora-docs/install-guide/issue/4++ [numero 4])

source: New Kickstart commands and options: `url`, `network --bindto=`, and LUKS-related options for `autopart`, `part`, `logvol`, and `raid`.
fi: Uudet Kickstart-komennot ja -asetukset: `url`, `network --bindto=` ja LUKSiin liittyvät asetukset `autopart`, `part`, `logvol`ja `raid`-asetuksille.

source: The `authconfig` Kickstart command is now deprecated and replaced by `authselect` (link:++https://pagure.io/fedora-docs/install-guide/issue/6++[issue 6])
fi: "authconfig" Kickstart-komento on nyt vanhentunut ja korvattu komennolla "authselect" (link:++https://pagure.io/fedora-docs/install-guide/issue/6++[issue 6])

source: New boot options: `inst.stag2.all=`, `inst.ks.all=`, `inst.xtimeout=`, `inst.decorated=`
fi: Uudet käynnistysvaihtoehdot: `inst.stag2.all =`, `inst.ks.all =`, `inst.xtimeout =`, `inst.decorated =`

source: Updated the Fedora Media Writer chapter (link:++https://pagure.io/fedora-docs/install-guide/issue/7++[issue 7])
fi: Päivitetty Fedora Media Writer -luku (linkki: ++ https: //pagure.io/fedora-docs/install-guide/issue/7++ [numero 7])

source: Updated image verification instructions for Mac (link:++https://pagure.io/fedora-docs/install-guide/issue/15++[issue 15])
fi: Päivitetyt levykuvanvahvistusohjeet Macille (linkki: ++ https: //pagure.io/fedora-docs/install-guide/issue/15++ [numero 15])

source: Various fixes related to the new publishing system
fi: Erilaisia uuteen julkaisujärjestelmään liittyviä korjauksia

source: Mon Jun 20 2016, Clayton Spicer (cspicer@redhat.com)
fi: Ma 20. kesäkuuta 2016, Clayton Spicer (cspicer@redhat.com)

source: Fedora 24 Final release
fi: Fedora 24:n lopullinen julkaisu

source: Added boot option [option]#inst.nosave=#
fi: Lisätty käynnistysvaihtoehto [option]#inst.nosave=#

source: Typo fixes
fi: Kirjoitusvirheitä korjattu

source: Mon Nov 02 2015, Petr Bokoč (pbokoc@redhat.com)
fi: Ma 2. marraskuuta 2015, Petr Bokoč (pbokoc@redhat.com)

source: Fedora 23 Final release
fi: Fedora 23:n lopullinen julkaisu

source: Kickstart commands and boot options updated for F23
fi: Kickstart-komennot ja käynnistysasetukset päivitetty F23:lle

source: Many typo fixes
fi: Useita kirjoitusvirheiden korjauksia

source: Mon May 25 2015, Petr Bokoč (pbokoc@redhat.cogm)
fi: Ma 25. toukokuuta 2015, Petr Bokoč (pbokoc@redhat.com)

source: Fedora 22 Final release
fi: Fedora 22:n lopullinen julkaisu

source: References to [application]*Yum* replaced with [application]*DNF* (the new default package manager)
fi: Viittaukset [sovellus]*Yum* korvattiin [sovellus]*DNF*:lla (uusi oletuspakettien hallinta)

source: Updates in boot options: [option]#inst.dnf# replaced with [option]#inst.nodnf#, added [option]#inst.kdump_addon=#
fi: Päivityksiä käynnistysasetuksiin: [option]#inst.dnf# korvattu [option]#inst.nodnf#:lla, lisätty [option]#inst.kdump_addon=#

source: Updates in Kickstart: [command]#%anaconda#, [command]#%addon#, [command]#sshkey#, [command]#pwpolicy#
fi: Päivityksiä Kickstartissa: [command]#%anaconda#, [command]#%addon#, [command]#sshkey#, [command]#pwpolicy#

source: Added the `Kdump` screen to the GUI docs
fi: Lisätty Kdump-näyttö GUI-dokumentteihin

source: Sun Dec 21 2014, Zach Oglesby (zach@oglesby.co)
fi: Su 21. joulukuuta 2014, Zach Oglesby (zach@oglesby.co)

source: Fixed Windows checksum steps, BZ#1175759
fi: Korjattu Windowsin tarkistussummavaiheet, BZ#1175759

source: Mon Dec 15 2014, Petr Bokoč (pbokoc@redhat.com)
fi: Ma 15. joulukuuta 2014, Petr Bokoč (pbokoc@redhat.com)

source: Fixes in Boot Options: inst.headless is deprecated, inst.askmethod moved from removed to Installation Source
fi: Korjaukset käynnistysasetuksiin: inst.headless on vanhentunut, inst.askmethod siirretty poistetusta asennuslähteeseen

source: Parts of the network boot setup chapter have been updated with correct URLs
fi: Osa verkkokäynnistysasetusten luvusta on päivitetty oikeilla URL-osoitteilla

source: Updates in Recommended Partitioning Scheme and Advice on Partitions in the Manual Partitioning section of the installation chapter
fi: Päivitykset suositellussa osiointikaaviossa ja neuvoja osioista asennusluvun Manuaalinen osiointi -kappaleessa

source: Mon Dec 8 2014, Petr Bokoč (pbokoc@redhat.com)
fi: Ma 8. joulukuuta 2014, Petr Bokoč (pbokoc@redhat.com)

source: Publishing for Fedora 21
fi: Julkaistu Fedoralle 21

source: Mon Dec 8 2014, Pete Travis (immanetize@fedoraproject.org)
fi: Ma 8. joulukuuta 2014, Pete Travis (immanetize@fedoraproject.org)

source: added info on media types
fi: lisätty tiedot mediatyypeistä

source: Tue Dec 17 2013, Petr Bokoč (pbokoc@redhat.com)
fi: Ti 17. joulukuuta 2013, Petr Bokoč (pbokoc@redhat.com)

source: Publishing for Fedora 20
fi: Julkaistu Fedoralle 20
