Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/_partials/install/CustomSpoke_PartitioningAdvice.po
Languages: id

source: Advice on Partitions
id: Saran tentang Partisi

source: There is no best way to partition every system; the optimal setup depends on how you plan to use the system being installed. However, the following tips may help you find the optimal layout for your needs:
id: Tidak ada cara terbaik untuk mempartisi setiap sistem; penyiapan optimal bergantung kepada bagaimana Anda berrencana untuk memakai sistem yang sedang diinstal. Namun, tips berikut mungkin membantu Anda menemukan tata letak optimal bagi kebutuhan Anda:

source: Consider encrypting any partitions and volumes which might contain sensitive data. Encryption prevents unauthorized people from accessing the data on the partitions, even if they have access to the physical storage device. In most cases, you should at least encrypt the `/home` partition, which contains user data.
id: Pertimbangkan untuk mengenkripsi sebarang partisi dan volume yang mungkin memuat data sensitif. Enkripsi mencegah orang tanpa otorisasi mengakses data pada partisi, bahkan bila mereka punya akses ke peranti penyimpanan fisik. Dalam kebanyakan kasus, Anda mesti paling tidak mengenkripsi partisi `/home`, yang memuat data pengguna.

source: In some cases, creating separate mount points for directories other than `/`, `/boot` and `/home` may be useful; for example, on a server running a [application]*MySQL* database, having a separate mount point for `/var/lib/mysql` will allow you to preserve the database during a reinstallation without having to restore it from backup afterwards. However, having unnecessary separate mount points will make storage administration more difficult.
id: Dalam beberapa kasus, membuat titik kait terpisah untuk direktori selain `/`, `/boot`, dan `/home` mungkin berguna; sebagai contoh, pada suatu server yang menjalankan sebuah basis data [application]*MySQL*, memiliki suatu titik kait terpisah untuk `/var/lib/mysql` memungkinkan Anda mempertahankan basis data selama instalasi ulang tanpa mesti memulihkan dari cadangan setelahnya. Namun, memiliki titik kait terpisah yang tidak perlu akan membuat administrasi penyimpanan lebih sulit.

source: Some special restrictions apply to certain directories with regards on which partitioning layouts can they be placed. Notably, the `/boot` directory must always be on a physical partition (not on an LVM volume or a Btrfs subvolume), and `/usr` can not be on a Btrfs subvolume.
id: Beberapa pembatasan khusus berlaku ke direktori tertentu terkait tata letak pemartisian mana mereka dapat ditempatkan. Khususnya, direktori `/boot` harus selalu ada pada suatu partisi fisik (bukan pada volume LVM atau sub volume Btrfs), dan `/usr` tidak bisa berada pada suatu sub volume Btrfs.

source: If you are new to Linux, consider reviewing the [citetitle]_Linux Filesystem Hierarchy Standard_ at link:++https://refspecs.linuxfoundation.org/FHS_2.3/fhs-2.3.html++[] for information about various system directories and their contents.
id: Bila Anda baru memakai Linux, pertimbangkan untuk membaca [citetitle]_Linux Filesystem Hierarchy Standard_ di link:++https://refspecs.linuxfoundation.org/FHS_2.3/fhs-2.3.html++[] untuk informasi tentang berbagai direktori sistem dan isi mereka.

source: Each kernel installed on your system requires approximately 20 MB on the `/boot` partition. The default partition size of 500 MB for `/boot` should suffice for most common uses; increase the size of this partition if you plan to keep many kernels installed at the same time.
id: Setiap kernel yang terpasang pada sistem Anda memerlukan kira-kira 20 MB pada partisi `/boot`. Ukuran partisi baku sebesar 500 MB untuk `/boot` mestinya cukup untuk kebanyakan penggunaan umum; naikkan ukuran partisi ini bila Anda berrencana untuk menyimpan banyak kernel yang terpasang pada saat yang sama.

source: The `/var` directory holds content for a number of applications, including the [application]*Apache* web server, and is used by the [application]*DNF* package manager to temporarily store downloaded package updates. Make sure that the partition or volume containing `/var` has at least 3 GB.
id: Direktori `/var` menyimpan isi untuk sejumlah aplikasi, termasuk server web [application]*Apache*, dan dipakai oleh manajer paket [application]*DNF* untuk menyimpan sementara pembaruan paket yang diunduh. Pastikan bahwa partisi atau volume yang memuat `/var` punya paling tidak 3 GB.

source: The contents of the `/var` directory usually change very often. This may cause problems with older solid state drives (SSDs), as they can handle a lower number of read/write cycles before becoming unusable. If your system root is on an SSD, consider creating a separate mount point for `/var` on a classic (platter) HDD.
id: Isi direktori `/var` biasanya sangat sering berubah. Ini dapat menyebabkan masalah dengan solid state drive (SSD) yang lebih tua, karena mereka dapat menangani sejumlah lebih sedikit siklus baca/tulis sebelum menjadi tak bisa dipakai. Bila root sistem Anda ada pada SSD, pertimbangkan untuk membuat titik kait terpisah untuk `/var` pada HDD (magnetik) klasik.

source: The `/usr` directory holds the majority of software on a typical {PRODUCT} installation. The partition or volume containing this directory should therefore be at least 5 GB for minimal installations, and at least 10 GB for installations with a graphical environment.
id: Direktori `/usr` memuat mayoritas perangkat lunak pada suatu instalasi {PRODUCT} umum. Maka partisi atau volume yang memuat direktori ini mesti paling tidak 5 GB untuk instalasi minimal, dan paling tidak 10 GB untuk instalasi dengan lingkungan grafis.

source: If `/usr` or `/var` is partitioned separately from the rest of the root volume, the boot process becomes much more complex because these directories contain boot-critical components. In some situations, such as when these directories are placed on an iSCSI drive or an FCoE location, the system may either be unable to boot, or it may hang with a `Device is busy` error when powering off or rebooting.
id: Bila `/usr` atau `/var` dipartisi terpisah dari sisa volume root, proses boot menjadi lebih kompleks karena direktori-direktori ini memuat komponen yang kritis untuk boot. Dalam beberapa situasi, seperti misalnya ketika direktori ini ditempatkan pada drive iSCSI atau lokasi FCoE, sistem mungkin tidak bisa boot, atau mungkin hang dengan kesalahan `Peranti sibuk` ketika dimatikan atau reboot.

source: This limitation only applies to `/usr` or `/var`, not to directories below them. For example, a separate partition for `/var/www` will work without issues.
id: Keterbatasan ini hanya berlaku untuk `/usr` atau `/var`, tidak ke direktori di bawah mereka. Sebagai contoh, suatu partisi terpisah untuk `/var/www` akan bekerja tanpa masalah.

source: Consider leaving a portion of the space in an LVM volume group unallocated. This unallocated space gives you flexibility if your space requirements change but you do not wish to remove data from other volumes. You can also select the `Thin provisioning` device type for the partition to have the unused space handled automatically by the volume.
id: Pertimbangkan untuk membiarkan sebagian ruang dalam suatu grup volume LVM tidak dialokasikan. Ruang tak dialokasikan ini memberi Anda fleksibilitas bila kebutuhan ruang Anda berubah tapi Anda tidak ingin menghapus data dari volume lain. Anda juga dapat memilih tipe peranti `Thin provisioning` untuk partisi agar ruang yang tidak terpakai ditangani secara otomatis oleh volume.

source: The size of an `XFS` file system can not be reduced - if you need to make a partition or volume with this file system smaller, you must back up your data, destroy the file system, and create a new, smaller one in its place. Therefore, if you expect needing to manipulate your partitioning layout later, you should use the `ext4` file system instead.
id: Ukuran dari sistem berkas `XFS` tidak dapat dikurangi - bila Anda perlu membuat suatu partisi atau volume dengan sistem berkas ini yang lebih kecil, Anda mesti membackup data Anda, merusak sistem berkas, dan membuat yang baru yang lebih kecil menggantikannya. Maka, bila Anda berrencana untuk perlu memanipulasi pemartisian Anda nanti, Anda mesti memakai sistem berkas `ext4` sebagai gantinya.

source: Use Logical Volume Management (LVM) if you anticipate expanding your storage by adding more hard drives after the installation. With LVM, you can create physical volumes on the new drives, and then assign them to any volume group and logical volume as you see fit - for example, you can easily expand your system's `/home` (or any other directory residing on a logical volume).
id: Gunakan Logical Volume Management (LVM) bila Anda mengantisipasi mengekspansi penyimpanan Anda dengan menambah lebih banyak hard disk setelah instalasi. Dengan LVM, Anda dapat membuat volume fisik pada drive baru, dan kemudian menugaskan mereka ke sebarang grup volume dan volume lojik sesuai kebutuhan - sebagai contoh, Anda dapat dengan mudah mengekspansi `/home` sistem Anda (atau sebarang direktori lain yang berada pada suatu volume lojik).

source: Creating a BIOS Boot partition or an EFI System Partition may be necessary, depending on your system's firmware, boot drive size, and boot drive disk label. See xref:Installing_Using_Anaconda.adoc#sect-installation-gui-manual-partitioning-recommended[Recommended Partitioning Scheme] for information about these partitions. Note that the graphical installer will not let you create a BIOS Boot or EFI System Partition if your system does *not* require one - in that case, they will be hidden from the menu.
id: Membuat suatu partisi Boot BIOS atau suatu Partisi Sistem EFI mungkin perlu, bergantung pada firmware sistem Anda, ukuran drive boot, dan label disk drive boot. Lihat xref:sect-installation-gui-manual-partitioning-recommended[Skema Pemartisian Yang Disarankan] untuk informasi tentang partisi ini. Perhatikan bahwa installer grafis tidak akan membiarkan Anda membuat Boot BIOS atau Partisi Sistem EFI bila sistem Anda *tidak* memerlukannya - dalam kasus itu, mereka akan disembunyikan dari menu.

source: If you need to make any changes to your storage configuration after the installation, {PRODUCT} repositories offer several different tools which can help you do this. If you prefer a command line tool, try [package]*system-storage-manager*.
id: Bila Anda perlu membuat sebarang perubahan ke konfigurasi penyimpanan Anda setelah instalasi, repositori {PRODUCT} menyediakan beberapa alat berbeda yang dapat membantu Anda melakukan ini. Bila Anda lebih suka alat baris perintah, cobalah [package]*system-storage-manager*.
