Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/_partials/install/DateTimeSpoke.po
Languages: id

source: Date & Time
id: Tanggal & Waktu

source: The `Date & Time` screen allows you to configure time and date-related settings for your system. This screen is automatically configured based on the settings you selected in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-welcome[Welcome Screen and Language Selection], but you can change your date, time and location settings before you begin the installation.
id: Layar `Tanggal & Waktu` memungkinkan Anda mengonfigurasi pengaturan terkait waktu dan tanggal untuk sistem Anda. Layar ini secara otomatis dikonfigurasi berbasis pengaturan yang Anda pilih dalam xref:sect-installation-gui-welcome[Layar Selamat Datang dan Pemilihan Bahasa], tapi Anda dapat mengubah pengaturan tanggal, waktu, dan lokasi sebelum Anda memulai instalasi.

source: Screenshot of the Date & Time screen
id: Tangkapan Layar dari layar Tanggal & Waktu

source: First, select your `Region` using the drop-down menu in the top left corner of the screen. Then, select your `City`, or the city closest to your location in the same time zone. Selecting a specific location helps {PRODUCT} ensure that your time is always set correctly including automatic time changes for daylight savings time if applicable.
id: Pertama, pilih `Wilayah` Anda memakai menu drop down di pojok kiri atas layar. Kemudian, pilih `Kota` Anda, atau kota terdekat ke lokasi Anda di zona waktu yang sama. Memilih suatu lokasi spesifik membantu {PRODUCTS} memastikan bahwa waktu Anda selalu ditata dengan benar termasuk perubahan waktu otomatis untuk daylight savings time bila berlaku.

source: You can also select a time zone relative to Greenwich Mean Time (GMT) without setting your location to a specific region. To do so, select `Etc` as your region.
id: Anda juga dapat memilih suatu zona waktu relatif to Greenwich Mean Time (GMT) tanpa menata lokasi Anda ke suatu wilayah spesifik. Untuk melakukan itu, pilih `Etc` sebagai wilayah Anda.

source: The list of cities and regions comes from the Time Zone Database ([package]*tzdata*) public domain, which is maintained by the Internet Assigned Numbers Authority (IANA). The Fedora Project can not add cities or regions into this database. You can find more information at the link:++https://www.iana.org//time-zones++[IANA official website].
id: Daftar kota dan wilayah datang dari Basis Data Zona Waktu ([package]*tzdata*) public domain, yang dipelihara oleh Internet Assigned Numbers Authority (IANA). Proyek Fedora tidak bisa menambahkan kota atau wilayah ke dalam basis data ini. Anda dapat menemukan lebih banyak informasi pada link:++https://www.iana.org//time-zones++[Situs web resmi IANA].

source: The switch labeled `Network Time` in the top right corner of the screen can be used to enable or disable network time synchronization using the Network Time Protocol (NTP). Enabling this option will keep your system time correct as long as the system can access the internet. By default, four NTP _pools_ are configured; you can add others and disable or remove the default ones by clicking the gear wheel button next to the switch.
id: Saklar berlabel `Waktu Jaringan` di pojok kanan atas layar dapat dipakai untuk memfungsikan atau menonaktifkan sinkronisasi waktu memakai Network Time Protocol (NTP). Memfungsikan opsi ini akan menjaga waktu sistem Anda benar selama sistem dapat mengakses internet. Secara baku, empat _pool_ NTP dikonfigurasi; Anda dapat menambahkan yang lain dan menonaktifkan atau menghapus yang baku dengan mengklik tombol roda gerigi di sebelah saklar.

source: The Add and mark for usage NTP servers dialog
id: Dialog tambah dan menandai untuk penggunaan server NTP

source: A dialog window allowing you to add or remove NTP pools from your system configuration
id: Suatu jendela dialog yang mengizinkan Anda menambah atau menghapus pool NTP dari konfigurasi sistem Anda

source: If you disable network time synchronization, the controls at the bottom of the screen will become active, and you will be able to set the current time and date manually.
id: Bila Anda menonaktifkan sinkronisasi waktu jaringan, kendali di dasar layar akan menjadi aktif, dan Anda akan dapat menata waktu dan tanggal saat ini secara manual.

source: After configuring your time and date settings, press the `Done` button in the top left corner to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-summary[Installation Summary].
id: Setelah mengonfigurasi pengaturan waktu dan tanggal Anda, tekan tombol `Selesai` di pojok kiri atas untuk kembali ke xref:sect-installation-gui-installation-summary[Ringkasan Instalasi].
