Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/_partials/install/FilterSpoke_AddiSCSI.po
Languages: tr

source: Add iSCSI Target
tr: iSCSI Hedefi Ekle

source: To use iSCSI storage devices, the installer must be able to discover them as _iSCSI targets_ and be able to create an iSCSI session to access them. Both of these steps may require a user name and password for _Challenge Handshake Authentication Protocol_ (CHAP) authentication.
tr: iSCSI depolama aygıtlarını kullanmak için, kurucunun bunları _iSCSI hedefleri_ olarak keşfedebilmesi ve bunlara erişmek için bir iSCSI oturumu oluşturabilmesi gerekir. Bu adımların her ikisi de _Zorlu El Sıkışma Kimlik Doğrulama Protokolü_ (Challenge Handshake Authentication Protocol - CHAP) kimlik doğrulaması için bir kullanıcı adı ve parola gerektirebilir.

source: You can also configure an iSCSI target to authenticate the iSCSI initiator on the system to which the target is attached (_reverse CHAP_), both for discovery and for the session. Used together, CHAP and reverse CHAP are called _mutual CHAP_ or _two-way CHAP_. Mutual CHAP provides the greatest level of security for iSCSI connections, particularly if the user name and password are different for CHAP authentication and reverse CHAP authentication.
tr: Bir iSCSI hedefini, hem keşif hem de oturum için hedefin bağlı olduğu sistemdeki iSCSI başlatıcının kimliğini doğrulamak için (_ters CHAP_) yapılandırabilirsiniz. Birlikte kullanıldığında CHAP ve ters CHAP, _karşılıklı CHAP_ veya _iki yönlü CHAP_ olarak adlandırılır. Karşılıklı CHAP, özellikle CHAP kimlik doğrulaması ve ters CHAP kimlik doğrulaması için kullanıcı adı ve parolası farklıysa, iSCSI bağlantıları için en yüksek güvenlik düzeyini sağlar.

source: Follow the procedure below to add an iSCSI storage target to your system.
tr: Sisteminize bir iSCSI depolama hedefi eklemek için aşağıdaki adımları izleyin.

source: Click the `Add iSCSI Target` button in the bottom right corner of the xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks] screen. A new dialog window titled `Add iSCSI Storage Target` will open.
tr: xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Kurulum Hedefi - Özelleşmiş Diskler ve Ağ Diskleri] ekranının sağ alt köşesindeki `iSCSI Hedefi Ekle` düğmesine tıklayın. `iSCSI Depolama Hedefi Ekle` başlıklı yeni bir iletişim penceresi açılacaktır.

source: Enter the IP address of the iSCSI target in the `Target IP Address` field.
tr: iSCSI hedefinin IP adresini `Hedef IP Adresi` alanına girin.

source: Provide a name in the `iSCSI Initiator Name` field for the iSCSI initiator in _iSCSI Qualified Name_ (IQN) format. A valid IQN entry contains:
tr: iSCSI başlatıcı için `iSCSI Başlatıcı Adı` alanına _iSCSI Nitelikli Adı_ (iSCSI Qualified Name - IQN) biçiminde bir ad girin. Geçerli bir IQN girdisi şunları içerir:

source: The string `iqn.` (including the period).
tr: `iqn.` dizgesi (nokta dahil).

source: A date code specifying the year and month in which your organization's Internet domain or subdomain name was registered, represented as four digits for the year, a dash, and two digits for the month, followed by a period. For example, represent September 2010 as `2010-09.`
tr: Organizasyonunuzun internet etki alanı veya alt etki alanı adının kaydedildiği yılı ve ayı belirten, yıl için dört basamak, bir kısa çizgi ve ay için iki basamak ve ardından bir nokta olarak temsil edilen bir tarih kodu. Örneğin, Eylül 2010'u `2010-09.` olarak temsil edin.

source: Your organization's Internet domain or subdomain name, presented in *reverse* order (with the top-level domain first). For example, represent the subdomain storage.example.com as `com.example.storage`.
tr: *Ters* sırayla (üst düzey etki alanı önce) olacak şekilde organizasyonunuzun internet etki alanı veya alt etki alanı adı. Örneğin, storage.example.com alt etki alanını `com.example.storage` olarak temsil edin.

source: A colon (`:`) followed by a string which uniquely identifies this particular iSCSI initiator within your domain or subdomain. For example, `:diskarrays-sn-a8675309`
tr: İki nokta üst üste (`:`), ardından etki alanınızda veya alt etki alanınızda bu belirli iSCSI başlatıcıyı benzersiz şekilde tanımlayan bir dizge. Örneğin, `:diskarrays-sn-a8675309`

source: A complete IQN will therefore look as follows:
tr: Yani tam bir IQN aşağıdaki gibi görünecektir:

source: An example using the correct format is also displayed below the input field for reference.
tr: Doğru biçimi kullanan bir örnek, yol göstermesi için ayrıca giriş alanının altında görüntülenir.

source: For more information about IQNs, see [citetitle]_3.2.6. iSCSI Names in RFC 3720 - Internet Small Computer Systems Interface (iSCSI)_, available from link:++https://tools.ietf.org/html/rfc3720#section-3.2.6++[] and [citetitle]_1. iSCSI Names and Addresses in RFC 3721 - Internet Small Computer Systems Interface (iSCSI) Naming and Discovery_, available from link:++https://tools.ietf.org/html/rfc3721#section-1++[].
tr: IQN'ler hakkında daha fazla bilgi için link:++https://tools.ietf.org/html/rfc3720#section-3.2.6++[] adresinde bulunan [citetitle]_3.2.6. iSCSI Names in RFC 3720 - Internet Small Computer Systems Interface (iSCSI)_ ve link:++https://tools.ietf.org/html/rfc3721#section-1++[] adresinde bulunan [citetitle]_1. iSCSI Names and Addresses in RFC 3721 - Internet Small Computer Systems Interface (iSCSI) Naming and Discovery_ sayfalarına bakın.

source: Specify the type of authentication to use for iSCSI discovery using the `Discovery Authentication Type` drop-down menu. Depending on which type of authentication you selected, additional input fields (such as `CHAP Username` and `CHAP Password` may then become visible. Fill in your authentication credentials; these should be provided by your organization.
tr: `Keşif Kimlik Doğrulama Türü` açılır menüsünü kullanarak iSCSI keşfi için kullanılacak kimlik doğrulama türünü belirtin. Hangi kimlik doğrulama türünü seçtiğinize bağlı olarak, ek giriş alanları (`CHAP Kullanıcı adı` ve `CHAP Parolası` gibi) daha sonra görünür hale gelebilir. Kimlik doğrulama bilgilerinizi doldurun; bunlar organizasyonunuz tarafından sağlanmalıdır.

source: Click the `Start Discovery` button. The installer will now attempt to discover an iSCSI target based on the information you provided, and if the target requires CHAP or reverse CHAP authentication, it will attempt to use the credentials you provided. This process may take some time (generally less than 30 seconds), depending on your network.
tr: `Keşfi Başlat` düğmesine tıklayın. Kurucu, sağladığınız bilgilere göre bir iSCSI hedefi keşfetmeye çalışacak ve hedef CHAP veya ters CHAP kimlik doğrulaması gerektiriyorsa, sağladığınız kimlik bilgilerini kullanmaya çalışacaktır. Bu işlem, ağınıza bağlı olarak biraz zaman (genellikle 30 saniyeden az) alabilir.

source: If the discovery was *not* successful, an error message will be displayed in the dialog window. This message will vary based on which part of the discovery failed. If the installer did not find the target you specified at all, you should check the IP address; if the problem is an authentication error, make sure you entered all CHAP and reverse CHAP credentials correctly and that you have access to the iSCSI target.
tr: Keşif başarılı *olmazsa*, iletişim penceresinde bir hata mesajı görüntülenecektir. Bu mesaj, keşfin hangi kısmının başarısız olduğuna bağlı olarak değişecektir. Kurucu belirttiğiniz hedefi hiç bulamadıysa, IP adresini gözden geçirmelisiniz; sorun bir kimlik doğrulama hatasıysa, tüm CHAP ve ters CHAP kimlik bilgilerini doğru girdiğinizden ve iSCSI hedefine erişiminiz olduğundan emin olun.

source: The `No nodes discovered` error message may also mean that all nodes on the address you specified are already configured. During discovery, [application]*Anaconda* ignores nodes which have already been added.
tr: `Düğüm bulunamadı` hata mesajı, belirttiğiniz adresteki tüm düğümlerin zaten yapılandırılmış olduğu anlamına da gelebilir. Keşif sırasında, [application]*Anaconda* zaten eklenmiş olan düğümleri yok sayar.

source: If the discovery was successful, you will see a list of all discovered nodes.
tr: Keşif başarılı olduysa, keşfedilen tüm düğümlerin bir listesini göreceksiniz.

source: Select one or more nodes you want to log in to by marking or unmarking the check box next to each node discovered on the target. Below the list, select again the type of authentication you want to use; you can also select the `Use the credentials from discovery` option if the CHAP/reverse CHAP user name and password you used to discover the target are also valid for logging in to it.
tr: Hedefte keşfedilen her düğümün yanındaki onay kutusunu işaretleyerek veya işaretini kaldırarak oturum açmak istediğiniz bir veya daha fazla düğümü seçin. Listenin altında, kullanmak istediğiniz kimlik doğrulama türünü yeniden seçin; hedefi keşfetmek için kullandığınız CHAP/ters CHAP kullanıcı adı ve parolası hedefe giriş yapmak için de geçerliyse, `Keşifteki kimlik bilgilerini kullan` seçeneğini de seçebilirsiniz.

source: After selecting all nodes you want to use, click `Log In` to initiate an iSCSI session. [application]*Anaconda* will attempt to log in to all selected nodes. If the login process is succesful, the `Add iSCSI Storage Target` dialog will close, and all nodes you have configured will now be shown in the list of network disks in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks].
tr: Kullanmak istediğiniz tüm düğümleri seçtikten sonra, bir iSCSI oturumu başlatmak için `Giriş Yap` düğmesine tıklayın. [application]*Anaconda*, seçilen tüm düğümlere giriş yapmaya çalışacaktır. Giriş yapma işlemi başarılı olursa, `iSCSI Depolama Hedefi Ekle` iletişim kutusu kapanacak ve yapılandırdığınız tüm düğümler artık xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Kurulum Hedefi - Özelleşmiş Diskler ve Ağ Diskleri] bölümündeki ağ diskleri listesinde gösterilecektir.

source: You can repeat this procedure to discover additional iSCSI targets, or to add more nodes from a previously configured target. However, note that once you click the `Start Discovery` button for the first time, you will not be able to change the `iSCSI Initiator Name`. If you made an error when configuring the initiator name, you must restart the installation.
tr: Ek iSCSI hedefleri keşfetmek veya önceden yapılandırılan bir hedeften daha fazla düğüm eklemek için bu adımları tekrarlayabilirsiniz. Ancak, `Keşfi Başlat` düğmesine ilk kez tıkladığınızda, `iSCSI Başlatıcı Adı` alanını değiştiremeyeceğinizi unutmayın. Başlatıcı adını yapılandırırken bir hata yaptıysanız, kurulumu yeniden başlatmanız gerekir.
