Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/_partials/install/FilterSpoke_AddFCoE.po
Languages: id

source: Add FCoE SAN
id: Menambahkan SAN FCoE

source: The following procedure explains how to add _Fibre Channel over Ethernet_ (FCoE) storage devices and make them available during the installation:
id: Prosedur berikut menjelaskan cara menambahkan perangkat penyimpanan _Fibre Channel over Ethernet_ (FCoE) dan membuatnya tersedia selama penginstalan:

source: Add FCoE Target
id: Menambahkan Target FCoE

source: Click the `Add FCoE SAN` button in the bottom right corner of xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks]. A new dialog window will open.
id: Klik tombol `Tambahkan SAN FCoE` di sudut kanan bawah xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Tujuan Penginstalan - Disk Khusus & Jaringan]. Jendela dialog baru akan terbuka.

source: Select the network interface (`NIC`) which is connected to your FCoE switch from the drop-down menu. Note that this network interface must be configured and connected - see xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Network & Hostname].
id: Pilih antarmuka jaringan (`NIC`) yang terhubung ke switch FCoE Anda dari menu tarik-turun. Perhatikan bahwa antarmuka jaringan ini harus dikonfigurasi dan dihubungkan - lihat xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration[Jaringan & Nama Host].

source: Below the `NIC` drop-down menu are two choices:
id: Ada dua pilihan di bawah menu tarik-turun `NIC`:

source: `Use DCB`
id: `Pakai DCB`

source: _Data Center Bridging_ (DCB) is a set of enhancements to the Ethernet protocols designed to increase the efficiency of Ethernet connections in storage networks and clusters. This option should only be enabled for network interfaces that require a host-based DCBX client. Configurations on interfaces that implement a hardware DCBX client should leave this check box empty.
id: _Data Center Bridging_ (DCB) adalah seperangkat penyempurnaan protokol Ethernet yang dirancang untuk meningkatkan efisiensi koneksi Ethernet di jaringan penyimpanan dan cluster. Opsi ini hanya boleh diaktifkan untuk antarmuka jaringan yang memerlukan klien DCBX berbasis host. Konfigurasi pada antarmuka yang menerapkan klien DCBX perangkat keras harus mengosongkan kotak centang ini.

source: `Use auto vlan`
id: `Pakai auto vlan`

source: This option indicates whether VLAN discovery should be performed. If this box is checked, then the _FCoE Initiation Protocol_ (FIP) VLAN discovery protocol will run on the Ethernet interface once the link configuration has been validated. If they are not already configured, network interfaces for any discovered FCoE VLANs will be automatically created and FCoE instances will be created on the VLAN interfaces. This option is enabled by default.
id: Opsi ini menunjukkan apakah pencarian VLAN harus dilakukan. Jika kotak ini dicentang, protokol penemuan VLAN _FCoE Initiation Protocol_ (FIP) akan berjalan di antarmuka Ethernet setelah konfigurasi tautan divalidasi. Jika belum dikonfigurasi, antarmuka jaringan untuk VLAN FCoE yang ditemukan akan dibuat secara otomatis dan instance FCoE akan dibuat di antarmuka VLAN. Opsi ini diaktifkan secara bawaan.

source: After you select which interface and options to use, click `Add FCoE Disk(s)`. Discovered FCoE storage devices will be displayed under the `Other SAN Devices` tab in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Installation Destination - Specialized & Network Disks].
id: Setelah Anda memilih antarmuka dan opsi yang akan digunakan, klik `Tambahkan Disk FCoE`. Perangkat penyimpanan FCoE yang ditemukan akan ditampilkan di bawah tab `Peranti SAN Lain` di xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-destination[Tujuan Penginstalan - Disk Khusus & Jaringan].
