Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/_partials/install/NetworkSpoke.po
Languages: es

source: Network & Hostname
es: Red y Nombre de equipo

source: The `Network & Hostname` screen is used to configure network interfaces. Options selected here will be available both during the installation (if needed for tasks such as downloading packages from a remote location) and on the installed system.
es: La pantalla `Red y Nombre de equipo` e usa para configurar las interfaces de red. Las opciones seleccionadas aquí estarán disponibles tanto durante la instalación (si son necesarias tareas como la descarga de paquetes desde una ubicación remota) como en el sistema instalado.

source: Network configuration is an expansive topic and many of the options available during the installation are beyond the scope of this document. For detailed information about networking, including both theoretical topics and specific instructions and examples, see the [citetitle]_{PRODUCT} Networking{nbsp}Guide_, available at link:++https://docs.fedoraproject.org/++[].
es: La configuración de red es un tema extenso y muchas de las opciones disponibles durante la instalación están más allá del alcance de este documento. Para información detallada sobre redes, incluyendo tanto cuestiones teóricas como instrucciones específicas y ejemplos, vea la [citetitle]_{PRODUCT} Guía de Red{nbsp}_, disponible en link:++https://docs.fedoraproject.org/++[].

source: The Network & Hostname screen. In the left pane
es: La pantalla Red y Nombre de equipo, En el panel izquierdo

source: anaconda/NetworkSpoke.png
es: anaconda/PasswordSpoke.png

source: Locally accessible interfaces are automatically detected by the installation program and cannot be manually added or deleted. All detected interfaces are listed on the left side of the screen. Click an interface in the list to display its current configuration (such as IP and DNS address); the details are displayed on the right side of the screen.
es: Las interfaces localmente accesibles son detectadas automáticamente por el programa de instalación y no pueden ser añadidas o borradas manualmente. Todas las interfaces detectadas se listan en el lado izquierdo de la pantalla. Pulse sobre una interfaz de la lista para visualizar su configuración actual (como direcciones IP y DNS); los detalles se visualizan en el lado derecho de la pantalla.

source: Below the list of interfaces are two buttons. Use the `+` button to add a virtual network interface (Team, Bond or VLAN) as described in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration-virtual-interface[Adding a Virtual Network Interface]. To remove a previously created virtual interface, select it in the list and click the `-` button.
es: Debajo de la lista de interfaces hay dos botones. Use el botón `+` para añadir una interfaz virtual de red (Team, Bond o VLAN) como se describe en xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration-virtual-interface[Añadir una Interfaz Virtual de Red]. Para borrar una interfaz virtual previamente creada, selecciónela de la lista y pulse el botón `-`.

source: To change settings such as IP addresses, DNS servers, or routing configuration for an existing interface (both virtual and physical), select the interface in the left pane and click `Configure` in the bottom right corner of the screen. Available settings are described in xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration-advanced[Editing Network Interface Configuration].
es: Para cambiar ajustes como direcciones IP, servidores DNS o configuración de enrutamiento para una interfaz existentes (tanto virtual como física), seleccione la interfaz en el panel izquierdo y pulse `Configurar` en la esquina inferior derecha de la pantalla. Los ajustes disponibles están descritos en xref:install/Installing_Using_Anaconda.adoc#sect-installation-gui-network-configuration-advanced[Editar la Configuración de una Interfaz de Red].

source: Use the `ON`pass:attributes[{blank}]/pass:attributes[{blank}]`OFF` switch in the top right corner to enable or disable the currently selected interface.
es: Use el conmutador `ON`pass:attributes[{blank}]/pass:attributes[{blank}]`OFF` en la esquina superior derecha de la pantalla para habilitar o deshabilitar la interfaz seleccionada actualmente.

source: Below the list of connections, enter a host name for this computer in the `Hostname` input field. The host name can be either a _fully-qualified domain name_ (FQDN) in the format _hostname_._domainname_, or a short host name with no domain name. Many networks have a _Dynamic Host Configuration Protocol_ (`DHCP`) service that automatically supplies connected systems with a domain name; to allow the `DHCP` service to assign the domain name to this machine, only specify the short host name.
es: Debajo de la lista de conexiones, introduzca un nombre de equipo de este ordenador en el campo de entrada `Nombre de equipo`. El nombre de equipo puede ser bien un _nombre de dominio completo_ (FQDN) en el formato _nombre de equipo_._nombre de dominio_ o un nombre de equipo corto sin nombre de dominio. Muchas redes tiene un servicio _Protocolo de Configuración Dinámica de Equipo_ (`DHCP`) que suministra automáticamente a los equipos conectados con un nombre de dominio; para permitir al servicio `DHCP` aisgnar el nombre de dominio a esta máquina, especifique solo el nombre corto de equipo.
