Repository: bobby285271/fedora-docs-l10n-fedora-install-guide
Catalog: po/*/f32/pages/_partials/install/PasswordSpoke.po
Languages: id

source: Root Password
id: Kata Sandi Root

source: The `Root Password` screen is used to configure the `root` password for your system. This password will be used to log into the administrator (also known as superuser) account, which is used for system administration tasks such as installing and updating software packages and changing system-wide configuration such as network and firewall settings, storage options and adding or modifying users, groups and file permissions.
id: Layar `Kata Sandi Root` digunakan untuk mengkonfigurasi kata sandi `root` untuk sistem Anda. Kata sandi ini akan digunakan untuk masuk ke akun administrator (juga dikenal sebagai pengguna super), yang digunakan untuk tugas administrasi sistem seperti menginstal dan memperbarui paket perangkat lunak dan mengubah konfigurasi seluruh sistem seperti pengaturan jaringan dan firewall, opsi penyimpanan, dan penambahan atau memodifikasi izin pengguna, grup, dan berkas.

source: The `root` account will always be created during the installation. However, you should always also create a normal user accont in xref:Installing_Using_Anaconda.adoc#sect-installation-gui-create-user[Create User] and use that account to log in to the system. Only switch to the administrator account only when you need to perform a task which requires administrator access.
id: Akun `root` akan selalu dibuat selama instalasi. Namun, Anda harus selalu juga membuat akun pengguna normal di xref:sect-installation-gui-create-user[Membuat Pengguna] dan memakai akun itu untuk masuk ke sistem. Hanya beralih ke akun administrator ketika Anda perlu melakukan tugas yang memerlukan akses administrator.

source: The `root` account has complete control over the system. If an unauthorized person gains access to this account, they can access or delete all users' personal files or otherwise exploit the machine for their own nefarious purposes. See the [citetitle]_{PRODUCT} Security Guide_, available at link:++https://docs.fedoraproject.org/++[], for detailed documentation about account security and guidelines for choosing a strong password.
id: Akun `root` memiliki kendali penuh atas sistem. Jika orang yang tidak sah mendapatkan akses ke akun ini, mereka dapat mengakses atau menghapus berkas pribadi semua pengguna atau mengeksploitasi mesin untuk tujuan jahat mereka sendiri. Lihat [citetitle]_Panduan Keamanan {PRODUCT}_, tersedia di link:++https://docs.fedoraproject.org/++[], untuk dokumentasi terperinci tentang keamanan akun dan pedoman untuk memilih kata sandi yang kuat.

source: The Root Password screen. Use the text input fields to provide your root password.
id: Layar Kata Sandi Root. Gunakan ruas masukan teks untuk memberikan kata sandi root Anda.

source: Once you choose a strong password, enter it in the `Root Password` field. The characters you write will be displayed as dots for security. Then, type the same password into the `Confirm` field to ensure you entered it properly. Both entered passwords must be the same.
id: Setelah Anda memilih kata sandi yang kuat, masukkan di ruas `Kata Sandi Root`. Karakter yang Anda tulis akan ditampilkan sebagai titik untuk keamanan. Kemudian, ketikkan kata sandi yang sama ke dalam bidang `Konfirmasi` untuk memastikan Anda memasukkannya dengan benar. Kedua kata sandi yang dimasukkan harus sama.

source: As you enter the password, it will be evaluated and the installer will determine the password's strength. If the installer considers your password weak, a message will appear at the bottom of the screen, explaining which aspect of your chosen password is considered insuficient. For example:
id: Ketika Anda memasukkan kata sandi, itu akan dievaluasi dan penginstal akan menentukan kekuatan kata sandi. Jika pemasang menganggap kata sandi Anda lemah, sebuah pesan akan muncul di bagian bawah layar, menjelaskan aspek kata sandi pilihan Anda yang dianggap tidak cukup. Sebagai contoh:

source: `The password you have provided is weak:` `The password is shorter than 5 characters.`
id: `Kata sandi yang Anda berikan lemah:` `Kata sandi kurang dari 5 karakter.`

source: If a message similar to the above appears, it is highly recommended to choose a different, stronger password.
id: Jika pesan yang mirip dengan di atas muncul, sangat disarankan untuk memilih kata sandi yang berbeda dan lebih kuat.

source: Once you configure the superuser password, click `Done` in the top left corner to return to xref:Installing_Using_Anaconda.adoc#sect-installation-gui-installation-progress[Configuration and Installation Progress]. If you selected a weak password, you must press the button twice.
id: Setelah Anda mengonfigurasi kata sandi pengguna super, klik `Selesai` di sudut kiri atas untuk kembali ke xref:sect-installation-gui-installation-progress[Kemajuan Konfigurasi dan Instalasi]. Jika Anda memilih kata sandi yang lemah, Anda harus menekan tombol dua kali.
